"Male Sling Procedure800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Male Sling ProcedureAdvertisementAdvertisementAdvertisementMale Sling ProcedureThe male sling procedure helps men with urinary incontinence (loss of bladder control). In the procedure, synthetic mesh-like tape is placed around the urethral bulb, compressing and moving the urethra into a new position. This treatment helps many men overcome urinary incontinence issues.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewIn the male sling procedure, synthetic mesh-like surgical tape is positioned around part of the urethral bulb, slightly compressing the urethra and moving it into a new position. This action in and of itself has been shown to overcome the problem of urinary incontinence in many patients.What is the male sling procedure?In the male sling procedure, synthetic mesh-like surgical tape is positioned around part of the urethral bulb, slightly compressing the urethra and moving it into a new position. The urethra is the tube through which urine exits the body. This procedure helps many patients with urinary incontinence.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy was the male sling procedure developed?The male sling procedure was developed to help men with urinary incontinence (loss of bladder control) after prostate surgery, particularly for those men requiring radical prostatectomy for prostate cancer. This procedure is best for men with mild to moderate urinary incontinence (wetting one to three pads per day or less).Procedure DetailsWhat tests are done before the male sling procedure?Before surgery, your doctor may ask you to have a few tests. These tests may include:A urodynamic study (testing to assess urinary tract function)A 24-hour pad test (to identify the number of pads used and amount of liquid leaked)A cystoscopy (a look inside your bladder)AdvertisementWhat happens before the male sling procedure?Before surgery, you may be asked to see your family physician or anesthesiologist for a preoperative checkup. If necessary, your doctor will do a few tests. These tests could include:Electrocardiogram (EKG)Blood workupUrine testsYou may also be asked to follow a few rules before surgery. These include:Do not take Aspirin or any blood thinning medications two weeks before surgery. This includes medications such as ibuprofen (Motrin®; Advil®); naproxen (Aleve®); and clopidogrel (Plavix®). If necessary, you can take Tylenol® for headaches or pain. Any other medication such as antibiotics, high blood pressure medications, hormone pills, and heart medications should be continued unless otherwise specified.Only consume clear liquids the night before surgery. This means anything you can see through, such as broth, juices and Jell-O. This helps keep the bowel clean at the time of surgery and reduces the risks of contamination.Do not eat or drink anything after midnight the day before surgery. Any medication that must be taken the morning of surgery should be taken with a small sip of water.How is the male sling procedure done?During the male sling procedure, an incision is made through the perineal tissue (the area between the scrotum and anus). The surgeon will then expose the urethra and use a supportive sling (a mesh-like surgical tape) around part of the urethral bulb that covers the most upper part of the urethra close to where it enters the area of the urethral sphincter. By wrapping the surgical tape around the urethral bulb, the sling gently moves the urethra into a new position and increases resistance in this area. This lends support to the bladder neck. This procedure has been shown to help with mild to moderate urinary incontinence, and is most commonly used after radical prostatectomy.The male sling procedure is usually performed as an outpatient surgery. However, there are some cases where patients will need to stay in the hospital overnight after surgery. The sling support requires absorbable sutures (stitches) in the perineum (the area between the scrotum and anus). This may cause some pain right after surgery, but overall, the amount of pain is usually mild and well tolerated.Care at Cleveland ClinicUrology CareMake an AppointmentAdvertisementRisks / BenefitsWhat are the advantages of the male sling procedure?The male sling procedure is not a major surgery. One of the advantages is that the male sling procedure only requires a small incision in the perineum (between the scrotum base and the anus). Because of this small incision, the recovery time is fairly short. Most patients have their catheters stay in for one to three days depending on surgeon preference.What are the risks and complications of the male sling procedure?Complications are rare with the male sling procedure. However, if complications do occur, they can include:Inability to urinate (retention of urine) – This is the most common problem after surgery, and may require catheter reinsertion for another week or two. In very rare cases, a second surgical procedure may be needed to resolve this issue.Bleeding and infection (especially of the mesh or the bone area and pubic bone)—This is a rare complication.Erosion—This is a rare complication.Recurrent leakage of urineRecovery and OutlookWhat happens after the male sling procedure?Following your surgery, you may have a catheter exiting from the urethra for a short period of time. The catheter is in place to allow you to empty your bladder since there may be swelling after surgery that makes it difficult to urinate. After the swelling goes down, you will gradually be able to urinate on your own and empty your bladder well. However, your normal pattern of urination may not return for a few weeks. You can resume a normal diet after surgery.What is the outcome of the male sling procedure?The majority of men undergoing the male sling procedure are either cured (pad free) or markedly improved afterward. Men who do not have a good result, or who have recurrent urinary leakage at a later date, are still good candidates for an artificial urinary sphincter (another device used to treat urinary incontinence after prostate surgery). Your doctor will discuss any additional procedures you may need in the future and will help develop a plan with you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/28/2019.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicUrology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"