"Mandibulectomy: Definition, Procedure & Types800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/MandibulectomyAdvertisementAdvertisementAdvertisementMandibulectomyA mandibulectomy is a surgery that removes a small part of your lower jaw (partial mandibulectomy) or a larger portion (segmental mandibulectomy). Your surgeon may also reconstruct your jaw with bone from another part of your body. Recovery from a mandibulectomy takes time.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is the definition of a mandibulectomy?Mandibulectomy is surgery that removes a small or large part of your lower jawbone (mandible). Often, surgeons perform a mandibulectomy to remove a tumor or diseased section of your jaw. Mandibulectomy is also called mandibular resection.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the different types of mandibulectomy?There are two types of mandibulectomy:Partial mandibulectomy (marginal mandibulectomy): Your surgeon removes part of your jawbone, so you typically don’t need reconstructive surgery.Segmental mandibulectomy: Your surgeon removes a large portion of your jawbone and rebuilds your jaw. Typically, your surgeon uses bone, an artery, a vein and soft tissue from another part of your body (called mandibulectomy and free-flap reconstruction).What part of the body does the bone come from to rebuild your jaw?To reconstruct your jaw, your surgeon may take bone from your:Lower leg.Shoulder blade.Hip.Your surgeon may also use a metal plate or piece of bone from a donor.AdvertisementWho needs to have a mandibulectomy?Your healthcare provider may recommend a mandibulectomy procedure if you have:Cancer in your mouth (oral cancer).Cancer in your oropharynx, or middle part of your throat (oropharyngeal cancer).Infection in your bone (osteomyelitis).Severe bone disease (osteonecrosis of the jaw) that develops from bisphosphonate therapy.Significant injury to your jaw.How does my healthcare provider decide which mandibulectomy procedure I need?Typically, your healthcare provider will consider:Co-occurring conditions that could complicate surgery or recovery.The location of the tumor.The severity of the condition.Your current health.AdvertisementProcedure DetailsWho performs a mandibulectomy?Often, several healthcare providers work together to perform a mandibulectomy, including a:Head and neck surgeon.Reconstructive surgeon.Oral surgeon.What happens before a mandibulectomy procedure?Before a mandibulectomy, your healthcare providers use several tests, such as a CT scan, to measure the size of the tumor (or evaluate the area).If you need reconstructive surgery to rebuild your jaw, your medical team may request more tests. The team also assesses the health of your blood vessels in the body part they’re taking bone from (donor site).Your healthcare provider will suggest avoiding certain substances and medications that can cause bleeding during surgery or interfere with healing after surgery, including:Alcohol.Aspirin, naproxen or ibuprofen.Cigarettes.Herbal supplements.What happens during a mandibulectomy procedure?A mandibulectomy takes many hours. During both types of mandibulectomy, you receive general anesthesia and are asleep for the procedure.During a marginal mandibulectomy, your surgeon:Makes an incision through your inner cheek.Removes the tumor and surrounding soft tissue from your lower jaw.Closes the incisions.During a segmental mandibulectomy, your surgical team removes a larger portion of your jaw and reconstructs it. Typically, the team:Removes the tumor and surrounding tissues.Sends the tumor and tissues for testing.Checks if cancer has spread to your lymph nodes.Removes bone, tissue and skin from the donor site.Shapes the bone to match the missing piece from your jaw.Connects the artery and vein from the donor site to an artery and vein in your head and neck.Attaches the new jaw with plates and screws and closes the incisions.You may also have these additional treatments:Arch bars and rubber bands in your mouth to align your teeth and jaw.A tracheostomy tube in your windpipe (trachea) to help with breathing.A feeding tube from your nose to your stomach to ensure you receive proper nutrients.What happens after a mandibulectomy procedure?You may stay in the hospital between two days and two weeks, depending on the mandibulectomy procedure you had.When you go home, follow your healthcare provider’s instructions on eating and caring for your incisions. You may still have a feeding tube or consume a liquid diet. You’ll also discuss how best to manage your pain after surgery.After your procedure, you may receive physical therapy and speech therapy. If you have cancer, your healthcare provider may also recommend radiation therapy or chemotherapy to destroy any remaining cancerous cells.Care at Cleveland ClinicSchedule Oral and Maxillofacial SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the risks or complications of mandibulectomy surgery?Potential risks of mandibulectomy include:Blood buildup under your skin (hematoma).Blood clot.Fluid buildup under your skin (seroma).Infection.Nerve damage.Recovery and OutlookHow long does it take to recover from a mandibulectomy?Recovery from a mandibulectomy can take time. Your recovery depends on the procedure you had. For example, if your surgical team rebuilt your jaw, you may need therapy to relearn how to swallow and eat.When can I return to work and other activities after a mandibulectomy?You can typically return to work after several weeks. You may need to wait longer before doing any strenuous activities, such as exercise. Your surgical team will give you details about your recovery time.When to Call the DoctorWhen should I see my healthcare provider?Seek medical attention if you develop:Fever above 100.5 degrees Fahrenheit (38.05 degrees Celsius).Headache.Increased bruising.Irritability.Nausea or vomiting.Rash.Severe pain that doesn’t go away with a pain reliever.Shortness of breath (dyspnea) or difficulty breathing.Swelling (angioedema).A note from Cleveland ClinicA mandibulectomy surgically removes a small part of your lower jaw (partial mandibulectomy) or a larger area (segmental mandibulectomy). Often, your surgical team also reconstructs your jaw with bone from another part of your body. You may need to have this procedure if you have cancer in your mouth or throat or a severe bone infection or injury. Talk to your healthcare provider about what to expect before, during and after mandibulectomy surgery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/07/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Oral and Maxillofacial SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"