"Masculinizing Hormone Therapy: Testosterone, Side Effects, Timeline800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Masculinizing Hormone TherapyAdvertisementAdvertisementAdvertisementMasculinizing Hormone TherapyMasculinizing hormone therapy helps gender nonconforming people who are designated female at birth (DFAB), including transgender men and nonbinary individuals, achieve a more traditional masculine appearance. Taking testosterone spurs development of secondary sex characteristics like facial hair, more muscle mass and a deeper voice.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is masculinizing hormone therapy?Masculinizing hormone therapy is gender-affirming treatment that produces the secondary sex characteristics associated with being designated male at birth (DMAB). This treatment uses testosterone to spur changes in your body that society associates with masculinity, like a deeper voice, more body hair and increased muscle mass.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho is masculinizing hormone therapy for?This therapy allows some gender-nonconforming people who are designated female at birth (DFAB) to feel more comfortable in their bodies. For many transgender men and nonbinary DFAB people, masculinizing hormone therapy changes the way they look and sound to better match their understanding of their gender or gender identity.Masculinizing hormone therapy is just one option for treating gender dysphoria. Gender dysphoria is the medical term for the emotional distress that happens when society’s expectations of your gender don’t match your gender identity. Hormone therapy may allow you to feel more at ease living as your authentic self.How does it work?People of all genders produce the hormone testosterone, but your body produces less of it if you’re DFAB. Instead, your body produces more estrogen, the hormone that causes secondary sex characteristics associated with traditional femininity, like rounded breasts and hips.Masculinizing hormone therapy reduces the amount of estrogen your body makes and boosts your testosterone levels high enough to:Suppress secondary sex characteristics associated with being AFAB.Induce secondary sex characteristics associated with being AMAB.AdvertisementWhat changes can I expect from masculinizing hormone therapy?You may notice changes as early as one month after you’ve started taking testosterone, but it may take a little longer to achieve the maximum effects. How quickly your body responds to the therapy depends on individual factors, like your age and genetics. In general, you can expect:Oily skin and acne: Should begin to see changes in one to six months, with full effect in one to two years.No more periods (amenorrhea): Should see full effect in two to six months.More facial and body hair: Should begin to see changes in three to six months, with full effect in three to five years.Hair loss on your scalp: Should begin to see changes after a year. The length of time to reach the full effect varies.Greater muscle mass and strength: Should begin to see changes in six to 12 months, with full effect in two to five years.Redistribution of body fat (like fat deposits in your abdomen instead of your hips): Should see full effect in three to six months, with full effect in two to five years.A deeper voice: Should begin to see changes in three to 12 months, with full effect in one to two years.A larger clitoris (and vaginal atrophy): Should begin to see changes in three to six months, with full effect in one to two years.Increased sex drive: Time to changes varies.Many of these changes persist even if you stop taking hormones. Others require that you continue taking testosterone regularly. For example, changes related to muscle mass, body fat distribution and menstruation all require that you don’t stop taking testosterone.Can I undergo masculinizing hormone therapy without help from a healthcare provider?Taking testosterone without a healthcare provider’s guidance is dangerous. It can be tempting to bypass an appointment with a healthcare professional to get started on testosterone quickly. This is especially the case if you have friends who are undergoing therapy, who share their prescribed testosterone and dosage recommendations with you. But everyone is different. Getting the dosage wrong can pose long-term risks to your health. Taking testosterone without a prescription isn’t safe.See your provider to ensure you’re getting treatment that’s safe and optimized to help you achieve your unique treatment goals.AdvertisementWhat type of healthcare provider should I see?Many healthcare providers can help you, particularly ones specializing in transgender health.Providers who can help include:Primary care physicians.Endocrinologists.Psychiatrists.Psychologists.Urologists.Procedure DetailsAt what point in my gender transition can I start masculinizing hormone therapy?Together, you and your provider can decide the best time to start therapy. Some gender-nonconforming individuals go their entire lives without needing or wanting gender-affirming therapies or surgeries. Others begin therapy as soon as possible.The Endocrine Society recommends that transgender adolescents start hormone therapy at 16 at the earliest. Earlier than 16, they recommend puberty blockers. The difference is that:Hormone therapy causes some changes to your body that are irreversible.Puberty blockers delay the onset of secondary sex characteristics associated with the gender you were assigned at birth. They prevent gender-nonconforming children from developing characteristics that may cause them to experience gender dysphoria, but they don’t produce irreversible changes.In some instances, transgender youths under 16 and their caregivers may decide that it’s best to begin masculinizing hormone therapy early for the well-being of the child. The right time to start treatment varies on a case-by-case basis.How do I prepare for masculinizing hormone therapy?Your provider will ensure you’re healthy enough for hormone therapy and explain both the benefits and risks of treatment. Preparation may involve:A discussion about your expectations of treatment. This discussion will include a review of the risks and benefits associated with taking testosterone.A review of your medical history. Your provider will look for conditions like heart or liver disease that may put you at greater risk of complications. They’ll review your immunization record and ensure that you’ve had all the required health screenings.A physical exam. Your provider will ensure that you’re physically healthy enough to start masculinizing hormone therapy.Lab tests. Tests may include a blood panel, pregnancy test, urinalysis and liver function test.You will also need to sign an informed consent form stating that you understand the benefits and possible side effects associated with treatment, and choose to begin therapy.Is it possible to control the extent of masculinization?Your provider can tailor your testosterone dose to help you achieve the gender presentation that feels right for you. Many of the changes you’ll notice depend not only on your dosage but also on individual factors that influence your response to treatment, like your age, health and genetics.How does masculinizing hormone therapy work?You can take testosterone as injectables, pills, pellets, patches and gels. Your healthcare provider can recommend the type, dose and frequency that’s right for you.To lower the risk of complications and side effects, you may start with a low dose. As your body gets used to the therapy, your healthcare provider may increase your dosage. After achieving the desired results, you’ll take a lower dose for the rest of your life.Care at Cleveland ClinicTransgender and Non-Binary Primary CareFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of masculinizing hormone therapy?Masculinizing hormone therapy can improve your overall well-being by helping to align your physical body with your gender.Depending on your treatment goals, masculinizing hormone therapy can:Allow you to experience gender congruence, a feeling of comfort in your gendered body.Improve your psychological well-being and mental health.Increase your sexual satisfaction.What are the potential side effects of masculinizing hormone therapy?You’ll meet with your provider regularly to monitor your response to treatment. Your provider can adjust your dosage to manage unpleasant side effects.Side effects include:Acne.Clitoral discomfort.Weight gain in your belly.Headaches, including migraines.Hair thinning or male-pattern baldness.Research is still ongoing about the complications that may arise from masculinizing hormone therapy. Testosterone is associated with blood thickening, which can put you at risk of having a high red blood cell count. This may lead to a stroke or a heart attack, especially if your dosage is too high.Other complications may include:Sleep apnea.Type 2 diabetes.Vaginal atrophy.How do I lower my risk of complications?Steps you can take to stay healthy on masculinizing hormone therapy include:Seeing a healthcare provider experienced in transgender health.Maintaining follow-up appointments.Taking testosterone as prescribed.What happens during follow-up appointments?Follow-up appointments enable your healthcare provider to track your response to treatment. They run tests to check for signs of complications. These often include blood tests. Occasionally, your care may include a bone density test (DEXA (DXA) scan).You can expect to see your healthcare provider:Every three months during the first year of hormone therapy.Every six to 12 months after that.You’ll still need to receive regular pelvic exams and Pap smears to detect conditions like cervical cancer.Recovery and OutlookWhat is the outlook for people undergoing masculinizing hormone therapy?Masculinizing hormone therapy can help relieve the negative feelings associated with gender dysphoria. Having physical attributes that match your gender can improve your self-esteem and self-image. These factors contribute to a better quality of life.What other gender-affirming treatments are available to transgender men and AFAB nonbinary people?Masculinizing hormone therapy may be the only treatment you need. Or, it may be the first step in your gender transition process. Surgery can help you make more changes to your appearance.Options include the following:Top surgery (mastectomy) removes breast tissue to create a more masculine-looking chest.Oophorectomy removes your ovaries.Hysterectomy removes your uterus.Vaginectomy removes all or part of your vagina and seals the opening.Metoidioplasty creates a penis using your clitoris and nearby tissue. It results in a penis that is smaller and shorter than average.Phalloplasty creates a penis using flaps of skin from other areas of your body. It can also add length and girth to your penis after metoidioplasty.Testicle implants are saline-filled sacs that surgeons implant, often during a metoidioplasty.When to Call the DoctorHow will I know if I need to see my healthcare provider between appointments?Certain side effects can be a sign of a complication. Some side effects can become severe and require immediate medical attention.Call your healthcare provider if you experience:Chest pain.Difficulty peeing.Dizziness.Sleep disorders, including sleep apnea.Tingling in your arms or legs (peripheral neuropathy).Yellowing of your skin or eyes (jaundice).A note from Cleveland ClinicMasculinizing hormone therapy can change your body so that it’s better aligned with your gender. Before starting any gender-affirming treatment, it’s important to speak to a provider, especially one with expertise in transgender healthcare. They can talk you through both the benefits and potential risks associated with gender-affirming therapy. They can help you safely achieve your treatment goals.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/03/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicTransgender and Non-Binary Primary CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementQuestions 216.444.2538Appointments & LocationsRequest an AppointmentFind a Primary Care ProviderFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"