"Mastectomy (Breast Removal Surgery): What It Is & Types800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Mastectomy (Breast Removal)AdvertisementAdvertisementAdvertisementMastectomy (Breast Removal)A mastectomy is another name for breast removal surgery. You might need surgery to remove your breast tissue if you have breast cancer or have a high risk of getting breast cancer. There are several different types of mastectomy. There are also different options for reconstructing or replacing your breasts after surgery.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewWhat is a mastectomy?A mastectomy is a surgical procedure to remove some or all of your breast tissue. It’s both a treatment and prevention for breast cancer. If you have breast cancer, surgery will always be part of your treatment plan. If you have a high risk of developing breast cancer, your healthcare provider may recommend a preventative mastectomy to help halt the development of breast cancer in the future.There are many types of mastectomies, which remove part or all of your breast tissue. There are also many ways to reconstruct your breast following removal. These are some of the discussions you will have with your healthcare provider. As you map out your breast cancer treatment plan together, you'll have a series of choices to make.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is a mastectomy done?TreatmentWhen you have breast cancer, the best hope of defeating it is to remove the cancer cells from your body. That means removing any tissue where cancer cells exist. This can be a relatively minor or a relatively major operation, depending on how large the tumor is and how much tissue needs removed.PreventionPeople who carry certain genetic mutations in their DNA have up to an 85% chance of developing breast cancer in their lifetimes. Genetic testing can help determine if you carry any of these genes, which include BRCA1 and BRCA2, p53 and PTEN. If you do carry these genes, there are many methods for preventing cancer, including a prophylactic mastectomy. This can reduce your breast cancer risk by about 90%. A small risk remains because a few breast cells will always exist.Who needs a mastectomy?Surgery is the primary recommended treatment if you have:Infiltrating ductal carcinoma.Infiltrating lobular carcinoma.Triple negative breast cancer.Inflammatory breast cancer.Paget’s disease of the breast.A proven high risk of breast cancer.AdvertisementWhat stage of breast cancer requires a mastectomy?When the tumor is small enough to be completely eliminated by removing only a third or less of your breast tissue, your healthcare provider may recommend a partial mastectomy (lumpectomy). Large tumors often require a complete mastectomy (removal of your entire breast). So, while you may only need to have part of your breast removed in earlier stages, it all depends on your breast size and the size of the tumor.You may be at higher risk of developing a second cancer if you're genetically predisposed or if you've had breast cancer before. So, under those circumstances, a complete mastectomy can help treat your current cancer and prevent a second cancer in the future. Stage IV (metastatic breast cancer) is too far advanced for effective treatment with surgery.Is mastectomy a major surgery?This is really a subjective question since there’s no standard definition of “major” surgery. What is important to know is that there are several different types of mastectomies that you might have, some more extensive than others. A simple lumpectomy usually takes about an hour, while a total mastectomy may take longer. Having breast reconstruction done in the same surgery takes even longer.AdvertisementWhat are the advantages of a mastectomy vs. a lumpectomy?Technically, a lumpectomy is a type of mastectomy (partial mastectomy). But most people think of a mastectomy as a total mastectomy — removal of your whole breast or both breasts. If you're planning your cancer treatment in the early stages, you may have a choice between a total mastectomy and a lumpectomy. If you choose a lumpectomy, your healthcare provider will want to follow it with radiation therapy and will discuss any other additional treatments.You may prefer a lumpectomy to minimize your surgery and recovery time and to preserve as much of your original breast as possible. However, you may prefer a mastectomy if it means you can avoid radiation therapy. Some people choose mastectomy because they prefer the cosmetic results of a complete breast replacement to reconstructing their original breast.Do they remove nipples during a mastectomy?It depends. If the tumor is a safe distance from your nipple, and if there are no signs of cancer infiltrating your nipple, you may be a candidate for a nipple-sparing mastectomy. This means your surgeon will remove your breast tissue but spare the skin and nipple.What are the different types of mastectomy procedures?Mastectomies go by different names depending on how much tissue your surgeon removes:Total mastectomy (simple mastectomy). A total or simple mastectomy removes all breast tissue but leaves your pectoral muscles beneath. A total mastectomy can be unilateral (one breast only) or bilateral (both breasts).Double mastectomy (bilateral mastectomy). A double mastectomy, also called a bilateral mastectomy, is a total mastectomy of both breasts. You may have a double mastectomy if you have cancer in both breasts or if you have a high risk of cancer occurring in both breasts.Skin-sparing mastectomy or nipple-sparing mastectomy. A skin-sparing or nipple-sparing mastectomy removes your breast tissue but spares the skin and/or nipple to use when reconstructing your breast.Mastectomy with breast reconstruction. Whether or not you're having a skin-sparing or nipple-sparing mastectomy, you may be able to have breast reconstruction surgery at the same time as your mastectomy. This will depend on your condition and treatment plan. You can also have breast reconstruction later in a separate surgery.Modified radical mastectomy. A modified radical mastectomy removes all of your breast tissue and also your underarm lymph nodes on the same side. This is often the first place breast cancer spreads.Radical mastectomy. A radical mastectomy removes all of your breast tissue, underarm lymph nodes and your pectoral muscles underneath. This surgery is rare these days, but it may be necessary if the cancer has spread to your muscles.Procedure DetailsWhat happens before a mastectomy?You and your healthcare provider will discuss your condition, your treatment options and your breast reconstruction preferences in detail before making a plan. That plan will include the type of mastectomy you have, any additional cancer therapies you may need and any additional cosmetic surgeries you may want. You’ll figure out how all of these variables fit together before scheduling your surgery.What happens during the mastectomy procedure?First, your healthcare provider will give you general anesthesia, which means you’ll be asleep through the procedure.You’ll have a tube to help you breathe and a catheter in your vein to give you IV fluids. You may have a catheter to drain your urine if it’s a longer procedure.Your surgeon will clean and sterilize the surgical site and give you antibiotics through your IV to prevent infections.You may have a mild radioactive substance called a tracer injected into your breast to help highlight the nearby lymph nodes. Your surgeon will use a handheld scanner to find them.Alternatively, your surgeon may inject a blue dye into your breast tissue to highlight your lymph nodes. The dye will stay in your tissues for a few weeks.Your surgeon will remove your breast tissue, including or sparing your skin and nipple. They may remove additional tissue if cancer has spread there.Your surgeon will remove one or several lymph nodes, depending on the stage of your cancer. They'll send them to the lab to check for cancer.Your surgeon may begin and complete the process of reconstructing your breast at this time. They may use an artificial implant and/or tissue from somewhere else on your body.If you're not having breast reconstruction at this time, they'll close the flap. You may have reconstruction surgery later, or you may choose not to have it.Your surgeon may leave a temporary drain inside the surgical site. This is a tube that draws excess fluids from the wound into a collection bulb on the outside. You may have it for a week or two afterward.What happens after a mastectomy?You’ll probably spend the night in the hospital, possibly longer, if you had more extensive surgery. Your healthcare team will teach you how to care for your wound and your surgical drain at home.You may wait for lab results to determine your next steps. Your healthcare team will check the breast tissue and lymph nodes they removed to ensure they got all of the cancer. They’ll usually have your results within a couple of weeks. Most of the time, there’s no need for additional surgery. But occasionally, they may need to remove additional lymph nodes or a wider margin of tissue in the area.You may also need additional cancer treatment after surgery, such as radiation or chemotherapy. Some people prefer to complete these treatments before beginning the process of breast reconstruction. Even if you’ve begun your breast reconstruction, you might need additional follow-up surgeries (revision surgery) to achieve the final cosmetic result you want.Care at Cleveland ClinicSchedule a Lumpectomy or MastectomyFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the possible risks or complications of the procedure?Early complications from the procedure can include:Wound infection. Surgeons are careful to prevent this. The risk is less than 1%.Hematoma. This rare complication involves a buildup of blood under the incision wound.Flap necrosis. This complication involves loss of blood supply to the cut tissue, leading to tissue death. It would require cutting off the dead tissue and possibly replacing it with a skin graft. The risk of flap necrosis is low.Delayed complications can include:Seroma. A buildup of fluid can occur inside the wound, more likely if you don’t have a surgical drain. It can cause swelling and tenderness.Post-mastectomy pain syndrome (PMPS). Up to 20% of people experience some symptoms of pain or irritation near the surgical site that don’t go away. People have described tingling, prickling, burning, itching and shooting pain. These symptoms are due to nerve damage and are more likely when your surgeon has to take tissue close to your underarm. Let your healthcare provider know if you experience symptoms of PMPS. They can prescribe special medication to treat nerve pain.Lymphedema. Lymphedema is a greater risk when you've had many lymph nodes removed. It’s caused by damage to your lymphatic system. When lymph fluid doesn’t drain properly, it builds up in your tissues, causing swelling, especially in your arms and legs. It can be mild to severe. Early intervention with physical therapy and massage can help manage it and keep it from progressing. It’s not curable, but the symptoms are treatable.Recovery and OutlookWhat is the recovery like from a mastectomy?It may take four to six weeks to feel fully recovered. Wound healing takes place in about three weeks. You may feel tired, sore and stiff at first, in your chest and through your arm and shoulder. Most people manage with mild pain relievers, and the stiffness improves with exercise. Your healthcare provider will give you specific exercises to do to help your recovery. They’ll let you know when it’s safe to do heavier work.Your nerves are the slowest part of your body to heal, and you may feel a variety of sensations as they heal over the next several months. Most people feel numb throughout their chest after surgery, but you may also feel momentary twinges, tenderness or phantom sensations. Many people regain some of the sensation in their chest after about two years. However, it may never be quite the same as before.Is there life after a mastectomy?Absolutely. Surgery may or may not be the end of your breast cancer journey, but it's likely to be a deciding factor in your treatment that can bring a lot of relief. And while losing your breasts can bring many emotions, many people are very satisfied with their breast reconstruction results. Many different types of cosmetic options are available to help you feel comfortable with your new, reconstructed cancer-free breasts.After your mastectomy, you may benefit from various supplemental wellness services to help restore your quality of life. That might mean counseling or support groups to address your mental and emotional health or physical rehabilitation therapies to help restore your full range of motion. It might also mean complementary medicine such as meditation or yoga, biofeedback or massage.A note from Cleveland ClinicWhen you’re planning for a mastectomy, you have a lot of choices to make in a short amount of time. Your healthcare provider wants to remove the cancer as soon as possible, but you also need to understand the different options and risks before you. The time pressure, together with the different emotions and concerns you have to sort through, can make the planning process feel overwhelming.Remember that your healthcare team is at your disposal to talk you through all of your questions and concerns, as many times as necessary. There’s also a wealth of resources online provided by people who have been through the process and want to help others walk through it. When you’ve made it through the surgery and you’re in the recovery phase, your support network will be just as important.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/25/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule a Lumpectomy or MastectomyFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementCall Appointment Center 24/7 866.320.4573Questions 216.444.2200Request an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"