"Medical Abortion: What Is It, Types, Risks & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Medical AbortionAdvertisementAdvertisementAdvertisementMedical AbortionA medical abortion is an abortion that is completed using a combination of medicines either taken orally or through the vagina. It works by stopping the growth of the pregnancy and then causing the lining of the uterus to shed. This type of abortion can be done as soon as pregnancy begins up until around nine weeks of pregnancy.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a medical abortion?A medical abortion (or medication abortion) is a procedure in which medication (prescription drugs) is used to end a pregnancy. It does not require surgery and is performed through the ninth week of pregnancy. It involves taking two medications — mifepristone and misoprostol. Mifepristone works by blocking the hormone progesterone. Without progesterone, the pregnancy cannot continue to grow in the uterus. Misoprostol causes cramping and bleeding to empty the uterus.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhen can someone get a medical abortion?Medical abortions are performed up to around nine weeks of pregnancy. It can be done as soon as you find out you are pregnant. Your healthcare provider will use an ultrasound to confirm you are pregnant and how long you have been pregnant. If you are beyond nine weeks of pregnancy, there are other options for ending the pregnancy. Your healthcare provider can talk to you about other options and help you decide which would be best for you.Who should not get a medical abortion?Medical abortion is not a safe option for those who:Are too far along in the pregnancy.Have a pregnancy outside of the uterus (ectopic pregnancy).Have a blood clotting disorder or significant anemia.Have chronic adrenal failure.Use long-term corticosteroids.Have an intrauterine device (IUD).Have an allergy to the medications used.Do not have access to emergency care.Can’t return for a follow-up visit.It is important to discuss your medical history with your healthcare provider before a medical abortion procedure.AdvertisementWhy is a medical abortion performed?Having a medical abortion is a highly personal decision based on your own circumstances. Women may choose medical abortions because of the risk of a congenital or inherited disease, to end an unwanted pregnancy or to complete an early miscarriage. It can also be an option for women with health complications where carrying the pregnancy could be life-threatening.What are the different types of abortions?There are medical and surgical abortions. Some differences between the different types of abortions include:Medical abortions (nine weeks of pregnancy or less): A woman will take two different medicines (usually within a 48-hour period). The medication is given by a healthcare provider and is either taken in the provider’s office or at home (or a combination of both). Your healthcare provider will give you specific instructions about how and when to take the medications.Surgical abortions: In this type of abortion, a healthcare provider will surgically remove the embryo from the uterus. These types of abortions require mild sedation, local anesthesia (numbing an area) or general anesthesia (fully asleep). Some other terms for surgical abortions are in-clinic abortions, aspiration abortions and dilation and curettage (D&C) abortions. Some reasons women have a surgical abortion are personal preference, too far along in pregnancy or a failed medical abortion.AdvertisementProcedure DetailsWhat happens during a medical abortion?Medical abortion involves taking medication orally or through the vagina. It does not require anesthesia or surgery. It works by using a combination of two drugs that, when used together, induce an abortion. Mifepristone works by blocking progesterone. Without progesterone, the uterine lining will thin, and the embryo will not stay attached. When misoprostol is taken, it causes the uterus to contract, bleed and expel the embryo.The most common medical abortions are:Mifepristone and misoprostol (oral): You will take mifepristone with your healthcare provider or once you are home. Then, you will take misoprostol 24 to 48 hours later at home.Mifepristone (oral) and misoprostol (vaginal, buccal or sublingual): This is the same medication, except the misoprostol is taken through the vagina or dissolved in the cheek or under the tongue. It is also taken within 24 to 48 hours of the first medication.The most severe side effects from a medical abortion start shortly after taking the second pill. After both doses of medication have been taken you can expect the following to occur:Bleeding and cramping that starts between one and four hours after taking the second pill.Heavy bleeding with blood clots for the next several hours.Heavy cramping for several hours.A low fever or chills that last about a day after taking the second pill. Others report feeling tired, nauseas and dizzy, and having diarrhea.A follow-up appointment will be scheduled to make sure there were no complications. Some healthcare providers may prescribe antibiotics, although infection from a medical abortion is uncommon.What do you do to prepare for a medical abortion?You will need to meet with your healthcare provider for an evaluation and exam. This usually includes:A physical exam and confirmation of pregnancy.Ultrasound to view the pregnancy in the uterus.Determining length of pregnancy and that it’s not an ectopic pregnancy.Blood and urine tests.Explanation of the procedure, risks and side effects.You will have bleeding and cramping afterwards, so be prepared to stay home or in a comfortable location for a few days. Purchase a supply of absorbent pads to contain the bleeding, acetaminophen or ibuprofen for pain relief and a heating pad for cramping.What can you expect after a medical abortion?Vaginal bleeding and cramping will be the biggest side effects. Other side effects from a medical abortion are:Nausea and vomiting.Fever.Chills.Diarrhea.Headache.Does a medical abortion pain feel like labor pain?A medical abortion feels most like strong period cramps. The amount of cramping and pain varies among women. You can take most over-the-counter pain relievers to help with any discomfort or pain that you feel. Ask your healthcare provider what medications can be taken to help manage pain.Care at Cleveland ClinicFind Your Ob/GynMake an AppointmentRisks / BenefitsWhat are the benefits of a medical abortion?The benefits of a medical abortion are:You can get one as soon as you know you are pregnant.There is no surgery or anesthesia involved.You can be at home once the cramping and bleeding occurs.It might feel more natural.You can have a support system with you.What are the disadvantages of a medical abortion?The disadvantages of a medical abortion are:Heavy and painful bleeding for a few days.Can’t be performed after nine weeks of pregnancy.The process is longer (over the course of days versus a few hours).What are the risks of a medical abortion?Before taking the medications for abortion, make sure you are willing to complete all doses that are prescribed to you. Skipping a dose or not following the instructions can pose serious health risks.Risks of a medical abortion are:Incomplete abortion.Heavy bleeding that will not stop.Infection.Fever.Diarrhea and digestive pain.Allergic reaction to the medications.What are signs of an infection after a medical abortion?The biggest signs of an infection after a medical abortion are unpleasant odors from the vagina and fever that lasts more than 24 to 48 hours.Recovery and OutlookHow effective is a medical abortion?When using the combination of mifepristone and misoprostol, it is found to be about 98% effective. It is generally most effective in pregnancies that haven’t reached seven weeks gestation.Do you have to have a follow-up appointment for an abortion?Your healthcare provider will want to see you for a follow-up appointment within two or three weeks. In this appointment, they are likely to:Perform a pelvic exam.Look for signs of infection.Discuss how much bleeding you had, when it stopped, the color and if there were clots.Check your uterus with an ultrasound.Talk about contraceptives to avoid future pregnancies, if you choose to do so.How long does it take to recover from a medical abortion?The amount of time it takes to recover from a medical abortion will vary. In some cases, you may be resuming normal activities within a day or two. Avoid any activities that cause you pain. You will likely have a range of emotions — relief, sadness, stress or guilt. These feelings are common and expected. It may be helpful to speak with a mental health professional, such as a counselor or therapist, about how you are feeling. Your healthcare provider may be able to give you recommendations on mental health professionals who can help you.How long do you bleed after a medical abortion?The amount of bleeding to expect depends on the person and how far along you were in pregnancy. Heavier bleeding is expected for one to two days. Bleeding will start to subside gradually over the course of two to three weeks. Healthcare providers may recommend sanitary pads until the bleeding stops. This helps you see the volume of blood and the clots more easily. Your risk for infection increases with the use of tampons during this time.How soon after a medical abortion can you have sex?You should wait at least two to three weeks to have sex after a medical abortion. This is to prevent infection in the vagina. You should not insert anything into your vagina during this time, including tampons.When can you get pregnant again after a medical abortion?You will be able to get pregnant once ovulation has occurred again. Your normal menstruation cycle should return within four to six weeks after a medical abortion. Your first period may be slightly irregular due to hormonal changes from the procedure. Medical abortion should not affect future pregnancies unless there were complications.When to Call the DoctorWhen should I contact my healthcare provider?You should work closely with your healthcare provider throughout the process of your medical abortion. Discuss all of the concerns you have and make sure you understand the process and what to expect.Contact your healthcare provider if any of the following occur afterwards:Severe bleeding — soaking more than two thick pads within an hour.Fever that lasts more than 24 hours.Foul-smelling vaginal discharge.Severe abdominal or back pain.You do not get your period after two months.You have symptoms of pregnancy.A note from Cleveland Clinic:The decision to have a medical abortion is highly personal. Your healthcare provider can guide you through this process and make sure you know what to expect before and after the procedure. Your healthcare team is there to make sure you are comfortable and receiving the care you need.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/21/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind Your Ob/GynMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"