"Membrane Sweep: Benefits, Risks & How It Works800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Membrane SweepAdvertisementAdvertisementAdvertisementMembrane SweepA membrane sweep is a common procedure performed after 39 weeks of pregnancy to induce labor naturally. It's performed by a healthcare provider and involves them inserting gloved fingers into your cervix to loosen your amniotic sac from your uterus. It's an effective way to progress labor when you are near or past your due date.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewLifting the amniotic sac during a membrane sweep can induce labor.What is a membrane sweep?A membrane sweep is when your healthcare provider sweeps a gloved finger across the membranes that connect your amniotic sac (a fluid-filled sac that contains your baby) to the wall of your uterus. It's performed once your cervix has begun to dilate and can't be done if your cervix is still closed. This separation of the amniotic membranes from the uterus speeds up labor in pregnant people. Membrane sweeps help your body release chemicals called prostaglandins. Prostaglandins soften your cervix and prepare your body for labor. There is no guarantee a membrane sweep will kickstart your labor or start contractions. It's an optional procedure that your healthcare provider may suggest as you near or pass your due date.It's also called stripping the membranes, membrane stripping or sweeping the membranes.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy will a doctor sweep my membranes?Your healthcare provider may suggest sweeping your membranes to start labor. It's performed once your cervix is partially dilated (or open), but contractions have not begun or have started then stopped. It's done around 39 or 40 weeks in pregnancy to avoid having to induce labor medically. Pregnancies that go beyond 41 or 42 weeks put you and your baby at risk for complications. Membrane sweeps are often suggested as the first option to get labor started naturally before scheduling an induction date.What week in pregnancy do membrane sweeps happen?Membrane sweeps are not performed until 39 weeks or later in pregnancy but can be performed up until 42 weeks. You have to be slightly dilated, which allows your healthcare provider to reach up into the cervix to perform the sweep. If you are high-risk or have underlying medical conditions, your healthcare provider may feel a membrane sweep is unsafe.AdvertisementProcedure DetailsHow do doctors perform a membrane sweep?A membrane sweep is performed during a vaginal or cervical exam at around 40 weeks in pregnancy. It can sometimes be done sooner than 40 weeks if your healthcare provider feels there is a medical need to try to naturally induce labor.Your healthcare provider will insert one or two gloved fingers into your cervix and sweep around the top of the cervical opening in a circular motion. This helps separate the amniotic sac from the walls of your uterus without rupturing the sac (breaking your water). This triggers your body to release prostaglandins. This hormone softens, thins and dilates the cervix to prepare you for labor.There is a chance the membranes will rupture during this procedure and that is OK. That's why membrane sweeping is only performed after you are full term.What happens after a membrane sweep?It's normal to experience some light bleeding after a membrane sweep. Some people experience contractions, cramping or mild discomfort afterward. If the bleeding becomes heavy or you have severe pain, contact your healthcare provider right away.AdvertisementDoes a membrane sweep induce labor?There's no guarantee that labor will begin after your membranes are stripped. Studies have shown that membrane sweeps are likely to kickstart labor before 42 weeks and can help avoid a medical induction. Membrane sweeps may be more effective if:You have a \"favorable cervix.\" This means your cervix has softened, thinned and dilated.You are over 40 weeks pregnant (on or just past your due date).You are already in the early stages of labor.How soon after a membrane sweep does labor start?Labor begins within 48 hours for most people after a membrane sweep. Every person and every pregnancy is a little different, so it's hard to say how long it will take for your labor to start (or if it will).How painful is a membrane sweep?The procedure only takes a few minutes, but it can be uncomfortable or slightly painful. Some people describe it as a rough cervical exam. You should expect some discomfort during and just after the membrane sweep. If the sweep worked, you may begin feeling contractions within a few hours.Care at Cleveland ClinicHaving Your BabyGetting StartedLabor & Delivery ServicesRisks / BenefitsWhat are the benefits of getting your membranes swept?The benefits of a membrane sweep are that it's more likely to cause you to go into labor naturally and avoid a medical or planned induction. A medical or planned induction involves getting medication to start labor. Most people are very eager to meet their baby (and probably starting to feel a little uncomfortable) after 39 weeks of pregnancy. The odds that a membrane sweep can get your closer to seeing your baby is an added benefit.Are there any risks with a membrane sweep?Membrane sweeping is generally safe, but there are some risks involved. Other than the discomfort you will feel during the procedure, there is a chance you will bleed afterward. It can also cause cramping that may be confused for contractions. During the procedure, there is a small chance your water breaks (rupturing of the amniotic sac), which can carry its own set of risks.Talk to your healthcare provider and weigh the risks and benefits of a membrane sweep. A membrane sweep is not recommended for people showing signs of needing a Cesarean delivery (C-section) due to other conditions.Recovery and OutlookWhat should I expect after I get my membranes swept?Remember, some people will go into labor within a few days of a membrane sweep, while other's will not. Some of the most common symptoms after a membrane sweep are:Cramping.Contractions that are irregular or hard to track.Light bleeding or spotting.Pay attention to how you feel and ask your healthcare provider how to know you are in labor.When to Call the DoctorWhen should I see my healthcare provider?Call your healthcare provider immediately if you experience severe pain or heavy bleeding after a membrane sweep. You can expect some cramping and bleeding, but anything severe may indicate a problem.Additional DetailsWhat are the signs of labor after a membrane sweep?Some of the most common signs that labor has started are:Cramping or pelvic pain.Contractions.Light bleeding or spotting.You lose your mucus plug.You have a bloody show.Your water breaks.How effective is membrane stripping?Membrane sweeping is effective. If you've never given birth before, it's most effective if performed at 40 weeks. If you have already given birth at least once, it's most effective closer to 41 weeks. One study showed that 90% of those who had a membrane sweep gave birth by 41 weeks compared to 75% who did not have the procedure.A note from Cleveland ClinicMembrane sweeps are a safe and effective way to start labor in most people. While slightly uncomfortable, they can be a great first attempt at getting labor going naturally. Talk to your healthcare provider about membrane sweeping if you are getting close to your due date. They can discuss the risks and benefits and what you can expect afterward.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/19/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicHaving Your BabyGetting StartedLabor & Delivery ServicesAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"