"Meniscus Surgery: Who Needs It, What to Expect Before & After800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Meniscus SurgeryAdvertisementAdvertisementAdvertisementMeniscus SurgeryMeniscus surgery is a common operation to remove or repair a torn meniscus, a piece of cartilage in the knee. The surgery requires a few small incisions and takes about an hour. Recovery and rehabilitation take a few weeks. The procedure can reduce pain, improve mobility and stability, and get you back to life’s activities.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is meniscus surgery?Meniscus surgery is an operation to remove or repair a torn meniscus, a piece of cartilage in the knee.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is a meniscus?Each knee has two menisci. They are rubbery, C-shaped cushions that serve as shock absorbers in the knee joint. If your meniscus is injured or torn (often called torn cartilage), your healthcare provider may recommend surgery to remove the damaged part or repair it.Who needs to have meniscus tear surgery?Meniscus injury and surgery are common, especially among people who play sports. A sudden twist, turn or collision can tear a meniscus.Older people also injure their menisci frequently. The menisci get weak over time and are more likely to tear. In fact, meniscus tears can be a normal occurrence as a part of the aging process.Many people with a torn meniscus choose surgery because the injured cartilage can make the knee unstable (buckle and give way), cause pain and swelling or cause the knee to “lock-up” or become “stuck.”AdvertisementDoes every meniscus injury need surgery?Some people need surgery for a torn meniscus, but some don’t. The decision depends on:Type, size and location of the tear.Your age.Your activity level and lifestyle.Related injuries (e.g., ACL tear).Presence of symptoms (pain, swelling, locking, buckling, etc)Your healthcare professional may suggest you first try nonsurgical treatments, such as :RICE (rest, ice, compression and elevation).NSAIDs.Physical therapy.Knee injections, such as cortisone.Procedure DetailsWhat happens before torn meniscus surgery?If you and your surgeon decide to move forward with surgery for a torn meniscus, you may have some tests in advance. For example, blood tests, electrocardiogram (EKG) and chest X-ray can help determine whether you are healthy enough for surgery. (If you are relatively healthy, these tests are usually not needed.)Someone from the anesthesia team will decide what type of anesthesia (pain control) you should receive:Local anesthesia is a shot that numbs only your knee area.Regional anesthesia is a shot that numbs your body from the waist down.General anesthesia is medication that puts you to sleep.If you receive local or regional anesthesia, you may also be sedated to help you relax. Most often you will have a general anesthetic for this type of procedure.A few days before surgery, your healthcare provider will:Give you a prescription for medications to manage pain after the surgery.Make appointments for physical therapy or a fitting for crutches.Tell you how to prepare for surgery. You may need to stop taking certain medications and not eat or drink for several hours before the procedure.AdvertisementWhat happens during arthroscopic meniscus surgery?The most common procedure for a torn meniscus is knee arthroscopy. It usually takes less than an hour.First, you receive anesthesia. The surgical team cleans the skin on your knee and covers the rest of your leg with a surgical drape. The team might place a clamp on your upper thigh to help with positioning during surgery.The surgeon makes a few small stab incisions (cuts) in your knee called portals. The team then fills the knee joint with a sterile fluid. The fluid helps control minor bleeding in the joint and washes away debris, which helps the surgeon see inside the joint.The surgeon inserts a small tool called an arthroscope into the incision. An arthroscope is a thin tube with a small light and video camera at the end. The camera projects video images from inside your knee onto a monitor.The surgeon uses the arthroscope to look at the tear and decide what surgical technique to perform:Meniscus repair: The surgeon sews torn pieces of cartilage back together so they can heal on their own. However, because of tear type and blood supply, less than 10%of tears are actually repairable.Partial meniscectomy: The surgeon trims and removes the damaged cartilage and leaves healthy meniscus tissue in place.Your surgeon inserts other surgical tools depending on the technique used. When the meniscectomy or meniscus repair is complete, the surgeon closes the portals with stitches or surgical strips. Then the team will cover your knee with a bandage.What happens after meniscus repair or meniscectomy?Most people who have meniscus repair or meniscectomy don’t need to stay overnight at the hospital. You’ll wait in a recovery room for the anesthesia to wear off. When you are ready to leave, somebody else will need to drive you home.Care at Cleveland ClinicMeniscus Tear TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of knee meniscus surgery?Meniscus tear surgery can help:Get you back to sports or other activities.Improve mobility.Make your knee more stable.Prevent or slow the development of arthritis.Reduce or completely relieve pain.What are the risks or complications of arthroscopic meniscus surgery?Arthroscopic knee surgery is very safe, with only rare complications:Arthritis later in life.Blood clots.Blood in the knee area.Infection.Injury to nerves and blood vessels near the knee.Stiffness in the joint.Trouble with anesthesia, such as problems with the heart or lungs.Recovery and OutlookWhat is meniscus surgery recovery like?The recovery time for meniscus surgery depends on the type of surgery you had. It takes longer for a meniscus repair to heal than a meniscectomy. Full recovery from meniscus surgery can take anywhere from six weeks to three months. Your care after surgery may involve:Crutches to take stress off the knee as it heals.Knee brace to stabilize the joint as you recover.Pain medications.Physical therapy.Rehabilitation exercises at home to restore mobility, range of motion and strength.RICE (rest, ice, compression and elevation).Will I have pain after meniscus surgery?You will have some pain immediately after surgery and for several weeks, which is normal. Your healthcare provider will prescribe medications to help you manage the pain. The medications will help you complete the exercises needed to recover.How long after meniscus surgery will I be able to walk, exercise and work?Most people can walk with crutches soon after meniscus surgery. Many return to normal activities within six to eight weeks.Your healthcare provider may recommend low-impact activities rather than high-impact (such as walking rather than running). If you have a physical job, you may need extra time off work to recover.When to Call the DoctorWhen should I see my healthcare provider?Your healthcare provider will tell you when to schedule an appointment for follow-up. But you should call if you develop:Fever higher than 101 degrees Fahrenheit.Lots of drainage (blood or fluid) on the dressing.Pain or swelling that is not relieved by resting or elevating the leg.Pus or foul-smelling drainage from any incisions.Trouble breathing.A note from Cleveland ClinicMeniscus surgery can fix an injured or torn meniscus, a piece of cartilage in the knee joint. Talk to your healthcare professional if you have knee pain that interferes with your life, work or activities. An arthroscopic procedure can reduce pain, improve mobility and stability, and help you return to activities.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/17/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicMeniscus Tear TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2606Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"