"Metoidioplasty Surgery: Procedure, Results & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/MetoidioplastyAdvertisementAdvertisementAdvertisementMetoidioplastyMetoidioplasty uses a testosterone-enlarged clitoris to form a penis. This gender affirmation surgery can be done with or without lengthening the urethra.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewMetoidioplasty is a gender affirmation surgery that uses existing genital tissue to create a penis.What is a metoidioplasty?A metoidioplasty is a type of gender affirmation surgery, also referred to as a “bottom surgery” or a “meta.” The procedure uses the tissue from your clitoris to create a neophallus, literally a “new penis.\" Before the surgery, you should be on hormonal substitution therapy for at least one year. Testosterone will increase the size of your clitoris.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is a metoidioplasty surgery done?A metoidioplasty is a surgery sometimes requested by people assigned female at birth. This surgery helps to align their physical bodies with who they really are. A metoidioplasty treats gender dysphoria.The goals of surgeons who do gender affirmation surgeries are to provide a penis of suitable length, natural-looking genitalia and the ability to urinate while standing up.How common are metoidioplasty surgeries?One survey estimated that 2% of transmen in the U.S. have had metoidioplasty and about 25% would like to have it in the future. However, there has traditionally been some difficulty in reporting accurate figures regarding the transgender and non-binary populations. This is due in part to different and changing terminology and also to the fact that data has not always been collected. Numbers do indicate that the number of gender-affirming surgeries being done is increasing and will continue to rise.AdvertisementProcedure DetailsWhat happens before a metoidioplasty?Before your surgery, you’ll probably do these things:Have a physical exam to assess your health and learn more about your medical history.Receive patient education about risks, benefits and postsurgical care requirements.Have a mental health evaluation to ensure your understanding of the procedure. Healthcare providers also explain its impact on your life. You’ll need to have surgery referral letters from two qualified mental health professionals. This is the time discuss your expectations of the surgery.Take hormone therapy for at least one year.Live for at least one year in a manner consistent with your gender identity.Get health recommendations, including quitting smoking and losing weight, which lower your risk of complications.What happens during a metoidioplasty?During a metoidioplasty, your surgeon will use the tissue from an enlarged clitoris to form a micropenis. (This refers to a penis that is less than 7 centimeters or about 2.57 inches long.)Depending on the type of metoidioplasty you have, your surgeon may:Release the clitoris by cutting the ligaments that connect it to the pubic bone. This is called a simple metoidioplasty.Insert a plastic tube (catheter) into the bladder that is threaded through the neophallus to keep the urethral space open.Use vaginal or cheek tissue to make the urethra longer.Use genital tissue to increase the length and girth of the neophallus.You may want to have other surgeries or additional changes during this surgery. These choices include whether or not your urethra is made longer, whether or not you have a scrotoplasty (to create a scrotum) and or a vaginectomy (to close the vagina, with or without a hysterectomy and oophorectomy. You may want to add testicular prostheses (testicular implants).AdvertisementWhat happens after a metoidioplasty?After a metoidioplasty, you’ll need time to heal. Sometimes the surgery is done in several steps and subsequent surgeries take place two to four months after your first one.Care at Cleveland ClinicSchedule Gender Affirming SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of a metoidioplasty?The advantages of metoidoplasty include:Having genitalia that is esthetically pleasing.Preserving sensation.Being able to urinate while standing.What are the risks or complications of a metoidioplasty?Every type of procedure has risks, like infection. The complications of metoidioplasty include:Urethral stricture (narrowing) due to scarring.Urethral fistula (connection between the urethra and other organs)Urinary tract infections (UTIs).Difficulties with sexual function.Another complication is that you may be dissatisfied with the results of the surgery. Some people who have had a metoidioplasty go on to choose another male genital surgery called a phalloplasty.Recovery and OutlookWhat is the recovery time after a metoidioplasty?You should be able to walk and do light activity after about a week and resume normal activities after about six weeks.When to Call the DoctorWhen should I see my healthcare provider regarding a metoidioplasty?If you’ve had a metoidioplasty, you should always follow the recommendations made by your surgeon regarding the schedule of visits and recuperation. Your healthcare team is always ready to take questions, so don’t hesitate to call with your concerns.However, you should call your provider or seek emergency care if you:Have signs of infection, like a fever, swelling or pus.Have excessive bleeding.Have difficulty or pain with urination.Have body pain that has lasted too long or seems too severe.Additional Common QuestionsWhat is the difference between a metoidioplasty and a phalloplasty?A metoidioplasty uses existing genitalia — clitoris and vaginal tissue — to create a penis. The new penis is more of a micropenis. The sensation you had in the area isn’t lost. You can have an erection after a metoidioplasty.A phalloplasty uses larger flaps of skin and muscle from other places in your body, such as your forearm, your thigh or your back, to create the penis. The penis formed in a phalloplasty is likely to be larger and more natural-looking, but you’ll need additional procedures to be able to have an erection. Some people may decide to have a phalloplasty after a metoidioplasty.A note from Cleveland ClinicA metoidioplasty is a surgery that creates a penis out of genital tissue that is already there. If you’ve decided to have a metoidioplasty, you’ll have already done a lot of research. Work with your healthcare providers to make sure you understand all of your options and possible complications. Discuss your expectations. You may need or want further surgery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/18/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Gender Affirming SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"