"Microscopic Testicular Sperm Extraction: How It's Done800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Microscopic Testicular Sperm ExtractionAdvertisementAdvertisementAdvertisementMicroscopic Testicular Sperm ExtractionMicroscopic testicular sperm extraction (microTESE) is a procedure that takes sperm directly from the testicular tissue of a man’s reproductive system. If a man can't release or make enough healthy sperm naturally, this medical procedure may be recommended for fertility reasons (to enable the man to father a child).ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewWhat is a microscopic testicular sperm extraction?Microscopic testicular sperm extraction (microTESE) is a procedure that takes sperm directly from the testicular tissue of a man’s reproductive system. If a man can't release or make enough healthy sperm naturally, this medical procedure may be recommended for fertility reasons (to enable the man to father a child). The testicular tissue is found in the two testes, where the sperm is made. The testes are found inside the scrotum, the small sac behind and under the penis.The goals of the microTESE procedure are to:Obtain the best quality sperm.Get enough sperm to fertilize an egg from a woman.Minimize damage to the reproductive organs.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is male infertility?Infertility is a disease of the reproductive system that makes it difficult for the body to perform the basics of reproduction. It affects both men and women. Most infertility cases are treated with medication or surgery.Male infertility in its most severe form may be caused by a condition known as nonobstructive azoospermia (the man does not produce sperm), or by obstructive azoospermia (sperm is produced, but blocked, and can't be released from the body).Many times, the causes of infertility are unexplained. Sometimes, the difficulties may be from a genetic disease such as cystic fibrosis, a birth defect, a medical problem, or the result of an earlier treatment that may cause infertility (such as certain cancer treatments). In other cases, we do not know what the cause of the infertility is, but we still have treatments that may help.How is infertility diagnosed?If a couple is unable to conceive a child after several months of trying without birth control, they should see a doctor. If the woman is older than 35, the couple should see a doctor sooner. Your healthcare provider will perform a physical exam of both partners to check for any physical issues that may be causing infertility. The provider will also ask many questions and discuss each person's medical history.The following tests may also be recommended or ordered to evaluate male fertility:Semen analysis: Determines the number and quality of sperm. Semen is a bodily fluid that is secreted by the male reproductive organs. It carries sperm and other nutrients that help the sperm survive to enable successful fertilization.Blood test: Checks for genetic or hormone problems. (Hormone levels are important in both male and female fertility.)Ultrasound of the scrotum: Looks for abnormalities in the veins that carry blood from the testicles and back to the rest of the body.In-home testing kits may be available for semen analysis. Ask the doctor for more information.AdvertisementWhat will the infertility tests determine?Semen analysis will give the doctor necessary information to help assess fertility and create a treatment plan. The tests should show some of the following:Amount of semen: At least 1.5 milliliters is considered normal. A lower number may mean that there is an internal issue with a part of the reproductive system, such as the seminal vesicles or a prostate gland, blocking the release of semen.Sperm count: Fifteen million to 300 million per milliliter is considered a normal range. Below 15 million is abnormal.Morphology: The size and shape of the sperm. Four percent of normal-shaped sperm (using the “strict” criteria) is ideal to be able to fertilize an egg. Some doctors consider even a lower percentage as normal.Motility: The movement of the sperm. Approximately 40% of sperm should be moving. The quality of movement is graded from 0 to 4, with a score over 3 considered good.When is microscopic testicular sperm extraction necessary or recommended?Microscopic testicular sperm extraction is usually performed on a man who is infertile and has no sperm in his ejaculation (azoospermia).AdvertisementProcedure DetailsWhat happens during the microscopic testicular sperm extraction procedure?A urologist, a doctor who specializes in the male and female urinary tract and male reproductive organs, typically performs the procedure by making a few small cuts in the testicle and removing a small amount of tissue. Once the tissue is removed from the body, it is examined under a microscope to look for sperm. If found, the sperm can be used right away to fertilize an egg, or the sperm cells can be frozen, stored and then thawed at a later time to be used for infertility treatment.The procedure is usually performed in the operating room with the patient under general anesthesia. A single incision is made in the middle of the scrotum. A microscope is used to help see the fine tubules of the testis that may contain sperm. All sutures (stitches) that are used dissolve on their own. The patient is able to go home the day of the procedure, and should be able to resume normal activities within one to two weeks.Care at Cleveland ClinicMale Infertility TreatmentFind A Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the possible complications of microscopic testicular sperm extraction?Possible risks of the microTESE procedure include bleeding, infection, and pain or discomfort after the procedure. There is a very rare chance that the testicle itself will be damaged during the procedure.Recovery and OutlookWill the microscopic testicular sperm extraction procedure need to be repeated?When possible, any extra sperm retrieved during testicular sperm extraction should be frozen to preserve the sperm and avoid further procedures.Although freezing the sperm may have some negative effects, medical experts believe that the outcome is generally the same as using non-frozen sperm in fertility procedures such as intra-cytoplasmic sperm injection (ICSI), a type of in vitro fertilization injecting one sperm directly into one egg. In vitro fertilization is a procedure in which a sperm and an egg are fertilized outside of the body, in a laboratory. The fertilized egg is then placed in the female’s uterus.If the microTESE procedure needs to be repeated, it is usually best to wait six to 12 months.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/07/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicMale Infertility TreatmentFind A Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"