"Microdermabrasion: What It Is, Benefits, Results & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/MicrodermabrasionAdvertisementAdvertisementAdvertisementMicrodermabrasionMicrodermabrasion is a minimally invasive procedure to remove the uppermost layer of skin from your face or body. It can help improve the appearance of your skin and minimize wrinkles, age spots or other minor cosmetic concerns.ContentsArrow DownOverviewProcedure DetailsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewIn microdermabrasion, your healthcare provider gently exfoliates the uppermost layer of your skin.What is microdermabrasion?Microdermabrasion is a minimally invasive cosmetic procedure for your skin. A dermatologist provider uses a special instrument to gently exfoliate (sand away) the uppermost layer of your skin. You can get microdermabrasion on your face, neck, back, hands or chest.Microdermabrasion:Helps new skin cells grow.Reveals newer, undamaged skin.Thickens collagen, which is a protein that keeps your skin firm.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the benefits of microdermabrasion?Microdermabrasion removes the uppermost layer of skin. This can improve the look and feel of your skin, revealing smoother, more youthful-looking skin. Microdermabrasion can make the following skin conditions less noticeable:Age spots.Enlarged pores or blackheads.Fine lines or wrinkles.Mild scars, especially those from acne.Skin discoloration or uneven skin tone.Stretch marks.Sun damage.What are the disadvantages of microdermabrasion?Microdermabrasion is a safe cosmetic procedure and doesn’t have serious risks. But some people may notice:Bruising, which might last for a few days after the procedure.Discoloration or darkened skin on the treated area.Flaky or dry skin.Increased sensitivity to sunlight, so be sure to wear sunscreen.Most people need multiple treatments.AdvertisementWho shouldn’t have microdermabrasion?Microdermabrasion might not be right for everyone. Talk to your healthcare provider before getting this procedure if you have:Acne or are taking medication for acne.Frequent skin rashes (contact dermatitis) or cold sores.Moles, freckles, skin tags or other growths that change in size or shape or bleed.Skin conditions such as eczema or psoriasis.How common is microdermabrasion?Microdermabrasion is a common treatment. It’s often among the top five most common nonsurgical cosmetic procedures.AdvertisementProcedure DetailsWhat happens before microdermabrasion?Before your microdermabrasion procedure, you’ll consult with a healthcare provider. A plastic surgeon, dermatologist or cosmetologist/aesthetician can perform microdermabrasion. They’ll go over your health history and your goals for the procedure. They may also take before photos of the area of skin that will have treatment.This is a good time to ask any questions you may have about the procedure, like:Are there any risks?How many treatments will I need?What kind of results can I expect?Will my skin be red or very sensitive after treatment?What do microdermabrasion facials do?You don’t need topical or local anesthetic to numb your skin before microdermabrasion. The procedure usually isn’t painful, but you might feel a scratching, stinging, sucking or vibrating sensation on your skin.Your healthcare provider uses one of two techniques to remove dead or damaged cells in microdermabrasion:Crystal microdermabrasion: Using this method, your dermatologist shoots tiny crystals through a tube. The crystals loosen and knock off dead skin cells. Then, your provider vacuums up the debris (the crystals and dead skill cells) using the same tube. It’s like sandblasting only much, much gentler.Diamond microdermabrasion: In this method, your dermatologist uses a diamond-tipped wand to remove (and vacuum up debris from) the top layer of your skin. This works a little more like an electric sander, but it’s much, much gentler.Treatment usually lasts about 30 to 40 minutes.What happens after microdermabrasion?You can go home right after your procedure. Your skin might be a little red, swollen or sensitive for up to 24 hours. Your healthcare provider may provide a cream for your skin, which can calm the irritation.Most people get between one and four treatments each month to achieve their desired results. Monthly treatments after that can help you maintain the results.Care at Cleveland ClinicGet Dermatology CareMake an AppointmentRecovery and OutlookHow long does microdermabrasion last?Microdermabrasion results vary from person to person. Your skin will feel softer and smoother after your first treatment. But the results of microdermabrasion build up over time. Most people need multiple treatments to achieve their desired cosmetic goals.Microdermabrasion is one good way to improve the look of your skin. But microdermabrasion doesn’t stop your skin cells from aging and dying. Your healthcare provider will evaluate how well you heal after your first treatment to determine how soon you can have your next treatment. After you reach your desired results, talk with your healthcare provider about how often they think you’ll need to repeat the treatment to keep the results.When to Call the DoctorWhen should I see my healthcare provider?Contact your healthcare provider if you notice the treated area is:Bleeding.Blistered.Swollen for longer than a day or two.Additional Common QuestionsWhat should I ask my healthcare provider about microdermabrasion?You may want to ask your healthcare provider:Am I a good candidate for microdermabrasion?Can I try an at-home microdermabrasion kit?Does microdermabrasion work better on light or dark skin?Would another type of skin treatment, such as a chemical peel or microneedling, work better for me?What is better: Microdermabrasion or a chemical peel?Both microdermabrasion and chemical peels exfoliate and brighten your skin. The difference is about how they do it.Microdermabrasion is a physical exfoliator — it removes skin by rubbing it off. It only removes the top layer of skin. So, the dull skin comes off and your face feels smoother.As the name implies, a chemical peel is a type of facial that uses chemicals to exfoliate deeper than microdermabrasion allows.What’s the difference between dermabrasion and microdermabrasion?Dermabrasion is more aggressive than microdermabrasion. Your dermatologist may recommend dermabrasion over microdermabrasion if you’re worried about deep scars and wrinkles. Your dermatologist may also recommend it to remove certain pre-cancerous growths.While microdermabrasion doesn’t cause bleeding, dermabrasion does. So, you’ll need a bit more recovery time after dermabrasion.A note from Cleveland ClinicThese days, you might feel like everyone is getting something done to their skin to look younger. But it’s important to remember that aging is a natural process. You are beautiful just as you are.That said, sometimes, having smooth, healthy-looking skin can give us a boost of confidence as we age. If that’s what you’re looking for, microdermabrasion may be a good option for you. It’s a minimally invasive way to exfoliate dead or damaged skin cells. It can reveal smoother, brighter skin and reduce the appearance of fine lines, age spots or light scars. You’ll likely need multiple treatments. If you have very sensitive skin or chronic skin conditions, talk to your dermatologist before getting microdermabrasion.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/12/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Dermatology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"