"Mitral Valve Replacement: Options, Procedure Details and Recovery. 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Mitral Valve ReplacementAdvertisementAdvertisementAdvertisementMitral Valve ReplacementMitral valve replacement is a heart surgery to give you a new mitral valve when your current one can’t be repaired. Your new valve will be either mechanical or biological. This surgery can relieve symptoms of mitral valve disease and prevent further damage to your heart. Talk with your provider about the benefits and risks of valve replacement.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is mitral valve replacement?Mitral valve replacement is a treatment option for people who have mitral valve disease. It involves surgery to give you a new mitral valve.Your mitral valve is the passageway between your left atrium and left ventricle. These two left-sided chambers of your heart hold oxygen-rich blood. This blood travels from your lungs into your left atrium. Then, the blood passes through your mitral valve into your left ventricle. Your left ventricle has the important job of pumping it out to the rest of your body through your aorta.If you have mitral valve disease, it’s harder for your valve to get this job done. This puts a strain on the left side of your heart. Over time, this can lead to heart and lung damage.Sometimes, mitral valve repair can fix problems with your valve so you don’t need it replaced. But if your valve is severely damaged, you may need a new one.Like all heart surgeries, mitral valve replacement comes with risks. But if your provider recommends this surgery, it means your valve disease is getting worse and you’re at risk for serious complications. It also means your valve can’t be repaired.Some people have mitral valve replacement at the same time as other heart procedures. These include:Coronary artery bypass grafting (CABG). This is the most common procedure performed at the same time as mitral valve replacement.Tricuspid valve repair or replacement.Aortic valveAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyIs a mitral valve replacement open-heart surgery?Usually, mitral valve replacement involves open-heart surgery. However, some people are candidates for Transcatheter Mitral Valve Repair or Replacement (TMVR). This is a minimally invasive procedure that treats your valve from inside your body. TMVR allows you to avoid open-heart surgery. Your provider will let you know if this is an option for you.What conditions are treated with mitral valve replacement?Mitral valve replacement treats the following conditions:Mitral valve regurgitation.Mitral valve stenosis.Degenerative mitral valve prolapse is a common cause of valve surgery. This means your valve flaps (leaflets) break down over the years, leading to mitral regurgitation (leakiness). This leakiness may start out mild. But if it gets worse over time, you may need repair or replacement.AdvertisementWho needs to have mitral valve replacement?Surgeons will try to repair your valve, rather than replace it, whenever possible. However, if repair surgery has a low chance of success, then your surgeon will recommend valve replacement. Repair might not be successful if:Endocarditis has severely damaged your valve.Rheumatic heart disease has severely damaged your valve.Your valve has extensive calcium deposits or scarring.There’s a lot of damage to your papillary muscles or chordae. These are your valve’s support structures.Talk with your provider about your options. It’s a good idea to go to a high-volume hospital (where surgeons perform many valve surgeries every day) for evaluation. Surgeons at these hospitals are experienced in evaluating valve anatomy. They’re highly skilled at deciding if repair or replacement would be better for you.What will my new valve be made of?There are two types of replacement valves:Mechanical valves made of carbon and steel.Biological (bioprosthetic) valves made of tissues from pigs, cows or (rarely) humans.In general, providers use the following age-related guidelines as a starting point for deciding which valve you need:Under age 50: Mechanical valve (unless pregnant or planning to become pregnant).Between age 50 and 65: Either one.Over age 65: Biological.These guidelines take into account the pros and cons of each type of valve.Mechanical valveProsConsIt's very durable. A mechanical valve can last 20 to 30 years.You need to take blood-thinners (anticoagulants) for the rest of your life to reduce your risk of blood clots. Clots are more likely to form on mechanical valves than biological ones.It reduces the chances of needing another valve surgery.You may hear a subtle clicking sound as the valve works.ProsProsIt's very durable. A mechanical valve can last 20 to 30 years.ConsYou need to take blood-thinners (anticoagulants) for the rest of your life to reduce your risk of blood clots. Clots are more likely to form on mechanical valves than biological ones.It reduces the chances of needing another valve surgery.ConsYou may hear a subtle clicking sound as the valve works.The use of blood thinners is the drawback most people talk about. Ask your provider what long-term anticoagulation therapy involves and whether it’s safe for you. The requirement to use blood thinners can be risky for some people. These include people who:Are pregnant or planning a pregnancy. Blood thinners can harm your fetus.Face a greater risk offalling. Blood thinners raise your risk of bleeding when you get injured.Face a greater risk of injury at work or at play, such as in certain sports or hobbies.Plus, some people may not want to take blood thinners for other reasons. So, if this is a concern for you, a biological valve may be a better option.Biological (bioprosthetic) valveProsConsYou won’t need to take blood-thinners for the rest of your life (unless you need them for another medical condition).It’s not as durable as a mechanical valve.You have a lower risk of blood clots.You’ll likely need another valve replacement surgery in about 10 to 15 years.ProsProsYou won’t need to take blood-thinners for the rest of your life (unless you need them for another medical condition).ConsIt’s not as durable as a mechanical valve.You have a lower risk of blood clots.ConsYou’ll likely need another valve replacement surgery in about 10 to 15 years.You may be wondering which type of valve is better for you. It’s a big decision. And it’s important to weigh the pros and cons of each. Surgeons recognize that each person will have their own preferences and concerns. Don’t hesitate to share your thoughts and preferences with your provider.AdvertisementHow common are mitral valve replacements?Heart valve surgery is the second most common heart surgery in the U.S.In the U.S., about 90,000 people have one of their heart valves replaced each year. Around the world, this number is about 280,000. The most commonly replaced valves are the mitral valve and the aortic valve.Procedure DetailsWhat happens before mitral valve replacement?Your provider will give you specific instructions for how to prepare for your surgery. In general, you’ll need to:Stop taking certain medications in the weeks before your surgery.Stop smoking and using tobacco products. Your provider can help give you resources to quit.Wash your body with an antimicrobial soap the night before your surgery.Stop eating and drinking after a specific time. It’s often midnight the night before your surgery.Take certain medications on the day of your surgery.Your provider may also give you medications to treat certain conditions before your surgery. These conditions include:Congestive heart failure.Atrial fibrillation.As your surgery day approaches, you should also prepare for your return home. For example, it’s important to:Find someone to drive you home from the hospital.Ask family, friends or neighbors to check on your home while you’re in the hospital.Arrange for child care and pet care, as needed.Organize and rearrange your home so you can easily get what you need while you recover. You may want to put kitchen supplies on your counter or table. That way you can easily access them without reaching up high or bending down low. Do the same with bathroom supplies.Ask for help, and accept help when it’s offered. Recovering from heart surgery takes time. It’s OK to ask others to help you cook, clean and manage errands so you can rest and get stronger.If you don’t have a support network nearby, ask your provider for local organizations and resources that can help.What happens during mitral valve replacement?During mitral valve replacement, your surgeon will remove your damaged valve and put a new one in its place. Throughout the surgery, your care team will use transesophageal echocardiography. This imaging technology guides their work and helps them confirm surgery success.Mitral valve replacement surgery is complex and requires a careful surgical technique.Your surgery will follow these steps.Your provider will give you anesthesia so you’ll be asleep during the surgery. You won’t remember the surgery when you wake up.Your provider will connect you to monitors and give you antibiotics through an IV.You’ll be hooked up to a cardiopulmonary bypass machine. This machine will do the work of your heart and lungs during the surgery. To connect you to the machine, your provider will insert tubes in two of your large veins (superior vena cava and inferior vena cava). Your heart will also be stopped during the surgery.Your surgeon will make an incision in your chest. Most valve replacements require a median sternotomy. This allows your surgeon to access your heart.Your surgeon will then make an incision in your left atrium to gain access to your mitral valve.Several surgical techniques can help preserve parts of your existing valve. Research shows the value of keeping as much of your natural tissue as possible, including the chords that support your valve. This can help the new valve work better and also help your left ventricle function better. Your surgeon will preserve healthy tissue and remove damaged tissue.Your surgeon will sew your new valve into place. The specific suturing techniques depend on the type of valve you receive.Your surgeon will check to be sure the valve’s leaflets can move freely. It’s important that no tissue gets in the way as your valve closes.Then, your surgeon will sew your left atrium closed and slowly ease you off the cardiopulmonary bypass machine.Your surgery will include additional steps if you’re having other procedures (like CABG) done at the same time.Mitral valve replacement generally takes two to four hours.What happens after mitral valve replacement?Most people need to spend about a week in the hospital after having valve surgery. After your surgery, you can expect to:Spend one or two days in the ICU. Your care team will keep a close eye on you. They’ll check your pulse, breathing and other vitals.Spend several more days in a hospital room.Receive treatment for an arrhythmia (irregular heartbeat). Arrhythmias are very common after valve replacement. Your care team may give you medications to help your heart rhythm. You may also need a temporary pacemaker.Begin anticoagulation therapy (usually warfarin) to reduce your risk of a blood clot. You’ll likely need to take these medications for up to three months if you received a biological valve. You’ll need to take them for life if you received a mechanical valve.Learn about cardiac rehab Cardiac rehab can help you get back on your feet again faster. Plus, it helps you build a community of people who’re in your shoes.Learn how to care for your incision as you continue recovering at home.Care at Cleveland ClinicMitral & Tricuspid Valve CareFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of mitral valve replacement?The advantages of mitral valve replacement include:It doesn’t take as long as repair surgery. So, you’ll spend less time on the cardiopulmonary bypass machine.It’s less complex to perform than repair surgery (though it’s still very complex).It lowers your risk of needing another surgery in the future.What are the complications of mitral valve replacement?Complications of valve surgery include:Arrhythmias.Bleeding.Blood clots.Heart block.Heart failure.Infection.Stroke.These complications may happen soon after your surgery or down the road. Talk with your provider about all possible complications and how to lower your risk.Recovery and OutlookWhat is the recovery like for mitral valve replacement?Recovery from valve repair surgery usually takes four to eight weeks. Some people may need more time.Several factors impact your recovery. These include:The severity of mitral valve disease before your surgery. People who had severe regurgitation or reduced heart function need more time to get their strength back.Your general health before your surgery. People who had heart failure or kidney failure face a slower recovery.The nature of the surgery. If you had valve replacement along with other procedures, like CABG, your recovery may be slower.Don’t push yourself to recover within a certain time frame. Everyone is different. Let your body rest, and accept help from others as you heal.Your provider will tell you when it’s safe for you to:Drive.Lift heavy objects.Take walks or do other forms of exercise.What is the survival rate for mitral valve replacement surgery?About 93% to 98% of people survive mitral valve replacement surgery. The risks go up as you get older. About 91% of people over age 65 survive this surgery.How long do you live after mitral valve replacement?About 50% to 60% of people live at least 10 years after their mitral valve replacement. This is true whether they receive a biological valve or a mechanical one.Your life expectancy after mitral valve replacement depends on many factors. As with any surgery, your age and overall health play a role. Factors related to the surgery itself include:Whether you need additional heart procedures along with valve replacement.Whether it’s a reoperation (your second time having mitral valve surgery).The timing of your valve replacement (planned in advance vs. emergency).How much of your natural valve tissue can be “spared” (kept) during the surgery.Your long-term survival is better if:You only need a valve replacement.It’s your first time having valve replacement surgery.Your surgery is elective (planned in advance).You have some healthy valve tissue for surgeons to keep and attach to your new valve.Talk with your provider about your individual situation and how long you can expect to live after your valve replacement. No provider can predict the exact number of years. But they’ll be able to assess your personal risks and give you a realistic picture of your outlook.When to Call the DoctorWhen should I see my healthcare provider?Your provider will tell you when you need to return for follow-up appointments. It’s important to keep these appointments so your provider can check how your new valve is working.As you recover, stay aware of how you’re feeling. Call your provider right away if you have any signs or symptoms of complications. These include:Chest pain.Chills or fever.Coughing up blood.Coughing up mucus that looks yellow or green.Dizziness or fainting.Fever.Headache that’s very severe.Irregular pulse (too slow or too fast).Nausea and vomiting.Pain, redness or swelling in your lower leg.Pain in the area of your incision that won’t go away.Shortness of breath.Signs of infection around your incision, like oozing or redness.Slurred speech or other signs of a stroke.If you’re taking blood thinners, you should call your provider if you:Fall.Have excessive bleeding in any area of your body (including your nose or gums).Have many bruises on your skin.Don’t hesitate to call your provider for any reason. It’s important to share how you’re feeling, even if you think everything’s probably fine. Your provider will know if a symptom that seems “minor” is in fact something serious.A note from Cleveland ClinicMitral valve replacement surgery is a major life event. If you just learned you need a new mitral valve, you may feel nervous or worried about what comes next. This is the time to learn as much as you can about your condition and treatment options, including both the benefits and the risks. Talk with your provider about why you need replacement rather than repair, and what type of replacement valve is better for you.It’s important to seek care at a high-volume hospital where valve surgeries are performed every day. Highly experienced cardiac surgeons have the skills and training to minimize your risks and help get you on the road to recovery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/02/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicMitral & Tricuspid Valve CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"