"Mitral Valve Repair: Procedure Details and Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Mitral Valve RepairAdvertisementAdvertisementAdvertisementMitral Valve RepairMitral valve repair surgery helps people with mitral valve disease live a longer and healthier life. You may need this surgery if your mitral valve is very leaky or very narrow. Without treatment, these problems can damage your heart over time and even be fatal. Talk with your provider about the treatment plan that’s best for you.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is mitral valve repair?Mitral valve repair is a treatment option for people who have mitral valve disease. It involves open-heart surgery to fix problems with your mitral valve. If you have severe mitral valve disease, your provider may recommend open-heart surgery to either repair or replace your damaged valve. Providers often recommend repair over replacement — particularly when the valve leaks — because there are more benefits and fewer risks in keeping your own valve. But for some people, replacement may be the best or only option.If you need to have mitral valve repair, it’s important to learn why you need this surgery and what you can expect. Mitral valve repair surgery has risks, like all heart surgeries, but advances in technology continue to make this surgery safer and more effective.Some people are candidates for procedures other than standard open-heart surgery. These include minimally invasive mitral valve repair and percutaneous interventions. Talk with your provider to see if you’re a candidate for one of these procedures. Your provider will consider many factors like your age and overall health condition to decide the method of valve repair that’s best for you.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat conditions are treated with mitral valve repair?Mitral valve repair treats the following conditions:Mitral valve regurgitation. This is commonly known as a “leaky valve.” Your valve flaps don’t close all the way, leading to some blood leaking in the wrong direction. This is most often caused by mitral valve prolapse.Mitral valve stenosis. This is a narrowing of your valve opening that prevents enough blood from flowing through.Mitral valve prolapse. People with this condition have mitral valve flaps that are too floppy or stretchy. About 6 in 10 mitral valve surgeries are due to leaky valves that are caused by leaflet prolapse.Why is mitral valve repair done?Mitral valve repair fixes problems with your valve so you can lower your risk of serious complications down the road.Your mitral valve is the door that connects your left atrium and left ventricle. These are the two chambers of your heart that hold oxygen-rich blood. Your left atrium receives this blood from your lungs. The blood travels through your mitral valve to enter your left ventricle. Then, your left ventricle pumps it out to the rest of your body through your aorta.Mitral valve disease makes it harder for your valve to do its job. Over time, this can lead to heart and lung damage. Repair through open-heart surgery can help you avoid or delay such problems.AdvertisementWho needs to have mitral valve repair?People who have mitral valve disease, particularly if the valve leaks, may need mitral valve repair surgery.If you have a mild form of the disease, you may not need surgery. Your provider may prescribe medications to manage your symptoms. But your provider will keep a close eye on the situation. They’ll use echocardiogram tests to check your heart at regular intervals. You may need surgery later on to manage valve disease that’s getting worse or damaging your heart.You may need mitral valve repair if:You have severe regurgitation (your valve is very leaky).The regurgitation causes symptoms.Your left ventricle isn’t pumping out enough blood to your body (left-sided heart failure).Your heart is enlarged.You have severe mitral valve stenosis with severe symptoms or a very narrow valve opening. But your provider may try other methods first, like balloon mitral valvotomy.How common are mitral valve repair procedures?Valve surgery is the second-most common heart surgery in the U.S. Over 100,000 people had valve repair or replacement surgery in 2018. The most commonly repaired valve is the mitral valve.More and more people are having mitral valve surgery — either repair or replacement — as time goes on. In 2011, more than 14,000 people had isolated mitral valve surgery (this means surgery just to treat their mitral valve). By 2016, that number was nearly 18,000.Plus, some people have mitral valve repair or replacement along with other heart procedures. These include coronary artery bypass grafting (CABG) and aortic valve replacement. From 2011 to 2016, about 174,000 people had mitral valve surgery either on its own or with other heart procedures.AdvertisementProcedure DetailsWhat happens before mitral valve repair?You’ll work with your provider and care team to prepare for your surgery. Be sure to follow your provider’s instructions. Your provider may tell you to:Stop taking certain medications in the weeks leading up to your surgery. These include blood thinners (anticoagulants) like aspirin and warfarin.Work with them to stop smoking.Wash with an antimicrobial soap the night before your surgery.Take certain medications on the day of your surgery.Stop eating and drinking after a specific time on the day of your surgery.What happens during mitral valve repair?During mitral valve repair, your surgeon will fix one or more issues with your valve. There are several different techniques your surgeon can use. In general, your surgery will follow these steps.Your provider will give you anesthesia so you’ll be in a deep sleep during the procedure.You’ll be hooked up to a cardiopulmonary bypass machine. This machine will do the work of your heart and lungs during the surgery.Your surgeon will make an incision (cut_ in your chest. The size of the incision depends on the surgical method. The incision may go down the middle of your chest (full sternotomy), or part of your chest (partial sternotomy). You may have a smaller incision between two of your ribs (right thoracotomy). Or, you may have several small incisions in different points between your ribs (robotic-assisted method).Your surgeon will put an annuloplasty ring around the valve. This ring is like a cloth washer that supports the valve and returns it to a more normal shape.Your surgeon will repair your mitral valve using one or more additional surgical techniques (described below).It’s then important to evaluate the success of the repair. Your surgeon will check to see if your valve is fully repaired, and make adjustments if needed.You’ll be disconnected from the bypass machine so your heart and lungs can start working again.Your surgeon will perform a transesophageal echocardiogram. This is to inspect your valve and confirm repair success.What surgical techniques are used for mitral valve repair?Providers use several different techniques for mitral valve repair. Talk with your provider about the techniques you can expect for your surgery.AnnuloplastyAll mitral valve repairs include an annuloplasty. This means your surgeon places a complete or partial ring around the rim of your valve. The ring may be flexible or rigid. An annuloplasty makes your repair last for a long time.Triangular or quadrangular resectionThis is the technique surgeons use most often for posterior leaflet prolapse. Your posterior leaflet and anterior leaflets are the two flaps that make up your valve.Your surgeon resects (removes) the damaged part of your leaflet and then sews the remaining edges together. Usually, surgeons can make a small, triangular cut to remove the damaged part. But if a larger area of your leaflet is diseased, your surgeon may need to make a rectangular cut to remove a bit more tissue.Chordal repairSurgeons use this technique to repair anterior leaflet prolapse. It involves replacing some of your chordae (chords), which are the tough, fibrous strings that support your mitral valve. Your surgeon removes the ruptured or elongated (too stretchy) chords. Then, they create and attach new chords.Your surgeon may create new chords out of a tough, synthetic material called Gore-Tex®. Or, your surgeon may take healthy chords from another area and put them in place of the damaged ones. This is called chordal transposition or chordal transfer. Both options provide excellent long-term results.Special situations for mitral valve repairSome people have special situations that require additional techniques during their repair surgery. These situations include:Mitral valve repair and atrial fibrillation. Many people who have mitral valve disease also have atrial fibrillation (AFib). If you have AFib, your surgeon can perform the MAZE procedure to treat your AFib during the same operation.Mitral valve repair for endocarditis. Endocarditis means there’s an infection in your heart valve. Your surgeon will need to remove all infected tissue from your valve. If there’s enough healthy tissue left, your surgeon can reconstruct your valve. Otherwise, you may need a new valve (valve replacement).Mitral calcification. If you have many calcium deposits on your valve leaflets or annulus, your surgeon will use advanced surgical techniques. They’ll separate your leaflet from your annulus and remove the calcium deposits. Then, they’ll rebuild the damaged part of your valve using a patch or sutures.What happens after mitral valve repair?After your surgery, you can expect to:Spend one or two days in the ICU. Your care team will keep a close eye on you. They’ll check your pulse, breathing and other vitals.Spend several more days in a hospital room to continue recovering.Learn about cardiac rehab.Learn how to care for your incision when you get home.Most people need to recover in the hospital for about a week after their valve surgery.Care at Cleveland ClinicMitral & Tricuspid Valve CareFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsMitral valve repair is open-heart surgery to fix problems with your mitral valve.What are the advantages of mitral valve repair?Mitral valve repair has several advantages over valve replacement. These include:Better chances of surviving the surgery and living a longer time afterward.Improved lifestyle.Better preservation of heart function.Lower risk of complications like stroke and endocarditis.No need for long-term use of blood thinners (anticoagulation).Your provider will recommend a repair, rather than a replacement, whenever possible. Repair is the better option for nearly everyone with mitral valve regurgitation. And it’s also better for some people with mitral valve stenosis.But replacement surgery is a better option in some situations. It doesn’t take as long as repair surgery, and it’s less complex to perform.Talk with your provider about the option that’s better for you.What are the complications of mitral valve repair?Complications of valve surgery include:Arrhythmias.Bleeding.Heart block.Heart failure.Infection.Stroke.Talk with your provider about all possible complications and how to lower your risk.Recovery and OutlookWhat is the recovery like for mitral valve repair?Recovery from valve repair surgery usually takes four to eight weeks. Some people may need longer.If you have a surgery coming up, you’re probably wondering what life will be like after your mitral valve repair. You know you’ll need to spend some time in the hospital, and you might be planning on cardiac rehab. But what comes next?The short answer is that recovery looks different for everyone. Your neighbor might’ve bounced back quickly and felt as good as new a month later. But maybe an old friend told you she didn’t feel back to normal for many months. And even then, it felt like a “new normal.”If it takes you longer, it’s OK. Don’t compare your recovery to what others experience, and don’t push yourself to feel better right away.Several factors impact your recovery. These include:The severity of heart disease before your surgery. It’ll take you longer to get your strength back if you had reduced heart function.Your general health going into surgery. Were you very active? Or did health issues make it hard for you to get around? Conditions like heart failure and kidney failure can also make recovery a slower process.The surgical method. If you had a median sternotomy, it’ll take six to eight weeks for your breastbone to get strong again. Smaller incisions (those used in minimally invasive surgical techniques) heal faster.After you’re home from the hospital, set small and manageable goals. Get enough rest as you slowly return to your normal routine.Your provider will tell you when it’s safe for you to:Drive.Lift heavy objects.Take gentle walks or do other types of exercise.What is the outlook for people who have mitral valve repair?Mitral valve repair is a durable solution for treating mitral valve disease. Most people (95%) can go at least 10 years without needing another surgery. Almost as many (90%) can go 20 years. Most people don’t need another mitral valve surgery after a successful repair.You’ll need an echocardiogram each year so your provider can check on your valve function. You may also need antibiotics before certain procedures to prevent endocarditis (an infection of your valve). Talk with your provider about all measures you need to take in the years following your surgery.What is the life expectancy after mitral valve repair?Your life expectancy depends on many factors, including the severity of your mitral valve disease and your overall health. Talk with your provider about how mitral valve repair may impact your life expectancy.Does mitral valve repair shorten your life?Mitral valve repair can help you live a longer and healthier life. Like all heart surgeries, it carries risks. Most people survive the surgery. But some people don’t.The operative mortality, or the number of people who don’t survive an isolated mitral valve repair procedure, is less than 1 in 1,000 at experienced centers.If your provider recommends mitral valve repair, they believe the benefits of the surgery outweigh the risks. It’s important to talk with your provider about your specific risks for having surgery and your chances of survival. Also, ask your provider what you may expect if you don’t have the surgery.When to Call the DoctorWhen should I see my healthcare provider?Your provider will let you know how often you need to return for follow-ups. Be sure to keep all your follow-up appointments and tell your provider how you’re feeling.As you recover, pay attention to how you feel. Everyone has some discomfort, and your provider will prescribe pain medication. But call your provider if you have signs of complications. These include:Chest pain.Chills or fever.Coughing up blood.Coughing up mucus that looks yellow or green.Dizziness or fainting.Fever.Headache that’s very severe.Irregular pulse (too slow or too fast).Nausea and vomiting.Pain, redness or swelling in your lower leg.Pain in the area of your incision that won’t go away.Shortness of breath.Signs of infection around your incision, like oozing or redness.Slurred speech or other signs of a stroke.Your provider will tell you if there are other signs you should look out for. For instance, if you’re taking blood thinners, you should call your provider if you:Fall.Have excessive bleeding in any area of your body (including your nose or gums).Have many bruises on your skin.It may be hard to know when a symptom is a normal part of recovery, or when it’s a sign of a complication. When in doubt, pick up the phone and call your care team. It’s better to get checked out and learn nothing’s wrong than to ignore a problem that needs medical care.A note from Cleveland ClinicMitral valve repair surgery can give you back the energy and strength you’ve been missing. Like all heart surgeries, it can come with risks. But advances in technology make mitral valve repair safer and more durable with each passing year. Back in the 1920s, surgeons pioneered mitral valve repair. Their technique? Using the surgeon’s finger to open up a narrowed valve! From the surgeon’s finger to advanced surgical methods, we’ve come a long way.Mitral valve surgery is complex. Don’t be afraid to ask your provider many questions so you understand exactly what’ll happen. Also, ask what lifestyle changes you can make after your surgery to support your heart health for years to come.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/25/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicMitral & Tricuspid Valve CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"