"Mitrofanoff Procedure: Purpose, Process & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Mitrofanoff ProcedureAdvertisementAdvertisementAdvertisementMitrofanoff ProcedureA Mitrofanoff procedure lets people with certain bladder conditions drain urine from their bladder through an opening (stoma) in their belly without a urostomy pouch. Surgeons use your appendix to make a passage between the stoma and your bladder. You insert a catheter (tube) to empty your bladder. Even children can safely perform this self-catheterization.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is a Mitrofanoff procedure?A Mitrofanoff procedure, (pronounced “me-TROF-an-off”), or a Mitrofanoff, helps people with certain conditions drain urine from their bladder through a surgically created opening in their belly.In this procedure, surgeons use your appendix to create a channel that connects your bladder to an opening (stoma) in your abdominal wall. To urinate, you insert a catheter (flexible tube) through the stoma and into your bladder.Professor Paul Mitrofanoff developed the procedure in 1976. Other terms for Mitrofanoff include appendicovesicostomy and continent urinary diversion.What is the bladder?Your bladder is part of your urinary system, which helps filter toxins and waste from your body through urine. These steps typically take place when you pee (urinate):Your kidneys filter impurities from your blood and make urine.Urine travels through ureters (small tubes) into your bladder.Your bladder, a muscular balloon-shaped organ, holds the urine until you get the urge to pee.Urine leaves your bladder through a tube called the urethra.What is the appendix?Your appendix is part of your digestive system. This small tube in your lower-right abdomen attaches to the top part of your large intestine (colon).Medical experts are still trying to determine exactly what the appendix does. Some research suggests that the appendix makes mucus that protects healthful bacteria. These healthy gut bacteria aid digestion and help you recover from digestive problems like diarrhea.With a Mitrofanoff, healthcare providers repurpose your appendix to channel urine out of your body. This is possible because, while your appendix may be useful, you can lead a long, healthy life without one. Many people who develop appendicitis (inflamed, infected appendix) have surgery to remove it (an appendectomy).If you need a Mitrofanoff and don’t have an appendix, your surgeon uses part of your small intestine. They can use your intestine to create the tunnel between your bladder and abdominal wall. Healthcare providers call this tunnel a Monti or Monti-Yang, named after the surgeons who first described it.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat does a Mitrofanoff do?A Mitrofanoff enables you to perform self-catheterization (intermittent catheterization) through a self-sealing opening in your abdomen.At regular intervals throughout the day, you:Insert a flexible tube called a catheter through the stoma and the Mitrofanoff tunnel to reach your bladder.Drain the urine through the catheter into a toilet or urine collection container.Remove the catheter after your bladder empties. The stoma closes on its own.Why would a child have a Mitrofanoff?Certain birth defects can affect a child’s nervous system, leading to a condition called neurogenic bladder. These conditions affect a child’s ability to control their bladder muscle.Some children have congenital (present at birth) urinary changes (anomalies). Examples include bladder exstrophy or cloacal exstrophy. In these conditions, their abdominal wall doesn’t form correctly, allowing their bladder to push through an opening between their pubic bones. This causes their bladder to develop inside out and exposed to the outside (exstrophy).Other conditions that may lead to a need for a Mitrofanoff include:Cerebral palsy.Sacral agenesis (part of the lower spine is missing).Spina bifida.Spinal cord injury.AdvertisementWhy would an adult have a Mitrofanoff?Adults may need a Mitrofanoff if they have:Bladder cancer, prostate cancer or colorectal (colon) cancer.Bladder control issues like severe urinary incontinence.Bladder inflammation (cystitis).Neurological disorders like multiple sclerosis or Parkinson’s disease that cause neurogenic bladders.Spinal cord injuries, paralysis or spine tumors.Stroke.Procedure DetailsWho performs a Mitrofanoff?A urologist performs bladder surgery. This medical doctor specializes in conditions that affect the urinary tract.AdvertisementWhat happens before a Mitrofanoff?Your intestines should be as empty as possible before the procedure to lower the risk of infection. You should follow your healthcare provider’s instructions, which may include:Fasting (consuming only clear liquids).Completing a bowel cleanse.What happens during a Mitrofanoff?A Mitrofanoff takes place under general anesthesia, which means you’re asleep for the procedure.During the procedure, your healthcare provider:Makes an incision into your abdomen.Removes your appendix from your large intestine.Connects one end of your appendix to a small incision in your bladder and the other end to a smaller abdominal incision (the stoma).Creates a valve where your appendix connects to your bladder. This valve squeezes shut when your bladder fills with urine, helping to prevent leakage.Makes a small incision below the stoma to insert the first catheter (called a suprapubic tube) directly into your bladder. This temporary catheter lets urine drain into a collection bag outside of your body, to allow your bladder to heal.May place small tubes called ureteral stents into the ureters so urine can flow freely from your kidneys into your bladder. (Not everyone needs ureteral stents.)Closes the main surgical incision site with stitches that dissolve as your bladder heals.What happens after the procedure?You may spend up to a week recovering in the hospital. After surgery, you may:Receive intravenous (IV) fluids for a couple of days (and no solid foods) to allow your intestines time to heal.Lie flat in bed for a day or two. You can roll from side to side and move your legs, but you shouldn’t sit up.Have a catheter in the Mitrofanoff tunnel to keep it from closing. This catheter stays in place for up to four weeks after the surgery. You go home with it and the suprapubic tube.Get another procedure in six to eight weeks to remove the ureteral stents (if necessary).Have your healthcare provider remove the suprapubic tube and the Mitrofanoff catheter when self-catheterization starts. Your provider removes it in their office. You won’t need another surgery to take it out.Care at Cleveland ClinicUrology CareMake an AppointmentRisks / BenefitsWhat are the benefits of a Mitrofanoff?A Mitrofanoff can reduce the risk of urinary leakage or incontinence. Many people find it’s easier and more comfortable to insert a catheter into an opening in their abdomen instead of their urethra. Even young children can perform the self-catheterization on their own.What are the risks?Approximately 2 out of 10 people who get a Mitrofanoff need a revision surgery years later to address problems like narrowing (stenosis) or deterioration of the Mitrofanoff tunnel. In some instances, the stoma stops sealing after catheterizations. In that case, urine could leak through the stoma and a revision could fix the problem.Because your appendix continues to make mucus despite its new function, you need to clean out (irrigate) the tunnel regularly. Your provider will show you how to do this. Irrigation can affect electrolyte levels in your blood. These minerals help your body maintain fluid levels. Regular blood tests can detect an electrolyte imbalance.Other risks of bladder surgery include:Bladder stones (calculi) and bladder cancer.Bleeding.Infections, including chronic urinary tract infections (UTIs).Large bowel (intestinal) obstruction.Recovery and OutlookWhat is recovery like after a Mitrofanoff?For a few weeks after the procedure, you may experience:Blood in your urine (hematuria).Painful muscle spasms (bladder spasms).You may take pain relievers and medications to relax your bladder muscle and ease the spasms.In approximately six weeks, you’ll return to your healthcare provider’s office to learn how to do self-catheterization.What is the outlook for someone with a Mitrofanoff?Most people who get a Mitrofanoff enjoy long, healthy lives. You can be physically active and even swim (although you may need to avoid certain contact sports). With the right medical care, women and people assigned female at birth with a Mitrofanoff can have healthy pregnancies.Your provider will keep an eye on your urinary system function after the procedure. You’ll get annual exams, such as:Blood tests to check electrolytes, kidney function and liver function.Cystoscopy to view the inside of your bladder.Kidney ultrasound and pelvic ultrasound.X-rays of your kidneys, bladder and ureters.When to Call the DoctorWhen should I call the doctor?You should call your healthcare provider if you experience:Being unable to empty your bladder.Excessive bleeding, swelling or bruising.Nausea and vomiting.Severe pain.Signs of infection, like foul-smelling discharge or fever.Additional Common QuestionsWhat is the difference between a Mitrofanoff and a urostomy?Both a Mitrofanoff and urostomy let urine (pee) drain through an opening in your belly. A urostomy creates an opening to drain urine directly from your kidneys, bypassing your bladder, or from a reservoir (conduit) made of bowel. Depending on the type of urostomy, you may need to wear a urine collection bag at all times, meaning you can’t control the urine flow. Some people find a urostomy more convenient than a Mitrofanoff, as you don’t need to use a catheter. Some people have a surgically created pouch that holds their urine until they insert a catheter to empty it.Is a Mitrofanoff permanent?It’s possible to remove the Mitrofanoff tunnel. Because you don’t need your appendix, your provider will remove it instead of reattaching it. After surgery to remove a Mitrofanoff, you may empty your bladder by:Peeing through your urethra (the way most people urinate) or leaking (and wearing diapers or pads).Inserting a catheter through your urethra into your bladder.Getting a urostomy.Can you still pee with a Mitrofanoff?Urine can still come out of the urethra after a Mitrofanoff. However, one of the goals of a Mitrofanoff is to prevent urinary leakage. If you empty your bladder regularly, you shouldn’t experience leakage. You shouldn’t try to urinate through the urethra. Most people need to empty the bladder via the Mitrofanoff every three to four hours and at least once per night.A note from Cleveland ClinicChildren and adults with certain conditions that affect their bladder may benefit from a Mitrofanoff procedure. A surgeon uses your appendix — an organ you can live well without — to make a channel for urine (pee) to drain through an opening in your belly (stoma). A Mitrofanoff makes it easier and more comfortable to empty your bladder through self-catheterization so you can live a full, active life.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/18/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicUrology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"