"Mitral Valve Disease: Percutaneous Interventions800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Mitral Valve Disease: Percutaneous InterventionsAdvertisementAdvertisementAdvertisementMitral Valve Disease: Percutaneous InterventionsContentsArrow DownOverviewProcedure DetailsResourcesContentsArrow DownOverviewProcedure DetailsResourcesOverviewAmar Krishnaswamy MD, Section Head, Interventional CardiologyCleveland Clinic cardiologists and surgeons work together to offer high-risk patients a variety of treatment options for mitral valve repair and replacement.What is mitral valve disease?There are two types of mitral valve disease — mitral regurgitation (MR) and mitral stenosis (MS). Mitral regurgitation means the mitral valve leaflets do not come together to create a seal to stop blood from going back from the heart toward the lungs. Mitral stenosis means the mitral valve leaflets are scarred and do not open very well, causing blood to back up into the lungs. Both MR and MS can cause you to be short of breath, have fatigue that gets worse and have swelling in your abdomen, legs and feet. Many times, surgery is needed to correct the problem, but less invasive, percutaneous/catheter-based treatment options are available for some patients.Can I have a percutaneous procedure instead of surgery to repair or replace my mitral valve?The type of treatment that is best for you depends on many factors. You will need an exam and testing, including an echocardiogram and CT scan, to help your doctor determine your best treatment options. Your Cleveland Clinic doctor may want you to have repeats of tests you have already had. This is because some treatments require certain anatomy that can only be seen with specialized imaging. But, it is always important to make sure you and your Cleveland Clinic doctor have access to your previous test results and images to avoid repeat tests, if possible.The process for Percutaneous Mitral evaluation includes 3 steps:Sending in records for review by the Structural Heart Team.If you are a possible candidate for a percutaneous/catheter-based treatment, you will have a series of tests and appointments with a surgeon and cardiologist at Cleveland Clinic. Even though these procedures are less invasive than traditional surgery, it is important to understand that they are still a major heart procedure. We will talk to you about your individual relative risks and benefits of the procedure.The last step in your evaluation is a final review of your medical records, test results and other information about your health by the Structural Heart Team. They will determine if a catheter based procedure is the best treatment option for you.The Structural Heart team will contact you to talk about next steps for your treatment. .Why choose Cleveland Clinic for your care?Cleveland Clinic is a world leader in the use of catheter based treatments for valve disease, carefully evaluating patients with a team approach to make sure patients get the best treatment for their mitral valve disease.Our outcomes speak for themselves. Please review our facts and figures, and if you have any questions, don't hesitate to ask.Procedure DetailsMitral RegurgitationMitral regurgitation can be degenerative (DMR) or functional (FMR). If you have MR, you will have an echocardiogram and other tests to find out which type it is. Your doctor will consider the type of MR you have, along with other factors, to help you choose the best treatment option(s) for you.Treatment options for patients with degenerative mitral regurgitation (DMR)If you have DMR and do not have a high risk of problems with heart surgery, this will likely be the best option for you. If you are high-risk because of your age, health problems or other reasons, your best treatment option may be a catheter-based procedure. These include the FDA-approved MitraClip and transcatheter mitral valve replacement (TMVR), which is a clinical trial-based treatment option.Treatment options for patients with functional mitral regurgitation (FMR)Many patients with FMR have an enlarged and/or weak heart and other health problems. These can increase your risk of problems with cardiac surgery. It is also possible that surgery may not be a long-lasting solution, as it is for patients with DMR. It is possible that a catheter-based treatment may be a better treatment option for you. Depending on your anatomy, a MitraClip may be a good option. If not, your doctor may talk to you about taking part in a clinical trial of other catheter-based mitral valve repair devices or TMVR.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyMitraClip for patients with mitral regurgitationWho can have a MitraClip for mitral regurgitation?The MitraClip is FDA-approved for patients with DMR or FMR who have a high risk of complications with open heart surgery.How is the MitraClip put in place?You will get general anesthesia and be \"asleep\" during the procedure. Because of this, you will have a breathing tube that will probably be taken out before you leave the operating room.The MitraClip is put in place with a long, thin tube called a catheter.The catheter is inserted into a vein though an incision at the top of your thigh. Your doctor uses X-rays and echocardiography to guide the device to your mitral valve. TheMitraClip is placed at the edges of the valve so they can come together and keep blood from flowing backward. You may need more than one MitraClip to get the best results.How long will I need to stay in the hospital?After the procedure, you will stay the night in the hospital and likely go home the next day.Other percutaneous repair devices for patients with mitral regurgitationCleveland Clinic is often able to offer treatment with devices that are only available to patients enrolled in clinical trials.These percutaneous annuloplasty devices are not yet approved by the FDA, but your doctor may discuss them with you if they are better suited for you, based on your valve anatomy or other factors.How are percutaneous annuloplasty devices put in place?You will get general anesthesia and be \"asleep\" during the procedure. Because of this, you will have a breathing tube that will probably be taken out before you leave the operating room.The device is put in place with a catheter. The catheter is inserted into a vein though an incision at the top of your thigh or in your neck.They device reduces the size of your heart where the mitral valve is attached. This brings the valve leaflets closer together and helps prevent blood from flowing backward.How long will I need to stay in the hospital?After the procedure, you will stay the night in the hospital and likely go home the next day.Transcatheter mitral valve replacement for patients with mitral regurgitationCleveland Clinic is using several types of Transcatheter Mitral Valve Replacement (TMVR) devices in carefully selected patients as part of clinical studies. TMVR may be an option for patients who cannot have a MitraClip procedure because of their valve anatomy and are considered too high risk for conventional valve surgery. Learn more about the Expanded Clinical Study of the Tendyne Mitral Valve System.Who can have TMVR for mitral regurgitation?Your doctor may talk to you about TMVR if you have MR and other treatment options are not well-suited for you.How are TMVR devices put in place?If you choose to have one of these devices, you will get general anesthesia and be \"asleep\" during the procedure. Because of this, you will have a breathing tube that may be taken out before you leave the operating room.Some of the devices are put in place through a vein via an incision at the top of your thigh. Others are placed directly into your heart through an incision in your chest.How long will I need to stay in the hospital?The amount of time you spend in the hospital depends on the type of procedure you have.Mitral StenosisMany people who have mitral stenosis had rheumatic fever as a child. Others develop it because of a combination of age and illnesses that cause calcium and scar tissue to form on the mitral valve and the area around it.Cardiac surgery is often the best treatment for mitral stenosis, but a percutaneous treatment is sometimes possible.Percutaneous mitral balloon valvuloplasty for patients with mitral stenosisPercutaneous mitral balloon valvuloplasty (PMBV) uses a tiny balloon on the end of a catheter to open the mitral valve.Who can have PMBV for mitral stenosis?The procedure is used most often in patients whose stenosis was caused by rheumatic fever. Your doctor will use an echocardiogram to determine if this is a good treatment option for you.How is percutaneous mitral balloon valvuloplasty done?The procedure is done using local anesthetic and conscious sedation with IV sedatives and pain medication.The balloon-catheter is is inserted into a vein though an incision at the top of your thigh. Your doctor uses X-rays and echocardiography to guide the catheter to your mitral valve.How long will I need to stay in the hospital?After the procedure, you will likely spend one night in the hospital.AdvertisementTranscatheter mitral valve repair for patients with mitral stenosisWho can have TMVR for mitral stenosis?If you have a high risk of problems with heart surgery and cannot have PMBV, your doctor may talk to you about TMVR. This procedure is being done for patients with mitral stenosis as part of a clinical trial. There are no FDA-approved devices for this type of treatment.How are TMVR devices put in place?If you choose to have one of these devices, you will get general anesthesia and be \"asleep\" during the procedure. Because of this, you will have a breathing tube that may be taken out before you leave the operating room.How long will I need to stay in the hospital?You will spend a few nights in the hospital after the procedure.Prior mitral valve surgeryPercutaneous treatment options for patients with a degenerated repaired or replaced mitral valvePatients who have had a mitral valve repair with a ring or band or have had surgery to replace the valve with a bioprosthetic mitral valve may experience degeneration over time. This can cause mitral regurgitation or stenosis. Both problems may be able to be corrected using a catheter-based procedure — either a MitraClip or TMVR.AdvertisementMitraClip for patients with a degenerated mitral valveWho can have a MitraClip after mitral valve degeneration?Some patients with a failing surgical mitral valve ring or band repair may be able to have a MitraClip. Your doctor will talk to you about this procedure if it is a good treatment option for you. Please see the MitraClip information in the mitral regurgitation section of this handout for procedure details.Mitral valve-in-valve or valve-in-ring replacementWho can have mitral valve-in-valve/valve-in-ring replacement?If you have a degenerated bioprosthetic mitral valve that was put in place during surgery, you may be able to have a catheter-based valve-in-valve/valve-in-ring procedure. This is an FDA-approved treatment that involves putting an aortic valve inside the mitral valve. Your doctor will need to check your valve anatomy to see if this is a good treatment option for you.How is the valve put in place?The procedure is done using local anesthetic and conscious sedation with IV sedatives and pain medication.The catheter is inserted into a vein through an incision at the top of your thigh. Your doctor uses X-rays to guide the catheter to your mitral valve. Then, the new valve is placed inside your mitral valve.How long will I need to stay in the hospital?You will be able to go home the evening on the day of the procedure or the next day.Care at Cleveland ClinicMitral & Tricuspid Valve CareFind a Doctor and SpecialistsMake an AppointmentResourcesDoctors who treatCleveland Clinic has the nation's largest valve treatment program.Doctors vary in quality due to differences in training and experience; hospitals differ in the number of services available. The more complex your medical problem, the greater these differences in quality become and the more they matter.The doctor and hospital that you choose for complex, specialized medical care will have a direct impact on how well you do. To help you make this choice, please review our Miller Family Heart, Vascular & Thoracic Institute Outcomes.Cleveland Clinic Heart, Vascular & Thoracic Institute Cardiologists and SurgeonsPatients are evaluated for Percutaneous Mitral Valve Treatments by our Interventional Mitral Valve Physician Team. This multidisciplinary team includes surgeons, cardiologists and nurses.Cleveland Clinic Interventional Mitral Valve physician teamHeart Failure (Drs. Jacob, Taylor, Starling)Interventional Cardiology (Drs. Kapadia, Krishnaswamy)Cardiac Surgery (Drs. Gillinov, Navia, McCurry, Smedira)A full evaluation is required to determine if you are a candidate for a percutaneous procedure. For more information on how to be evaluated, please contact our Heart, Vascular & Thoracic Institute resource nurses.See About Us to learn more about the Sydell and Arnold Miller Family Heart, Vascular & Thoracic Institute.ContactTo arrange a consultation, or if you have additional questions or need more information, click here to contact us, chat online with a nurse or call the Miller Family Heart, Vascular & Thoracic Institute Resource Information Nurse at 216.445.9288 or toll-free at 866.289.6911. We would be happy to help you.Becoming a PatientMake an appointmentPlan your visitBilling & insuranceVisitor amenitiesOutcomesWhy choose Cleveland Clinic for your care?Our outcomes speak for themselves. Please review our facts and figures, and if you have any questions don't hesitate to ask.ConditionsValve diseaseTreatment GuidesValve disease and treatment optionsHeart valve surgeryAll Miller Family Heart, Vascular & Thoracic Institute treatment guidesDiagnostic TestsDiagnostic tests are used to diagnose your valve disease and the best treatment for you.Diagnostic testingAnatomyYour heart valvesYour heart and blood vesselsLove Your Heart PodcastOur Love Your Heart podcast is designed to help you learn more about heart and vascular disease.VideosVascular Disease and Treatment videosAll MIller Family Heart, Vascular & Thoracic Institute videosInteractive ToolsMiller Family Heart, Vascular & Thoracic Institute interactive toolsResource LinksRecovery at homeSupport groups and informationVisit Health Essentials - Read articles on valve disorders and healthy living on the Health Essentials blogFollow Heart, Vascular & Thoracic Institute webchats and news stories on Twitter*Subscribe to Heart, Vascular & Thoracic Institute eNews*A new browser window will open with this link.The inclusion of links to other websites does not imply any endorsement of the material on those websites nor any association with their operators.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/03/2019.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicMitral & Tricuspid Valve CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"