"MonaLisa Touch: Purpose, Procedure, Risks & Results800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/MonaLisa TouchAdvertisementAdvertisementAdvertisementMonaLisa TouchMonaLisa Touch is a type of laser therapy to treat symptoms of vaginal atrophy like vaginal dryness and painful sex. It works by repairing your vaginal tissue. A healthcare provider performs MonaLisa Touch in their office. It’s noninvasive and doesn’t require anesthesia.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is the MonaLisa Touch?MonaLisa Touch® is a type of noninvasive laser therapy to treat vaginal atrophy (also called GSM or genitourinary syndrome of menopause). GSM is a condition that causes symptoms like vaginal dryness and pain during sex. The MonaLisa Touch can help make sexual intimacy more comfortable. It works by healing the tissue lining of your vagina, restoring its moisture.MonaLisa Touch is an alternative to estrogen-based therapies like creams, lubricants or medication. It’s ideal for people who either can’t or prefer not to use estrogen therapy as treatment for GSM.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat does MonaLisa Touch treat?The MonaLisa Touch treats symptoms of GSM that most commonly occur in menopause. Menopause is when a person assigned female at birth (AFAB) stops getting their period and loses the ability to get pregnant. During menopause, your estrogen levels decrease. These hormonal changes cause your vaginal tissue to become dry and thin. This can lead to several symptoms such as:Painful sexual intercourse.Vaginal discomfort and bleeding.Frequent urinary tract infections (UTIs).Urinary incontinence (leaking pee when you sneeze, laugh or cough).Vaginal irritation, itchiness or burning.The MonaLisa Touch helps the tissues in your vagina regenerate, helping it to become moist again.It’s important to note that the MonaLisa Touch doesn’t tighten your vagina. There are other methods your provider may suggest if your goal is to fix looseness or sagging. The MonaLisa Touch helps restore your vagina’s lubrication, not necessarily its appearance.Who can have MonaLisa Touch treatment?The ideal candidates for MonaLisa Touch treatment are people who:Are experiencing symptoms of low estrogen during the transition to menopause or after menopause.Tried other methods (such as estrogen therapy) and were unsuccessful.Have symptoms as a result of chemotherapy, breast cancer or hysterectomy.Can’t take estrogen due to other health conditions or treatments.Have been diagnosed with vulvar disorders like lichen sclerosus.If you have any of the following health conditions, MonaLisa treatment may not be right for you:You’re pregnant or gave birth within the last three months.You have bladder prolapse.You have a sexually transmitted infection (STI) or other vaginal infection.You’re receiving anticoagulants or have immune thrombocytopenia.Talk to your healthcare provider about your symptoms and health history. They can tell you if you’d benefit from MonaLisa Touch laser therapy.How does MonaLisa Touch treatment work?The MonaLisa Touch is a CO2 (carbon dioxide) fractional laser. A fractional laser delivers thousands of tiny beams of light into a specific area. The laser beams destroy vaginal tissue and stimulate your vaginal tissue to generate new blood vessels and produce more collagen and elastin. This essentially causes the tissue lining to regenerate and repair itself.AdvertisementProcedure DetailsDo I need to prepare for MonaLisa Touch treatment?No. There’s nothing you need to do to prepare for treatment. It’s a relatively quick and painless procedure. It doesn’t involve surgery or anesthesia. Your provider will discuss any preparations with you before treatment.What happens during MonaLisa Touch procedure?Treatment with the MonaLisa Touch happens in your healthcare provider’s office.It’s similar to what happens during a Pap smear:You’ll take your pants and underwear off and recline on an exam table.You’ll put a sheet or drape over your legs. Your feet will go in stirrups.Your provider may numb your vaginal opening with a cream.Your provider will insert a wand-like device into your vagina to begin treatment.The device delivers tiny energy pulses into your vagina. It may feel like a vibration or a tiny prick — like the poke of a needle. Your provider will treat both the internal vaginal skin (where a tampon goes) and the skin at the opening of your vagina.You need three treatments spaced about six weeks apart. Your provider may recommend annual treatments to maintain relief of your symptoms.AdvertisementDoes MonaLisa treatment hurt?No, it shouldn’t hurt. Your provider puts numbing gel around your vaginal opening before they insert the laser. Some people say they can feel a vibration.How long does MonaLisa treatment take?Treatment with the MonaLisa takes about five minutes.What happens after MonaLisa Touch treatment?Recovery from MonaLisa laser therapy is quick. You can continue on with your day as normal. Your vagina may feel a little irritated or uncomfortable. If you feel discomfort, applying ice packs or using a lubricant may help. Avoid doing activities that cause you pain.Care at Cleveland ClinicFind Your Ob/GynMake an AppointmentRisks / BenefitsWhat are the benefits of MonaLisa Touch?Treatment with MonaLisa Touch has been shown to cause significant improvements in vaginal moisture. It can restore a person’s sexual intimacy and give them confidence again.MonaLisa Touch treatment is also beneficial for people who can’t take estrogen. Treatment for vaginal dryness traditionally involved estrogen medications. This means people who can’t take estrogen were left without an option for relief prior to MonaLisa Touch laser treatment.Is MonaLisa Touch effective?Yes, studies show that over 80% of people are satisfied or very satisfied with the results of treatment. About 90% of people rate their improvement as better or much better.Many people say they notice relief from vaginal dryness after just one treatment.What are the side effects of MonaLisa Touch?Side effects are mild and don’t last longer than 36 hours. The most common side effects are:Irritation at your vaginal opening.Light bleeding.Pink or brown vaginal discharge.Itching or burning sensation when you pee.Swelling or redness at your vaginal opening.Recovery and OutlookWhat is the recovery time after MonaLisa Touch treatment?Most people return to their normal activities the same day. You should refrain from intercourse for three days. You can expect to have mild irritation or discomfort for 24 to 36 hours.Discuss specific recovery instructions with your provider so you know what to expect.When to Call the DoctorWhen should I call my healthcare provider?Contact your healthcare provider if you have uncomfortable symptoms due to vaginal dryness. They can talk to you about possible treatment options, including treatment with MonaLisa Touch.Additional DetailsHow much does MonaLisa Touch treatment cost?Your insurance doesn’t cover MonaLisa Touch treatment. The exact cost of treatment depends on your location and provider, but you can expect to pay anywhere from $500 to $1,000 per session. Some people may need up to five sessions initially. Most people need to return every 12 to 18 months for touch-ups. Be sure to talk to your provider about what you can expect to pay for treatment.A note from Cleveland ClinicThe MonaLisa Touch® is a type of laser treatment for people with vaginal dryness, pain during sex and other uncomfortable symptoms associated with low estrogen. It delivers tiny pulses of light to your vaginal tissue, which causes it to repair itself. Talk to your healthcare provider if you’re interested in MonaLisa Touch treatment — they can tell you if it’s right for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/02/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind Your Ob/GynMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"