"Monoclonal Antibody Therapy For Cancer: What It Is, Uses & Treatment800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Monoclonal Antibody Therapy for CancerAdvertisementAdvertisementAdvertisementMonoclonal Antibody Therapy for CancerMonoclonal antibody therapy is a form of targeted treatment that uses lab-created antibodies that find and kill specific cancer cells. Physicians who treat cancer (oncologists) also use monoclonal antibody therapy to boost the immune system’s ability to defend against cancer. Providers can use this treatment on its own or with other treatments.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewWhat is monoclonal antibody therapy for cancer?In monoclonal antibody therapy, healthcare providers use lab-created antibodies to treat many kinds of cancer. When providers treat cancer with monoclonal antibodies, they’re using lab-made antibodies that are clones or exact copies of a specific antibody. These antibodies find and kill specific cancer cells. This treatment also helps immune systems defend against cancer. Providers use this therapy on its own or with other cancer treatments.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are monoclonal antibodies?Your antibodies are part of your immune system. Antibodies are proteins that scour your body for signs of intruders (antigens) like infections or cancer cells. Antibodies attach to (bind to) antigens. Then your immune system develops ways to protect your body from similar intruders. Monoclonal antibodies are designed to act like your antibodies.How does monoclonal antibody therapy work?Monoclonal antibody therapy for cancer mirrors your antibodies. Antibodies are proteins that constantly look for specific antigens. Antibodies work like this:Antibodies are shaped like upside-down letter Y.Each leg of the Y ends in a section called an antigen-binding fragment (Fab). This fragment is like a puzzle piece that only fits in a spot on specific antigen.Your antibodies scan your immune system for antigens. Once your antibodies connect with their target antigen, your antibodies attract other parts of your immune system to help to kill the cancer cell.AdvertisementHow do monoclonal antibodies affect cancer cells?Monoclonal antibodies are multi-taskers with several strategies for disrupting cancer cells. Here are some ways that monoclonal antibodies can work:They make immune system targets. Some monoclonal antibodies find and attach to cancer cells. This makes it easier for the immune system to target and destroy the cancer cells.They carry targeted treatments. Some monoclonal antibodies transport treatments like chemotherapy and radioactive substances to cancer cells. These are antibody-drug conjugates.They block cancer cell signals. Certain cancer cells have receptors that signal cancer cells to divide. Monoclonal antibodies block those signals so cancer cells can’t multiply.For example, some monoclonal antibodies work by disrupting signals from the cancer cell called the checkpoint system. Your immune checkpoints keep your immune system from overreacting to intruders and destroying healthy tissue by accident. Cancer cells can turn off the system by placing checkpoint proteins on their surface to protect them from immune system assault. Some monoclonal antibodies inhibit these checkpoints, allowing your immune system cells (like T-cells) to eliminate target cancer cells.Is monoclonal antibody therapy a kind of cell therapy?Cell therapy treats cancer by introducing new healthy cells into your body. CAR-T cell therapy and bone marrow transplants are examples of cell therapy. Monoclonal antibody therapy, in contrast, introduces lab-made antibodies into your body that work with the cells already in your immune system.AdvertisementDoes monoclonal antibody therapy cure cancer?Monoclonal antibody therapy is an effective cancer treatment alone or in combination with other treatments. In most cases, monoclonal antibody treatment doesn't cure cancer. Many times cancer comes back after treatment. Monoclonal antibody therapy delays cancer’s return.Procedure DetailsWhat happens before this treatment?Your healthcare provider may do tests on your blood or cancer cells, including tests to see if certain genes or proteins have changed. Changes in your genes or proteins may affect your treatment.How do healthcare providers administer monoclonal therapy?You can receive monoclonal antibody therapy as an infusion, meaning treatment given in an intravenous (IV) solution injected into your vein.Care at Cleveland ClinicGet Cancer CareMake an AppointmentRisks / BenefitsWhat are the advantages of monoclonal antibody therapy?This treatment lets healthcare providers target cancer without damaging healthy cells. It typically causes fewer side effects than some other cancer treatments. It also helps your immune system to fight cancer.What are monoclonal antibody therapy side effects?Like all cancer treatments, monoclonal therapy has side effects:An itchy rash.Diarrhea.Feeling very tired.Having chills, fever or feeling dizzy.Feeling generally unwell.Headache.Nausea and vomiting.Low blood pressure.Some people have sensitivity reactions during their first treatment:Feeling breathless, as if you can’t quite catch your breath.Feeling faint or weak.Flushing.When to Call the DoctorIf I have reactions to therapy, when should I call my healthcare provider?You should call your provider if your treatment side effects are stronger than you anticipated or last longer than you expected.A note from Cleveland ClinicHealthcare providers are just beginning to understand all the ways that monoclonal antibody therapy may combat cancer. That’s exciting news for people coping with cancer and looking for safe, effective treatment. Monoclonal antibody therapy treats many types of cancer. If you have cancer, ask your provider if this treatment may be right for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/18/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Cancer CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"