"Morning-After Pill: Emergency Contraception & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Morning-After PillAdvertisementAdvertisementAdvertisementMorning-After PillThe morning-after pill is a type of birth control that can be used in emergency situations when typical birth control wasn’t used, failed, or in cases of non-consensual sexual intercourse (rape). This pill is most effective at preventing pregnancy when it’s taken as quickly after unprotected sex as possible. Brand names include Plan B One-Step® and ella®.ContentsArrow DownOverviewProcedure DetailsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is the morning-after pill?The morning-after pill is a medication that can be used as emergency contraception (birth control). Emergency contraception isn't the same as typical birth control pills that you might use daily or other forms of routine birth control. It's used in situations where your birth control has either failed or you were unable to use protection. Some situations where emergency contraception might be used can include:Having sexual intercourse without any form of birth control.Experiencing birth control failure (a broken condom, forgotten birth control pill or missed dose of the birth control shot).Experiencing non-consensual sexual intercourse (rape).There are many different brand names for the morning-after pill. The progestin-only morning-after pill is levonorgestrel (Plan B One-Step®). This medication is available over the counter. Another type of morning-after pill called ulipristal (ella®) is only available by prescription.Other options for emergency contraception aside from the pill include the intrauterine device (IUD). There are two types of IUDs available: the Copper IUD and the Levonorgestrel IUD. These devices are placed into your uterus by a healthcare provider. IUDs can also be used for emergency contraception if inserted up to five days after unprotected sex.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAre there different types of morning-after pill?There are three main types of morning-after pill — each with popular brand names you might have heard of.Progestin-only pill (Plan B One-Step®)Plan B is a type of emergency contraception that's taken as one pill. For the best results, you should take Plan B as soon as possible — typically within the first three days after unprotected sex. You can take it up to five days after unprotected sex, but the effectiveness of the medication drops.Ulipristal (ella®)This type of morning-after pill also works by preventing ovulation. Ulipristal can be more effective than other morning-after pill options when it’s taken correctly (within the window of time when it’s most effective). People can take ulipristal up to five days after unprotected sex. The most common brand name for this medication is ella®. Your healthcare provider needs to prescribe ulipristal.Combined birth controlThis type of emergency contraception involves taking birth control pills that contain both progestin and estrogen. Unlike a progestin-only medication like Plan B, this option is typically taken in two doses. It’s important to talk to your healthcare provider or pharmacist about the exact dosage (amount of the medication) you'll need and how far apart you should take the two medications. When you use combination birth control as an emergency contraception option, you’re taking a typical birth control pill at a higher dose. This isn’t something you should do without talking to your provider because different brands of birth control can change the amount you need to take.Combined birth control (Yuzpe regimen)This type of emergency contraception involves taking extra pills from a regular birth control pack. It's referred to as the Yuzpe regimen. This method involves combining pills from an available birth control pack to total 100mcg of ethinyl estradiol and 0.5mg levonorgestrel. A second dose is then repeated in 12 hours. It’s important to know that this regimen is less effective and less well-tolerated than other forms of emergency contraception. While the most common side effects include nausea and vomiting, taking extra birth control pills can cause more serious side effects in some people. It increases your risk of blood clots. It should only be considered in cases where other forms of emergency contraception aren't readily available.How does the morning-after pill work?The morning-after pill doesn’t reverse pregnancy. Instead, it's a type of emergency birth control that prevents pregnancy. The main way the morning-after pill works is by preventing ovulation. Ovulation is a part of your normal reproductive cycle. This is the phase when your ovaries release an egg that can then be fertilized by sperm and begin the fetal development process. If you don’t ovulate, you can't get pregnant.AdvertisementHow effective is the morning-after pill?When you’re thinking about how effective the morning-after pill is at preventing pregnancy, it’s important to factor in time. This is key to the medication’s effectiveness. All forms of the emergency contraception pill are more effective the sooner you take it. You don't need to wait to take these medications until the next day — despite the name “morning-after pill.”There are certain time frames for each type of morning-after pill. The progestin-only option should be taken within the first 72 hours (three days) after unprotected sexual intercourse. The ulipristal and combined options can be taken up to 120 hours (five days) after sex.Each day you wait outside of these recommended windows of time makes the medication less effective.Procedure DetailsHow long after unprotected sex should I wait before taking the morning-after pill?You don't need to wait until the next morning to take the morning-after pill. Emergency contraception pills are most effective at preventing pregnancy when they’re taken as quickly as possible after unprotected sexual intercourse. The amount of time you have can vary between different medications.Progestin-only pills (Plan B One-Step®): For these medications, you typically have about a three-day window of time when Plan B will still be effective. It becomes less effective at preventing pregnancy the longer you wait. If you take a progestin-only medication within five days of unprotected sex, it can be moderately effective.Ulipristal (Ella®): This type of emergency contraception pill is more effective for a longer period of time. With this medication, you have up to five days after unprotected sex where it’s still effective at preventing pregnancy.Combined birth control pills: Combining birth control pills that contain progestin and estrogen can be used as emergency contraception for up to five days after intercourse. There can be a lot of variety between different brands of birth control pills, so it’s a good idea to talk to your healthcare provider about the exact timing and dosage.AdvertisementHow many times can you take emergency contraception medications?Even though there isn’t a set restriction on how many times you can take the morning-after pill, you shouldn't use it as routine birth control. This type of birth control is meant to be used in emergency situations when your birth control has failed, wasn't used or in cases of non-consensual intercourse.What are the signs that emergency contraception hasn't worked?If you take the morning-after pill in the immediate time window after having unprotected sex, it can be very effective. But it doesn’t always work. Emergency contraception medications become less effective the longer you wait before taking them. One of the main signs that a morning-after pill hasn’t worked is a missed menstrual period. If your period is more than seven days (a week) later than you expected, take a pregnancy test.Care at Cleveland ClinicSchedule Birth Control CounselingFind a Doctor and SpecialistsMake an AppointmentRecovery and OutlookWhat are the side effects of the morning-after pill?For many people, there are no serious side effects of the morning-after pill. Some symptoms of taking a morning-after pill (Plan B One-Step® or Ella®) can include:Changes to your normal menstrual cycles (your period might be earlier or later than normal).Spotting (light bleeding).Nausea and vomiting.Tiredness (fatigue).Headaches and dizziness.Pain in your abdomen or breast.The side effects of the morning-after pill are mild for most people. But if you notice more severe symptoms or have concerns after taking the morning-after pill, reach out to your healthcare provider.Is there bleeding after I take the morning-after pill?You might experience light bleeding — called spotting — after taking the morning-after pill. Even though this doesn’t happen to everyone who takes the morning-after pill, it isn’t something that should worry you. If you notice that the bleeding is heavier or happens after you’ve missed a period, reach out to your healthcare provider. Spotting that happens after a missed period could be implantation bleeding. This light bleeding happens early during fetal development when the embryo embeds itself into the lining of your uterus (endometrium).Can morning-after pill make your period late or disrupt your cycle?The morning-after pill can cause your next period to be irregular. If your period is late or abnormal, contact your healthcare provider and consider taking a home pregnancy test. Your provider will advise you on your next steps if your menstrual cycle doesn’t return to normal.Can I get pregnant again after taking the morning-after pill?The morning-after pill isn't a permanent form of birth control. It won't harm your chances of getting pregnant in the future or impact your fertility. These medications (Plan B One-Step®, ella® and other generic options) are a temporary way to prevent pregnancy — they aren’t long-term forms of birth control.When to Call the DoctorShould I see my doctor after taking the morning-after pill?In most cases you won’t need to see your healthcare provider after taking the morning-after pill. However, if you haven’t gotten your period within a week of when you expect it or you experience unusual bleeding, it’s often a good idea to talk to your healthcare provider. A missed period is one of the earlier signs of pregnancy.It’s also important to remember that the morning-after pill won't protect you from sexually transmitted infections (STIs). If you have any concerns that you might have been exposed to an STI, reach out to your provider.Additional Common QuestionsDoes the morning-after pill work if I take it first and then have unprotected sex?The morning-after pill is designed to be taken shortly after unprotected sex to prevent pregnancy. It's not meant to be regular birth control. Talk to your healthcare provider about your options for birth control to find an option that works best for your lifestyle.Can my weight impact the effectiveness of the morning-after pill?There's research that suggests that your weight can impact how effective the morning-after pill will be for you. People with a higher body mass index (BMI) may not experience the same level of effectiveness when using the morning-after pill as people with a lower BMI. One type of emergency contraception that's highly effective at any weight is an intrauterine device (IUD).Is the morning-after pill available over the counter?The Plan B One-Step® pill and other progestin-only forms of emergency contraception are available over the counter. However, ulipristal (ella®) is a prescription-only medication. You should also talk to your healthcare provider before taking combined birth control pills to make sure you take the correct dosage (amount).A note from Cleveland ClinicThe morning-after pill is a form of emergency contraception (birth control) that’s meant to help prevent pregnancy. This medication doesn't end an already established pregnancy. If you take a morning-after pill, it’s important to remember that the medication will be the most effective the sooner you take it. You typically have between three to five days after unprotected sex when the morning-after pill is most effective at preventing pregnancy. If you have any questions about emergency contraception, talk to your healthcare provider.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/01/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Birth Control CounselingFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"