"mRNA Vaccines: What They Are & How They Work800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/mRNA VaccinesAdvertisementAdvertisementAdvertisementmRNA VaccinesmRNA vaccines protect you from disease. The current ones work by teaching your body to build a protein from the COVID-19 virus. Your body sees that the protein doesn’t belong and makes antibodies to protect you from it. mRNA vaccines are safe and effective. Millions of people have received the vaccines, and side effects are rare.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional Common QuestionsOverviewA closer look at how our bodies use messenger RNA (mRNA) vaccines to increase our immunity to COVID-19, helping to prevent severe disease and death.What is an mRNA vaccine?A messenger ribonucleic acid (mRNA) vaccine is a biological substance given to you in a series of shots designed to protect you from developing a disease. Two of the vaccines currently in use to prevent the COVID-19 infection (coronavirus disease) are mRNA vaccines. These are the Pfizer and Moderna vaccines.An mRNA vaccine works by triggering your immune system to create antibodies. Antibodies are proteins in the body. They fight bacteria and viruses that cause disease.The COVID-19 mRNA vaccines are safe and effective to prevent serious complications. They help your body make the same antibodies it would create if you had been sick with COVID-19. The vaccines offer protection from the disease without the risks of the life-threatening illness.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the types of mRNA vaccines?Healthcare providers are currently offering two types of mRNA vaccines in the United States. Comirnaty® (formerly known as the Pfizer-BioNTech vaccine) is approved for people over 12. The Moderna vaccine is approved for people over 18.For more than 30 years, scientists have been studying mRNA vaccines to prevent diseases such as:Cytomegalovirus (CMV).Influenza (flu).Rabies.Zika virus.Scientists are also studying mRNA vaccines to treat diseases like multiple sclerosis (MS) and cancer. These treatments use the same mRNA technology to trigger the immune system to create antibodies. Though they aren’t approved yet, these treatments are currently in clinical trials.Procedure DetailsA woman receives an injection in her left arm.What does an mRNA vaccine prevent?Both of the available mRNA vaccines are used to help prevent severe illness from COVID-19 infection. Although the COVID-19 mRNA vaccines are new, the technology behind these vaccines is not. For many years, researchers and scientists have been studying these types of vaccines to fight other diseases. During the COVID-19 pandemic, scientists used this technology to develop vaccines that target SARS-CoV-2. SARS-CoV-2 is the virus that causes COVID-19.Both mRNA vaccines had been approved in the US under emergency use authorization (EUA). This means the US Food and Drug Administration (FDA) has allowed these vaccines to be used before they've been through the full FDA-approval process. However, one of these vaccines, formerly called the Pfizer-BioNTech Covid-19 Vaccine, has been granted full approval status. It will now be available as Comirnaty®.The mRNA vaccines are very effective at preventing COVID-19. But no vaccine is 100% effective. It’s rare but people who are fully vaccinated can still get COVID-19. However, the vaccines prevent serious complications, hospitalizations and death from COVID-19.AdvertisementHow do mRNA vaccines work?All vaccines work by stimulating your immune system so it can protect you from germs. Most vaccines give you a small amount of a damaged or “killed” virus. Your body responds by making antibodies to fight the disease. They protect you from illness if you’re exposed to those germs in the future.mRNA vaccines also stimulate your immune system, but they work in a different way than other vaccines. The mRNA vaccines don’t contain the virus that causes disease. Instead, they contain “messenger molecules” (mRNA) that give your body instructions that are kind of like a special recipe. The instructions tell your cells how to make a piece of the protein from a virus, such as the virus that causes COVID-19.Your cells use the recipe to create the protein, which is totally harmless to you. Your immune system recognizes the protein and knows that it doesn’t belong in your body. So, it creates antibodies that destroy it. If you ever come into contact with the virus, your antibodies recognize them again, attack them and destroy them.How do providers deliver the mRNA vaccines?You get an mRNA vaccine through an injection (shot) in your upper arm. Both types of approved mRNA COVID-19 vaccines require two shots, spaced either three (Moderna) or four weeks (Comirnaty®) apart. Follow your provider’s instructions about when to get your shots. Doing so will make the vaccine more effective and offer you the best protection against coronavirus disease. Persons who are immunocompromised may require an additional third dose to get the full benefit of the vaccine.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdvertisementRisks / BenefitsWho should get an mRNA vaccine?If you’re eligible for the vaccine, you should get it. The vaccine protects you and others from COVID-19. Talk to your healthcare provider about getting the vaccine.Who shouldn’t get an mRNA vaccine?An mRNA vaccine might not be as effective in people who have a weakened immune system, cancer or a history of cancer. If you have cancer or another health condition, talk to your provider about getting before getting any kind of vaccine, including the mRNA vaccines for COVID-19.People who are allergic to any of the ingredients in the mRNA vaccines should not get them. It’s rare, but some people have a serious allergic reaction after getting the vaccine.How effective are the mRNA vaccines?The mRNA vaccines in current use are very effective at protecting people from getting and spreading COVID-19. Some studies show that these vaccines are at least 90% effective in people who are fully vaccinated (have had both doses of the vaccine).What are the benefits of getting an mRNA vaccines?Vaccines offer people protection from disease. People who've already been infected with the virus that causes COVID-19 infection develop the same type of immunity. But the COVID-19 mRNA vaccine protects people from the virus without having to get sick from the infection. The vaccine drastically reduces your risk of severe illness and the long-term effects of COVID-19 (long COVID or long-hauler COVID-19).What are the risks of getting an mRNA vaccine?COVID-19 mRNA vaccines are very safe. Millions of people have received the vaccine with few side effects.Though uncommon, allergic reactions to mRNA vaccines have occurred. Reactions usually happen within one hour after getting a shot. So, your provider will ask you to stay in the area for about 15 minutes after your dose to check for any problems. Signs of an allergic reaction to the mRNA vaccine include:Dizziness.Shortness of breath (dyspnea).Swelling in your face or throat, which could be a sign of anaphylaxis.Rash, hives or itching.In rare cases, some people experience myocarditis (inflammation in the heart muscle) or pericarditis (inflammation in the heart’s lining) after getting a COVID-19 mRNA shot. This affects young people and adolescents more than adults. Signs of myocarditis and pericarditis include:Chest pain.Difficulty breathing or shortness of breath.Heart palpitations (fast or pounding heart).What side effects do the mRNA vaccines have?After you get your shot, you may feel run-down or tired. Your body is working hard to launch an immune response and create antibodies to protect you. The side effects from an mRNA vaccine are similar to symptoms of COVID-19.Side effects may be worse after your second dose than after your first one. Most side effects last for about one to three days. You may experience:Pain, swelling or redness where you got the shot.Chills.Fatigue.Fever.Headache.Muscle pain and joint pain.Nausea, vomiting or diarrhea.Swollen lymph nodes.When to Call the DoctorWhen should I call a healthcare provider?If side effects such as muscle pain, chills and fever are severe or last more than a few days, call your provider. You should contact your provider right away if you have heart flutters, heart pounding or shortness of breath after getting the vaccine.Get emergency medical help if you have signs of an allergic reaction, including swelling in the face or throat, trouble breathing or rash.Additional Common QuestionsIs the Johnson & Johnson vaccine the same as the mRNA vaccines?No. The Johnson & Johnson vaccine is one shot only. Also, it works differently than an mRNA vaccine. The Johnson & Johnson vaccine also helps the body recognize COVID-19 infection as an intruder, but it uses something called an adenovirus to deliver the message to destroy the virus behind COVID-19. The adenovirus in the vaccine can’t reproduce in your body.Is the Astra Zeneca vaccine the same as mRNA vaccines?The Astra Zeneca vaccine against COVID-19 infection is supposed to be given as two shots. It’s not an mRNA vaccine. It also uses an adenovirus to tell the body to fight off COVID-19. The Astra Zeneca vaccine isn’t approved in the US.A note from Cleveland ClinicThe COVID-19 mRNA vaccines are safe and effective. Although vaccines for COVID-19 are new, they use mRNA technology that scientists have been studying for many years. The vaccines prevent disease by enabling your immune system to protect you. If you’re eligible for the vaccine, you should get it. Though rare, some people experience side effects from the vaccines. Before getting a shot, tell your provider if you're allergic to any of the ingredients or if you’ve had a reaction to another vaccine before.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/24/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6503Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"