"Muscle Relaxers: What They Are, Uses, Side Effects & Types800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Muscle RelaxersAdvertisementAdvertisementAdvertisementMuscle RelaxersMuscle relaxers are prescription medications that can help treat muscle-related symptoms, like spasticity and spasms. There are several types of muscle relaxers, and they work in different ways. It’s important to talk to your healthcare provider about the risks and benefits of these medications.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewWhat are muscle relaxers?Muscle relaxers (also called muscle relaxants) are prescription medications that affect muscle function. Healthcare providers prescribe them to treat several symptoms, such as muscle spasms, spasticity and musculoskeletal pain.The term “muscle relaxant” refers to two major drug classes: antispastics and antispasmodics. These two classes differ in their uses, ways of working and side effects.This article focuses on skeletal muscle relaxants, as opposed to smooth muscle relaxants. Skeletal muscles are the muscles that help you move. Smooth muscles are the muscles that you don’t have control over, like the muscles in your intestine, stomach and blood vessels. There are also smooth muscle antispasmodic medications.Are there over-the-counter muscle relaxers?There are no over-the-counter (OTC) muscle relaxants in the United States. But some OTC medications can help muscle issues (like soreness), such as NSAIDs (nonsteroidal anti-inflammatory drugs) and acetaminophen.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the types of muscle relaxers?Healthcare providers in the United States can currently prescribe the following antispasmodic skeletal muscle relaxants:Carisoprodol (Soma®, Vanadom®).Chlorzoxazone (Lorzone®, Parafon Forte DSC®, Relax-DS®, Remular S®).Cyclobenzaprine (Fexmid®, Flexeril®).Metaxalone (Metaxall®, Skelaxin®).Methocarbamol (Robaxin®).Orphenadrine (Norflex®).Antispastic skeletal muscle relaxants that providers can currently prescribe in the U.S. include:Baclofen (Lioresal®).Dantrolene (Dantrium®).Two skeletal muscle relaxants have both antispastic and antispasmodic effects. They include:Tizanidine (Zanaflex®).Diazepam (Valium®).What do muscle relaxers help treat?Although antispastics and antispasmodics are both types of skeletal muscle relaxants, they have specific and different uses. In addition, some of these medications treat conditions not related to muscle function. For example, providers sometimes prescribe diazepam to treat anxiety and seizures.Antispastic medication usesHealthcare providers mainly prescribe antispastic muscle relaxers to treat spasticity.Spasticity is a disruption in muscle movement patterns that causes certain muscles to contract all at once when you try to move or even at rest. It’s usually caused by damage to nerve pathways within your brain or spinal cord that control movement and stretch reflexes.Spasticity may occur due to several conditions, some of which include:Cerebral palsy.Multiple sclerosis (MS).Spinal cord injury.Stroke.Brain or head injury.Amyotrophic lateral sclerosis (ALS), also known as Lou Gehrig’s disease.Baclofen is considered the first-line treatment for spasticity, especially for adults who have spinal cord injuries.Antispasmodic medication usesProviders mainly prescribe antispasmodic skeletal muscle relaxants for musculoskeletal and myofascial pain, especially lower back pain, and muscle spasms.However, these medications aren’t the first-line therapy for the treatment of pain or spasms. They’re alternative therapy after first- or second-line therapies haven’t worked. This is due to the adverse side effects of antispasmodics, including addiction potential for some types of the medication.How common are muscle relaxants?Muscle relaxants are a somewhat common prescription due to the frequency of acute and chronic back pain. Low back pain is a very common issue — it remains among the top five reasons people see a primary healthcare provider. Most cases of low back pain resolve without medical intervention. If other treatments don’t work to alleviate the pain, providers may recommend a muscle relaxant.But providers usually only prescribe them for brief periods due to the addiction potential of certain types.AdvertisementProcedure DetailsWhat do muscle relaxers do?The different types and brands of skeletal muscle relaxers work in different ways to affect muscle function. Most muscle relaxers act as central nervous system depressants and cause a sedative effect, or prevent your nerves from sending pain signals to your brain.In general, antispastic medications act on your spinal cord or skeletal muscle directly to improve muscle tightness (hypertonicity) and involuntary spasms.Antispasmodics decrease muscle spasms through changes in your central nervous system (brain and spinal cord).How do you take muscle relaxers?Depending on the type of muscle relaxer, there are different forms in which you can take them, such as tablets, capsules, solutions or injections.Your healthcare provider and/or pharmacist will give you specific instructions on how to take the medication. Be sure to follow them.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdvertisementRisks / BenefitsAre muscle relaxers effective?Antispastic medications are effective in treating spasticity, but high doses can lead to unwanted side effects. Other treatments can help with spasticity as well, including physical therapy and Botox® injections.Research is lacking on whether or not antispasmodics are more effective in treating muscle pain and spasms than NSAIDs or acetaminophen. Antispasmodics have more side effects than NSAIDs and acetaminophen, so it’s important to talk to your healthcare provider about the benefits and risks of taking these medications.What are the side effects of muscle relaxers?Each type of prescription muscle relaxer has different possible side effects. It’s important to talk to your provider or a pharmacist about possible side effects of the specific medication you’re taking or thinking of taking.In general, common side effects of muscle relaxants include:Drowsiness and fatigue.Dizziness.Nausea.Headache.Dry mouth.Muscle relaxers can cause more serious side effects like fainting and blurred vision. Talk to your provider if you experience any bothersome side effects.Do muscle relaxers make you sleepy?Yes, prescription muscle relaxers can make you sleepy due to how they affect your central nervous system. Because of this, you should be cautious about operating heavy machinery, such as driving a car, or making important decisions while taking these medications.Are muscle relaxers addictive?Carisoprodol and diazepam are controlled substances. This means they have addiction potential and can cause withdrawal symptoms if you develop a dependence and stop taking them. You should avoid these medications if you have a personal or family history of substance use disorder.If you feel that you’re dependent on carisoprodol or diazepam or your prescribed dosage isn’t helping to manage your symptoms, don’t take more than your recommended dosage. Talk with your healthcare provider immediately.The other prescription muscle relaxants aren’t controlled substances.What are the possible risks or complications of taking muscle relaxers?The two main possible complications of taking muscle relaxers are the potential for overdose and dangerous interactions with alcohol.Alcohol and muscle relaxersIf you’re taking a prescription muscle relaxer, you shouldn’t consume alcohol. Alcohol and muscle relaxers are both depressants, which means they slow down your central nervous system. If you take them together, the side effects are much more intense, which can be dangerous.It can cause symptoms like:Extreme dizziness.Extreme drowsiness.Blurred vision.Low blood pressure.Fainting.Memory problems.Liver damage.Increased risk of overdoseMuscle relaxer overdoseMuscle relaxers have a potential for misuse and addiction, especially carisoprodol and diazepam. Prolonged use can lead to increased tolerance and physical dependence.As most muscle relaxers act as sedatives, some people take muscle relaxers alone or in combination with other drugs for nonmedical reasons to produce or enhance feelings of euphoria and dissociation.Muscle relaxer misuse can lead to an increased risk of overdose, which can result in:Changes in consciousness.Hallucinations.Seizures.Respiratory depression.Cardiac arrest.Coma.Death.Seek immediate medical attention if you or a loved one are experiencing symptoms of an overdose.When to Call the DoctorWhen should I call my healthcare provider?You should have regular appointments with your healthcare provider when taking a muscle relaxant to assess how well it’s working.Otherwise, talk to your healthcare provider in the following situations:If you develop bothersome side effects.If your symptoms aren’t improving or if they’ve gotten worse.If you think you’re developing a dependence on the medication.When should I seek emergency care?If you have symptoms of overdose, call 911 or go to the nearest emergency room.A note from Cleveland ClinicPrescription muscle relaxers can be effective in treating spasticity, muscle spasms and muscle-related pain. But it’s important to weigh the possible risks of these medications, including their side effects and addiction potential. Be sure to talk to your healthcare provider about all the options available to treat your symptoms. Together, you can determine the best treatment plan for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/07/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"