"Myringotomy: Definition, Procedure & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/MyringotomyAdvertisementAdvertisementAdvertisementMyringotomyA myringotomy is a surgery performed on your tympanic membrane (eardrum). A tiny incision is created in your eardrum to allow fluid to drain from your middle ear. Myringotomy is most often recommended to treat otitis media with effusion (fluid in the ear). On average, myringotomy recovery takes about four weeks.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is myringotomy?A myringotomy is a surgery performed by an ear, nose and throat (ENT) specialist to drain fluid from your middle ear. A myringotomy may be completed on one ear or both (bilateral myringotomy).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is the difference between myringotomy and tympanostomy?During a myringotomy, your surgeon creates a tiny hole in your tympanic membrane (eardrum). In some cases, your surgeon may also perform a companion procedure called a tympanostomy. During tympanostomy, your surgeon places an ear tube in the myringotomy incision. An ear tube equalizes pressure in your ears and helps prevent recurrent (returning) infections.When is a myringotomy necessary?A myringotomy may be necessary for children and adults with:Frequent ear infections (acute otitis media).Ear bleeding due to trauma, severe infection or a ruptured eardrum.Balance problems.Hearing loss or muffled hearing.Speech delays (in children).Ear barotrauma (a painful feeling in your ears due to air pressure changes).Most myringotomies are performed on children because young people are more prone to ear infections. However, many adults need myringotomy, too. Barotrauma is the most common reason for myringotomy in adults.AdvertisementWhat is the purpose of a myringotomy?The main purpose of a myringotomy is to allow fluid that’s trapped in your middle ear to drain out. This fluid could be water, blood or pus.Procedure DetailsWhat happens before a myringotomy?Your healthcare provider will perform an examination of your ear using an instrument called an otoscope. They may also run hearing tests and blood tests, and they’ll likely perform a tympanogram — a test that measures how well your ear drum responds to pressure changes.If your healthcare provider determines that a myringotomy is right for you, they’ll give you a list of preoperative instructions. Generally, you shouldn’t eat or drink anything after midnight the night before your myringotomy procedure. You’ll also need to arrange for a trusted friend or family member to drive you to and from your appointment.AdvertisementWhat happens during a myringotomy procedure?In most cases, myringotomy surgery is performed under general anesthesia to keep you comfortable. But it may also be done with a topical anesthetic in the office. During your myringotomy procedure, your surgeon uses a small microscope so they can see your eardrum clearly. Next, they’ll create a tiny hole in your eardrum and drain the fluid from your middle ear. In some cases, your surgeon will also perform a tympanostomy by placing an ear tube (myringotomy tube) into the incision. This ear tube allows drainage from your middle ear to continue.No stitches are necessary because the incision will heal on its own. Once your myringotomy surgery is complete, your surgeon will pack your ear with gauze. From start to finish, a myringotomy takes about 15 to 20 minutes.Is myringotomy painful?Anesthesia prevents pain during myringotomy surgery. However, you may experience some mild pain or discomfort following your procedure. You can take over-the-counter pain relievers to ease discomfort. Your surgeon may also give you numbing ear drops. Be sure to take all medications as directed.What happens after a myringotomy?Your ear might feel clogged after myringotomy surgery. This is a normal side effect, and it could take a few days for your hearing to improve.Your surgeon will give you a detailed list of postoperative instructions. You’ll need to follow these guidelines closely to ensure a successful recovery. In general, you should:Take all medications exactly as directed by your surgeon.Change your gauze regularly.Avoid submerging your head under water.Wear earplugs when you bathe or shower.Care at Cleveland ClinicGet ENT (Otolaryngology) CareMake an AppointmentRisks / BenefitsWhat are the advantages of myringotomy?Myringotomy offers a number of potential benefits. For example, myringotomy can:Reduce the frequency of ear infections.Restore hearing loss caused by fluid buildup.Ease ear pain and pressure.Improve balance.Improve speech and academic performance in children.What are the risks or complications of myringotomy?Like any surgical procedure, myringotomy comes with some risks. Possible complications include:A permanent hole in your eardrum that doesn’t heal.Hardening of your eardrum, which can cause hearing problems.Surgical injury to your ear canal.Scarring of your eardrum.Excess bleeding.Infection.Chronic drainage.Allergic reaction to anesthesia.Recovery and OutlookWhat is the recovery time after a myringotomy?Most people fully recover in about four weeks. If you had ear tubes put in, they should fall out on their own within six to 12 months.When can I go back to work or school?After myringotomy, most people will be able to go back to work or school within one to two days. Ask your healthcare provider when it’s safe to return to normal routines.When to Call the DoctorWhen should I call my healthcare provider?If you’ve recently undergone myringotomy, it’s important to keep a close eye on any side effects. You should call your healthcare provider if you develop:Signs of infection, such as fever or chills.Pain that doesn’t improve with medication.Redness, swelling or excessive ear bleeding or discharge.Hearing problems.Nausea and vomiting.Cough.Shortness of breath.Chest pain.A note from Cleveland ClinicIf you have frequent ear infections, barotrauma or other conditions caused by fluid in your ear, a myringotomy can ease your symptoms. This common surgical procedure helps release fluid from your middle ear, reducing your risk of pain, infection, hearing problems and more. Talk to your healthcare provider to see if myringotomy is right for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/27/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet ENT (Otolaryngology) CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"