"Balloon Sinuplasty: Procedure, Recovery & What it Is800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Balloon SinuplastyAdvertisementAdvertisementAdvertisementBalloon SinuplastyMore than 30 million people have chronic rhinosinusitis or CRS. Most people can be helped with medical treatment including antibiotics. Balloon sinuplasty might be a solution when your CRS symptoms last more than 12 weeks and medical treatment hasn’t helped.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewHere's how a tiny balloon opens blocked nasal passages.What is balloon sinuplasty?Balloon sinuplasty is a minimally invasive treatment for sinusitis, also called chronic rhinosinusitis (CRS). Some people who have chronic sinus symptoms may be treated with balloon sinuplasty instead of endoscopic sinus surgery (ESS).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat conditions are treated with balloon sinuplasty?More than 30 million people have chronic rhinosinusitis or CRS. Medical treatments, including antibiotics, can ease most peoples’ symptoms. But if your symptoms last more than 12 weeks, your healthcare provider might recommend balloon sinuplasty or endoscopic sinus surgeryCRS symptoms include:Stuffy nose.Congestion.Facial pressure.Runny nose.Loss of sense of smell.Is balloon sinuplasty a common treatment for CRS?Healthcare providers used balloon sinuplasty since 2005. The treatment has become increasingly popular as providers can perform the procedure at medical offices as well as hospitals.AdvertisementProcedure DetailsWhat happens before this procedure?Before you have balloon sinuplasty, your healthcare provider will use computed tomography (CT) scans to confirm balloon sinuplasty is an appropriate treatment for your condition.What happens during this procedure?Balloon sinuplasty can be done in a medical office or a hospital operating room.If you’re being treated in an operating room, your balloon sinuplasty might include the following:You’ll be given general anesthesia or conscious sedation. Conscious sedation blocks pain but allows you to stay awake during the procedure.Your healthcare provider will put a topical decongestant in your nose to control any bleeding you might have during the procedure.They’ll inject a local anesthetic into some of the tissue that lines your nose.They’ll use a thin tube with a light on the end called an endoscope to insert a catheter into your nostril.Next they’ll use the catheter to guide a small balloon into your sinuses.Then they’ll slowly inflate the balloon to gently unblock your sinuses.Your provider may deflate the balloon and remove it or they may repeat the process before deflating the balloon and removing it.If you’re being treated in a medical office, your balloon sinuplasty might include the following steps:You’ll sit in a reclining examination chair.Your healthcare provider will apply a topical decongestant in your nose.Then they’ll apply an anesthetic spray before applying additional anesthetic to thick cotton pads and put the pads in your nose.Your provider will take out the pads and inject a local anesthetic into some of the tissue that lines your nose.They’ll use a thin tube with a light on the end called an endoscope to insert a catheter into your nose.Your provider will use the catheter to guide a small balloon into your sinuses.Then they’ll slowly inflate the balloon to gently unblock your sinuses.Your provider may deflate the balloon and remove it or they may repeat the process before deflating the balloon and removing it.AdvertisementIs balloon sinuplasty painful?No, balloon sinuplasty usually isn’t painful. Most people who have balloon sinuplasty report feeling a sense of pressure in their nose during the procedure.What happens after balloon sinuplasty?You’ll stay at the hospital or medical office until you feel comfortable leaving. Most healthcare providers recommend you ask someone to drive you to and from your appointment. Your provider might recommend a potential schedule of follow-up appointments and tests:One week after procedure: Follow-up appointment and nasal endoscopy.Three months after the procedure: Follow-up appointment including nasal endoscopy.One year after the procedure: Follow-up appointment including nasal endoscopy and general assessment of your nose health.Care at Cleveland ClinicSchedule Sinus SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of balloon sinuplasty to treat chronic rhinosinusitis?Balloon sinuplasty is a safe and minimally invasive way to treat CRS. Studies show few people who have the procedure report side effects or complications.What are the risks or complications of this procedure?While balloon sinuplasty has few complications, here are a few complications you might experience:Your nose might bleed more than you expected.You might develop bacterial sinusitis and need antibiotics to cure the infection.Your symptoms might come back, requiring additional procedures such as another balloon sinuplasty or a different treatment, such as endoscopic sinus surgery.Recovery and OutlookWhat is the recovery time?You might need to rest at home for 24 to 48 hours after your balloon sinuplasty. Your healthcare provider might recommend the following steps to help you recover:Avoid blowing your nose for 24 to 48 hours.Rinse your nostril with nasal spray.If you feel congested, sleep with your head elevated.Avoid strenuous activity for the first week after your surgery.When to Call the DoctorWhen should I see my healthcare provider?Most people who have balloon sinuplasty notice some bloody drainage from their noses. That’s completely normal. Call your healthcare provider if your nose bleeds a lot and you can’t control the bleeding.A note from Cleveland ClinicA nose that won’t stop running. Or a nose that is so stuffed with gunk that you can barely breathe. Or pain that makes your face ache. We’ve all had these sinusitis symptoms at one time or another. But if your symptoms last for more than 12 weeks, you don’t have to suffer — and sniffle — in silence. Tell your healthcare provider about your symptoms. They will recommend treatments that will help you breathe free again.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/01/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Sinus SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"