"Beta-blockers: Types, Uses and Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Beta-blockersAdvertisementAdvertisementAdvertisementBeta-blockersBeta-blockers are a class of medicines most commonly used for problems involving your heart and your circulatory system. They also are sometimes used to treat conditions related to your brain and nervous system. Beta-blockers work by slowing down certain types of cell activity, which can help control blood pressure, heart rate and more.ContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat are beta-blockers?Beta-blockers are a class of medicines commonly used to treat a wide range of problems involving your heart and your circulatory system. They also are sometimes used to treat conditions related to your brain and nervous system.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow do they work?Your body uses a chemical signaling system to control certain processes and functions. This uses specific sites on the surface of your cells, called receptors, where certain chemicals — called neurotransmitters — can latch on.Receptors work similarly to locks. If a chemical with the right structure latches onto a receptor, it works like a key and activates the cell to respond a certain way. How the cell responds depends on where it is and what it does. If your body needs certain cells to act, it can produce more of the chemical that can activate the cells’ receptors.Many medications work by artificially affecting that chemical signaling process. Medications that work like this fall into two categories:These medications attach to and activate receptor sites. In effect, they pretend to be the right kind of chemical compound and the cell falls for the deception. This can stimulate cells that wouldn’t be active otherwise.These medications attach to the receptor sites but don’t do anything else. The effect is similar to breaking a key after inserting it into a lock. The broken part of the key stays in place and blocks another key from entering. Antagonists reduce the number of receptors that are available for activation, which slows down cell activity.Beta receptorsAdrenergic receptors (sometimes called adrenoceptors) are a key type of receptor found throughout your body. They get their name from adrenaline (also called epinephrine), a neurotransmitter that your body produces naturally. Adrenaline can activate all adrenergic receptors, much like a building master key can open every lock inside that structure.Beta-blockers are beta receptor antagonists, meaning they block beta-adrenergic receptors and slow down certain types of cell activity.What do beta receptors control?Beta receptors come in three different sub-types and have different functions depending on their location.Beta-1 (B1)The beta-1 receptors are found mainly in the heart and kidneys. When activated, they do the following:Increase your heart rate.Increase heart pumping force.Activate the release of renin, an enzyme found in your kidneys.Beta-2 (B2)The beta-2 receptors are found mainly in smooth muscle tissue. That tissue is in your respiratory system (especially your trachea and bronchial tubes), blood vessels and your nervous system). When activated, these receptors affect various body systems in the following ways:Respiratory: Cause smooth muscle to relax so people breathe more easily.Blood vessels: Cause smooth muscle to relax and lowers blood pressure.Liver: Activate liver’s conversion of glycogen into glucose (which your body uses for energy).Heart: Increase pumping force and heart rate.Nervous system: Cause muscle tremors.Beta-3 (B3)Beta-3 receptors are found mainly in fat cells and in your bladder. When activated, they do the following:Cause fat cells to break down.Cause relaxation and increase in bladder capacityCauses tremors, which limits potential medical applications for B3 receptor-targeted medications.AdvertisementWhat conditions are treated by this class of medication?Because beta-receptors are found in several locations throughout the body, beta-blockers can treat a wide range of problems and conditions.Beta-blockers are mainly used to treat heart and circulatory conditions, including the following:Aortic dissection.Arrhythmias.Chest pain (angina).Coronary artery disease.Heart attack.Heart failure (especially chronic heart failure).High blood pressure (hypertension).Hypertrophic obstructive cardiomyopathy (enlarged heart).Migraines (preventive).Portal hypertension.Outside of the heart and circulatory system, they can treat several other conditions:Essential tremorGlaucomaHyperthyroidism (overactive thyroid)Types of beta-blockersSome beta-blockers are only effective on certain beta receptors, a property known as “selectivity.” It’s a key consideration when healthcare providers choose which beta-blocker to prescribe.Beta-blockers generally fall into two broad categories based on whether or not they are cardioselective, meaning they block just the B1 receptors mainly found in the heart.Cardioselective (B1 receptor)NonselectiveAcebutolol*Carvedilol*AtenololLabetalol*BetaxololNadololBisoprololPenbutololEsmololPindolol*MetoprololPropanololNebivolol*SotalolTimololCardioselective (B1 receptor)Cardioselective (B1 receptor)Acebutolol*NonselectiveCarvedilol*AtenololNonselectiveLabetalol*BetaxololNonselectiveNadololBisoprololNonselectivePenbutololEsmololNonselectivePindolol*MetoprololNonselectivePropanololNebivolol*NonselectiveSotalolNonselectiveTimolol*These medications have distinctive or unique properties. Examples of those properties include:Carvedilol and labetalol: Both of these can also block some alpha-receptors. This can help lower heart rate and blood pressure even further, making these medications more effective.Esmolol: This medication is only available in an IV form, which limits its use to hospitals and similar medical settings.Nebivolol: This medication causes blood vessels to expand (the term for this is vasodilation), which can help further lower blood pressure.Off-label prescribing of beta-blockersBeta-blockers are sometimes used for “off-label” purposes. This means that they’re prescribed for conditions other than the ones they’re specifically approved to treat.An example of this is choosing a similar but unapproved medication to treat a condition over an approved one. This can happen when the approved medication has side effects that the patient should avoid and the alternate medication is safe and likely to help.Off-label prescribing is a legal practice and is medically acceptable and justified when evidence shows a medication has a low risk of causing harmful side effects and is effective for off-label use.Common off-label treatment uses of beta-blockers include:Migraines (substituting one beta-blocker for another).Anxiety (such as stage fright or performance anxiety).Reducing tremors (beta-blockers are banned in certain sports because of their performance-enhancing capabilities).Are beta-blockers commonly prescribed?Beta-blockers are some of the most commonly prescribed medications in the United States, with approximately 30 million adults using a beta-blocker.AdvertisementRisks / BenefitsWhat are the advantages of beta-blockers?Beta-blockers are commonly used for several reasons:They’re effective for a wide range of medical problems. Because so many heart and circulatory problems are connected, using a beta-blocker to treat one problem can often benefit multiple related problems.They’ve been studied extensively. Beta-blockers have been in use for decades, with the first clinical trials for them taking place in the 1960s. Because of that, their effects are better understood, and it’s easier to use them safely and avoid negative effects.Most (especially generics) are inexpensive. Beta-blockers are typically very affordable, making it easier to ensure patients aren't going without medications because they can't afford the cost.What are the possible side effects of these medications?Because beta-blockers affect your heart and circulatory systems, they can have a wide range of side effects. As a result, healthcare providers often prescribe specific beta-blockers to limit or avoid these side effects.Common side effects of all beta-blockers include:Slow heart rate (bradycardia).Low blood pressure (hypotension).Irregular heart rhythms (arrhythmias).Fatigue.Dizziness.Nausea.Insomnia, sleep changes and nightmares.Dry mouth or eyes.Rare side effects include:Sexual and erectile dysfunction.What are the reasons I should not take these medications?Beta-blockers can negatively impact several diseases, conditions and health concerns. These are known as contraindications and include:Moderate to severe asthma. Nonselective beta-blockers can aggravate or cause an asthma attack or trouble breathing. Healthcare providers will often prescribe B1-selective beta-blockers to minimize this for people with milder cases of respiratory problems but will avoid using beta-blockers entirely in people with moderate to severe cases.Certain types of arrhythmias. Beta-blockers can aggravate some arrhythmias.Slow heart rate or low blood pressure. Most beta-blockers will aggravate either of these conditions by further lowering heart rate and blood pressure.Raynaud’s phenomenon. This condition causes decreased circulation in your hands and feet (especially fingers and toes) and sometimes in parts of your face. Beta-blockers may aggravate the condition. Raynaud's can happen on its own (primary, also known as Raynaud's syndrome or Raynaud's disease) or occur because of another disease (secondary Raynaud's).Hypoglycemia (low blood sugar). Beta-blockers can delay feeling most of the effects of low blood sugar. For people with conditions that cause low blood sugar like diabetes (especially Type 1), this can delay taking action to stabilize blood sugar levels. If the levels drop too low, you may become confused, pass out or have seizures. A key symptom of low blood sugar that beta-blockers don't mask is sweating. Recognizing sudden sweating can be an important warning sign for individuals who take beta-blockers and are at risk of having low blood sugar.Do beta-blockers interact with any other medications?Beta-blockers can interact with a wide range of medications, especially those related to the side effects or contraindications above. Your healthcare provider can best inform you of the side effects that are of greatest concern to you.Recovery and OutlookHow long can I stay on beta-blockers?You can use beta-blockers for extended periods. In some cases, especially for adults over 65, it’s possible to use them for years or indefinitely.When to Call the DoctorWhen should I see my healthcare provider?Your healthcare provider can advise you on when you should call or schedule an appointment related to taking beta-blockers. In general, you should call or schedule an appointment if you have a sudden change in symptoms, especially ones related to your heart and circulatory system. These include:Shortness of breath.Chest pain.Heart palpitations (where you can feel your heartbeat racing, pounding or skipping beats).Fainting unexpectedly, or having multiple episodes where you feel dizzy or lightheaded.Other symptoms to watch for and ask your doctor about include:Slow heart rate, low blood pressure and confusion or behavior changes, especially when they happen at the same time. This combination of symptoms can indicate a beta-blocker overdose.Recurring episodes of low blood sugar. When not treated, long-term low blood sugar can cause brain damage.A note from Cleveland ClinicBeta-blockers are a widely used, commonly prescribed class of medications. They can treat a wide range of problems, ranging from high blood pressure and heart problems to preventing migraines and anxiety attacks. Though they’ve been in use for decades, there are still instances where they aren’t the best choice. It’s a good idea to talk to your healthcare provider about any concerns or questions you might have. They can answer your questions and help you use these medications in the best way possible.Care at Cleveland ClinicCardiology CareMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/18/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicCardiology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"