"Beta-agonist: Types, Dosing, Benefits & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Beta-agonistAdvertisementAdvertisementAdvertisementBeta-agonistBeta-agonists are medications most commonly used to treat breathing conditions like COPD and asthma. Providers also sometimes use them to treat conditions in your heart and other areas of your body. They work by attaching to beta-receptors that relax muscles in your lungs and other organs and stimulate your heart functions.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a beta-agonist?Beta-agonists are medications that primarily treat lung conditions. They work by attaching to (binding) beta-receptors — “activators” in or on your cells that unlock certain functions. Binding instructs them to perform that function.Activating beta-receptors relaxes the muscles in many organs, including your lungs, which helps you breathe better. They can also increase your heart rate and how well your heart works.There are beta-1, beta-2 and beta-3 receptors that can be targeted with beta-agonists. The most common beta-agonists are beta-2 agonists, which are used to treat chronic obstructive pulmonary disease (COPD) and asthma.Beta-agonists are also called “beta-adrenergic agents.”What are beta-1 agonists?Beta-1 agonists bind to receptors in your heart. This causes your heart to beat faster and to pump blood with more force. Providers can use beta-1 agonists to treat certain heart conditions or events.What are beta-2 agonists?The most commonly used beta-agonists are beta-2 agonists. Inhaled beta-2 agonists bind to receptors in your lungs. This relaxes the muscles in your airways, allowing them to open up. You’ll usually hear them called “bronchodilators.” These can be short-acting beta-agonists (SABA), which usually come in rescue inhalers, or long-acting beta-agonists (LABA). They’re commonly used to treat COPD and asthma.Beta-2 agonists can also relax the muscles in other organs in your body to treat other conditions.What are beta-3 agonists?Beta-3 agonists are a fairly new class of medications. Currently available beta-3 agonists relax your bladder muscles to reduce your urge to pee. They treat overactive bladder. Researchers are still studying beta-3 agonists that treat other conditions.What conditions are treated/managed with beta-agonists?Beta-2 agonists commonly manage breathing conditions like asthma and COPD. Providers also use types of beta-agonists during some medical emergencies, and to treat heart conditions, overactive bladder and high potassium levels (hyperkalemia).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhich drugs are beta-agonists?Some examples of beta-agonist drugs include:Short-acting beta-2 agonists: Albuterol, levalbuterol.Long-acting beta-2 agonists: Formoterol, salmeterol, indacaterol.Beta-1 agonists: Dobutamine, norepinephrine (noradrenaline), dopamine (in high doses).Beta-1 and beta-2 agonists: Epinephrine (adrenaline), isoproterenol.Beta-3 agonist: Mirabegron.How common are beta-agonists?Providers commonly prescribe inhaled bronchodilators, like short-acting and long-acting beta-agonists, to treat COPD, asthma and other breathing conditions. One of the most commonly prescribed beta-2 agonists is albuterol.Procedure DetailsHow do beta-agonists work?Beta-agonists work on parts of your sympathetic nervous system. Your sympathetic nervous system activates your “fight-or-flight” response. This response diverts your body’s resources to the most critical organ functions — like those in your muscles, lungs and heart — in dangerous or stressful situations.Beta-agonists use alpha- and beta-receptors. Receptors are like a button that the chemical signals from your brain push to perform certain jobs. Beta-agonists push buttons that activate features of your sympathetic nervous system, including:Relaxing your muscles in your lungs to allow you to breathe easier and get more oxygen to your body.Increasing your heart rate to pump oxygen-rich blood to your muscles.Relaxing your bladder to hold more pee (urine) and keep you from feeling like you need to go to the bathroom.In contrast, beta-blockers (also known as “beta-antagonists”) block the receptors so agonists can’t latch on. This keeps the receptors from getting activated.Selective beta-agonists only target beta-receptors in certain parts of your body. Nonselective beta-agonists target all of your beta-receptors. You usually experience side effects when a medicine pushes buttons in organs that you weren’t trying to target.How long will I need to use a beta-agonist?How long you’ll need beta-agonist medications depends on what you’re treating:You use short-acting beta-agonists (SABAs) for a short period of time, to open up your airways during an asthma attack or a COPD exacerbation.Some people with COPD use long-acting beta-agonists (LABAs) daily to manage their symptoms. Some people with asthma use them regularly, often in combination with a corticosteroid, to manage symptoms.A provider usually only treats you with other beta-agonists during certain events or emergencies. These include situations like acute heart failure, cardiogenic shock and anaphylaxis.AdvertisementRisks / BenefitsWhat are the benefits of beta-agonists?When used to treat breathing conditions, an inhaler that delivers a beta-2 agonist can be a convenient way to manage your condition at home. Since this targets the medicine to your lungs, side effects are usually minimal.What are the side effects of beta-agonists?Side effects of beta-agonists depend on what kind they are. Ask your provider what side effects to look out for. Some side effects may include:Fast heart rate (tachycardia).Irregular heart rate (arrhythmia).High blood pressure (hypertension).Shakiness.Anxiety or nervousness.Sweating.Headaches.Muscle cramps.For some people, using beta-agonists regularly can reduce their effectiveness.AdvertisementRecovery and OutlookHow long will it take for me to feel better when using a beta-agonist?How long it’ll take for you to feel better depends on the condition you’re treating. Short-acting beta-2 agonists usually help you breathe better within 15 minutes of using your inhaler. Long-acting beta-2 agonists can take up to an hour to start working. You may need to use them regularly for a while before you start to feel better most of the time.When to Call the DoctorWhen should I call my healthcare provider?Contact your healthcare provider if you:Have any unwanted or unexpected side effects to your treatment.Feel like your treatment isn’t working.They may be able to make adjustments to keep you more comfortable. Call your provider right away or seek medical attention immediately if you have any severe side effects.A note from Cleveland ClinicBeta-agonists are most commonly used to treat and manage breathing conditions. They can help you successfully manage COPD or asthma and improve your quality of life. Providers can also sometimes use them for other conditions, especially in emergencies. Talk to your provider about any concerns or questions you have about your treatment with beta-agonist drugs.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/24/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6503Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"