"Biguanides: What They Are, Uses & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/BiguanidesAdvertisementAdvertisementAdvertisementBiguanidesBiguanides (better known as metformin) are a type of oral diabetes medication that helps lower blood sugar levels for people with Type 2 diabetes. Healthcare providers prescribe this medication for other conditions, as well, like PCOS and gestational diabetes.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewWhat are biguanides?Biguanides are a type of oral diabetes medication. They help manage diabetes — mainly Type 2 diabetes — by lowering blood glucose (sugar) levels.Healthcare providers prescribe them for other conditions, as well.Is metformin the only biguanide?Yes, metformin is the only biguanide available in most countries. Its brand names include:Glucophage®.Glucophage XR®.Glumetza®.Fortamet®.Riomet®.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat conditions do biguanides treat or manage?The U.S. Food and Drug Administration (FDA) approved metformin (the only biguanide) in 1994 for the management of Type 2 diabetes (T2D). Since then, metformin has become the most widely prescribed oral diabetes medication and first-line therapy for T2D.Healthcare providers sometimes prescribe biguanides for other conditions. This is an off-label, or non-FDA-approved, use of the medication. Non-FDA-approved uses of metformin include:Management of gestational diabetes.Management of prediabetes.Management of Type 1 diabetes.Management of antipsychotic medication-induced weight gain.Treatment and prevention of polycystic ovary syndrome (PCOS).Researchers are also studying biguanides for their anticancer effects. Studies show that people taking metformin for diabetes have a significant reduction in their risk of cancer.How common are biguanides?Biguanides (metformin) are a very common medication. In 2020, there were approximately 92 million prescriptions for metformin in the U.S.Procedure DetailsHow do biguanides work?Biguanides lower blood glucose (sugar) levels by decreasing the amount of glucose your liver produces and releases into your bloodstream. They also help lower blood glucose levels by making your skeletal muscle tissue more sensitive to insulin so it can absorb glucose for energy. This increases insulin sensitivity and reduces insulin resistance. These bodily changes help manage diabetes.In PCOS, biguanides decreases insulin levels, which then decrease luteinizing hormone and androgen levels. This helps regulate your menstrual cycle (period).AdvertisementHow long will I need to take biguanides?Diabetes is typically a chronic condition (except for gestational diabetes), so you’ll likely take metformin long-term. It’s important to remember that diabetes management involves several strategies, including regular exercise and meal planning. While metformin is effective, it alone can’t treat diabetes.Your healthcare provider will be able to give you more information about how long you’ll take metformin and other strategies to best manage diabetes.Care at Cleveland ClinicAdult Type 2 Diabetes ManagementPediatric Type 2 Diabetes ManagementFind a Doctor and SpecialistsFind a Pediatric Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the potential benefits of biguanides?Biguanides are effective. For people with Type 2 diabetes, biguanides (metformin) can decrease their A1C levels by about 1%.Studies show that biguanides are also effective in preventing or delaying the development of Type 2 diabetes in people at high risk. A study demonstrated that intensive lifestyle intervention and metformin therapy reduced progression from prediabetes to diabetes by 58% and 31%, respectively.Studies also show that metformin may decrease your risk for cardiovascular disease.AdvertisementWhat are the side effects of biguanides?Common side effects of biguanides (metformin) include diarrhea and nausea and vomiting. They affect up to 30% of people taking the medication.Less common side effects include:Chest discomfort.Headache.Excessive sweating (diaphoresis).Low blood sugar (hypoglycemia).Weakness.What are the risks or complications of biguanides?Biguanides (metformin) are generally safe, but taking them may result in certain complications, including:Vitamin B12 deficiency.Lactic acidosis.Drug interactions.Vitamin B12 deficiencyLong-term use of metformin may cause your vitamin B12 levels to decrease. Your healthcare provider will likely monitor your levels while you take the medication, especially if you have anemia or peripheral neuropathy. Your provider may recommend a vitamin B12 supplement.Lactic acidosisMetformin has a black box warning for lactic acidosis. This is a rare, potentially life-threatening complication. It affects every 1 in 30,000 people taking metformin. Your provider will be monitoring your kidney function levels while you take the medication. They’ll tell you to stop taking it if there’s any noted change in your kidney function.Lactic acidosis happens when lactic acid builds up in your body, which leads to metabolic acidosis. Risk factors for lactic acidosis include:Liver disease or kidney disease.Being over the age of 65.Recently having had surgery.Low oxygen levels (hypoxia).Alcohol use disorder.Symptoms of lactic acidosis and metabolic acidosis include:Fatigue.Weakness.Nausea and vomiting.Abdominal pain.Rapid breathing or long, deep breathing.If you have these symptoms, call 911 (or your local emergency services number) or go to the nearest emergency department as soon as possible.While this complication is rare, if lactic acidosis isn’t treated in time, it can lead to death.Drug interactionsTaking metformin with other medications can lead to complications. Before starting any new medication, make sure you tell your healthcare provider about all the medications you take, including prescriptions, over-the-counter (OTC) drugs and supplements.Taking certain medications while also taking biguanides may increase your risk of developing lactic acidosis. They include (but aren’t limited to):Bupropion.Carbonic anhydrase inhibitors.Cephalexin.Cimetidine.Dolutegravir.Glycopyrrolate.Lamotrigine.Ranolazine.Topiramate.Taking certain medications in addition to biguanides can increase your risk of experiencing low blood sugar (hypoglycemia). They include:Androgens.Alpha-lipoic acid.Salicylates.Selective serotonin reuptake inhibitors (SSRIs).Quinolones.Prothionamide.Pegvisomant.When to Call the DoctorWhen should I call my healthcare provider?You should have regular appointments with your healthcare provider when you’re taking a biguanide to assess how well it’s working.Otherwise, talk to your healthcare provider in the following situations:If you develop bothersome side effects.If it’s not working to manage your condition (like diabetes or PCOS).If you’re thinking of stopping the medication.A note from Cleveland ClinicBiguanides (metformin) are a well-studied class of oral diabetes medication. They’re proven to be generally safe and effective at managing Type 2 diabetes and other conditions. If you have any questions about taking metformin, don’t hesitate to ask your healthcare provider. They’re available to help you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/22/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicAdult Type 2 Diabetes ManagementPediatric Type 2 Diabetes ManagementFind a Doctor and SpecialistsFind a Pediatric Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6568Appointments & LocationsRequest an AppointmentVirtual Visits for DiabetesFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"