"Biologic Therapy for Severe Asthma800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Biologic Therapy for Severe AsthmaAdvertisementAdvertisementAdvertisementBiologic Therapy for Severe AsthmaNew injectable asthma medications (omalizumab, mepolizumab, reslizumab, benralizumab, and dupilumab) target different molecules and help patients who still have problems even though they are using other inhalers.  Learn who might be helped and about possible side effects.ContentsArrow DownOverviewAdditional DetailsContentsArrow DownOverviewAdditional DetailsOverviewHow does biologic therapy treat severe asthma?Asthma is a complex disease. Many patients are able to control asthma with inhaler therapy. But some patients with severe asthma have episodes of frequent symptoms and episodes where the asthma gets much worse even when they use more than one inhaler. Now there are new options called biologic therapy to help patients with severe asthma. Biologic therapies offer new ways of treatment because they target different molecules in the body that contribute to asthma.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the types of biologic therapy drugs for treating asthma?Xolair® (omalizumab)Xolair is a medication for patients with poorly controlled asthma and allergies to year-round allergens like dust mites, pet dander, or cockroach debris. Xolair blocks the antibody that causes an allergic asthma response.Xolair is given as one or two subcutaneous injections (shots given under the skin), depending on the dose prescribed.It is given every 2 or 4 weeks, depending on the dose prescribed.After you receive a dose of medication, most infusion centers will monitor you for a period of time to make sure you do not have any reactions to the medication.The most common side effects with Xolair are:  Muscle achesJoint achesFatigueInjection site reactionSevere allergic reactions (rare)Nucala® (mepolizumab)Nucala is a medication for patients with eosinophilic asthma. Eosinophils are a type of white blood cell that can cause inflammation in the lungs of some patients with asthma. Nucala works by reducing the number of eosinophils in your blood.Nucala is administered as a shot under the skin once every 4 weeks.After you receive a dose of medication, most infusion centers will monitor you for a period of time to make sure you do not have any reactions to the medication.The most common side effects with Nucala are:  HeadachesInjection site reactionBack painWeaknessFatigueSevere allergic reactions (rare)Cinqair® (reslizumab)Cinqair is also a medication for patients with eosinophilic asthma. It also works by reducing the number of eosinophils in your blood.Cinqair is administered as an intravenous (IV, or through the vein) infusion. It takes about 20 to 50 minutes to receive the infusion. It is given once every 4 weeks.After you receive a dose of medication, most infusion centers will monitor you for a period of time to make sure you do not have any reactions to the medication.The most common side effects with Cinqair are: Sore throatMuscle achesSevere allergic reactions (rare)Fasenra® (benralizumab)Fasenra is a medication for patients with eosinophilic asthma and works by reducing the number of eosinophils in your blood.Fasenra is administered as a shot under the skin.It is given once every 4 weeks for the first 3 doses, then once every 8 weeks.After you receive a dose of medication, most infusion centers will monitor you for a period of time to make sure you do not have any reactions to the medication.The most common side effects with Fasenra are: HeadacheSore throatSevere allergic reactions (rare)Dupixent® (dupilumab)Dupixent is also a medication for patients with poorly controlled eosinophilic asthma and works by blocking a number of inflammatory cells that affect patients with asthmaDupixent is administered as a shot under the skin.It is given once every other week.You will receive the first three doses of Dupixent in clinic so that we can teach you how to inject it. You will be monitored for one hour after the first dose to make sure you do not have a reaction to the medication. You will be monitored for 30 minutes after the next two doses. After that, Dupixent can be administered at home by yourself.The most common side effects with Dupixent are: Sore throatInjection site reaction (temporary redness or pain)Elevated eosinophil levelSevere allergic reactions (rare)Additional DetailsWhere can I get biologic treatments for asthma?Your doctor will decide if you would benefit from any of these therapies based on your symptoms, the medications you are already on, and your blood test results. These drugs are given in an infusion center.AdvertisementWill my insurance cover biologic therapy for asthma ?Your doctor’s office will work with your insurance company before starting treatment to make sure everything is approved. Many pharmaceutical companies also have programs to help patients afford these treatments.Will I still need to take my inhalers?Yes! It is very important that you continue to take all your other asthma medications and inhalers. Your doctor will tell you if you can decrease the dose of any of your other inhalers over time if your asthma is under good control.Care at Cleveland ClinicAsthma Treatment for AdultsFind a Doctor and SpecialistsAsthma Treatment for ChildrenFind a Pediatric Doctor and SpecialistsMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/14/2019.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicAsthma Treatment for AdultsFind a Doctor and SpecialistsAsthma Treatment for ChildrenFind a Pediatric Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6503Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"