"BiPAP Machine: Uses, Benefits, Side Effects & Alternatives800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/BiPAPAdvertisementAdvertisementAdvertisementBiPAPBiPAP® is a type of noninvasive ventilation that helps you breathe. Providers can use it to treat you if you’re not getting enough oxygen or can’t get rid of carbon dioxide. A machine delivers air through a mask on your face. It uses a lower pressure when you’re exhaling than when you’re inhaling.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewBiPAP uses a higher air pressure when you’re inhaling and a lower one when you’re exhaling.What is BiPAP?Bilevel positive airway pressure (known as BPAP, or more commonly under the trade name, BiPAP) is a machine that helps you breathe. It’s a form of noninvasive ventilation that providers might use if you can breathe on your own but aren’t getting enough oxygen or can’t get rid of carbon dioxide. Unlike invasive mechanical ventilation, which connects to a tube in your throat, BiPAP delivers air through a mask on your face.“Positive airway pressure” means that the device pushes air at a higher pressure into your airway, which includes your nose, mouth and windpipe (trachea). That higher pressure keeps your airway open and can help move air into and out of your lungs.“Bilevel” means that it gives you airflow at two different pressures: one for when you’re inhaling and a lower one for when you’re exhaling. These two levels are called inhalation positive airway pressure (IPAP) and exhalation positive airway pressure (EPAP). The machine settings can set the timing of the two pressures (timed) or it can adjust the pressure based on your breathing patterns (automatic).Providers use BiPAP in certain emergency or intensive care situations. Some people also have a BiPAP machine at home for chronic conditions.Why would I need BiPAP?You might use a BiPAP machine if you have certain ongoing conditions or an emergency situation where you need help breathing. Providers can treat the following conditions with BiPAP:Heart failure.Chronic obstructive pulmonary disease (COPD).Obstructive and central sleep apnea.Hypercapnic respiratory failure. This happens when carbon dioxide builds up in your blood and you aren’t effectively getting rid of it when you exhale.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat’s the difference between BiPAP and CPAP?CPAP (continuous positive airway pressure) machines give you the same air pressure whether you’re breathing in or out. BiPAP machines adjust the air pressure you get depending on whether you’re inhaling or exhaling. Most people with sleep apnea use CPAP, but in some situations, your provider may recommend a BiPAP machine.Procedure DetailsWhat happens during BiPAP treatment?If a provider is putting you on BiPAP, they’ll:Turn on the BiPAP machine and adjust the settings, if necessary (the adjustment process is also known as “titration”).Fit the mask over your face. There are different types of masks. Yours might cover just your nose or your nose and mouth. Your provider will adjust the mask so it’s not too tight or too loose.If you have your own BiPAP, you’ll:Set up your machine. This might include putting it on a stable surface, checking the filter, setting up the humidifier and attaching any hoses to the machine and to the mask. Your healthcare or medical equipment provider should instruct you on how to do this.Put on your mask and adjust it according to your provider’s directions. You usually do this sitting up.Turn the machine on.Lay down and readjust your mask as necessary.How long can you stay on BiPAP?There’s no one answer to this question — how long you’re on BiPAP depends on why you’re on it. Unless you’re treating sleep apnea, most people are only on BiPAP until they can breathe well enough on their own again.BiPAP isn’t life support and doesn’t take over breathing for you entirely like invasive mechanical ventilation does. If you need to be on BiPAP for more than a few days straight, you need to be able to take breaks. This means either breathing without a machine or getting extra oxygen through a small tube (cannula) just under your nose.If you’re on BiPAP for sleep apnea, you can use it at night indefinitely.AdvertisementRisks / BenefitsWhat are the potential benefits of BiPAP?Benefits of BiPAP include:It’s noninvasive. This means it doesn’t need to be inserted inside your body. Noninvasive ventilation has fewer risks than invasive ventilation.It can help to transition you off a life support system.BiPAP is an alternative to CPAP in people with sleep apnea who can’t tolerate, or who aren’t getting better with, CPAP.What are the risks of BiPAP?Risks and drawbacks of BiPAP include:A provider can’t give you BiPAP if you’re not breathing on your own.BiPAP is uncomfortable and you or your loved one might not be able to tolerate it for long periods of time.The mask can make some people feel claustrophobic (trapped or closed-in).Injury to your lungs from too much pressure (this is rare, and some devices or masks have safeguards that prevent this).Low blood pressure (hypotension).Aspiration pneumonia.AdvertisementRecovery and OutlookHow long will it take for me to feel better after starting BiPAP?How long it’ll take to feel better depends on why you’re on a BiPAP machine. If you’re using it for sleep apnea, it can take a few days to a few weeks to feel better. You may feel more rested, have more energy or notice you don’t need to take a nap during the day. COPD flare-ups can last days or weeks, even with BiPAP treatment.Is there anything I can do to make this treatment easier on me?BiPAP can feel uncomfortable and take some getting used to. If a provider is treating you with BiPAP, they may apply your mask in stages — loosely at first — so that you have time to get used to the feeling. If you’re using BiPAP at home, there are some things you can do to help you adjust:Get the right kind of mask. Research what kinds of masks are available and which one might be best for you based on how you sleep. Ask your healthcare or medical equipment provider for recommendations.Practice wearing your mask. Try your mask on during the day or a little bit before bedtime with the machine off. Getting used to the feeling while you’re awake can make it easier to fall asleep with it on.Be consistent. If you’re using BiPAP for sleep apnea, make sure you use it every night. Using it on and off will make it harder to get used to. You also won’t see an improvement in your symptoms without consistent use.Use the ramp feature. If your machine has it, the “ramp” feature gives you lower air pressure as you’re falling asleep. After you’re asleep, it increases the pressure.When to Call the DoctorWhen should I call my healthcare provider?Talk to your provider if you feel like your sleep apnea or COPD isn’t well managed. They can help you figure out what treatment options might work for your specific condition.A note from Cleveland ClinicProviders use BiPAP to treat both emergency situations and chronic conditions. The air pressure levels can help some people manage their conditions better. Reach out to your provider if you want to know more about treatment options for your breathing or heart condition. Talk to them about what’s working for you and what’s not. Together, you can make a plan to help you manage your health in a way that works best for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/10/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6503Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"