"Birth Control Pill: Types, Side Effects & Effectiveness 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Birth Control PillsAdvertisementAdvertisementAdvertisementBirth Control PillsBirth control pills are a type of contraception that’s 99% effective at preventing pregnancy when taken consistently every day. The pill contains hormones that regulate menstruation, decrease PMS symptoms, lower the risk of ovarian and uterine cancers, improve acne and treat endometriosis.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsAdditional DetailsOverviewWhat is the birth control pill?The birth control pill is a type of oral contraception that uses hormones to prevent pregnancy. “Oral” means you take it by mouth. Contraception is any form of birth control — any device or method to prevent pregnancy. People call it “the pill” because it comes in pill form that’s easy to take. For many people, the pill is just one part of their daily routine.Birth control pills prevent pregnancy 99% of the time when you take them every day, exactly as prescribed. Unlike other types of birth control, like condoms, the pill doesn’t protect against sexually transmitted infections (STIs). You’ll need to use additional protection along with the pill to reduce your risk of STIs.What are the types of birth control pills?There are two types of birth control pills. Both contain hormones that keep you from getting pregnant.Combination pills contain estrogen and progestin. This is the most common type.Progestin-only pills are also called “the minipill.” They may be better if you’re breastfeeding (chestfeeding) or have a history of clots in your legs or lungs (venous thromboembolism) or stroke and shouldn’t take estrogen.The morning-after pill is a type of birth control you can take in emergency situations when you’re not using typical birth control, and you’re at risk of pregnancy. Brand names include Plan B One-Step® and ella®. The morning-after pill works differently from the birth control pills you take regularly.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow effective is the pill?The pill is 99% effective at preventing pregnancy — but only if you take it every day. Forgetting to take the pill at the scheduled time increases your chances of pregnancy if you’re sexually active. Nine out of every 100 people on the pill have unintended pregnancies each year.Procedure DetailsHow does the birth control pill work?The hormones in birth control pills prevent pregnancy by blocking conception, when sperm fertilizes an egg. They also cause changes in your uterus so that it can’t support a pregnancy while you’re on the pill.Birth control pills:Stop or reduce ovulation (the release of an egg from an ovary).Thicken cervical mucus, creating a barrier that prevents sperm from entering your uterus and eventually reaching the egg.Thin the lining of your uterus so that a fertilized egg can’t attach and grow there.AdvertisementWhen should I take birth control pills?Take them exactly as prescribed. The pill comes in different dosing packets — including 21-day pill packs, 91-day pill packs or even 365 days of pills. Not all pills in a packet are the same. When you take some of them depends on which kind you’re using. You need to take the right pill at the right time.Follow the instructions on the packaging, or ask your provider or pharmacist if you have questions before you start.Combination pillsMost packets contain “active” and “inactive” pills. Active pills contain hormones. Inactive pills, sometimes called placebo pills, don’t have hormones. The inactive, hormone-free pills may be helpful reminders so that you don’t get out of the habit of taking the pill. You can also set reminders, such as an alarm, or use apps that send reminders.Traditional dose packs28-day packs: Take active pills for 21 days and inactive pills for seven days. You’ll bleed on the inactive week. (The bleeding isn’t a period. Instead, it’s your body’s response to not being on the hormones.)21-day packs: Take active pills for 21 days and no pills for seven days. You’ll bleed the week you’re not taking pills. (Set reminders so you don’t forget to start a new pack on day 29.)Extended or continuous dose packs91-day packs: Take active pills for 12 weeks (three months) and inactive pills for seven days. You’ll bleed on the inactive week. (You’ll only bleed four weeks every year.)365-day packs: Take active pills every day. You may have some breakthrough bleeding or no bleeding at all. Amethyst™ is the only birth control pill available as a 365-day pack.Progestin-only pills (minipills)Progestin-only pills contain 28 active pills that you have to take at the same time every day (within a three-hour window) to prevent pregnancy. For example, taking a pill at 7 a.m. Monday and 10:30 a.m. Tuesday (3 and a half hours) puts you at risk of pregnancy if you’re sexually active.A newer form of the minipill called Slynd® is the exception. You take 24 active pills and then four inactive pills.How soon does the pill work?The pill can take up to a week to start preventing pregnancy. You’ll need to use another form of birth control during the first seven days you’re taking the pill if you’re sexually active.AdvertisementWhat should I do if I miss a pill?Take the missed pill as soon as you remember, and continue taking your usual dose as planned. Use a backup form of birth control until you’ve taken seven days of active pills. It’s helpful to keep package inserts handy. Most give specific instructions on what to do if you miss a pill.Talk to a healthcare provider if you miss several days of the pill. Your provider can discuss pregnancy tests and emergency contraception options.Should I avoid certain medications while taking the pill?Always check with a healthcare provider before starting new medications or herbal supplements. Certain drugs can make the pill less effective, increasing your chances of pregnancy. These include:Antiseizure medications.Herbal supplements, such as St. John’s wort.Medications used to treat HIV.Can I take the pill while breastfeeding?Your healthcare provider may recommend taking the progestin-only pill if you’re breastfeeding (chestfeeding). The combination birth control pill contains estrogen, which can decrease milk production.However, you may switch to an estrogen-containing combination pill once your milk fully comes in.Ask your healthcare provider which option is best for you.Care at Cleveland ClinicSchedule Birth Control CounselingFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of taking the pill?Birth control pills are some of the most popular forms of contraception. People use the pill to prevent pregnancy because:It’s convenient. You just take a pill each day.It’s effective. It prevents pregnancy 99% of the time when you take it correctly.It doesn’t interrupt the spontaneity of sex. You don’t have to find birth control right when things are heating up.You can get pregnant soon after stopping the pill. Most people who decide to try for a baby get pregnant within a year after stopping the pill. This is the same timeline for people trying to get pregnant who haven’t been on the pill.Birth control pills can provide health benefits in addition to pregnancy prevention.The pill can:Make your menstrual cycle (periods) lighter or more regular.Prevent anemia (by lightening your periods).Reduce menstrual cramps and menstrual migraines.Lessen symptoms of premenstrual syndrome (PMS) and premenstrual dysphoric disorder (PMDD).Reduce hot flashes during the transition into menopause (perimenopause).Treat polycystic ovary syndrome (PCOS).Treat endometriosis or uterine fibroids.Lower your risk of ovarian cancer, uterine cancer and colon cancer.Stop unwanted hair growth (hirsutism) and clear acne.Does the pill prevent sexually transmitted diseases (STDs)?No, the pill won’t protect you against sexually transmitted diseases (STDs) or STIs. STIs, such as genital herpes, chlamydia and human immunodeficiency virus (HIV), are transmitted through direct sexual contact and the exchange of body fluids during intercourse, oral sex and anal sex. The human papillomavirus (HPV) is transmitted through skin-to-skin contact.Ask your healthcare provider about the best forms of protection to protect from STIs based on your sexual activity.Are there any side effects to taking the pill?You may experience side effects when you first start taking the pill. Side effects usually go away (or get better) after a few months. Potential side effects include:Nausea.Headaches.Irritability or moodiness.Breast (chest) tenderness or swelling.Spotting between periods (abnormal menstruation).Tell your healthcare provider if you’re experiencing side effects that don’t improve. You may need to switch to a different brand of birth control pill.Do birth control pills make you gain weight?No. Many people ask this question before starting the pill. Several studies have shown that birth control pills don’t make you gain (or lose) weight.Are there any health risks to taking the pill?Birth control pills are safe for most people. It’s the most commonly prescribed form of birth control. The pill has been available for more than 60 years, so there’s a long history of people using it safely to prevent pregnancy.A small percentage of people who take the combination (estrogen-containing) birth control pill are at increased risk of developing these rare complications:Deep vein thrombosis (DVT).Pulmonary embolism.High blood pressure.Heart attack.Stroke.Your healthcare provider will discuss any concerns you have. They’ll talk to you about any risk of complications based on your medical history. Luckily, most people who can’t use the estrogen-containing pill can safely take progestin-only pills.Additional DetailsWhich pill is best for birth control?Your healthcare provider will advise you on whether it’s best to take a combination pill versus a progestin-only pill based on your medical history. They’ll only prescribe pills that are safe for you.Ultimately, the best birth control pill is the one you remember to take. People who get pregnant while they’re on the pill usually do so because they forget to take their pills as often as they should. Pick the birth control pill that’s easiest to work into your routine, and take it consistently.What are alternatives to the pill?If you’re not confident you can remember to take a daily pill, talk to your healthcare provider about these other birth control options:Etonogestrel implant (Nexplanon® and Implanon™).Intrauterine device (IUD) (several hormonal and nonhormonal options are available).Removable contraceptive vaginal ring (both monthly and yearly options are available).Birth control skin patches (Xulane® and Twirla®).Depo-Provera® progestin injection (also called Depo).A note from Cleveland ClinicThe birth control pill can prevent pregnancy as long as you remember to take it every day. It provides other benefits, too. It can help with period symptoms like cramps and heavy bleeding. It can improve acne. The pill might even reduce your risk of some cancers. You may need to try several different brands of the pill before finding the one that works best for you. It’s worth it to find the pill that’s easiest to work into your routine. Talk to your healthcare provider if you have questions about starting the pill or trying a different kind.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/05/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Birth Control CounselingFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"