"Biventricular Pacemaker800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Biventricular PacemakerAdvertisementAdvertisementAdvertisementBiventricular PacemakerA biventricular pacemaker can improve your health and quality of life if you have arrhythmia-related heart failure. The device coordinates contractions so that your heart’s lower chambers work together to efficiently pump oxygen-rich blood out to your body.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a biventricular pacemaker?A biventricular pacemaker is an implantable device for people with advanced heart failure due to abnormal heart rhythms (arrhythmias) and/or function. The device consists of three wire leads and a pulse generator, which contains a battery and a tiny computer. Healthcare providers implant the device during a procedure.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow can a biventricular pacemaker help me?In a healthy heart, electrical signals help your left and right lower chambers (ventricles) pump together. With heart failure, abnormal signals cause ventricle contractions to fall out of synch. There may also be a lack of coordination with your heart’s right upper chamber (atria).These issues reduce the number of effective contractions and therefore the amount of oxygen-rich blood pumped out to your body, making you feel sick. A biventricular pacemaker helps your heart work more efficiently. This treatment is also known as cardiac resynchronization therapy.How does a biventricular pacemaker work?When there’s an abnormal rhythm, the device generates painless electrical impulses. They pass through the leads to your heart’s chambers, helping them pump together. Most people don't feel their heart pacing.AdvertisementWhy would someone need a biventricular pacemaker?Candidates for a biventricular pacemaker are typically on heart failure medications but their symptoms continue worsening. They're likely at a high risk for cardiac arrest.This treatment is also for people who have:Abnormally large left ventricle: This occurs when your heart works harder than it should.Poor ejection fraction: Ejection fraction measures how much blood your left or right ventricle pumps out to your body.Life-threatening arrhythmia: An arrhythmia occurs when your heart beats irregularly or too fast, both of which can affect ejection fraction.Severe or moderately severe heart failure symptoms: Issues such as fatigue and shortness of breath (dyspnea) interfere with daily activities.What other treatments might I need?If you're at risk for life-threatening arrhythmias, you may receive a combined biventricular pacemaker and implantable cardioverter-defibrillator (ICD). When the ICD detects a dangerously fast rhythm, it delivers a shock to stop it. This device protects you from complications such as cardiac arrest and sudden death.AdvertisementProcedure DetailsWhat surgical approaches are used to implant biventricular devices?Healthcare providers implant the device through a small cut (incision) in your chest. There are two techniques for placing the wire leads:Endocardial (transvenous) approach: This approachis minimally invasive. Your provider implants leads by making a small incision in your arm. Then, they advance the leads through a nearby blood vessel to reach your heart.Epicardial approach: This approachis open surgery that involves making a larger incision near your heart. This technique is for people who need multiple cardiac treatments in one procedure. It’s also for people who aren't candidates for the endocardial approach.What does the procedure feel like?What you feel depends on the lead placement approach:Endocardial: Intravenous (IV) medications help you relax and make you feel drowsy, but you won't be asleep. You'll also receive medication to numb the treatment area. You may feel a pulling sensation as the surgeon implants the device, but you shouldn't feel pain.Epicardial: You receive general anesthesia, which includes medications to put you to sleep. You experience no sensation and you'll have no memory of the procedure.How is the device implanted?The steps of the implantation procedure include:Your healthcare provider makes a cut (incision) in your chest.The leads are inserted either through the chest incision (epicardial approach) or through a vein in your arm (endocardial approach).Lead tips are advanced until they make contact with your right atrium, right ventricle and left ventricle.Real-time imaging (fluoroscopy) helps your provider guide the leads to the right spot.The pulse generator is inserted through the chest incision and held in place by a pocket of nearby tissue.What happens after implanting the biventricular device?Once the leads are in place, your healthcare provider performs lead function testing. This is also known as pacing. Pacing confirms that the leads are:Where they should be.Functioning properly.Capable of synchronizing left and right ventricle activity.After successful pacing, your provider connects the leads to the device. Before completing the procedure, they set the device to meet your needs. After the implant procedure, your provider will make further adjustments as necessary. This is done by placing a programmer over the site of the generator.Care at Cleveland ClinicHeart Failure TreatmentsFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of a biventricular pacemaker?A biventricular pacemaker improves symptoms of heart failure in about 50% of people who receive the device. Additional benefits include:Better quality of life and ability to live an active, independent lifestyle.Fewer heart-related hospitalizations.Improved heart functioning.Longer survival.What are the risks associated with a biventricular pacemaker?As with any heart failure treatment, biventricular pacemakers have a risk of complications. Potential complications include:Bleeding.Cardiac tamponade, where the space around your heart fills with blood.Collapsed lung (pneumothorax).Infection.Lead dislodgement, when a lead disconnects from heart tissue or the pulse generator.Mechanical failure, meaning the device doesn’t function as it should.Nerve damage.Recovery and OutlookWill I have to stay in the hospital after my procedure?People typically start their recovery in the hospital.Endocardial (minimally invasive) approach: Most people go home within a day of their procedure.Epicardial (open surgical) approach: You may need to stay in the hospital for up to five days.What can I expect during recovery?Recovery can take a few months. You should rest and avoid strenuous activity involving your upper body during this time, especially on the side of the pacemaker implant.You can also expect regular follow-up appointments with your healthcare provider to:Make sure your recovery is on track.Adjust device settings to your needs.What is the outlook for people undergoing biventricular device implant surgery?If treatment is successful, you may experience:Gradual symptom improvement and return to most daily activities.Improved ejection fraction.Normal or near-normal sized left ventricle.Lower risk of cardiac arrest.When to Call the DoctorWhen should I contact my healthcare provider after receiving a biventricular pacemaker?After your procedure, you should contact your healthcare provider if you have:Abnormal bleeding from the incision site.Pain that worsens or doesn't respond to medications.Pericardial effusion, which causes chest fullness and pain on the left side of your chest.Redness, warmth or swelling near the incision site.Severe bruising (hematoma).Signs of device failure, which may include heart failure symptoms like dizziness and palpitations.Symptoms of infection, such as fever or chills.A note from Cleveland ClinicA biventricular pacemaker is for people with moderate to severe heart failure symptoms. This device coordinates contractions of your heart’s lower chambers to improve heart function. Many people feel significantly better in the months following implant surgery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/29/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicHeart Failure TreatmentsFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"