"Bladder Surgery: Recovery, Repair & Causes800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Bladder SurgeryAdvertisementAdvertisementAdvertisementBladder SurgeryYour urinary bladder, which holds your pee after it’s filtered by your kidneys, may need surgery for several reasons including bladder cancer. Your bladder may need to be removed, or you may need a reconstructive procedure. There are many different types of bladder surgeries.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is bladder surgery?Bladder surgery is a procedure on your urinary bladder — the organ below your kidneys but above your urethra that houses your pee. The type of bladder surgery depends on what’s being treated. Conditions that may need surgery include:Bladder cancer.Cystocele (fallen bladder/bladder prolapse).Urinary incontinence (loss of bladder control).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the types of bladder surgeries?Most bladder surgeries are now done robotically, meaning that your surgeon will just make a small number of incisions and then place ports that allow the use of robotic arms to perform the surgery. Few are open surgeries where there’s a long cut. Types of surgeries include:Bladder exstrophy repair: This type fixes a birth defect where your bladder is inside out and stuck to the abdominal wall.Anterior repair: A severe cystocele (fallen bladder or bladder prolapse) may require an anterior (from the front) repair. In this type of surgery, an incision (cut) is made in the wall of your vagina and the tissue that separates the bladder from your vagina is tightened. The surgeon might also implant permanent mesh grafts made of synthetic or biologic materials to improve vaginal support.Urostomy: Sometimes, reconstructive bladder surgery is needed or desired for people who have lost their bladder. In a procedure called a urostomy, a segment of your intestine is removed and reattached to your ureters. This leads urine from your kidneys to an opening (stoma) near your belly button. A light, leak-proof bag is attached to the stoma to collect urine. The bag can be emptied as needed.Neobladder urostomy: A segment of your intestine can also be formed into a small pouch or a larger \"neobladder.\" The pouch or bladder is placed in the cavity left by your bladder and stores urine. A conduit, again made from your intestine, leads to a stoma in the abdomen but in this instance, a valve allows the pouch to be drained whenever you wish. No bags are involved. The neobladder may be attached to your urethra to allow urine to drain normally.Bladder cancer is the most common reason for people to undergo bladder surgery. Depending on the stage and progression of bladder cancer, surgery can be used in combination with other therapies such as chemotherapy or radiation therapy. To treat bladder cancer, many different types of procedures may be done. Those procedures include:Radical cystectomy: This procedure involves the complete removal of your bladder. An incision is made in your abdomen and the bladder and adjacent organs are carefully examined to determine the status of cancer and see if it may have spread to adjacent structures and organs. Your bladder is removed along with any other affected organs.Segmental or partial cystectomy: Segmental cystectomy surgery is where part of your bladder is removed. This surgery may be done for people who have a low-grade tumor that has invaded the wall of their bladder but is limited to one area. Because only a part of the bladder is removed, they’re able to pee normally after recovering from this surgery. Removal of only a portion of your bladder is a viable option when a tumor is invasive, but all evidence indicates that it's a solitary tumor limited to a defined region of your bladder. The procedure reduces the size of the bladder but preserves a significant portion.Transurethral resection (TUR) with fulguration: This is a surgery in which a cystoscope (a thin lighted tube) is inserted into your bladder through your urethra. A tool with a small wire loop on the end is then used to remove cancer or to burn the tumor away with high-energy electricity. This is known as fulguration.Urinary diversion: This is a surgery to make a new way for your body to store and pass urine.What does the bladder do?Your urine bladder (not to be confused with your gallbladder), stores your pee after your kidneys filter it. Pee goes from your kidneys down the ureters and into your bladder, where it’s stored before exiting your body through your urethra.Your bladder is made of muscular, flexible tissues that can expand bigger or shrink smaller depending on how much pee it contains. The muscles in your bladder contract when they push your pee through your urethra.AdvertisementHow common is bladder surgery?Almost 85,000 people are expected to be diagnosed with bladder cancer in 2021. It’s the sixth most common cancer in the United States and the third most common cancer for males. Bladder surgery is typically part of the treatment plan for bladder cancer. Radical cystectomy — where your entire bladder is removed — is the type of bladder surgery used for muscle-invasive bladder cancer (MIBC).What kind of surgeon performs bladder surgery?Bladder surgeries are performed by a surgical urologist. Urologists specialize in both male and female urinary tracts.AdvertisementIs bladder surgery inpatient or outpatient?This depends on the type of surgery you’re having. Ask your healthcare provider if you’ll need to stay in the hospital. It could be days, or it could be weeks.Can you live without your bladder?Yes. If you don’t have your bladder, you’ll have to have a urostomy or neobladder urostomy reconstructive surgery.Procedure DetailsWhat happens before bladder surgery?Your healthcare provider may recommend you stop taking any medications that risk bleeding during your bladder surgery. You should stop the following medications about a week before:NSAIDs, including:Ibuprofen (Advil®).Naproxen (Aleve®).Blood thinners, such as:Warfarin (Coumadin®).Clopidogrel (Plavix®).Acetylsalicylic acid (Aspirin).Some antibiotics, blood pressure medications and herbal medications or supplements may also be restricted. You’ll also be asked to stop smoking and using tobacco products. Besides the negative health consequences that smoking has, tobacco use can lead to higher risks both during and after surgery. Tobacco has been proven to slow down the healing process and decrease the effectiveness of the immune system.Don’t discontinue any medication without your healthcare provider’s instruction.Your provider will likely recommend you change your diet the day before your surgery and follow a clear liquid diet starting the morning before your surgery. This includes juices without pulp, soup broth and Jell-O. It’s also important to arrange for someone to care for you after surgery as returning to normal activity is not recommended immediately.What happens during bladder surgery?There is no one way to approach all bladder surgeries. Each condition treated with bladder surgery requires a different approach or different surgery. When you talk to your healthcare provider about undergoing bladder surgery, make sure you understand and feel comfortable with what is explained to you.Nowadays, most bladder surgeries are done robotically. This means that instead of an \"open\" surgery, which requires one large incision, your surgeon will use a few much smaller incisions. Doing surgery this way reduces healing time, risk factors and reduces scarring during the healing process.What happens after bladder surgery?The specifics of recovering from bladder surgery depend a lot upon the type of bladder surgery that you have. For example, in a transurethral resection much less tissue is removed or changed in the surgery than during a radical cystectomy where the entire bladder is removed. Thus, the recovery time after your procedure can vary. Your healthcare provider will help guide you through the recovery process including a voiding trial (where your healthcare provider will test your ability to pee on your own after surgery) and catheter care instructions.Not long after your surgery, you’ll need to get checked out again by your healthcare provider. Report any problems you’ve had since your procedure. If you’ve had bladder cancer, they might need to insert a camera into your bladder to check it.Will I be asleep during the bladder surgery?Yes. You will be under general anesthesia which will put you to sleep.Care at Cleveland ClinicBladder Disorders TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the risks of bladder surgery?All surgeries come with risks. Bleeding, infection and internal damage are typically a risk in any surgery.What are the possible complications of bladder surgery?There can be complications of bladder surgery. You are at higher risk if you are over the age of 60 or designated female at birth. Possible problems include:Gastrointestinal problems: Abdominal surgeries can interfere with your bowel functions. Talk to your healthcare provider about how to handle GI issues.Reproductive health in men: Bladder cancer can spread to your prostate. During bladder surgery, your prostate may also be removed, which may impact your fertility.Reproductive health in women: If your uterus is removed as part of bladder cancer surgery, you won't be able to get pregnant.Urinary diversion: If you have a procedure that reroutes your urine (from the ureters into a bag, for example), you may have complications. Pee could leak from the opening made in your body, and there could be an infection.Hormonal changes: If your bladder cancer has spread to your ovaries, they may need to be removed. Menopause will begin.Inability to urinate: Some people, especially women who have had more than their bladder removed, are unable to pee right away. This usually lasts no longer than a week. You’ll be given a catheter (a tube inserted into your bladder or ureters) and a leg bag (a small bag that catches the urine). Your healthcare provider will teach you how to operate the equipment.Recovery and OutlookWhat is the recovery time? When can I go back to work/school?This depends on which procedure you get. Ask your healthcare provider.Will I have to limit my activity?Don’t exercise or lift heavy objects for at least a few weeks.What can I eat and drink after bladder surgery?Be sure to get plenty of fluids. If you don’t get enough water, you’re risking a urinary tract infection (UTI).What medications will I need to take?Your healthcare provider will likely give you pain medications. Ask about any other medications before you go home.When to Call the DoctorWhen should I contact my surgeon?Contact your surgeon if you have any of the following symptoms:Severe pain, especially when you’re peeing.You can’t pee.You have a temperature of 100.4 degrees Fahrenheit (fever).Blood in your urine.When should I contact my usual healthcare provider?Contact your healthcare provider if you have symptoms of any of the conditions that require bladder surgery to treat. Bladder cancer symptoms you should report include:Hematuria (blood in your urine). This is the most common symptom of bladder cancer. Your urine may look red, or it could look pink or dark brown.An urgent need to pee.Frequent urination.Pain when you pee.Pain in your lower abdomen or your back.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/06/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicBladder Disorders TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"