"Types of Blood Pressure Medication (Antihypertensives)800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Blood Pressure MedicationAdvertisementAdvertisementAdvertisementBlood Pressure MedicationBlood pressure medications, or antihypertensive agents, help many people who have high blood pressure. Multiple antihypertensives are available. Your healthcare provider will consider your health issues and work with you to find the blood pressure medication that’s right for you.ContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat are blood pressure medications?Blood pressure medications (antihypertensives) are medicines that bring your blood pressure down in various ways. Some blood pressure medications make your blood vessels widen so blood gets through more easily. Others remove extra fluids from your blood or block natural hormones your body makes that raise blood pressure.In addition to your age, race and gender/sex, your healthcare provider will consider your other health problems and how high your blood pressure is when deciding which high blood pressure medication to give you. Your treatment will be different from your neighbor’s or your brother’s prescriptions because each of you has a unique situation.You may need to take more than one type of high blood pressure medication to bring your blood pressure numbers down. Your healthcare provider may try one antihypertensive agent and add a second or third little by little to bring your blood pressure down. They may also start and stop antihypertensive drugs if they aren’t giving results or you develop intolerable side effects or unsafe changes in your bloodwork. Your healthcare provider will likely ask you to take your blood pressure at home each morning, before you have had any caffeine.Most people take blood pressure medications in the form of a pill you swallow every day, but your doctor may give you some antihypertensive medications through an IV (intravenous) in your arm during a hospital stay.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat do blood pressure medications treat?Blood pressure medications treat high blood pressure, or hypertension, with the goal of keeping your heart strong and preventing heart failure, a heart attack, kidney failure or a stroke. High blood pressure makes your heart’s job more difficult and more demanding. Bringing your blood pressure down makes it easier for your heart to keep pumping blood to your essential organs and cells 24 hours a day.How common are antihypertensives?Antihypertensive drugs are very common, as an estimated 1 billion people in the world have high blood pressure. In the United States, about 50% of people aged 20 and older have high blood pressure and might take high blood pressure medication.AdvertisementWhat is the most popular medication for high blood pressure?Healthcare providers have several “first-line” or first-choice blood pressure medications they prescribe. They include:ThiazideACE inhibitors.Calcium channel blockers.Types of blood pressure medicationAdrenergic blockers (including alpha, beta, alpha-beta and peripherally acting blockers)What they do: They keep your body from raising its blood pressure in reaction to stress.Selected blood pressure medication side effects:Fainting.Dizziness.Tiredness.Low heart rate.Angiotensin-converting enzyme (ACE) inhibitorsWhat they do: They keep your body from making angiotensin II (a blood vessel constrictor).Selected blood pressure medication side effects:Cough.High potassium.Dizziness.Angioedema (face and neck swelling); if you have this dangerous reaction, you shouldn’t take an ACE inhibitor drug again.Angiotensin II receptor blockers (ARBs)What they do: They keep angiotensin II from making your blood vessels constrict.Selected blood pressure medication side effects:High potassium.Dizziness.Calcium channel blockers (including dihydropyridines and nondihydropyridines)What they do: They keep calcium out of your blood vessels, which lets the muscle in your blood vessels relax and loosen.Selected blood pressure medication side effects:Headache.Dizziness.Fast or slow heart rate.Lower leg swelling.Centrally acting alpha-agonistsWhat they do: They prevent your nervous system from responding to stress.Selected blood pressure medication side effects:Tiredness.Dry mouth.Slow heart rate.Direct vasodilatorsWhat they do: They make your blood vessels more open.Selected blood pressure medication side effects:Fast heart rate.Headache.Lower leg swelling.Diuretics (including potassium-sparing, loop, thiazide and thiazide-type diuretics)What they do: They help your blood vessels get wider and make your kidneys move extra fluid and salt into your pee.Selected blood pressure medication side effects:High or low levels of magnesium or potassium.Upset stomach.High uric acid levels.Dizziness.AdvertisementRisks / BenefitsWhat are the advantages of antihypertensives?Blood pressure medications help many people lower their high blood pressure and keep their hearts from becoming overworked. They also help people avoid having heart failure, kidney failure, a heart attack or stroke.What are the risks or complications of blood pressure medication?Some older adults have a sudden drop in blood pressure when they stand up (orthostatic hypotension). Antihypertensive medication can make this worse, and older adults can get dizzy and fall, sometimes getting injured. Some antihypertensive medications change your electrolyte levels as you lose extra fluid in your urine. Too high or too low levels of potassium can cause dangerous heart rhythms.Recovery and OutlookWhat is my outlook on blood pressure medication?Many people are successful in controlling their blood pressure with antihypertensive drugs. This helps prevent serious cardiovascular and kidney problems, in combination with a healthy diet and exercise. People who keep their blood pressure in a normal range keep taking their medicine at the same time every day without missing doses. They also keep going to regular checkups with periodic bloodwork to be sure the antihypertensive drugs aren’t causing any problems. It’s also important to follow a good lifestyle, including:Keeping your sodium intake low.Limiting your alcohol use.Getting regular physical activity.Controlling your weight.Why is my blood pressure still high on medication?There are a number of reasons why your blood pressure may still be high when you’re taking blood pressure medication. Reasons why it seems your high blood pressure medication isn’t working include:You may need two, three or four different antihypertensives.You’re not taking them every day.You’re taking multiple drugs, but they work the same way.You’re eating too much salt.A drug you’re taking makes your body retain salt.You’re not taking a diuretic.You may have a condition called secondary “hypertension,” which means high blood pressure caused by a different problem with your body (hyperaldosteronism, pheochromocytoma, renal artery stenosis). If your blood pressure is very high after multiple medications are being used, this is something you should ask your doctor about.Other drugs or herbs may prevent your blood pressure medication from working.Recreational drugs can raise your blood pressure.When to Call the DoctorWhen should I see my healthcare provider?Tell your healthcare provider if you’re having problems with blood pressure medication side effects. They can order a different antihypertensive medication or give you a different amount (dose) of what you’re taking. Also, if your blood pressure readings get too high or too low on your home blood pressure monitor, tell your healthcare provider.Additional Common QuestionsCan you take fish oil with blood pressure medication?Yes, you can. However, you should check your blood pressure regularly because taking both may lower your blood pressure more.Will blood pressure medicine lower my heart rate?Yes, some high blood pressure medications, such as beta-blockers, can lower your heart rate.What blood pressure medications are safe in pregnancy?You can take methyldopa, labetalol or nifedipine during pregnancy, but check with your healthcare provider for their recommendation. Many other antihypertensives aren’t safe for your developing fetus, so be sure to let your healthcare provider know when you plan to become pregnant.What is the first drug of choice for hypertension?First-line (first choice) options include these blood pressure medication names: Thiazide diuretics, calcium channel blockers and ― for people who have kidney disease and heart failure ― angiotensin-converting enzyme (ACE) inhibitors and angiotensin II receptor blockers (ARBs). Beta-blockers may also be first-line choices if you have a history of heart disease.What is the best antihypertensive medication?The best antihypertensive medication is the one that works best for you and your specific situation. Everyone has different health problems. What works well for one person may not work well for another. You may need two or three different antihypertensive agents to bring your blood pressure into the normal range.A note from Cleveland ClinicHigh blood pressure is a very common medical problem. Half the adults in America have high blood pressure. Blood pressure medications are very helpful in controlling high blood pressure. That helps prevent heart failure, heart attack, stroke and kidney failure. Your healthcare provider will work with you to find the antihypertensive medication that’s best for you. Be sure to keep taking it every day and go to all of your regular checkups.Care at Cleveland ClinicResistant Hypertension TreatmentFind a Doctor and SpecialistsMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/29/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicResistant Hypertension TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"