"Blood Stem Cell Donation: What It Is, Process & How It Helps800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Blood Stem Cell DonationAdvertisementAdvertisementAdvertisementBlood Stem Cell DonationBlood stem cell donation is one of the procedures healthcare providers use to obtain blood-forming cells (stem cells) for stem cell (bone marrow) transplant. The process begins when someone agrees to donate stem cells in their blood. Anyone can volunteer to donate bone marrow, but all donors must meet certain health requirements.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookAdditional Common QuestionsOverviewWhat is blood stem cell donation?Blood stem cell donation is the procedure healthcare providers use to obtain healthy blood stem cells for stem cell transplants. Each year, about 18,000 people learn they have a disease, like blood cancer, that a blood stem cell or other stem cell transplant could help to treat. People can donate blood stem cells as part of their own treatment or to help a close family member who needs a stem cell transplant. They also can register to help others by being a blood stem cell donor.How common is blood-stem cell donation?It’s the most common way to donate blood stem cells. Other ways are bone marrow donation and umbilical cord blood donation. In umbilical cord donation, people who are close to giving birth can choose to donate cord blood after they’ve given birth.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy would someone need blood stem cells?People with certain blood cancers or blood disorders may benefit from a blood stem cell transplant. In this treatment, healthcare providers replace damaged blood stem cells in recipients’ bone marrow with healthy ones. The healthy blood stem cells go on to make new red blood cells, white blood cells and platelets. Stem cell transplants are treatment for many conditions, including:Aplastic anemia.Leukemia.Multiple myeloma.Myelodysplastic syndrome. Myeloproliferative disorders.Non-Hodgkin lymphoma.Sickle cell anemia.What makes a good match between donors and recipients?Healthcare providers evaluate test results showing the number of matching human leukocyte antigens (HLA) markers. Antigens are markers that tell your immune system whether something in your body is harmful or safe. High numbers of matching antigens help the donated stem cells to produce new, healthy blood cells and new immune systems.Providers typically first consider the following:Close family members: Any first-degree family member, like biological parents and siblings, may be a match.Unrelated donors: Providers scour registries for unrelated donors with HLA that may be a match.Haploidentical donors: This is a first-degree family member with HLA that match at least half of the recipient’s HLA.Where do healthcare providers find unrelated blood stem cell donors?In the U.S., Be The Match (formerly the National Marrow Donor Program) maintains a registry of qualified stem cell donors, including blood stem cell donors. People join the registry by contacting the program online or through a donor center. You can find a donor center by calling 1.800.MARROW.2. Healthcare providers seeking qualified stem cell donors may also work with international registries like the World Marrow Donor Association. What goes into becoming a blood stem cell donor?The process involves several steps, each designed to ensure safety for donors and recipients. Steps include:Completing a questionnaire about your health history, providing your contact information and signing an agreement to join the registry. The health history is important because people with certain medical conditions can’t donate stem cells.Providing a sample for HLA typing. The test involves swabbing the inside of your cheek with a cotton swab to obtain a tissue sample. You can choose to go to a donor center or request a mail-in kit. Registry medical professionals analyze your sample to determine your HLA type and then add that information to the registry. The program team will contact you if your HLA type is a close match.Providing a blood sample if there’s a close match so the transplant center team can confirm the match and decide if a blood stem cell transplant is appropriate.Meeting with a counselor to review blood stem cell donation requirements, procedure and risks, and then signing an informed consent document. Signing the document means that you understand and accept the risks of donating blood stem cells.Having a physical examination and blood tests to confirm you don’t have medical conditions that would prevent you from donating blood stem cells. If you didn’t go to a donor center for HLA testing, the registry team will identify a local donor center where you’ll have your physical examination and blood tests.What factors disqualify potential donors?The main factors are age and health history. In the U.S., only people ages 18 to 40 can register with Be the Match as potential donors. Transplant organizations set this age limit because many people develop medical conditions as they grow older that could disqualify them as donors. Medical conditions that disqualify potential donors include:HIV/AIDs.Severe arthritis such as rheumatoid arthritis.Autoimmune diseases that affect your whole body.Bleeding disorders or conditions such as hemophilia or deep vein thrombosis.Brain injury.Cancer: People who had chemotherapy or radiation therapy or who had cancer treatment within the past five years may not be able to donate blood stem cells. Chronic hip, back or spine pain for which you’re receiving medication. Chronic Lyme disease.Diabetes: If you need insulin for your diabetes, you can’t donate.Heart disease, specifically a history of heart attack, angioplasty, bypass surgery, heart valve replacement surgery or pacemaker.Hepatitis B or Hepatitis C.Kidney disease.This list represents just a few of the conditions and reasons why you may not be able to donate blood stem cells. If you want to donate but aren’t sure you’ll qualify, talk to a healthcare provider. They can review the medical guidelines and your health history.AdvertisementProcedure DetailsWhat happens before the blood stem cell donation process?If you’re a match, the donor center team will schedule days and times for the procedure. Blood stem cell donation typically takes four to six hours daily. It can take three to four days to collect enough stem cells for transplant.As you’re making plans, ask the donor center team if you should arrange for someone to bring you to your appointment and take you home. And you may want to bring a favorite pillow, reading material or games on your phone or tablet.About 30 days before the donation, you’ll go through a final round of tests to confirm nothing’s changed since you joined the registry. The follow-up tests are done because it can be months or even years before there’s a match. Tests may include a chest X-ray, an electrocardiogram and the following blood tests:Complete blood count (CBC).Comprehensive metabolic panel.Infectious disease tests.Pregnancy test for women and people assigned female at birth.Assuming you’re in good health and able to donate blood stem cells, you’ll receive a series of injections with a medication called Filgrastim that stimulates your bone marrow to grow and release blood stem cells into your blood. Most people receive one injection a day for four to five days before donation. Filgrastim injections can cause some side effects, including:Bone pain.Headaches.Mild fever.Nausea.Trouble sleeping.Filgrastim side effects typically go away soon after you finish injections. In the meantime, over-the-counter painkillers like acetaminophen or ibuprofen will help with headaches, pain and fever. Talk to your healthcare providers at the donor center for ways to manage nausea and sleep issues.Are there restrictions on what I can eat or drink before donating stem cells?No, but it’s a good idea to drink lots of fluid for a few days before the actual donation procedure. Remember to eat breakfast on the morning of your appointment.What happens during the process?Providers may refer to this as “harvesting” the cells. To donate stem cells:You’ll sit in a comfortable chair or on a bed.Your providers will insert a needle into a vein in each of your arms.The needle connects to a catheter, which is a thin, flexible tube that carries blood to a machine that collects stem cells from your blood.Once the machine has collected stem cells, the catheter in your other arm returns your blood.The donated stem cells are collected in a bag and stored for the recipient’s use.Does the procedure cause side effects?It can, but they’re rarely serious. For example, blood being returned from the machine contains an anticoagulant. The anticoagulant may affect your calcium levels, causing muscle cramps or making you feel lightheaded or tingly. Your donor team may give you a calcium supplement.AdvertisementWhat happens after the process?For most people, blood stem cell donation takes place over a few days. You’ll be able to return to work or go about your day after each donation session is done.Risks / BenefitsWhat are the risks and benefits of donating blood stem cells?The main benefit is being able to help someone who needs a stem cell transplant. That person may be your sibling or other close family member. They may be someone you know or someone you’ve never met. Regardless, by donating stem cells, you’re giving that person a chance to overcome a serious illness. There are very few risks to donating blood stem cells. It doesn’t increase the risk of a blood issue or cancer.Recovery and OutlookHow long does it take to recover from donating blood stem cells?For most people, recovery happens as soon as they finish donating blood stem cells. For example, Filgrastim side effects typically go away once the donation process is complete. But be sure to contact the care team at the donation center if you have questions or concerns.Additional Common QuestionsDo blood stem cell donors and recipients ever meet?They may, but only if both parties agree to a meeting. Healthcare and transplant organizations that coordinate donations also facilitate donor and recipient meetings.A note from Cleveland ClinicDonating blood stem cells could make a life-changing difference for someone with blood cancer or a blood disorder. That may sound dramatic, but it’s true. The blood stem cell donation process takes time and commitment. But it could be time well spent if there’s a match between you and someone who needs a stem cell transplant. To learn more, talk to a healthcare provider or contact Be The Match the National Marrow Donation Program at 1.800.MARROW.2.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/17/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"