"Blood Types: What They Are and Mean for Your Health800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Blood TypesAdvertisementAdvertisementAdvertisementBlood TypesAll blood does the same thing, but not all blood is the same. Blood types classify blood so healthcare providers can determine whether one person’s blood is compatible with another’s. Blood transfusions and organ transplants depend on donors and recipients having compatible blood types. Blood types include A, B, AB and O.ContentsArrow DownOverviewAdditional DetailsContentsArrow DownOverviewAdditional DetailsOverviewHow common are blood types: A breakdown of total population and ethnicity.What are blood types?A blood type is a classification system that allows healthcare providers to determine whether your blood is compatible or incompatible with someone else’s blood. There are four main blood types: A, B, AB and O. Blood bank specialists determine your blood type based on whether you have antigen A or B on your red blood cells. They also look for a protein called the Rh factor. They classify your blood type as positive (+) if you have this protein and negative (-) if you don’t.This makes for eight common blood types:A positive (A+).A negative (A-).B positive (B+).B negative (B-).AB positive (AB+).AB negative (AB-).O positive (O+).O negative (O-).Knowing about blood types allows healthcare providers to safely transfuse donated blood from one person into another during a blood transfusion. Blood types also need to be compatible for organ transplants.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow do blood types get determined?Blood bank specialists determine blood types based on whether there are particular antigens on your red blood cells. An antigen is a substance that can make your body’s immune system react. Think of an antigen as a marker (like a nametag) that identifies a substance in your body as belonging or not belonging.Your blood type is compatible with someone else’s if your immune system recognizes the antigens in donated blood as belonging.What blood types meanMost people think of A, B, AB and O when they hear the phrase “blood types.” These letters classify blood types based on whether red blood cells have the A antigen or B antigen. This is called the ABO system.Type A: Red blood cells have the A antigen.Type B: Red blood cells have the B antigen.Type AB: Red blood cells have both A and B antigens.Type O: Red blood cells have neither A nor B antigens.Blood types are either “positive” or “negative,” depending on the absence or presence of the Rh factor’s D antigen, another marker. This is called the Rh system. Being RhD positive is more common than being RhD negative.Positive (+): Red blood cells have the RhD antigen.Negative (-): Red blood cells don’t have the RhD antigen.What are the different blood types?There are eight blood types included in the ABO and Rh blood group systems: A positive (A+), A negative (A-), B positive (B+), B negative (B-), AB positive (AB+), AB negative (AB-), O positive (O+), O negative (O-).The most common blood type in the United States is O positive (O+).The least common blood type in the U.S. is AB negative (AB-).Rare blood typesOutside of the ABO system, there are over 600 antigens that may attach to red blood cells. There are more than 30 different blood group systems related to these unique antigens. Other blood group systems include the:Duffy blood group.K antigen (or Kell) group.Lutheran blood group.Kidd blood group.These blood groups are rare. A general definition of a rare blood type is one that happens at a rate of 1 per 1,000 people or fewer.One of the world’s rarest blood types is Rh-null. Fewer than 50 people in the world have this blood type. It’s so rare that it’s sometimes called “golden blood.”AdvertisementHow are blood types inherited?You inherit your blood type the same way you inherit your eye color — from your biological parents. Both the ABO genes and the Rh factors come from your parents. Due to the many possible combinations, you might not have the exact same blood type as your parents.Which blood types are compatible?An important part of blood donation is ensuring that someone receiving blood (recipient) has a compatible blood type with someone donating blood (donor). If you receive blood from a donor whose blood cells contain antigens your body doesn’t recognize, your immune system may attack the donated red blood cells. The results could be life-threatening.Your blood type allows providers to determine which blood types are safe for you to receive. It helps them know which recipients can safely receive blood that you donate.A positive: You can receive blood that’s A positive, A negative, O positive or O negative.A negative: You can receive blood that’s A negative or O negative.B positive: You can receive blood that’s B positive, B negative, O positive or O negative.B negative: You can receive blood that’s B negative or O negative.AB positive: You can receive any blood type.AB negative: You can receive blood that’s AB negative, A negative, B negative or O negative.O positive: You can receive blood that’s O positive or O negative.O negative: You can only receive blood that’s O negative.Blood typeBlood types you can recieveBlood types you can donate toA+A+, A-, O+, O-A+, AB+A-A-, O-A-, A+, AB-, AB+B+B+, B-, O+, O-B+, AB+B-B-, O-B-, B+ AB+, AB-AB+All blood types (universal recipient)AB+AB-AB-, A-, B-, O-AB-, AB+O+O+, O-O+, A+, B+, AB+O-O-All blood types (universal donor)Blood typeBlood typeA+Blood types you can recieveA+, A-, O+, O-Blood types you can donate toA+, AB+A-Blood types you can recieveA-, O-Blood types you can donate toA-, A+, AB-, AB+B+Blood types you can recieveB+, B-, O+, O-Blood types you can donate toB+, AB+B-Blood types you can recieveB-, O-Blood types you can donate toB-, B+ AB+, AB-AB+Blood types you can recieveAll blood types (universal recipient)Blood types you can donate toAB+AB-Blood types you can recieveAB-, A-, B-, O-Blood types you can donate toAB-, AB+O+Blood types you can recieveO+, O-Blood types you can donate toO+, A+, B+, AB+O-Blood types you can recieveO-Blood types you can donate toAll blood types (universal donor)Note that this assumes that all of the less common Non-ABO blood group antigen systems are also compatible.Universal donorBlood type O negative (O-) is the universal donor. This means that a person with any other blood type can safely receive your blood. It doesn’t contain any antigen markers that other blood types recognize as not belonging. Providers use type O negative blood the most in emergencies when someone needs blood fast.Providers look at different markers to determine blood type compatibility for donating plasma. Plasma is the liquid part of blood. The universal plasma donor is type AB.Universal recipientBlood type AB positive (AB+) is the universal recipient. You can safely receive blood from any other blood type. Your blood recognizes all potential antigens as safe, so your immune system doesn’t launch an attack.AdvertisementHow can you find out your blood type?You can ask your physician. They might have your blood type on record. Another way, which would be helpful to you and others, is to volunteer to donate blood if you’re eligible. You can also buy at-home blood test kits to determine your blood type.Blood bank specialists use blood typing to determine what antigens you have on your red blood cells. They mix your blood sample with antibodies that attack antigens A or B. An antibody is a protein in your body that attacks substances that don’t belong, like unfamiliar antigens.Additional DetailsYou can safely receive blood from donors with compatible blood types.How does blood type affect pregnancy?A fetus may inherit its Rh factor (either positive or negative) from either parent. There may be problems if you’re Rh negative and carrying a fetus with blood that’s Rh positive.During your first visit to your obstetrician, you’ll take a blood test to determine your blood type and screen for antibodies. If your body reacts to Rh-positive red blood cells, your anti-Rh antibodies can begin to attack the fetus’s red blood cells.To prevent this from happening, you’ll receive Rh immunoglobulin (RhIg). RhIg is a medicine that blocks antibodies from attacking the fetus’s blood.Can your blood type change?Usually, you’ll have the same blood type all of your life. In rare cases, however, blood types can change. The change usually relates to unique circumstances, such as having a bone marrow transplant or getting certain types of leukemia or infections. Not all of these changes in blood type are permanent.A note from Cleveland ClinicIt’s useful to know your blood type. If you’re ever in a position where you need a blood transfusion, determining your blood type will be an essential first step. Knowing which blood types are compatible with yours allows your provider to keep you safe should you ever need blood. The good news is that you don’t need to understand all the microscopic cell markers that come into play to safely donate or receive blood. The blood collection centers of the American Red Cross and local hospital blood bank specialists have controls and safeguards in place to ensure the safety of the blood donation process.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/14/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"