"Donating Blood800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Blood DonationAdvertisementAdvertisementAdvertisementBlood DonationPatients who need blood the most, such as people with cancer, heart surgery, and accident victims, benefit when you donate blood.  One pint of donated blood can save up to three lives. Blood donations are always needed.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewWhy donate blood?Blood is essential for life. It contains components that transport oxygen throughout the body and also fight infection. There is no man-made substitute for blood. It is only made in the body. Many patients depend on life-saving transfusions for a number of medical conditions, such as surgery and cancer treatments.A healthy body can regenerate, or make more, blood in about 4 to 6 weeks. Donating one pint is a small amount of the body’s total blood supply. Typically, there are about 10 to 12 pints of blood in a person’s body.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho can donate blood?You must be at least 17 years old in Florida (or at least 16 years old with parental/guardian consent in Ohio and some other states), weigh 110 pounds or more, and be in good health. If you have a cold or the flu on the day you are scheduled to give blood, you should cancel your appointment and reschedule once you are feeling better.There are some health concerns that can temporarily prevent you from giving blood, such as:Some medicationsLow levels of hemoglobin (the protein in your body that carries oxygen to cells and carbon dioxide away). If hemoglobin is low, you might have low levels of red blood cells (a condition called anemia).High or low blood pressure or heartbeatRecent travel to a country with malaria risksRecent blood transfusionPregnancyNew tattoos (only in some states). In Ohio and Florida, for example, you don’t need to wait if the tattoo was applied at a state-regulated establishment.Other health concerns will permanently prevent you from giving blood, such as:HIV/AIDSCertain types of hepatitisForeign travel to certain places during certain time framesProcedure DetailsWhat happens during blood donation?Donating blood is generally simple and quick. It takes a total of about one hour of your time. Although the actual donation time is about 10 minutes, there are some items that need to be taken care of before and after the donation process.When you arrive to donate blood, you need to show an ID, such as a driver’s license or passport. You then are asked several health questions, including what types of medication you are taking, both prescription and over-the-counter. The questions are personal. It is very important that you read all of the information carefully and answer all of the questions honestly. The answers are kept confidential.A quick exam also takes place to ensure that you are healthy enough to give blood. A nurse or technician takes your temperature, blood pressure and pulse. The technician also takes a small sample of your blood with a finger stick to make sure your hemoglobin is not low.During the actual blood donation, you are either lying down or sitting in a chair. First, the area inside of your elbow is cleaned with antiseptic. Next, the technician inserts a needle into a vein in your arm and draws a pint of blood out of your body. It is not usually painful, but you will feel a prick when the needle goes through your skin.Afterwards, you are given a small snack and something to drink. You are asked to remain seated for about 15 minutes to make sure there are no side effects or problems. You can leave after you have rested and are sent home with instructions to take it easy, drink plenty of water, and avoid strenuous exercise for the next day or so.AdvertisementWhat does blood donation feel like?Most people describe only feeling the needle pricking the skin as it enters, without other discomfort. Very few donors have other issues during or after donating.After giving blood, some people may feel a little dizzy or weak. That is why it is important that you rest for several minutes before leaving. It is also best to eat a snack and have a drink of water or juice right after you donate blood.What happens to the donated blood?The donation is tested for blood type and for certain infectious diseases, but you should never donate blood for the purpose of getting tested for infectious diseases, you should see your doctor for that instead. Each pint of donated blood goes through some laboratory tests for infectious diseases before it can be used for patient care. If it does not pass these tests, the blood cannot be used and is safely thrown away. The donor will be notified when this happens.The blood then goes to the lab where it is tested for blood type and the red blood cells, platelets, and plasma are separated. The blood is usually available for patient use about 1 to 2 days after collection.AdvertisementWho uses donated blood?Volunteer blood donations will go to patients who need blood the most. Typical recipients are those patients going through:Cancer treatmentHeart or orthopedic surgeryOrgan transplant surgerySurgery after accidentsYou can also donate blood for use by a family member or friend who has the same blood type as you. This is called a directed donation.Sometimes, a healthy person can donate blood prior to a non-emergency surgery. This blood is stored and available for surgery only for the person who donated it. This is especially helpful for patients who are difficult to find blood for because of antibodies. This is called an autologous donation.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentRisks / BenefitsWhat are the advantages of blood donation?Donating blood can save someone’s life. In fact, one pint of your blood can save up to three lives. There is always a need for blood. It is used every hour of every day at hospitals during surgeries and treatment of injuries and chronic illnesses in patients of all ages.What are the side effects and risks of blood donation?Most donors do not experience discomfort after donating. You may feel lightheaded, tired, or dizzy after giving blood, so you should not plan to do anything strenuous after donating. The place where you donate blood will give you information afterwards on how to care for your bandage and other instructions.Sterile materials are used and discarded safely after one-time use on the donor. This is for the safety of the person who receives the blood, as well as the safety of the donor, and the staff collecting the blood.Recovery and OutlookWhat happens after a blood donation?After donating blood, you will be able to return to your regular routine soon. It is best to follow the donation center’s instructions after your donation. It is also important to immediately let the donation center know if you think of health information that you did not inform them of previously, or if you develop other issues such as fever, muscle aches and others, according to their instruction sheet. If you are a regular donor, talk with your doctor about adding multivitamins to your diet to make sure that you are not depleting your iron and other vitamins when giving blood.How often can I donate blood?Because a healthy body continues to make blood, new red blood cells will replace those that were donated in approximately four to six weeks. It is safe to donate whole blood every 56 days, but may be sooner or longer depending on the type of blood component that is donated.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/05/2019.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementQuestions 216.444.2538Appointments & LocationsRequest an AppointmentFind a Primary Care ProviderFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"