"Body Contouring: What Is It, Benefits, Risks & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Body ContouringAdvertisementAdvertisementAdvertisementBody ContouringBody contouring, or body sculpting, can eliminate fat, shape areas of the body and tighten skin. Lipolysis is a nonsurgical option that uses cold, heat, lasers and other methods. Surgical options include tucks, lifts and liposuction. Surgery has more risks and longer recovery, but it usually provides more noticeable results.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is body contouring?Body contouring, or body sculpting, is a medical or surgical procedure that aims to reshape an area of the body. It may involve procedures to:Get rid of extra skin.Eliminate excess fat.Reshape or contour the area.Body contouring does not usually help you lose weight. Instead, it helps shape the body and address specific areas where weight loss isn’t effective or after significant weight loss results in extra skin.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the different types of body contouring?Nonsurgical body contouring is called lipolysis. There are several lipolysis methods:Cryolipolysis uses very cold temperatures to destroy fat cells (for example, CoolSculpting®).Injection lipolysis involves putting deoxycholic acid into the body to target fat cells.Laser lipolysis uses lasers to destroy fat cells (for example, Zerona®).Radiofrequency lipolysis uses ultrasound waves and heat to target fat cells (for example, truSculpt®).Sometimes, the results can vary.Options for surgical body contouring include:Lifts and tucks: These surgical procedures remove excess fat and extra skin. Examples include a tummy tuck (abdominoplasty), facelift (rhytidectomy), breast lift (mastopexy) and double chin surgery.Liposuction: Liposuction (lipo) suctions out fat deposits.Why is body sculpting used?People choose to have body sculpting to look and feel thinner or to attain a certain shape. It’s often used on specific areas of the body when diet and exercise aren’t making a difference.Surgical options can also remove extra skin to make the skin look smoother and younger. Such procedures can help people who have excess skin after significant weight loss. It can also improve loose, saggy or wrinkled skin that occurs with natural aging.Body contouring can target most areas of the body. Common sites include:Arms.Back.Belly and flanks (love handles).Buttocks.Neck and chin.Thighs.AdvertisementProcedure DetailsWhat happens before body contouring?First, you’ll meet with a plastic surgeon. You’ll discuss:Your goals.Your medical history, including health conditions, allergies and previous surgeries.Any medications you’re taking, including vitamins and over-the-counter drugs.Use of alcohol, tobacco or illegal drugs.The healthcare professional will also:Examine and measure the area(s) you want to change.Draw on the area(s) with a marker or pen.Take pictures.Discuss your options and make recommendations.Review the risks and options, as well as discuss anesthesia and post-operative pain control if you’re considering surgery.If you decide to move forward, you’ll have to sign a consent form. By signing it, you give permission to the healthcare provider to perform the procedure. You also agree that you understand the risks of the procedure and have realistic expectations.Depending on what kind of body sculpting you choose, the healthcare team may ask you to:Get blood work or have a physical exam with your primary care provider.Stop smoking.Stop taking certain medications (for example, aspirin, NSAIDs and herbal supplements).What happens during liposuction and other surgical body contouring?Most cosmetic surgeries take place in a surgeon’s office, surgical center or hospital. The procedure can last 45 minutes to a several hours, depending on what you’re having done.For surgical procedures, the team may:Mark the sites pre-operativelyPosition you on a surgical table and do safety checks with nursing and anesthesia.Administer anesthesia — local or general — based on the procedure.Clean and prepare the skin in the surgical area.Make incisions (cuts) in your skin — these are based on the procedure(s) performed.Cut, reposition or shape tissue and excess fat to create the look you want.Tightening muscles during abdominoplasty is common.Trim excess skin.Suction out excess fat using liposuction by itself or in combination with other procedures.Close any incisions when the procedure is complete.Apply bandages.AdvertisementWhat happens during non-surgical lipolysis?Most lipolysis procedures take place in an office or clinic. One session takes about 30 to 60 minutes.The team may:Give you a robe or hospital gown to wear.Position you on a chair or table.Mark the skin with a pen or marker.Inject a drug in the area where you want to reduce fat (for injection lipolysis).Use a tool (such as paddles or a wand) to deliver ultrasound waves, laser beams, cold or heat, depending on the type of lipolysis.Most people need several treatment sessions to see results.What happens after body contouring?Most people go home the same day, even after surgical procedures. If you have surgery, you should have someone drive you home and stay with you the first night. And you may have a thin tube near one or more incisions to drain fluid and prevent swelling.Your surgical team will give you recovery instructions. They may include:Caring for the drains and changing the bandages.Minding over-activity, but ambulating (moving around) to avoid blood clots.Reporting any complications — these will be explained pre-operatively.Staying out of the sun.Using medications (for example, ointments or pills) to control pain or prevent infection.For nonsurgical body sculpting, you will leave the office or clinic immediately after the procedure. You usually won’t need a ride home, and you can go about your day normally.Care at Cleveland ClinicPlastic Surgery CareMake an AppointmentRisks / BenefitsWhat are the advantages of body sculpting?Many people who have body contouring report:More defined, well-shaped body parts.Younger, thinner appearance.Smoother skin.Symptomatic improvement.Results from surgery are more noticeable and immediate. With nonsurgical options, it may take a few weeks or months to see a difference.What are the risks or complications of surgery?Any procedures — such as lifts and tucks — are surgeries and therefore come with certain risks, although relatively uncommon. Risks can include:Asymmetry (both sides don’t look the same).Bleeding or blood clots.Complications from anesthesia, such as nausea, vomiting or trouble waking up.Damage to nerves, blood vessels, muscles or organs.Hair loss near incisions.Hematoma (a pocket of blood under the skin), which may have to be drained.Incisions that don’t heal properly.Infection.Nerve injury that could cause weakness, numbness or changes in the way skin feels.Pain or swelling that lasts longer than expected.Problems with the heart or lungs.Results you don’t like, which could require follow-up surgery.Scarring, rippling or discoloration of the skin.Skin irregularities and discoloration.With nonsurgical options, risks are much more limited and include:Hives or rash.Pain or soreness.Red skin.Swelling.Unsatisfactory results and need for repeat sessions.Recovery and OutlookWhat is the recovery time after body contouring?Recovery from surgical options can take weeks to months, depending on how much work is done and how large the incisions are.Nonsurgical options have much shorter recovery times. Most people go back to work and other activities immediately after the treatment.When to Call the DoctorWhen should I see my healthcare provider?Nonsurgical procedures carry very little risk, so you likely won’t have to watch out for complications.If you have a surgical procedure, you should report the following signs of infection or other complications:Bleeding, drainage, redness or swelling at the incision site.Chest pain.Dizziness.Fever higher than 100.5 degrees Fahrenheit.Severe pain not helped with medicine.Nausea or vomiting.A note from Cleveland ClinicBody contouring can help eliminate fat and shape areas of the body when diet and exercise aren’t working. Being at your ideal weight improves quality of the results with lower complications. Lipolysis is a nonsurgical procedure, and liposuction is a surgical way to remove fat. Other body sculpting procedures, such as skin excision, can tighten and smooth any loose or wrinkled skin. Talk to your healthcare provider about your options and their risks.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/04/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPlastic Surgery CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"