"Bone Marrow Aspiration: Definition, Purpose & Procedure800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Bone Marrow AspirationAdvertisementAdvertisementAdvertisementBone Marrow AspirationA bone marrow aspiration is a procedure to take a sample of the liquid part of your bone marrow. Your bone marrow is the spongy tissue inside of your bones that produces blood cells. Your healthcare provider may recommend this procedure to check your blood cell levels. Or they may use aspiration to check if cancer cells have spread to your bones.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is bone marrow aspiration?Bone marrow aspiration is a procedure to remove a small amount of bone marrow. Bone marrow is the spongy tissue inside of your bones that creates blood cells. During a bone marrow aspiration, your healthcare provider uses a needle to take a small sample of the liquid part of your bone marrow.Your healthcare provider may order a bone marrow aspiration to evaluate your red blood cells (RBCs), white blood cells (WBCs) and platelets. Sometimes, your healthcare provider uses a bone marrow aspiration along with a bone marrow biopsy.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is the difference between aspiration and biopsy?Both aspirations and biopsies are procedures to test your bone marrow. An aspiration takes a sample of the liquid part of your bone marrow. A biopsy takes a sample of the solid, spongy part of your bone marrow.Why might I have a bone marrow aspiration?You may have a bone marrow aspiration to identify or diagnose conditions related to your bone marrow. Or you may have bone marrow aspiration if a blood test showed irregular levels of RBCs, WBCs or platelets.Some of the conditions that can affect your bone marrow include:Anemia.Hemochromatosis (iron overload).Leukemia.Myelodysplastic syndrome.Aplastic anemia.Leukopenia, a condition that causes low white blood cell count.Lymphoma, including adult Hodgkin’s lymphoma and adult non-Hodgkin’s lymphoma.Myelofibrosis.Tuberculosis.Your healthcare provider may use bone marrow aspiration during cancer treatment. Bone marrow aspiration can tell your doctor if cancer has spread (metastasized) to your bones. It also can be used to help monitor blood cancers.In some cases, your healthcare provider may use an aspiration to check the health of your bone marrow before or after treatment such as a bone marrow transplant.AdvertisementWho performs a bone marrow aspiration?Often, a specially trained technician or healthcare provider performs a bone marrow aspiration. An oncologist (cancer doctor) or hematologist (blood disease doctor) may also perform a bone marrow aspiration.Procedure DetailsWhat happens before a bone marrow aspiration?Most people can continue eating and drinking as usual before bone marrow aspiration. Tell your healthcare provider about all the medications and supplements you take. You may need to stop taking certain medications, such as blood thinners, for a period before the procedure.AdvertisementWhat happens during a bone marrow aspiration?Usually, your healthcare provider takes the bone marrow sample from your pelvis (hip bone). They insert a needle through an area in your lower back, close to your hip.Immediately before a bone marrow aspiration, your healthcare provider gives you an injection with a numbing medication, so you don’t feel anything during the procedure. Your healthcare provider may also use sedation, where you stay awake but in a relaxed state.During the aspiration, you lie on your stomach or side on an exam table. Then the technician or doctor:Inserts a hollow needle into your pelvic bone.Attaches a syringe to the needle to withdraw a sample of bone marrow liquid.Removes the needle and syringe.Places a bandage over the area to prevent infection and promote healing.What happens after a bone marrow aspiration?You’ll return home the same day of a bone marrow aspiration. Depending on the type of anesthesia your healthcare provider used, you may need to wait at their office for the effects to wear off. Someone needs to drive you home after the procedure.Risks / BenefitsWhat are the advantages of a bone marrow aspiration?A bone marrow aspiration tells your healthcare provider whether your bone marrow is producing healthy amounts of blood cells. It can also guide your healthcare provider during cancer treatment.What are the risks of a bone marrow aspiration?Bone marrow aspirations are typically safe. There’s some risk of:Allergic reaction to anesthesia.Bleeding.Infection.Most people don’t have complications from a bone marrow aspiration. You may have a higher risk of complications if you have a condition that has weakened your immune system, such as an autoimmune disease or HIV/AIDS, but it’s still uncommon.Recovery and OutlookWhat can I expect after a bone marrow aspiration?After a bone marrow aspiration, you’ll need to keep the area around your bandage clean and dry for at least 24 hours. Your medical team will tell you when you can remove the bandage.Most people feel some pain around where the needle was inserted for a few days. You may feel back pain when you bend over or pain that extends down the back of your leg. Many people also develop mild bruising on their lower back or buttocks in the first week after a bone marrow aspiration.When to Call the DoctorWhen should I see my healthcare provider?After a bone marrow aspiration, call your healthcare provider right away if you have a fever or any symptoms around the needle insertion site, such as:Discharge.Excessive bleeding.Swelling.Warmth.Additional Common QuestionsWhat if a bone marrow test is positive?Bone marrow tests aren’t positive or negative. When your healthcare provider tests a bone marrow sample, they may assess it for:Blood cell counts.Cancer cells.Signs of infection.If your healthcare provider finds any signs of health problems, they’ll discuss treatment and next steps with you.A note from Cleveland ClinicBone marrow aspiration is a procedure to take a sample of the liquid part of your bone marrow. Your healthcare provider may use a bone marrow aspiration to see if your blood cell counts are within a typical range. Or they may use an aspiration to check if cancer cells have spread to your bones. A bone marrow aspiration uses a long, hollow needle, usually inserted into your pelvic bone. You return home the same day.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/18/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"