"Botox Injections: Treatment, Recovery & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Botox (Botulinum Toxin)AdvertisementAdvertisementAdvertisementBotox (Botulinum Toxin)Botox® injections improve appearance by relaxing muscles that cause wrinkles. These injections also treat medical conditions, including migraines, hyperhidrosis, overactive bladder and eye problems. To maintain results, treatments should be repeated every three to six months.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is Botox®?Botox® is one of the most widely known brands of botulinum toxin injections. Botulinum toxins are neurotoxins that affect nerves and cause muscle weakening. You might get a botulinum toxin injection for cosmetic or medical reasons. Healthcare providers inject small amounts of Botox into specific muscles to smooth wrinkles, prevent migraine headaches and treat a wide range of other health conditions.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow does Botox work?Botox blocks nerve signals to muscles. As a result, injected muscles can’t contract (tense up). These effects are always temporary, but can last for several months. The muscle injected depends on the primary area of concern. Several areas can be treated in one session.What cosmetic conditions can be treated with Botox?Botox cosmetic injections are used to address signs of aging. This treatment can smooth fine lines and wrinkles in several areas of your face, including your:Eyebrows.Forehead.Nose.Eyes (crow’s feet).Lips.Chin.Jawline.Neck.AdvertisementWhat medical conditions can be treated with Botox?Botox has been used for decades in the medical industry. These injections may be recommended for the treatment of:Crossed eyes (strabismus).Excessive muscle contractions (dystonia).Excessive sweating (hyperhidrosis).Eyelid twitching.Chronic migraines.Overactive bladder.Pediatric upper limb spasticity.Adult spasticity.Blepharospasm.Cervical dystonia.Can Botox help reduce pain?Yes. Many healthcare providers recommend Botox for pain management. Botox blocks nerve signals that control muscle activity, resulting in relaxation and pain relief. Botox injections can be successful in treating:Back pain.Neck pain.Jaw pain.Nerve pain.Sciatica pain.Neuropathy (peripheral neuropathy).Pelvic pain.Chronic myofascial pain (CMP).Osteoarthritis.Joint pain.TMJ pain.AdvertisementWhat is Botox made of?A bacterium called Clostridium botulinum makes the neurotoxins used in Botox. Healthcare providers use a specific type of the bacteria (type A) for medical injections.Botulinum toxins occur naturally in soil and contaminated foods. If you consume large amounts of botulinum toxins or the bacteria get into a wound, you can develop botulism. This serious nervous system disorder affects breathing. For optimal safety and efficacy, Botox is produced in a lab. Technicians dilute and sterilize the botulinum toxins so they won’t cause botulism.Is Botox safe?Botox is generally safe when administered by a licensed healthcare provider. Ask your medical team if Botox injections are right for you.Procedure DetailsHow should I prepare for Botox?Make sure your healthcare provider has a current list of the medications and supplements you take. Certain medications increase the risk of bruising at the injection site. These include anticoagulants or blood thinners (Warfarin®) and nonsteroidal anti-inflammatory drugs (NSAIDs). Alcohol also makes you more prone to redness and bruising. Don’t drink for 24 hours before a procedure.What should I expect during Botox treatment?Your healthcare provider uses a fine needle to inject small amounts of Botox into the treatment area. Depending on the issue, you may receive several injections in different spots. Here’s what else you need to know about Botox therapy:Botox is an outpatient procedure. You’ll be able to go home the same day.Discomfort is usually mild. The injections may sting and feel uncomfortable, but the procedure is over quickly. Your healthcare provider might apply a topical numbing agent to your skin before giving injections.You may be given anesthesia. If you’re receiving injections for an overactive bladder, you may receive local or regional anesthesia.What should I know about Botox aftercare?Unless your healthcare provider says otherwise, you can return to work and most activities immediately after treatment. To reduce redness, swelling or bruising:Don’t rub or put pressure on the treatment area for 12 hours.Stay upright (don’t lie down) for three to four hours.Avoid physical exertion for 24 hours.How often should you get Botox?On average, the effects of Botox last about three to four months. Retreatment is recommended at this time. Eventually, however, your muscles may train themselves to contract less. As a result, treatments can be spaced out over longer periods of time. Your healthcare provider can let you know how often you should get Botox based on your unique needs.Care at Cleveland ClinicPlastic Surgery CareMake an AppointmentRisks / BenefitsAre there any Botox side effects?Side effects from botulinum toxin injections vary depending on the area receiving treatment. Most issues are mild and improve in a day or two. Possible Botox side effects include:Pain, swelling, redness or bruising at the treatment site.Flu-like symptoms.Headache.Neck pain.Upset stomach (indigestion).Temporary drooping eyelids (ptosis).Eye irritation or redness.Who should not get Botox injections?Botox injections are relatively safe. Still, you shouldn’t get this treatment if you’re pregnant, breastfeeding or have:Neuromuscular disease.Drooping eyelids (ptosis).Weak facial muscles.Recovery and OutlookHow long does it take for Botox to work?After Botox treatment, most people notice the desired effects around the third or fourth day. Full results will be visible within 10 to 14 days.How long does Botox last?Within three to six months after Botox therapy, toxins wear off and muscles regain movement. As a result, wrinkles return and issues like migraines and sweating may resume. To maintain results, you may choose to receive more Botox injections. Your healthcare provider can let you know how often to undergo Botox treatment.When to Call the DoctorWhen should I call my healthcare provider?Botox is a common procedure that’s rarely accompanied by serious side effects. However, you should call your healthcare provider immediately if you experience:Vision problems, including blurred vision or drooping eyelids.Signs of urinary tract infection, such as blood in your urine (hematuria).Shortness of breath (dyspnea).Trouble swallowing.Slurred speech.Numbness or paralysis in an untreated area.Severe stomach upset.Additional Common QuestionsHow does Botox for migraines work?Botox injections are U.S. Food and Drug Administration (FDA)-approved for the treatment of chronic migraines. This therapy works best for people who experience headaches at least 15 days out of every month.To ease migraine symptoms, Botox is injected into the treatment area. The medication enters your nerve endings, thereby blocking the chemicals that signal pain transmission.In general, Botox for migraines works better with every additional treatment. Most people report satisfactory results after the second or third session.Does Botox hurt?The needles used for Botox injections are extremely small. As a result, most people experience little to no discomfort during treatment. Some individuals describe a slight pinching or stinging sensation. If you’re worried about pain, your healthcare provider can apply a topical numbing gel.Can you get Botox while pregnant?Botox injections aren’t likely to harm your baby. Still, most healthcare providers recommend waiting until after you’ve given birth to undergo treatment.Can you get Botox while breastfeeding?Experts aren’t sure whether or not Botox ends up in breast milk. To ensure the safety of your baby, most healthcare providers advise against getting Botox injections while breastfeeding.Are there other types of botulinum toxins?There are different brand names for botulinum toxin injections. Not all products treat the same problems. Your healthcare provider can discuss the best option for your unique situation. In addition to Botox, options include:Dysport® (AbobotulinumtoxinA).Xeomin® (IncobotulinumtoxinA).Jeauveau® (PrabotulinumtoxinA).What should I know about Dysport vs. Botox?Dysport and Botox are both injections made from botulinum toxins. The main difference is the potency of trace proteins found in these medications. As a result, Dysport may offer faster outcomes, but Botox may last longer. If you’re trying to decide which treatment option is right for you, talk to your healthcare provider.Does insurance cover Botox?Health insurance policies vary, so always check with your insurance provider. Most health insurers cover treatments for migraines, urinary incontinence or other medical conditions. Insurers don’t typically cover Botox injections for cosmetic purposes.What’s the difference between Botox and dermal fillers?Cosmetically, Botox and dermal fillers offer similar results. Both help reduce the appearance of facial lines and wrinkles. While Botox is made from botulinum toxin, dermal fillers are made from other natural or synthetic materials, including collagen, hyaluronic acid or calcium hydroxylapatite. Botox injections temporarily paralyze muscles to reduce wrinkles, while dermal fillers add volume and help retain moisture. Your healthcare provider can discuss the pros and cons of each treatment and help you determine which option is best for you.Is it safe to get Botox and the COVID-19 vaccine?Yes. There are no known cases concerning Botox and COVID-19 vaccine reactions. Healthcare providers strongly recommend that you get the COVID-19 vaccine as soon as you’re eligible, whether or not you’ve had Botox.There’ve been isolated cases of swelling in people with dermal fillers who received the Moderna and Pfizer vaccines. First, remember that Botox injections and dermal fillers aren’t the same things. Secondly, people who experienced these rare side effects reported that symptoms diminished quickly. Further, the temporary swelling didn’t cause any long-term health complications. For these reasons, the American Academy of Plastic Surgeons states that people who’ve received dermal fillers shouldn’t be discouraged from getting the COVID-19 vaccine.A note from Cleveland ClinicIf you choose botulinum toxin injections, you’ll need to undergo treatment every three to six months to maintain optimal results. There isn’t a known risk of receiving multiple Botox treatments. Many people find that Botox significantly improves their overall quality of life. Talk to your healthcare provider to determine if this therapy is right for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/06/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPlastic Surgery CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"