"Brachioplasty (Arm Lift): Surgery, Recovery & What To Expect800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Brachioplasty (Arm Lift)AdvertisementAdvertisementAdvertisementBrachioplasty (Arm Lift)Brachioplasty is a type of cosmetic surgery that can improve the appearance of your upper arms. It involves tightening sagging skin and supportive tissue. Surgeons also remove pockets of fat. It makes your arms appear more sculpted in a way that exercise and diet alone can’t.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewBefore and after a brachioplasty procedure; it’s a cosmetic surgery to improve the tone and definition of your upper arms.What is brachioplasty?This procedure, also known as an arm lift, is a type of cosmetic surgery. It helps improve tone and definition in your upper arms by:Reducing pockets of fat.Removing excess skin.Tightening supportive tissue.Smoothing over remaining skin.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho is this procedure for?You may benefit from brachioplasty surgery if your upper arms are drooping or sagging. This area may take on a batwing-like appearance with a flap of skin that hangs down when you raise your arms.This may occur due to:Changes in skin elasticity that occur with age.Losing a lot of weight with or without obesity surgery and maintaining a healthy lifestyle.Having certain genetic factors that cause your skin to sag.Lymphedema.Is exercise a possible substitute for brachioplasty surgery?Exercise, especially resistance training, like lifting weights, improves upper arm muscle tone. But exercise can’t tighten loose skin. After an arm lift, these healthy habits can help you maintain good results for as long as possible.AdvertisementIs an arm lift right for me?You may benefit from brachioplasty if you:Have loose skin in your upper arms.Can accept the appearance of an arm lift scar, which typically runs the length of your upper arm and can be unsightly.Are of a stable weight, meaning you’re not likely to gain or lose significant weight in the long term.Don’t have medical conditions, such as anemia, that raise your risk of surgical complications.Don’t smoke.What else is important to know about brachioplasty?An arm lift is for tightening loose, sagging skin. If you wish to achieve a more sculpted look, you may want the surgeon to perform liposuction on your arms. This procedure removes deposits of fat that don’t respond to diet and exercise. Your surgeon can perform liposuction during brachioplasty.Brachioplasty won’t stop your upper arms from sagging if you gain or lose a lot of weight. That’s why it’s essential to maintain a healthy weight before and after your procedure.AdvertisementProcedure DetailsWhat happens during an arm lift?If brachioplasty surgery is right for you, here’s what to expect:You receive medication to stay comfortable. This may include general anesthesia, which puts you to sleep and blocks sensation. Or you may receive a local anesthetic, which numbs the surgical area and helps you relax.Surgeons make an incision on the inside or back of your arm. The size of the incision depends on how extensive the procedure is.Your surgeon removes excess skin by cutting it away and sometimes, excess fat by using liposuction.They use stitches (sutures) to tighten supportive tissue.Before completing the procedure, surgeons close the incision with sutures. They also bandage your arm with sterile gauze to reduce the risk of infection.Will insurance pay for brachioplasty?An arm lift is typically a cosmetic procedure that improves appearance. For this reason, insurance often doesn’t cover brachioplasty surgery. If your sagging skin is causing a medical issue, like recurring infections, insurance may consider it. Approval depends on your insurance benefits and individual circumstances.Care at Cleveland ClinicPlastic Surgery CareMake an AppointmentRisks / BenefitsWhat are the benefits of brachioplasty?You can expect a trimmer appearance in your upper arm. Many people experience a boost in confidence. They feel more comfortable in sleeveless shirts, form-fitting tops and swimsuits.What are the risks of brachioplasty surgery?Arm lift risks include:Abnormal or excessive scarring.Excessive bleeding.Fluid accumulation (seroma).Nerve, blood vessel or muscle damage.Numbness.Surgical site infection.Wound separation (dehiscence).Recovery and OutlookWhat is brachioplasty recovery like?After your procedure, bandages protect the incision while it heals. You wear a snug-fitting sleeve (compression garment) to minimize swelling. There may be tiny tubes under your skin to drain excess fluid.Arm lift recovery also includes:Changing bandages and elevation on pillows as necessary.Getting plenty of rest and eating a healthy diet, which promotes healing.Avoiding strenuous exercise and heavy lifting for a period of recovery.Wearing a compression garment for several weeks.How soon will I notice results?You’ll notice changes in the shape and tone of your upper arms immediately after surgery. Longer-term changes include:Swelling and bruising, which may subside in a few weeks.Scars may fade somewhat but never fully disappear.Some recurrent looseness.Sagging can occur naturally with further aging.When to Call the DoctorWhen should I contact my healthcare provider?Call your surgeon if you experience signs of brachioplasty complications, such as:Blood clot symptoms, such as abnormal swelling in your arm.Blood-soaked dressings or excessive bleeding.Dehydration risks, which include not being able to keep fluids down and vomiting.Fever or discharge from the incision, which could be a sign of infection.Pain that’s not responding to medications.Shortness of breath or chest pain.Sensation or movement changes in your arms or hands.A note from Cleveland ClinicBrachioplasty is a type of cosmetic surgery that improves tone and definition in your upper arms. You may need this procedure if you have loose skin due to losing weight or age-related changes. The effects of an arm lift can last a long time. But sagginess can come back as you get older or if you experience weight fluctuations.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/27/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPlastic Surgery CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"