"Brachytherapy (Internal Radiation) for Cancer800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/BrachytherapyAdvertisementAdvertisementAdvertisementBrachytherapyBrachytherapy, or internal radiation therapy, treats prostate, breast, head and neck, and other cancers. Doctors place tiny radioactive pellets inside or next to the tumor. The pellets give off radiation that destroys cancer cells. The treatment spares surrounding healthy tissue and organs. Brachytherapy isn’t used for cancers that have spread.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewYour oncologist may use an instrument, like a bronchoscope, to insert radioactive seeds or capsules near a tumor during brachytherapy.What is brachytherapy?Brachytherapy (pronounced “bray-kee-THEH-ruh-pee”) is a form of radiation therapy that treats various cancers. Treatment involves surgically placing radioactive seeds, capsules or other implants inside or near a cancerous tumor. The implants give off radiation for a short time.Brachytherapy can deliver large amounts of radiation that shrink or destroy tumors, while sparing healthy, surrounding tissue.Brachytherapy is also called internal radiation therapy.How does brachytherapy work?Radioactive materials implanted inside or beside a tumor release a prescribed radiation dose. Radiation destroys cancer cells or damages their genetic makeup (DNA). Damaged cancer cells can’t grow and multiply. Eventually, they die off.You may receive brachytherapy alone or with other cancer treatments, like electronic beam radiation therapy or surgery.What are the types of brachytherapy?Brachytherapy treatments vary in strength (dosage) and treatment duration. With brachytherapy, your body may give off trace amounts of radiation and potentially expose others. Following your radiation oncologist’s instructions about when and how to interact with others safely if you’re receiving brachytherapy is important.Brachytherapy implants include:Low-dose rate (LDR): LDR implants release low doses of radiation continuously for one to seven days. As you can expose others to radiation during this time, you’ll likely stay in the hospital during treatment. You may also have visitor restrictions. For example, you may not be able to interact with vulnerable populations, like children or people who are pregnant.High-dose rate (HDR): HDR implants release high doses of radiation for 10 to 20 minutes. Treatment times vary from twice a day for up to five days to once a week for up to five weeks. Many people who get HDR go to the hospital for treatment, leave that same day, and then return for future treatments. Others stay in the hospital the entire time. During treatment sessions, your body may give off radiation that’s potentially harmful to others. Your care team may observe you from a nearby room or wear protective gear during interactions. Once the sessions end, the radiation no longer poses a risk to others.Permanent: Permanent radioactive implants release radiation continually, and the level of radioactivity quickly decreases over time until they become inactive. The implants, or seeds, which are about the size of a grain of rice, remain in your body. This treatment is also called seed implantation. At first, your healthcare provider may restrict your interactions as you give off radiation. Over time, you should be fine to interact with others without exposing them to radiation.What does brachytherapy treat?Brachytherapy is most effective at treating cancer that hasn’t metastasized, or spread throughout your body. It’s effective at destroying “local” tumors, or tumors in a specific area in your body.Brachytherapy can treat:Brain cancer.Breast cancer.Cervical cancer.Eye cancer.Gallbladder cancer.Head and neck cancers.Lung cancer.Prostate cancer.Rectal cancer.Skin cancer.Thyroid cancer.Uterine cancer.Vaginal cancer.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow should I prepare for brachytherapy?Your healthcare provider will explain how you should prepare. You may need to:Get a physical exam.Review your medical history. Your healthcare provider will need to know about your medicines, past and present conditions, and prior surgeries. They’ll need to know if you’re pregnant or breastfeeding (chestfeeding).Get an imaging scan, such as a magnetic resonance imaging (MRI) or computed tomography (CT) scan.Stop taking medications that affect blood clotting, such as blood thinners (anticoagulants) or nonsteroidal anti-inflammatory drugs (NSAIDs).Use a bowel preparation (enema) before the procedure.Not drink or eat anything for several hours before going to the hospital.Quit using tobacco products.How is brachytherapy performed?The procedure depends on your cancer, the type of brachytherapy (LDR, HDR or permanent) and where the implants are placed:Intracavity brachytherapy: Implants are placed near the tumor inside a body cavity, like your vagina.Interstitial brachytherapy: Implants are placed directly inside the tumor.Regardless of the procedure, you’ll have medicines to keep you relaxed. You may get a sedative and anesthesia to relieve pain and discomfort. Once you’re comfortable, your healthcare provider will:Insert a catheter (small flexible tube) or applicator device that will be used to send the radioactive implants to the tumor. Imaging (X-ray, ultrasound or MRI) can help ensure correct placement.Send the implant through the catheter or applicator device until it reaches the tumor. How long the implant stays depends on the type of brachytherapy. With HDR, your provider removes the implant after treatment sessions. With LDR, the implant may be removed after each treatment session and re-inserted during future sessions, or your provider may leave it in place throughout treatment.You’ll receive pain medications to ease any discomfort once it’s time to remove the catheter or applicator device.AdvertisementWhat should I do after getting brachytherapy?You may need to limit your activity and get extra rest after treatment. Follow your healthcare provider’s guidance on when it’s safe to return to your usual routine.It’s essential that you follow your provider’s instructions on how to interact with others safely. For example, if you have permanent brachytherapy, you may expose other people to radiation for several weeks or months. While the exposure risk is small, you should limit your contact with young children and people who are pregnant as directed by your healthcare provider.Care at Cleveland ClinicGet Cancer CareMake an AppointmentRisks / BenefitsWhat are the potential side effects of brachytherapy?Potential side effects depend on the cancer type and the type of brachytherapy you receive. Side effects typically improve a few months after treatment stops.You may experience:Difficulty peeing (urinating) or urinary incontinence.Erectile dysfunction.Fatigue.Fecal (bowel) incontinence, constipation or diarrhea.Hair loss.Headaches.Mouth sores.Nausea and vomiting.Shortness of breath (dyspnea) or cough.Usually, side effects occur in the body part where the implant is. For example, with a prostate gland seed implant, you may experience fatigue, urinary and/or bowel symptoms or erectile dysfunction, but not hair loss or mouth sores.AdvertisementWhat are the disadvantages of brachytherapy?As with any cancer treatment, brachytherapy can cause unpleasant side effects. Most side effects improve once treatment stops, but some are long-term or don’t appear until after treatment ends. Ask your healthcare provider about potential risks associated with brachytherapy before starting treatment.Recovery and OutlookHow effective is brachytherapy?Brachytherapy is a highly effective treatment for certain types of cancer. It’s most effective on cancers that haven’t spread, or metastasized. Most side effects improve as the radiation leaves your body.When to Call the DoctorWhen should I call the doctor?You should call your healthcare provider if you experience any of the following symptoms during treatment:Trouble breathing or swallowing.Severe stomach upset, vomiting or diarrhea.Urinary incontinence.Fecal incontinence.Additional DetailsWhat’s the difference between internal radiation and external radiation?Internal radiation, like brachytherapy, uses radioactive materials inside of your body to destroy a tumor. External beam radiation therapy (EBRT) uses a machine to deliver beams of radiation energy through your skin to the tumor.External radiation is more common than brachytherapy. It’s the only possible treatment for some cancers.A note from Cleveland ClinicBrachytherapy places radiation close to a tumor, destroying cancer cells, while sparing healthy tissue from harmful radiation exposure. It’s excellent at treating local tumors, like those found in breast, prostate, cervical and uterine cancer. Follow your healthcare provider’s guidance about caring for yourself and managing side effects if you’re receiving brachytherapy. Ask about likely outcomes if you’re receiving brachytherapy as a standalone treatment or in combination with another treatment, like surgery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/03/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Cancer CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"