"Brazilian Butt Lift: What to Expect, Surgery, Recovery & Risks800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Brazilian Butt LiftAdvertisementAdvertisementAdvertisementBrazilian Butt LiftA Brazilian butt lift is an increasingly popular cosmetic procedure. A Brazilian butt lift increases the size and shape of your butt while removing fat from other areas of your body. Candidates should be in good physical and mental health and have realistic expectations.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is a Brazilian butt lift?A Brazilian butt lift (BBL) is a procedure that improves (augments) the look of your buttocks in addition to removing fat from other parts of your body (liposuction).However, a Brazilian butt lift isn’t a traditional “lift” procedure like a facelift or breast lift despite its name. A Brazilian butt lift adds volume to and improves the shape of your butt, but it won’t improve sagging or excess skin. If you have sagging or excess skin, talk to your healthcare provider about a butt lift.Doctors called plastic surgeons perform Brazilian butt lifts.“Buttock augmentation with fat grafting” and “safe subcutaneous buttock augmentation (SSBA)” are other names for the procedure.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat does a Brazilian butt lift do to your body?During a Brazilian butt lift, a doctor called a plastic surgeon will remove fat deposits from other parts of your body and insert them into areas around your butt. After you’ve recovered, your butt will be bigger, stick out more and have an even shape (symmetrical). The areas of your body that had fat removed will have smoother body contours (shapes).Who is a good candidate for a Brazilian butt lift?Getting a Brazilian butt lift is a personal decision. Pursuing your wants and desires for your body can be very empowering.To be considered for a Brazilian butt lift, you should:Be finished developing.Be in good physical health.Have realistic expectations.Have enough excess body fat available in other parts of your body to transfer to your butt.If you don’t have enough excess body fat available, you may be a good candidate for butt implants.AdvertisementHow long does a Brazilian butt lift last?The effects of a Brazilian butt lift are semi-permanent. They should last several years and may even last for over a decade without any follow-up treatments. However, your body changes as you get older, which can affect your results over time. To preserve the effects of your Brazilian butt lift, you should maintain a consistent weight.How common are Brazilian butt lifts?A Brazilian butt lift is a common procedure that’s growing in popularity. According to the most recent statistics from the American Society of Plastic Surgeons, there were 21,823 Brazilian butt lifts performed in 2020. The COVID-19 pandemic may have affected the number of Brazilian butt lift procedures in 2020, as elective surgeries (surgeries scheduled in advance) decreased. Between 2015 and 2019, the frequency of Brazilian butt lift procedures grew from 14,705 to 28,076.AdvertisementProcedure DetailsWhat happens before a Brazilian butt lift procedure?You must be at least 18 years old to get a Brazilian butt lift. However, your body is unique — you may not complete puberty until you’re older than 18. If you haven’t finished developing, the results of your Brazilian butt lift procedure may be affected. Discuss any questions or concerns you have with your healthcare provider.Your healthcare provider will assess many factors, including your mental health and any social conditions. Your healthcare provider may ask you the following questions:Why do you want a Brazilian butt lift?What are your expectations?Do you think a lot about imagined or very small defects with your body?Is a spouse, partner or friend encouraging you to get a Brazilian butt lift?Are you aware of the risks involved in a Brazilian butt lift procedure, including fat embolisms?Your healthcare provider will evaluate your general health, including any preexisting health conditions or risk factors. Talk to your healthcare provider about any allergies you have. Tell them about any prescription or over-the-counter (OTC) medications that you’re taking, including herbal supplements.Your physical health and the shape of your body are also important. Your healthcare provider will examine the following regions to determine the best place(s) to perform the fat harvesting via liposuction:Lower back region.Hips.Inner thighs.Outer thighs.The space between your tailbone, sacrum and rectum (presacral triangle).What happens during a Brazilian butt lift procedure?During a Brazilian butt lift procedure, you’ll be sedated (put under) with general anesthesia so you’re not awake and won’t feel any pain. If you only need to have a small amount of fat transferred, you may only need local anesthesia. If given local anesthesia, you’ll be awake during the procedure because it only numbs a small section of your body.Once you’re asleep and numbed, your plastic surgeon and their team of healthcare providers:Use a suction device attached to a small, stainless steel instrument called a cannula.Make small incisions (cuts) in your body and insert the cannula into the fatty areas between your skin and muscle.Remove excess fat with a suction cannula and a large syringe. A large amount of fat is usually needed to perform a Brazilian butt lift — usually 300 ccs to 500 ccs (1 1/3 to 2 1/4 cups) on each side.Purify the fat that’s removed.Make three to five small incisions in specific areas around your buttock.Inject the purified fat into the incisions around your buttock. The upper region of your butt receives most of the fat, and the middle of your butt receives less. The purified fat is usually injected into the hypodermis (subcutaneous tissue) instead of your muscle.Stitch your liposuction and fat transfer incisions closed.What happens after a Brazilian butt lift procedure?After the Brazilian butt lift procedure, your healthcare provider will wrap your affected areas with a compression band to reduce bleeding. If you’re receiving general anesthesia, your anesthesiologist will stop putting anesthesia into your body to keep you asleep. You’ll move to a recovery room, where healthcare providers wait for you to wake up and monitor your overall health.Once you wake up, you may feel dazed, and your affected areas may feel sore. Your healthcare providers will continue to monitor your overall health for up to several hours. Once they determine that you no longer need monitoring, they’ll discharge you (let you go home). You must have a family member or friend drive you home and take care of you for at least the first 24 hours after your Brazilian butt lift procedure.It may take up to six months for your body to fully recover after your Brazilian butt lift procedure. During this time, you may have to eat a high-protein diet to assist your healing. This will help you maintain your new shape. You may also have to incorporate lower body exercises that focus on your butt, including leg lifts, lunges and squats.Care at Cleveland ClinicPlastic Surgery CareMake an AppointmentRisks / BenefitsWhat are the advantages of a Brazilian butt lift?There are many advantages to a having Brazilian butt lift when performed by a qualified and experienced plastic surgeon:The procedure is safer than other surgeries, including silicone butt implants.The effects look natural.The effects can last a long time.It can boost your self-esteem.Your clothes may fit better or more comfortably.What are the risks or complications of a Brazilian butt lift?Getting a Brazilian butt lift poses some risks, including:Your butt contains many blood vessels and nerves. If the cannula strikes any of these structures during the surgery, it can lead to injury, a fat embolism or death.Bruising.Infection.Skin discoloration or changes in skin sensation.Swelling or poor wound healing.Recovery and OutlookWhat is the recovery time?The first several days after your Brazilian butt lift procedure are often the most painful.Your butt may be swollen and bruised.Your incisions may bleed slightly.You may retain fluid around your affected areas.To manage pain, some people take either a prescribed pain medication or OTC acetaminophen. If you’re taking a prescription pain medication, it’s a good idea to have a family member or friend help take care of you because you shouldn’t drive. As always, discuss your allergies and complete medical history with your healthcare provider.After one to two weeks, your pain should decrease. You may have to wear a compression garment around the areas that were liposuctioned. In some cases, you may need a temporary drain in the incision to remove excess blood or fluid.You won’t be able to sit or lie down on your butt for at least two weeks. So, you’ll need to stand rather than sit and sleep on your stomach or sides.After several weeks, you may be able to sit for short periods of time on a specially designed pillow that evenly distributes pressure. You won’t be able to sit without your pillow for approximately eight weeks. At this point, you may be able to participate in light exercises. However, you should avoid heavy lifting or strenuous activities for one month.Your body should fully recover between two and three months after your Brazilian butt lift procedure.It’s important to remember that your body is unique, so recovery times may vary. Follow your healthcare provider’s instructions on how to manage your pain and discomfort throughout your recovery.When can I go back to work?Depending on your job, you should be able to go back to work between 10 and 14 days after your Brazilian butt lift procedure. If you usually sit at a desk for long periods, it’s advisable to use a standing desk until you’ve completely healed.When to Call the DoctorWhen should I see my healthcare provider?Schedule regular follow-up appointments with your healthcare provider.After one to two weeks, your healthcare provider will remove your stitches, and they’ll also check your incisions. During this time, your healthcare provider will also evaluate how well your body is healing and determine whether you have recovered enough to sit for short periods on a special pillow.You should then see your healthcare provider four to six weeks and three months after your Brazilian butt lift procedure to evaluate your progress. After three months, your healthcare provider should be able to determine how well your body has responded to the procedure.Additional DetailsWhat questions should I ask my healthcare provider?How many Brazilian butt lift procedures have you performed?Can I achieve a desired look through just liposuction on my butt?How should I treat the swelling and pain?Do I need to adjust my diet? How many calories should I eat per day to maintain my shape?What exercises should I do to maintain my shape?When can I start participating in normal activities and exercises again?What is a Sculptra® butt lift? Is that a better option for me?What are silicone butt implants? Is that a better option for me?A note from Cleveland ClinicGetting a Brazilian butt lift is a personal decision. If you wish to increase the size of your butt and change its shape while reducing and smoothing other areas of your body, you can talk to a plastic surgeon to discuss your options. A Brazilian butt lift can boost your self-confidence, but you should be aware that the effects are only semi-permanent. You may need to get a Brazilian butt lift again during your life. Talk to your healthcare provider about your questions and concerns, and learn more about outcomes and risks.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/19/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPlastic Surgery CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"