"Types of Breast Surgery for Cancer, Cosmetic & Preventative 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Breast Surgery: OptionsAdvertisementAdvertisementAdvertisementBreast Surgery: OptionsBreast surgery is a procedure that modifies a woman or man’s breasts. Such surgeries are done for a variety of reasons. Some are done for cosmetic reasons, such as to reconstruct the breast to look more youthful, or increase its size. Others are medically necessary such as a breast reduction for back pain or surgery to remove cancer.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat's breast surgery?Breast surgery is a procedure performed on a female or male’s breast(s). There are different types of breast surgeries. Some are performed for medical reasons such as cancer, others for cosmetic reasons (plastic surgery). Examples include:Medical reasons:Breast cancer surgery (lumpectomy, mastectomy). Either part or all of the breast and possibly the nearby lymph nodes are removed to get rid of the cancer.Preventative surgery (mastectomy). Sometimes breasts are removed to prevent breast cancer.Removal of non-cancer breast lumps. Some non-cancer breast lumps may need to be removed.Breast reduction. The breast size is decreased. (Note that this may also be performed for cosmetic reasons.)Cosmetic reasons:Breast reconstruction. The most common time for this is after breast cancer surgery.Breast augmentation. The breast size is increased.Breast reduction. The breast size is decreased. (Note that this may also be performed for medical reasons.)AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat conditions are treated with breast surgery? When is breast surgery necessary?There are medical reasons for needing breast surgery, such as breast cancer, non-cancerous breast lumps and breast reduction surgery to help get rid of back pain. There are also cosmetic reasons, such as the personal desire to have a different size, appearance, or shape of the breast(s).How often are breast surgeries performed?Breast surgeries are common.AdvertisementIs breast surgery outpatient or inpatient?The answer depends on what type of procedure you’re having:Surgery for breast cancer, breast augmentation and breast reduction surgery can be either inpatient or outpatient, depending.Most lumpectomies are outpatient.Most mastectomies require an overnight stay at the hospital.Ask your healthcare provider about the details of your specific type of surgery.Do males have breast surgery?Yes. Some men have a condition called gynecomastia where their breasts are large, and they choose to have for this condition.Men can also develop breast cancer, and the cancer is removed with surgery.AdvertisementProcedure DetailsWhat happens before breast surgery?You’ll have a consultation with your surgeon before any medical or cosmetic procedure. He or she will first need to learn about your situation and determine if you’re a good candidate for the surgery. You’ll likely have the following discussions no matter what type of breast surgery you’re having:Why do you need/want the surgery?Do you have any drug allergies?What medical treatments have you had before?What medications are you on?Do you take any vitamins or herbal supplements?Do you use alcohol, tobacco, or illegal drugs?Is there a history of breast cancer in your family?What pre-existing health conditions do you have?What surgeries have you had?You might be ready for optional cosmetic breast surgery if you meet the following criteria, including:You’re physically healthy.You aren’t pregnant.You aren’t breastfeeding.Your breasts are fully developed.You’ve decided to have the procedure for yourself, not for anyone else. (An important conclusion to come to if you’re having cosmetic surgery.)At this point in the process, your healthcare provider may ask you to do some tasks to prepare for your surgery, including:Adjust your medications.Get a blood test.Stop smoking and using any type of nicotine.Avoid drugs like Aspirin that can interfere with bleeding.Stop taking recreational drugs.Take vitamins, if recommended.The consultation is also the time for you to ask your surgeon questions. For example:Are you certified by a board-certified surgeon?How many years of training do you have?How long will my recovery period be?What are the risks and possible side effects?Will I need more operations in the future?Will I still be able to breastfeed?How will my breasts look over time?What can I do if I don’t like the outcome of my surgery?Before a breast augmentation, breast reduction, or breast reconstruction, your healthcare provider will:Measure your breasts. You’ll talk with your surgeon about what size you want to be.Take photographs. You’ll want to see before and after images.Before breast surgery for cancer, your healthcare provider will:Identify the size and location of the cancer. This will determine the surgery type: lumpectomy or mastectomy.How long does breast surgery last?The length of the procedure depends on the type of breast surgery. Lumpectomy, for example, takes about one to two hours. Breast reduction surgeries, for example, take about three to five hours.What happens during breast surgery?Breast surgeries are very complicated, but the steps are simplified here with two examples: breast augmentation surgery and breast reduction surgery.There are five steps in a breast augmentation surgery:Anesthesia. Intravenous sedation or general anesthesia.Incision. The location of the incision depends on the type of breast implant, how much larger you wish to be and your surgeon’s recommendation. The incision might be along your areola, the fold under your breast, or in your armpit. \\Insert and place the implant. The implant will be inserted either under the pectoral muscle or directly behind the breast tissue, which is over the pectoral muscle. Your surgeon will discuss the options to figure out the best one for you.Close the incisions. The incision is closed using layered sutures in the tissue, and then surgical tape or a skin adhesive (glue) to close the skin. The scar from the incision line will eventually face.See the results. You will be able to see the results of your surgery as soon as you wake up.There are five steps in a breast reduction surgery:Anesthesia. General anesthesia.Incision. It will be around your nipple, then downward below your breast.Removal. Extra skin, tissue and fat are removed.Relocation. Your nipple will be relocated to a more ideal location.Close the incisions. Your healthcare provider may install a drainage tube at the incision site. Dressings will be applied.If there has been some trauma to the breasts or specifically the nipple, or if you want to change its appearance, breast reconstruction surgery might be the best option. Unfortunately, this won’t cure an inability to breastfeed or feel sensation on the nipple. The reconstruction is done using implants or using your tissues such as part of your abdominal wall.Will I be asleep during breast surgery?Yes. You will be under anesthesia. Discuss your anesthesia options with your healthcare provider.What should I expect after breast surgery?Your healthcare provider will monitor you closely after surgery. You’ll have gauze dressings and either a support bra or elastic bandage. These will minimize swelling and support your healing breasts. You’ll get instructions and schedule a follow-up appointment. You may get a prescription for pain medication.Care at Cleveland ClinicPlastic Surgery CareMake an AppointmentRisks / BenefitsWhat are the risks of breast surgery?All surgeries have risks, and breast surgery is no different. Possible risks include, but are not limited to:Anesthesia.Bleeding.Infection.Changes in nipple or breast sensation.Scarring.Implant leakage or rupture.Pain.Needing revision surgery.A warning if you have breast augmentation surgery: breast implants can prevent the detection of cancer. Breast cancer is a serious condition. Also, note that breast implants may not last your entire lifetime. You may have to have surgery in the future. Weight loss, pregnancy and menopause can also change the shape of your breasts.Is breast surgery painful?There can be scar tissue after breast reduction surgery that causes pain. Typically, if you have breast augmentation, your pain shouldn’t last more than one to five days, although there may be some soreness and swelling for as long as a few weeks.After breast cancer surgery the area may be bruised. There may be numbness or tingling all over, including your upper arm and armpit. Take pain relievers, warm showers (after a week) and do some easy exercises. When you’re allowed to, put vitamin E lotion or pure lanolin on the incisions to help with scarring.Recovery and OutlookWhat is the prognosis (outlook) after breast surgery?In the future, you might need to have more breast surgeries. The reason could be there’s more cancer, or because implants need to be replaced. Blood tests, physical exams and mammograms are vital.Talk with your healthcare provider about any personal risks.What is the recovery time?The recovery time is generally between one week and six weeks or longer and depends on the type of breast surgery you are having. After a lumpectomy, you may return to work after around two weeks. After a mastectomy, this will be longer, between four to six weeks. After breast reduction or augmentation surgery, you can return to work/school after about a week. You may be sore for weeks after breast surgery. It is important to discuss recovery time with your healthcare provider as this will depend on your case.How should I care for myself once I’m home?You’ll have several tasks at home no matter what type of breast surgery you have. Right after your surgery, you’ll need to care for your breasts by changing the bandages, keeping the areas dry, and other tasks:Continue wearing your support bra if this is recommended. It will help with pain and swelling. The dressings may need to be changed daily.Clean the incision sites, but only under orders from your surgeon.If your surgeon installed a drainage device then you’ll have to care for it. Fluids will move from the catheter at the site of the surgery and you’ll have to empty the tube. The amount of fluid will gradually lessen, and the color of it will change.You may shower after your surgery and your healthcare provider will give you instructions as to the timing of this. It is not recommended that you bathe in a bathtub or swim after breast surgery for at least one month.Will I have to limit my activity?Don’t go back to your normal activity level or driving until you have permission from your surgeon. Avoid lifting heavy objects. Depending on what your surgeon says, you may not be able to return to your normal exercise routine for up to a month.When to Call the DoctorContact your surgeon if you experience:Swelling in your arm or hand, under your arm, or near the incision.A fever of 101 degrees (Fahrenheit) or higher.More drainage.Pain that regular pain medication can’t lessen.Loss of appetite.Broken sutures.Dizziness, blurred vision, or headaches.Shortness of breath or coughing.Digestive problems.Additional DetailsDoes health insurance cover breast surgery?Surgery for breast cancer is typically covered by health insurance. Optional surgeries to change the appearance of your breasts are typically not covered by insurance. Speak with your health insurance company regarding your options before you schedule surgery.How much does breast surgery cost?The cost of breast surgery depends on the procedure, the surgeon’s experience and the geographic location of the office. There are fees for the anesthesia, the facility, tests, clothes, prescriptions and the surgeon’s fees. Ask about payment plans.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/26/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPlastic Surgery CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"