"Breast Reconstruction: What Is It, Types, Procedure & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Breast ReconstructionAdvertisementAdvertisementAdvertisementBreast ReconstructionBreast reconstruction is surgery to recreate breasts after a mastectomy. There are several types of breast reconstruction. Some techniques use implants. Others use tissue from your body (such as the belly) to form a breast. Breast reconstruction can happen right after a mastectomy or much later. You may need multiple surgeries over several months.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is breast reconstruction?Breast reconstruction is surgery to recreate breasts after mastectomy or lumpectomy. Sometimes reconstruction takes several surgeries. There are many breast reconstruction techniques. Some use silicone or saline breast implants. Other techniques use a flap of tissue from your body (such as tissue from the lower belly).Breast reconstruction can happen right after breast cancer surgery (immediate reconstruction). Or it can happen months or years later (delayed reconstruction). You may have surgery to reconstruct both breasts. Or your provider may replace one breast and reshape it to match the other. Your provider may recommend multiple surgeries over several stages.Some people choose to have breast reconstruction after a mastectomy, but many don’t. The decision to have breast reconstruction is very personal.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the types of breast reconstruction surgery?There are two main types of breast reconstruction surgery after mastectomies.Flap reconstructionIn flap reconstruction, your surgeon takes tissue from your own body (autologous tissue) and uses it to form a breast. Usually, they take the tissue from the lower abdomen (belly). But it can also come from your thigh, back or bottom.Your surgeon may remove fat, skin, blood vessels and muscle from these parts of your body to form a new breast. Healthcare providers call this tissue a flap. Sometimes, surgeons move a flap through your body (pedicled flap). This way the flap retains its own blood supply. Or they may detach the flap from its blood supply (free flap) and attach it to blood vessels in your chest.The types of flap reconstruction include:DIEP flap: Your provider takes skin, fat and blood vessels from the lower belly. A DIEP flap does not remove the underlying abdominal (belly) muscle.TRAM flap: Your provider removes skin, fat, blood vessels and muscle from the lower belly.Latissimus dorsi (LD) flap: Providers remove tissue and muscle from the back. They transplant the LD flap (still connected to its own blood supply) through the back to the breast area.IGAP flap: For this procedure, tissue comes from your butt. Muscle isn’t used in this procedure.SGAP flap: This technique also removes tissue (not muscle) from your butt. It uses a different group of blood vessels than the IGAP flap procedure.PAP flap: Your surgeon removes tissue from the inner and back of your thigh and uses it to form a breast. This procedure does not transplant muscle from your thigh.TUG flap: Similar to a PAP flap, this technique uses tissue from your thigh. A TUG flap transplants muscle as well as tissue.SIEA flap (or SIEP flap): This procedure is like a DIEP flap, but it uses different blood vessels. Providers don’t use this technique as often. Few people have the blood vessels necessary for the surgery to be successful.Implant reconstructionIn implant reconstruction, surgeons use saline or silicone implants to recreate breast tissue. Sometimes surgeons use a combination of implants and tissue from your body. Implant reconstruction can happen along with a mastectomy. Or you may choose to have this procedure after a mastectomy.The types of implant reconstruction are:Under the chest muscle: Your surgeon lifts up the chest muscle and places the implant underneath it.Above the chest muscle: Your surgeon places the implant on top of the chest muscle. You may not need as much recovery time because your chest muscle remains in place.Implant with tissue expander: Your surgeon places an expander under your skin. About once per week, you or your healthcare provider fills the expander with saline. Your skin gradually expands (stretches). Your surgeon will place the implant once your skin has expanded enough to cover it.Oncoplastic reconstruction after lumpectomyIf you are a candidate for lumpectomy, you may benefit from oncoplastic reconstruction. Your oncologic breast surgeon will help you know if you are a candidate for breast conservation. However, you’ll require radiation when a lumpectomy is performed.In oncoplastic reconstruction, surgeons use the techniques of breast reduction or breast lift at the same time as the lumpectomy. The breast reduction or breast lift helps to fill in the defect created by the lumpectomy and improves the breast shape. You’ll need a breast reduction or lift on the other breast for symmetry.Can a nipple be reconstructed?Some types of mastectomy leave the nipple and areola in place (nipple-sparing mastectomy). The areola is the dark skin surrounding the nipple. If necessary, providers can create a new nipple. They do this by transferring skin from another part of your body (skin graft) or local skin on the breast to shape into a nipple.Some people choose to get a 3D tattoo of an areola after nipple reconstruction. Specially trained tattoo artists create realistic images of an areola.AdvertisementHow do I know what type of breast reconstruction surgery to get?Your provider will recommend the most appropriate technique for you based on:Your age, overall health and lifestyle.The kind of mastectomy or lumpectomy you had and how much tissue remains.Whether you need additional treatments for breast cancer (such as chemotherapy or radiation).Past surgeries you’ve had that may make it difficult or impossible to take a flap from your belly. One example is abdominal surgery.Your goals and desired appearance.What does breast reconstruction treat?Most often, breast reconstruction happens after surgery to treat or prevent breast cancer. Providers use it to reshape breasts and rebuild damaged or missing tissue. They may also perform this surgery to restore symmetry. This means they make both breasts the same size and shape. Less commonly, providers reconstruct breast tissue that results from congenital abnormalities (birth defects).After a mastectomy, it’s normal to mourn the loss of your breast. Breast reconstruction surgery helps many people manage these strong emotions and move forward.AdvertisementProcedure DetailsWhat happens before breast reconstruction surgery?Breast reconstruction happens after a mastectomy or lumpectomy. If you have breast cancer, you may also need chemotherapy or radiation before breast reconstruction surgery. Your surgeon will ask you about your goals and discuss your surgical options with you.First, your surgeon will conduct a comprehensive examination. They will measure and take photographs of your breasts. Tell your provider about your health, medications you take and any surgeries you’ve had. Your provider may ask you to stop taking certain medications before the procedure.What happens during breast reconstruction surgery?A surgeon will perform your breast reconstruction surgery in a hospital. Your provider gives you anesthesia, so you’ll be asleep and you won’t feel any pain during the surgery. If you’re having a mastectomy or lumpectomy, your surgeon will do that procedure first.While you’re still asleep, your surgeon performs the breast reconstruction. If you’re getting implant reconstruction, they place the implant in your chest. If you're having a flap procedure, they take tissue from one part of your body, form and place the new breast.During surgery, your provider may insert a drain (a thin tube) under your skin. One end of the tube sticks out from your chest. The tube drains fluid and blood as you recover. Your provider will remove the tubes when you don’t need them anymore.What happens after breast reconstruction surgery?After surgery, you may need to stay in the hospital for up to a week. Your team of providers will watch you to ensure you’re healing. You may wear a surgical bra. As your breasts heal, the bra supports your breasts and reduces swelling. When it’s time to go home, your provider will give you instructions detailing how to care for yourself.Your provider will help you manage pain after surgery. They may recommend prescription or over-the-counter pain medication. Follow your provider’s instructions carefully when taking medication.If you had reconstruction on one breast, you may need more surgery to make your breasts match. This may include breast reduction surgery or breast augmentation.Care at Cleveland ClinicSchedule Breast Reconstruction SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of breast reconstruction surgery?Breast reconstruction surgery can improve self-confidence after a mastectomy or lumpectomy. After breast reconstruction, many people feel better about how their clothes fit. They may also feel more comfortable wearing a swimsuit.Many people choose not to have breast reconstruction after a mastectomy. Instead, they wear a breast form (prosthesis) inside a special bra. They may also choose to “go flat” and not wear prosthetic breasts. The decision is very personal and varies from person to person.What are the risks or complications of breast reconstruction surgery?As with any surgical procedure, risks of breast reconstruction include infection and bleeding. Results vary depending on the type of procedure and how much tissue remained after breast cancer surgery and radiation.After surgery, you’ll probably have little or no sensation in your newly reconstructed breasts. Over time, you may regain some sensation in the skin. But it won’t feel like it did before.Complications of breast reconstruction surgery may include:Blood clots. These may be more likely to happen after some types of flap reconstruction surgeries.Breasts that are a different size or shape. One may feel more firm than the other. The nipples and areolas may not be symmetrical.Bruising or scarring around the reconstructed breasts. All breast reconstruction surgeries leave scars. They may fade over time.Fat necrosis. Death of the transplanted tissue after flap surgery.Problems with the implants (for implant reconstruction). These problems can include wrinkling, rippling and ruptures (tears) in the implant.Weakness, pain or sensitivity at the donor site after a flap reconstruction procedure. Donor sites may include the lower belly, thigh, back or bottom.Do implants carry extra risk?Some implants may increase the risk of anaplastic large cell lymphoma (ALCL), a rare form of cancer. Most of these implants are no longer on the market in the United States. Ask your provider about the risk of developing ALCL after implant surgery.Recovery and OutlookWhen can I go back to my usual activities after breast reconstruction surgery?Everyone recovers from surgery differently. Your recovery time depends on several factors. These include your overall health and the type of procedure you had.You will need to avoid lifting, exercising or doing some activities for a while to give your body time to heal. Talk to your provider about when you can get back to the activities you enjoy.Cancer can return after breast reconstruction surgery. See your provider for regular checkups. If you had one breast reconstructed, you’ll need regular mammograms on the other breast to check for cancer.When to Call the DoctorWhen should I see my healthcare provider about breast reconstruction surgery?Call your provider right away if you have:Signs of infection, such as fever.Severe pain or pain that doesn’t get better with medications.Bleeding or fluid (pus) coming from the incisions.Changes in color on the breast or near the incisions.A note from Cleveland ClinicBreast reconstruction surgery can improve self-confidence and body image after a mastectomy or lumpectomy. The decision to get breast reconstruction is very personal. If you decide to get this surgery, talk to your provider about the technique that’s right for you. Be honest and open about your goals, lifestyle and desired appearance. You may need more than one surgery over several months. Follow your provider’s instructions during recovery. Call them right away if you have severe pain or signs of infection.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/27/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Breast Reconstruction SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"