"Breast Implant Removal: What to Expect, Surgery & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Breast Implant RemovalAdvertisementAdvertisementAdvertisementBreast Implant RemovalBreast implant removal is surgery to take out silicone or saline implants. You may have the operation because you no longer want implants. Or you may choose surgery because you have complications with your implants. Often, people choose implant removal because scar tissue has hardened around the implant, causing a capsular contracture.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is breast implant removal?Breast implant removal is surgery to take out breast implants. During the operation, a surgeon may also remove scar tissue or silicone from implant leaks.You may want your surgeon to remove old implants and replace them with new ones. Or you may no longer want implants at all. Sometimes, people need the surgery because they have had implant complications.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is breast implant removal done?Breast implants don’t last a lifetime. The American Society of Plastic Surgeons recommends that people with breast implants have them removed or replaced every 10 to 15 years. However, your plastic surgeon may not recommend that you have them removed if you haven’t had any complications.Some people opt for breast implant removal because the shape of their breasts has changed since their breast augmentation. Breast appearance may change due to:Age.Breastfeeding.Pregnancy.Weight changes.Who needs to have breast implant removal?In some cases, breast implant removal or replacement is medically necessary. The most common reason to remove implants is that scar tissue hardens around the implants. This hardening is known as capsular contracture. It can cause pain, discomfort or breasts that look different than they once did.You may also want implant removal because of:Breast implant-associated anaplastic large cell lymphoma (BIA-ALCL), a rare cancer that occurs in scar tissue around an implant. BIA-ALCL is associated with textured implants. You should check with your plastic surgeon to see if you’ve ever had textured implants placed.Calcium buildup around the implant.Leaking of the implant.Movement or shifting of the implant.AdvertisementProcedure DetailsWhat happens before breast implant removal?Before breast implant removal, your healthcare provider will give you specific instructions to help you prepare. You may need to:Adjust current medications or start new ones.Avoid medicines that increase bleeding risks, such as anti-inflammatory drugs or certain herbal supplements.Stop smoking or using tobacco products.Usually, breast implant removal is an outpatient surgery, meaning you can leave the same day. Before the operation, you will need to arrange transportation to return home.What happens during breast implant removal?When it’s time for surgery, a doctor who specializes in pain control (anesthesiologist) gives you medicine. This medicine will help you remain numb during the surgery. You may have:Intravenous (IV) sedation to help you feel calm and relaxed.General anesthesia to put you in a sleep-like state.During the operation, your surgeon:Makes an incision around the circle of darker skin around your nipple (areola) or under the lower fold of your breasts (inframammary fold).Removes implants and scar tissue.Places new implants, if you are also having implant replacement.Uses stitches, tapes or skin adhesives to close the incisions.AdvertisementWhat happens after breast implant removal?After surgery, you receive specific instructions for recovery. Your provider tells you:How to care for your incisions.Activity restrictions.What medications to take.When to follow up with your plastic surgeon.For a few weeks, you may wear a special support bra or a compression garment to reduce swelling. You may also have small tubes called drains placed underneath your skin. These tubes ensure that you drain excess fluid or blood. These drains usually come out after a few days but may stay in place for up to 10 days or more.Care at Cleveland ClinicPlastic Surgery CareMake an AppointmentRisks / BenefitsWhat are the advantages of breast implant removal?Breast implant removal has a few benefits. Getting the surgery may affect:Mammograms: Silicone or saline implants may interfere with seeing breast tissue clearly on an X-ray. Without implants, your mammogram results may be clearer.Pain: If you have capsular contracture, removing implants can provide nearly instant pain relief. Removing large implants may decrease neck or back pain.Replacements and rupture risks: If scar tissue hardens enough, it can lead to an implant rupture. Removing implants takes away the risk of an implant rupture.What are the risks of breast implant removal?Many people have breast implant removal surgery with minimal to no complications. But all surgeries carry some risks. With breast implant removal, one of the most common risks is feeling dissatisfied with the appearance of your breasts after surgery.Other complications of implant removal can include:Bleeding.Asymmetry.Seroma or bodily fluid collecting in the space where the implant was.Infection.Loose skin.Numbness or changes in nipple sensation.Scarring.Recovery and OutlookHow long is recovery from breast implant removal?For the first one to two weeks after surgery, you will need to avoid some of your usual activities, such as driving. During recovery, you will need to limit strenuous activity and heavy lifting. Many people have tenderness or soreness for up to six weeks.When to Call the DoctorWhen should I see my healthcare provider?Call your healthcare provider right away if you experience:Chest pain.Chills.Fever.Nausea or vomiting.Persistent or worsening pain.Shortness of breath (dyspnea).Additional Common QuestionsWill my breasts sag after implant removal?When you have breast implants, your skin stretches to accommodate the size of your breasts. After implant removal, your breasts may sag, droop or appear misshapen.Many people choose to have implant removal with a breast lift (mastopexy). During a breast lift, your surgeon removes excess skin and reshapes your breast tissue. If needed, the surgeon can also reposition the nipple and areola. The result is firmer, more elevated breasts.A note from Cleveland ClinicBreast implant removal is surgery to take out silicone or saline implants. Typically, breast implants last for about 10 to 15 years. Some people have implant removal surgery because of tissue hardening around the implant or other complications. Others may have surgery to replace old implants with new ones. Or you may no longer want implants. Surgery to remove breast implants is typically an outpatient procedure. If you are concerned about the appearance of your breasts after implant removal, you may have a breast lift.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/20/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPlastic Surgery CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"