"Breast Cancer: Intraoperative Radiation Therapy: What Is It & Treatment 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Breast Cancer: Intraoperative Radiation Therapy (IORT)AdvertisementAdvertisementAdvertisementBreast Cancer: Intraoperative Radiation Therapy (IORT)If you’re a woman getting a lumpectomy, there are a couple treatment options including IORT. IORT (Intraoperative radiation therapy) for breast cancer is, unlike external beam radiotherapy (EBRT), a procedure where radiation is delivered directly to the tumor instead of throughout the entire breast. The radiation is delivered in a single dose, has fewer side effects than EBRT and eliminates just the cancer, leaving the healthy tissues alone.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is intraoperative radiation therapy (IORT)?Intraoperative Radiation Therapy (IORT) for early breast cancer is a procedure where radiation is delivered directly to the tumor or tumor bed during a lumpectomy (surgery to remove part of your breast). This type of therapy is different from traditional radiation therapy, known as external beam radiation therapy (EBRT), which floods the entire breast with radiation. Typically, IORT is combined with EBRT or chemotherapy.IORT is an preferred therapy for several reasons:IORT is a shorter procedure.IORT is given in a single dose instead repeatedly over several weeks.IORT has fewer side effects compared to EBRT.IORT delivers a higher dose of radiation.IORT eliminates the cancer, leaving the healthy tissues alone.IORT might reduce the possibility of a recurrence of cancer because it eliminates microscopic disease immediately (EBRT might not start until a month later, giving the cancer time to return). And IORT can be performed again while EBRT may not.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhich breast cancer patients should receive intraoperative radiation therapy?You may benefit most from IORT if you are over the age of 50 and have early stage breast cancer that has not spread.How often is intraoperative radiation therapy performed?Intraoperative radiation therapy requires unique equipment. It is not readily available at every healthcare facility, so it is used far less than external beam radiotherapy. It is not used as often as EBRT.AdvertisementProcedure DetailsHow is intraoperative radiation therapy used to treat breast cancer?In treating breast cancer, IORT is used in patients who have had a lumpectomy (removal of a tumor from the breast), rather than a mastectomy (removal of the entire breast). The IORT device delivers low-energy, high-dose radiation directly to the tumor bed (the cavity left after the tumor has been removed from the breast) in the operating room, right after the tumor has been removed.After the lumpectomy, a spherical applicator on the IORT device is placed directly into the tumor bed and delivers a smaller dose of x-rays than is transported in standard radiation therapy.What happens before intraoperative radiation therapy?Your radiation team will determine the proper dose of radiation and the correct angles for the radiation beams.Directly before the dose of radiotherapy, you will be in surgery to remove the cancer from your breast(s) (lumpectomy).AdvertisementWhat happens during the procedure?The tumor is removed from your breast. Then, delivery of the IORT is done via electron beams, x-rays or high-dose-rate brachytherapy where the tumor was. Finally, the incision is closed.How long does the procedure last?The IORT treatment usually takes about 30 minutes, depending on the IORT device.Will I be asleep during intraoperative radiation therapy?Yes, you will be asleep under anesthesia.What should I expect after the procedure?In some instances the intraoperative radiation therapy is delivered after the surgery instead of during it. Your surgeon will have to reopen your incision if that is necessary.After the procedure, be sure to get enough rest, stay hydrated and eat nutritious meals.Care at Cleveland ClinicBreast Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of intraoperative radiation therapy?Breast IORT has many advantages:All of the needed radiation can be delivered at one time. The “standard” radiation therapy schedule for breast cancer is five days a week for up to six weeks. IORT saves time, and is more efficient and convenient for the patient.The radiation dose in IORT is much smaller than that of external beam radiotherapy.Nearby normal/healthy organs and tissues receive less, if any, radiation from IORT.If necessary, the patient can have another lumpectomy if another tumor is found in the breast in the future.IORT costs significantly less than external beam radiotherapy.What are the side effects of intraoperative radiation therapy?The most common side effects of IORT are bruising and excess fluid buildup in the breast tissues. A short list of side effects common with any type of radiation therapy includes:Anemia.Bleeding.Constipation.Diarrhea.Dizziness.Fatigue.Headaches.Pain.Skin problems.Sleep problems.Is intraoperative radiation therapy painful?The procedure won’t hurt you at all. There can be painful bruising in the area afterwards.Recovery and OutlookWhat’s the prognosis? How effective is intraoperative radiation therapy?Some studies have shown that intraoperative radiation therapy is just as effective as external beam radiation therapy. Other studies have proven that women who have IORT are more likely to have local recurrence (the cancer returns in the same breast) than those who had whole breast EBRT. In one experiment, 15.2% of 1,721 women who got intraoperative radiation therapy had to have EBRT later. That same experiment showed that both radiation techniques had similar survival rates after five years. 97.4% of participants who got IORT survived, as did 98.1% of those who got EBRT. A similar study saw similar results: 96.8% of IORT patients survived after six years and so did 96.9% of EBRT patients.As for the risk of local recurrence (cancer coming back within the same breast), the recurrence rate is 2.1% for IORT and 1% for EBRT.The bottom line is that IORT and EBRT survival results are similar, but IORT is less effective at preventing cancer from coming back in the same breast. Experts agree that more research is needed because IORT is still a relatively new procedure.When to Call the DoctorWhen should I contact my healthcare provider?Talk to your healthcare provider if you have any concerns about your procedure. Discuss with them, before the surgery, what side effects they expect you to have and what side effects warrant contacting them. Side effects can be different for you vs. someone else, even if you’ve had the same radiation treatment.Don’t forget that there are emotional side effects of breast cancer treatment. Seek out a therapist for counseling and a psychiatrist for medication, if necessary.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/18/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicBreast Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"