"Bronchial Thermoplasty: What It Is, What It Treats & Details800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Bronchial ThermoplastyAdvertisementAdvertisementAdvertisementBronchial ThermoplastyIf you have severe asthma that you cannot control with other therapies, bronchial thermoplasty may be an option. The treatment uses heat to shrink smooth muscle in the lungs. It keeps muscles from tightening and causing an asthma attack.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewBronchial thermoplasty uses heat to shrink smooth muscle in the lungs to reduce asthma symptoms.What is bronchial thermoplasty?People with asthma have chronic inflammation in their airways. During an asthma attack, the smooth muscle that lines the lungs swells even more. The swelling makes breathing difficult.Bronchial thermoplasty is an asthma treatment that targets the smooth muscle in the lungs. The treatment uses heat to shrink the smooth muscle so it can’t tighten and cause asthma symptoms.The treatment involves three sessions, with three weeks between each session. A pulmonologist (a doctor specializing in the lungs) performs bronchial thermoplasty. Your pulmonologist will treat a different section of your lungs during each session.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho may be a candidate for bronchial thermoplasty?Bronchial thermoplasty is approved only to treat adults with severe asthma. About 5% to 10% of people with asthma have severe asthma that can’t be controlled with medications, inhalers or other therapies.When is bronchial thermoplasty used to treat asthma?The National Institutes of Health’s asthma treatment guidelines recommend using bronchial thermoplasty only for adults who can’t use other treatments. Your healthcare provider will first try other ways to treat asthma inflammation. A subset of people with severe asthma may be candidates for this treatment.Bronchial thermoplasty is still a new and relatively unproven therapy. For many people, the limited benefits may not be worth the potential risks. You and your healthcare provider will need to decide if your asthma is severe enough to warrant trying this treatment.AdvertisementProcedure DetailsWhat happens before bronchial thermoplasty?Your healthcare provider will prescribe an oral steroid for you. You’ll take this medicine for two days before the procedure, on the day of the procedure and for two days after. The steroid decreases swelling in your lungs.What happens during bronchial thermoplasty?On the day of the procedure, you will go to the hospital. In most cases, bronchial thermoplasty is an outpatient procedure. Unless you have severe side effects after the treatment, you will not have to spend the night in the hospital.You will be under anesthesia during bronchial thermoplasty. You may be asleep so that you hold perfectly still. Or you may have lighter anesthesia. You won’t remember much, if anything, about the treatment.Your doctor inserts a thin, flexible tube called a bronchoscope through your nose or mouth and down into your lungs. The doctor then inserts a catheter (thin tube) through the bronchoscope and into your lungs. The catheter delivers the thermal heat to the smooth muscle in your lungs.AdvertisementWhat happens after bronchial thermoplasty?After the procedure, healthcare providers will monitor you for at least a few hours to watch for side effects. If the procedure triggers worsening asthma symptoms, you may need to spend the night in the hospital.Bronchial thermoplasty doesn’t cure asthma. After the procedure, you will still need to take asthma medication to help control symptoms.Care at Cleveland ClinicAsthma Treatment for AdultsFind a Doctor and SpecialistsAsthma Treatment for ChildrenFind a Pediatric Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of bronchial thermoplasty?Bronchial thermoplasty may reduce the frequency and severity of asthma attacks. While you will still need asthma medication, you may be able to take lower doses or take medicines less often, especially steroids.If you frequently have asthma attacks so severe you need to go to the emergency room, bronchial thermoplasty may reduce hospital visits. The procedure can also reduce sick days when you can’t go to school or work.What are the risks or side effects of bronchial thermoplasty?For many people, the risks and unknowns of bronchial thermoplasty may outweigh its potential benefits. Researchers have only followed a small number of patients for long periods post-treatment. Doctors don’t yet know all of the possible long-term risks.Short-term side effects can be severe. They include:Coughing up blood.Respiratory infections.Worsening asthma symptoms.Recovery and OutlookWhat is the recovery time after bronchial thermoplasty?Irritation to your lungs from the procedure itself may last for a few days. During that time, you may have asthma-like symptoms, such as shortness of breath or chest tightness. Your provider can provide ways to treat these symptoms (such as using your inhaler).How long do the effects of bronchial thermoplasty last?Some people have reported improvements in symptoms and overall quality of life lasting up to five years. Because the treatment is new, healthcare providers don’t yet know the long-term results.When to Call the DoctorWhen should I contact my healthcare provider?You should call your doctor if you experience:Chest tightness.Coughing up blood.Difficulty breathing.Severe worsening of your asthma symptoms.A note from Cleveland ClinicBronchial thermoplasty is a treatment option for people with severe asthma they can’t control with other therapies. The procedure uses heat to shrink the smooth muscles in the lungs so they can’t tighten and cause asthma symptoms. Most experts agree the slight benefits of bronchial thermoplasty do not outweigh the risks for most people.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/22/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicAsthma Treatment for AdultsFind a Doctor and SpecialistsAsthma Treatment for ChildrenFind a Pediatric Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6503Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"