"Bursa Injection: Steroid Injection for Joint Pain800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Bursa InjectionAdvertisementAdvertisementAdvertisementBursa InjectionBursa injections contain steroids that soothe bursitis inflammation and joint pain. The steroid injection eases symptoms of hip bursitis, shoulder bursitis and other types of bursitis. If injections don’t relieve symptoms, you may need surgery.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a bursa injection?Bursa injections treat bursitis pain. The shot typically contains a steroid like triamcinolone. These anti-inflammatory medicines reduce swelling and pain.The injection is combined with anesthetic to reach a larger area and provide some pain relief until the steroid has time to take effect.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs a bursa injection?People who have pain from bursitis may need steroid injections to decrease swelling and pain. Bursitis occurs when something irritates the fluid-filled sacs called bursae that cushion joints.Bursae (bur-SEE) are part of the skeletal system. They allow tendons, muscle and bone to move together without friction.Repetitive use, accidents and injuries can lead to irritation of the bursae. Over time, fluid builds up in the sacs. When bursae swell, there’s less room for joints and connective tissue to move. This creates friction and pain in the joint.What do bursa injections treat?There are 160 bursae in the body. Bursitis can affect any of them, although inflammation most commonly occurs in joints that get a lot of repetitive use. Steroid injections treat:Hip (trochanteric) bursitis.Shoulder (subacromial) bursitis.Elbow (olecranon) bursitis.Hamstring or buttocks bursitis.Knee (most commonly pre-patellar) bursitis.AdvertisementProcedure DetailsWhat happens during a bursa injection?A bursa injection is a relatively quick procedure that often takes less than 10 minutes. You’ll get the injection at your healthcare provider’s office and go home soon after. Your provider may use ultrasound technology to guide the procedure for certain injection sites like the hip, knee or shoulder.During a bursa injection, your provider:Verifies what procedure you need and in what location.Completes appropriate cleaning of the injection site.Applies a local anesthetic to the skin to numb the area.Inserts a thin needle through the skin and into the inflamed bursa sac.Injects medicine into the bursa.You may feel some pressure or discomfort while receiving the injection. If you are getting treatment to more than one bursa, your provider will repeat the steps using a new, sterilized needle for each injection.Care at Cleveland ClinicGet Orthopaedic CareMake an AppointmentRisks / BenefitsWhat are the potential side effects of a bursa injection?The types of side effects or complications vary depending on where you receive the bursa injection. Overall, bursa injections are a safe treatment for bursitis pain.You may experience discomfort, bruising or swelling in the joint for a day or two after the injection. There’s also a slight risk of infection.Other potential side effects include:Headaches.Mild fever.Skin dimpling or discoloration.AdvertisementWhat are the potential risks or complications of a bursa injection?Steroid injections can raise your blood pressure and blood sugar levels for one to two days. If you have diabetes, please make sure that you have a plan with you caregiver to address that complication. Sometimes patients might require additional medications. If you have high blood pressure or diabetes, you may need to watch that condition more closely for a few days after the injection.Recovery and OutlookWhat is recovery like after a bursa injection?If the injection had an anesthetic, you should get some pain relief that lasts for a couple of hours. After that, it can take a few days for the steroid to work and the swelling to go down.Follow your healthcare provider’s recommendations for recovery. You may need to:Avoid activity that puts stress on the treatment area for at least 24 hours.Place an ice pack wrapped in a towel on the treatment area.Take over-the-counter pain relievers or nonsteroidal anti-inflammatory drugs (NSAIDs) to ease pain and swelling.Avoid submersion — like in a bath or pool — for two days after the injection. After that, however, you can take a shower.How long do bursa injections provide symptom relief?Symptom relief varies depending on the affected joint. Bursa injections can reduce pain and inflammation for several months or up to one year.Some people get permanent symptom relief with one treatment. If you continue activities that irritate the joint, bursitis symptoms may return faster.How often can I get bursa injections?The frequency of injections depends on the treatment area, symptoms and dosage amount.You typically need to wait at least three months between injections according to the treatment condition. This is because too many injections can damage the bursa, joint and connective tissue.When to Call the DoctorWhen should I call the doctor?You should call your healthcare provider if you experience:Signs of infection, such as fever, redness or yellow discharge at the injection site.Severe pain in the treatment area.Severe bruising or bleeding.Decreased range of motion in the treated joint.A note from Cleveland ClinicBursa injections are an effective treatment for bursitis pain and inflammation. They are commonly combined with rehabilitation, depending on the body area. Generally, one injection can decrease your pain significantly. However, to keep bursitis from recurring, it’s important to follow your healthcare provider’s advice. You may need to limit activities that irritate the joint or wear a supportive brace or sling. Stretching and strengthening exercises may also help. If your symptoms reoccurred after your joint injection, please discuss them with your healthcare provider. Commonly, inflammation also involves the tendon because it’s close to the bursa in several joints. Your provider may recommend other therapies or surgery if injections haven’t been successful.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/21/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Orthopaedic CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2606Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"