"Butt (Buttocks) Lift: What It Is, Surgery & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Butt (Buttocks) LiftAdvertisementAdvertisementAdvertisementButt (Buttocks) LiftA butt lift is a cosmetic procedure that removes excess fat and sagging skin from your buttocks. Butt lift surgery is extensive and requires a long recovery. If you don’t gain weight, results tend to be permanent.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewA butt (buttocks) lift raises and smooths sagging, wrinkled skin and adds volume to your butt using liposuction.What is a butt lift?A butt lift, also called a gluteal or lower back lift, pulls up the skin around your butt (buttocks) to improve the shape and surface of your butt. The procedure creates a smoother, less dimpled and more toned appearance. Unlike other cosmetic butt procedures, a butt lift doesn’t increase the size of your butt.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho’s a good candidate for a butt lift?A plastic surgeon will help determine whether you’re a good candidate for a butt lift or another cosmetic procedure.In general, a butt lift is best for people who:Are in good health and don’t smoke.Don’t have obesity.Don’t have chronic conditions that may prevent healing, such as diabetes or lupus.Lost a lot of weight or had weight loss surgery.Have extra fat, sagging or loose skin on their buttocks.Who isn’t a good candidate for a butt lift?People who aren’t ideal candidates for a butt lift are those who:Aren’t ready for a longer recovery.Can’t quit smoking at least six weeks before surgery.Have health problems, such as heart disease.Have unrealistic expectations about their results.Haven’t reached a stable weight.AdvertisementWhat’s the difference between BBL and a butt lift?Despite the name, a Brazilian butt lift (BBL) isn’t the same as a butt lift. The goal of a butt lift is to raise and smooth sagging, wrinkled skin. The goal of BBL is to enhance and add volume to your butt.In BBL, the plastic surgeon:Removes excess fat from one part of your body, like your stomach or thighs (liposuction).Injects that fat into areas of your butt.When will I see results from butt lift surgery?You’ll see results right after surgery. However, you won’t see the full effects until about three to six months after your butt lift procedure.AdvertisementWill butt lift scars go away?Because a butt lift involves incisions, you’ll have scars. Plastic surgeons typically make incisions in less visible places that are usually hidden under clothes. Still, scars take a long time to fade and never go away completely. Some may remain noticeable. Talk to your plastic surgeon about the location of your incisions.Procedure DetailsHow do I prepare for butt lift surgery?Your plastic surgeon will give you instructions on how to prepare for your butt lift procedure, including:Not smoking.Stopping medication that increases bleeding, such as aspirin and herbal supplements.What happens before butt lift surgery?Before surgery, you’ll likely receive general anesthesia. You’ll be asleep during the entire procedure and won’t experience any pain. You’ll also likely take an antibiotic to reduce the risk of infection.What happens during butt lift surgery?The entire butt lift procedure can take several hours. Your plastic surgeon pulls up the excess skin and may also use liposuction to shape your butt or thighs.The location of your incisions depends on which technique your plastic surgeon uses. To pull up excess skin, your surgeon may make an incision:Along your lower back.In your hips.Under your butt cheeks.At the end of the surgery, your plastic surgeon:Closes the incisions using stitches, tape or another material.Covers the incisions with dressings.Places tubes under your skin (surgical drains) to drain excess blood and fluid.What happens after butt lift surgery?After surgery, you’ll go into a recovery area until you wake up from the anesthetic or where you’ll wait for a short amount of time to make sure there aren’t any complications. You may need to spend the night in aftercare. Or if your provider says it’s OK, you may go home. You’ll need someone to take you home, as you won’t be able to operate a vehicle safely after your surgery.You’ll receive instructions on how to care for your incisions and surgical drains. Often, but not always, you’re asked not to put pressure on the surgical site. Before your surgery, discuss your postsurgical plans with your surgeon and family members or friends.You may also need to:Wear a compression garment to reduce swelling and promote skin tightening and healing.Take medicine that reduces the risk of blood clots.Care at Cleveland ClinicPlastic Surgery CareMake an AppointmentRisks / BenefitsWhat are the advantages of a butt lift?Unlike other cosmetic butt procedures, a butt lift removes excess skin and improves sagging. People who’ve recently lost a lot of weight can also benefit from a butt lift. And a butt lift provides long-lasting results if you maintain your weight.What are the risks or possible complications of butt lift surgery?Your plastic surgeon should discuss the potential risks and complications of having a butt lift, which may include:Bleeding (hematoma).Chronic pain.Fluid buildup under your skin (seroma).Infection.Scarring.Numbness.Wound healing problems.Swelling that doesn’t go away.Recovery and OutlookWhat is the recovery time for butt lift surgery?Recovery from butt lift surgery takes time. You’ll likely have to use pillows when sitting and adjust how you sleep. These techniques help with healing and reduce the risk of incisions splitting.When can I get back to my usual activities?You may need to wait up to several weeks before returning to your typical activities. It can take several months for you to fully heal.When to Call the DoctorWhen should I see my healthcare provider after butt lift surgery?Call your plastic surgeon if you experience:Changes in your heartbeat.Chest pain.Excessive bleeding or swelling.Extreme or long-lasting pain.Fever.Shortness of breath (dyspnea).A note from Cleveland ClinicA butt lift removes excess skin and improves sagging, creating a smoother, more toned appearance. However, a butt lift doesn’t add volume to your butt. Recovery from butt lift surgery takes a long time. Like any cosmetic procedure, it also comes with potential risks. Talk to your plastic surgeon about whether a butt lift or another procedure is right for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/01/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPlastic Surgery CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"