"Abdominoplasty (Tummy Tuck): Risks, Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Abdominoplasty (Tummy Tuck)AdvertisementAdvertisementAdvertisementAbdominoplasty (Tummy Tuck)An abdominoplasty (tummy tuck) is a major surgery that removes excess skin and fat from the abdomen. The surgery also tightens muscles. It can be appropriate for women who have had many pregnancies or anyone who has lost a lot of weight.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookAdditional DetailsOverviewWhat is abdominoplasty (tummy tuck)?An abdominoplasty is a procedure that flattens your abdomen by removing extra fat and skin and tightening muscles in your abdominal wall. This surgical procedure is also known as a tummy tuck.Tummy tucks can be thought of as \"mini\" or more involved procedures depending on the amount of skin and fat. It's important to educate yourself, thoroughly analyze your own situation, and take your time arriving at a final decision. The procedure shouldn't be used as an alternative to weight loss.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho are the best candidates for an abdominoplasty (tummy tuck)?A tummy tuck is suitable for both men and women who are in good general health overall and are at a stable weight. It's best to be a non-smoker.A tummy tuck shouldn't be confused with a liposuction (the cosmetic surgery used to remove fat deposits), although your surgeon may choose to perform liposuction as part of a tummy tuck. Women who have muscles and skin stretched after several pregnancies may find the procedure useful to tighten those muscles and reduce that skin. A tummy tuck is also an alternative for people with a history of obesity and who've had significant weight loss, but still have excessive fat deposits or loose skin in the abdominal area.When should you avoid an abdominoplasty (tummy tuck)?If you're a woman who is still planning to have children, you may want to postpone a tummy tuck until you're through bearing children. During surgery, your vertical muscles are tightened. Future pregnancies can separate these muscles once again.If you're still planning to lose a significant amount of weight, don't have a tummy tuck right away. Wait until your weight has stabilized.It's important to note that a tummy tuck causes scarring on the abdomen. The length of the scar, which is along the bikini line, depends on the amount of extra skin. With minimal extra skin, the mini abdominoplasty results in a short scar.Your plastic surgeon will discuss all these options with you when you go for the consultation. You and your surgeon will discuss the results you want, and the surgeon will determine the appropriate procedure during your consultation.AdvertisementProcedure DetailsHow is an abdominoplasty (tummy tuck) done?Depending on the results you want, this surgery can take anywhere from one to five hours. Surgery is generally done as an outpatient procedure. If you are traveling out of town to a facility to have the procedure done, you'll be asked to stay overnight at a hotel. Liposuction may or may not be recommended at the same time.You will receive general anesthesia, which will put you to sleep during the operation. It's important to have someone with you who can drive you home. If you live alone and you're sent home after the procedure, you also will need someone to stay with you at least the first night after the surgery.Complete abdominoplasty: This option is for patients who need the most correction. The incision (cut) is made at the bikini line, at about the same level as your pubic hair. The length of the scar depends on the amount of extra skin. Your surgeon will then manipulate and shape the skin and muscle as needed. You will also have an incision around your navel (belly button) with this procedure, because it's necessary to free your navel from surrounding tissue. Drainage tubes may or may not be placed under your skin. These will be removed in a few days as your surgeon sees fit.Partial or mini-abdominoplasty: Mini-abdominoplasties are done with shorter incisions and are often performed on people who have less excess skin. Your belly button most likely won't be moved during this type of procedure. Your skin will be separated between the line of incision and your belly button. This procedure generally takes one to two hours. As with the complete abdominoplasty, you may or may not have drainage tubes after surgery.Circumferential abdominoplasty: This surgery includes the back area. When there is a lot of excess fat in the back as well as the abdomen, you may have either liposuction of the back or circumferential abdominoplasty. The latter procedure allows for the removal of both skin and fat from the hip and back areas, which improves the shape of your body from all sides.After your partial or complete tummy tuck, your incision site will be stitched and bandaged. Your surgeon may have you wear an elastic bandage or compression garment after surgery. If so, it's very important that you follow all of your surgeon's instructions on wearing this garment and caring for the bandage. Your surgeon will also tell you about the best way to sit or lie down so you'll be in the least amount of pain.If you're exceptionally physically active, you'll have to severely limit strenuous exercise for four to six weeks. Your doctor will advise you on this as you go through the healing process. Generally, one week off work after the surgery is sufficient for most people to recover properly. Again, your doctor will help you determine this.How should I prepare for an abdominoplasty (tummy tuck)?Smoking can increase the risk of complications and delay healing. If you smoke, you will have to stop for a certain period as determined by your doctor. It is not enough to just cut down on smoking. You must completely stop using all forms of nicotine — gum, patches, and e-cigarettes — for at least one month before surgery and for two weeks after. The longer, the better, in terms of the time between when you stop smoking and when you have surgery.Make sure you eat well-balanced, complete meals. Don't try to diet excessively before the surgery. Proper nutrition is important to proper healing.As part of your pre-operative consultation, your surgeon may instruct you to stop taking some of your medications that thin your blood and dietary supplements for a certain period before and after the surgery. This includes aspirin and nonsteroidal anti-inflammatories (NSAIDs). You must let your surgeon know if you're taking any blood thinners.Make sure you set up the safest, most comfortable recovery area to meet your needs before you undergo the surgery. Your home recovery area should include:A supply of loose, comfortable clothing that can be put on and taken off very easily.A telephone within easy reach.A hand-held shower head and bathroom chair.Care at Cleveland ClinicPlastic Surgery CareMake an AppointmentAdvertisementRisks / BenefitsWhat are the complications and side effects of an abdominoplasty (tummy tuck)?As expected, you will have pain and swelling after surgery. Your doctor will prescribe pain medications as needed.Soreness may last for several weeks. You may also have numbness, bruising and overall tiredness for that same time period.As with any surgery, there are risks. You may have an increased risk of complications if you have poor circulation, diabetes, heart, lung, or liver disease, or if you smoke. Complications can include:Scarring.Hematoma (bleeding).Infection.Seroma (accumulation of fluid).Poor wound healing.Blood clots.Numbness or other changes in sensationOther complications include:Fat necrosis (death of fatty tissue located deep in the skin).Wound separation.Asymmetry (unevenness or lopsidedness).Recovery and OutlookWhat is the outlook for someone who has had an abdominoplasty (tummy tuck)?Generally, most people love the new look after they've undergone this procedure. However, you may not feel like your normal self for months after the surgery. You've gone through a tremendous amount to make this happen. It is a big commitment — emotionally, physically, and financially. It's very important that you follow proper diet and exercise to maintain your new look.Additional DetailsDoes insurance cover an abdominoplasty (tummy tuck)?Insurance carriers usually don't cover elective cosmetic surgery. But your carrier may cover a certain percentage if you have a hernia that will be corrected through the procedure, or if you've had surgery for weight loss. It's extremely important that you begin communicating with your insurance company early on and that you discuss your insurance concerns with your healthcare provider.In most cases, your provider will write a letter to your insurance carrier, making the case that the surgery is medically necessary (if that applies to you). Insurance may only cover certain portions of the surgery, so make sure you get details. As with any cosmetic surgery, this may affect future insurance coverage for you, and your premiums may increase.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 12/30/2020.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPlastic Surgery CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"