"Kidney Ablation for Cancer: Procedure, Benefits & Outlook800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Ablation for Kidney CancerAdvertisementAdvertisementAdvertisementAblation for Kidney CancerAblation uses cold (cryoablation) or heat (radiofrequency ablation) to destroy a cancerous tumor on your kidney. The procedure can be an alternative therapy that may eliminate cancer while preserving your kidney. People who have ablation generally have shorter hospital stays and recover faster.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewWhat is ablation for kidney cancer?Usually, kidney cancer (also called renal cancer) is treated with surgery to remove all or part of the kidney. However, other options may be used in certain situations, particularly when you have other medical problems that make surgery unwise.One relatively new treatment is ablation, which uses cold or heat to attack a tumor. When cold is used, this is called cryotherapy or cryoablation. When heat is used, this is called radiofrequency ablation.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow does cryoablation for kidney cancer work?Cryoablation is used to treat small tumors, up to four centimeters (or about 1½ inches).Cold gas is used to destroy the tumor by freezing it and then rapidly thawing it. This starves the cancer cells of blood, oxygen, and water. The gas is delivered through a thin needle that is inserted into the tumor. This is usually a laparoscopic procedure, which means the doctor makes a few small cuts and uses a tiny camera on an instrument called a laparoscope.This can also be done through your skin (percutaneously) with a radiologist inserting a needle that is guided by a CT scan to freeze the tumor. This is even less invasive than the laparoscopic approach.What happens before and after cryoablation for kidney cancer?Your doctor might ask you to stop taking certain medications or supplements as much as a week before the procedure. You will be asked to not eat or drink for eight hours before the procedure.You will probably only be in the hospital for one day, but full recovery might take as long as three weeks. During this time you will be asked to avoid strenuous activity. For this reason, arranging for some help at home is a good idea. You will have several follow-up appointments for scanning procedures over the next six months.AdvertisementHow does radiofrequency ablation for kidney cancer work?Several needles are placed in the tumor. The needles are used to heat the tumor with electric currents, or radio waves, that destroy it. This is usually done under local anesthesia, meaning you will be awake for the procedure. You might be given medicine to help you relax.What happens before and after radiofrequency ablation for kidney cancer?As with cryoablation, your doctor will give you instructions about when to stop taking medications and supplements. They will tell you how long you need to not eat or drink before the procedure.You might be able to go home shortly after the procedure is over and resume your normal activities after a few days. However, more than one session may be required.Care at Cleveland ClinicKidney Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the advantages of ablation as a treatment for kidney cancer?Ablation can be performed when surgery would be risky because of your age or other medical conditions. The plan is to destroy the tumor while sparing the rest of the kidney. Compared to surgery that removes part of or all of your kidney, people who have ablation treatments have shorter hospital stays and return more quickly to their normal activities.What are the risks of ablation as a treatment for kidney cancer?People may need multiple kidney ablation treatments to achieve the desired results. In addition, there is a chance that the heat from ablation could cause a urine leak or a blockage that prevents the flow of urine from your kidney to your bladder. It’s important to note that most surgeons place a temporary stent to protect against heat injury during ablation. Other possible complications include infection or damage to the treated kidney.Recovery and OutlookWhat is the long-term outlook after ablation for kidney cancer?These procedures are relatively new. Cryoablation was first used in this way in 1995, and radiofrequency ablation for kidney cancer is an even more recent development. So while the success rate has been good, patients who have had one of these procedures must be carefully followed over the years to determine how effective they are in the long run.A note from Cleveland ClinicWith fewer side effects and a faster recovery time, kidney ablation is a successful alternative to surgery for many people. Your healthcare provider can discuss your treatment options in detail and let you know if this procedure is right for you. They can also give you plenty of resources so you can make an informed decision regarding your overall health.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/03/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicKidney Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"