"Ablation Therapy800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Ablation TherapyAdvertisementAdvertisementAdvertisementAblation TherapyAblation therapy is a minimally invasive treatment option that is used to destroy tumors and other abnormal tissues in the body. This procedure can use either freezing cold liquids or very hot liquids.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewWhat is ablation therapy?Ablation therapy uses extremely high or low temperatures to destroy (ablate) abnormal tissue or tumors, or to treat other conditions. It is a minimally invasive procedure, meaning that it may be done without open surgery. Ablation removes a layer or layers of tissue, unlike a surgical resection, which removes an entire organ or part of it.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow is the tissue removed during ablation therapy?Tissue can be destroyed by freezing it with cold liquids, or applying hot liquids to the area. Radiofrequency energy or electrical currents may also be applied to destroy the abnormal tissue.Some of the more commonly used methods in ablation therapy include:Microwave ablation: Usually, a thin probe is inserted through a small incision in the skin. The placement of the probe may be guided by using ultrasound, computed tomography (CT) or MRI (magnetic resonance imaging) to locate the area to be treated. The tip of the probe releases microwaves to destroy the tissue.High-energy radiofrequency ablation: This technique is similar to microwave ablation, only radiofrequency waves are used instead.Thermal balloon ablation: A balloon is inserted into the body cavity and filled with fluid heated to 190 degrees Fahrenheit.Laser ablation: A laser may be used to treat skin discolorations or lesions.Cryoablation: A probe or other device is inserted using a thin needle or applied to tissue and supercooled to minus 4 degrees Fahrenheit with liquid nitrogen or argon. The cold gas flows through the tip of the probe, causing ice crystals to form and destroy the tissue.Why is ablation therapy performed?An ablation may be performed to treat many types of medical conditions. Some of the most common procedures include:Catheter or cardiac ablation: A radiofrequency ablation or cryoablation is sometimes performed to treat a heart arrhythmia (irregular heartbeat). The goal is to restore normal heart rhythm by destroying or scarring areas of the heart that cause the irregular heartbeats.Endometrial ablation: Women who experience heavy menstrual bleeding may benefit from an ablation of the endometrium (the lining of the uterus). The procedure can stop or alleviate abnormal bleeding, but it is irreversible.Ablation for cancer: Cancerous tumors of the kidneys, liver, and other organs may be treated with cryoablation or other ablation techniques.AdvertisementProcedure DetailsHow do I prepare for ablation therapy?You should not eat solid food or drink fluids before undergoing the procedure. Your healthcare provider will tell you how long you should avoid eating or drinking.Continue taking your medications as usual, unless your doctor tells you to stop taking them. Patients who take a blood thinner, such as Coumadin® or warfarin, might need to stop taking it temporarily. Discuss any concerns about your medication with your doctor.You may require blood tests or other diagnostic tests prior to the procedure.Do not wear any jewelry to the hospital or clinic.What happens during the ablation therapy procedure?The procedure may be performed in a hospital or outpatient facility. You may be sedated before the procedure begins. An area of skin may be shaved, if necessary, and disinfected. You may be given a local anesthetic to numb the area where the needle or catheter will be inserted. In some cases, a general anesthetic is given, and the patient is not awake during the procedure. A needle puncture or small incision is made so that the probe or catheter can be inserted.In the case of a catheter ablation, a balloon catheter will be inserted into a blood vessel, usually in the groin area, forearm or neck. It is then threaded through the blood vessel until it reaches the heart. Imaging may be used so the tip of the probe or catheter can be viewed while it is being placed.The length of the procedure can vary, depending on the type of ablation or the condition being treated. Catheter ablation generally takes three to six hours.Care at Cleveland ClinicGet Cancer CareMake an AppointmentAdvertisementRisks / BenefitsWhat are the benefits of ablation therapy?Benefits of ablation therapy include a shorter recovery time compared to open surgery, less bleeding and minimal risk. Some procedures may be performed under local anesthesia, during which the patients remain awake. Usually, open surgery is not required, so recovery times are shorter. A patient may be discharged the same day, or require only short period of hospitalization. Ablation therapy does not damage the surrounding healthy tissue. It can be repeated if necessary.Ablation therapy can be used along with other types of therapy, such as chemotherapy or drug therapy.What are the risks of ablation therapy?The risks of ablation therapy will vary depending on the specific procedure that is used and the severity of the underlying condition. Generally, ablation therapy is quite safe and the risk is minimal. Complications of ablation may include:Bleeding from the puncture siteInfectionsScarringDamage to blood vesselsStroke or heart attackRecovery and OutlookWhat happens after an ablation therapy procedure?You may have to remain in the hospital for several hours or overnight, depending on the type of procedure. Catheter ablation generally requires an overnight stay.If you received a local anesthetic, you might be able to go home within few hours. You might feel sick or nauseated if you were given a general anesthetic. It is common to experience fatigue or tiredness for a few days after the ablation. Discomfort may persist from a few hours to a few days.The recovery period may vary depending on the underlying condition and the type of ablation procedure.You may have to avoid strenuous activities for a while. You should arrange for someone to drive you home if you are discharged the same day. Ask your doctor about how long you should wait before resuming normal activities.Women who have an endometrial ablation may experience vaginal bleeding or a discharge afterward, which may persist for up to three or four weeks.Seek immediate medical treatment if you experience a high fever, excessive bleeding, vomiting, pain, or any other unusual or distressing symptoms.Will I need to repeat ablation therapy in the future?The ablation procedure may need to be repeated if the condition recurs later. There may be a waiting period of three to six months following a cardiac or catheter ablation to see whether the procedure was effective.What is the long-term outlook for patients after ablation therapy?An ablation procedure might not always be effective or might not be the best option for treating a particular condition. You may need to continue taking medication, even if the procedure is successful. If ablation therapy is not effective, you might have to undergo a different type of procedure. You should discuss all available options with your doctor.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/10/2019.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Cancer CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"