"Angiotensin-Converting Enzyme (ACE) Inhibitors800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/ACE InhibitorsAdvertisementAdvertisementAdvertisementACE InhibitorsAngiotensin-converting enzyme inhibitors, often shortened to ACE inhibitors, are a type of medications that lower your blood pressure. They interfere with how your body converts angiotensin into a form that raises your blood pressure. These drugs can treat cardiovascular conditions like high blood pressure, heart failure, kidney problems and more.ContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat are ACE inhibitors?Angiotensin-converting enzyme inhibitors, often shortened to ACE inhibitors or ACE-I, are a class of medications that help lower your blood pressure and can protect your kidneys. They’re used to treat cardiovascular (heart- or circulatory system-related) conditions like high blood pressure, heart failure, diabetes-related kidney disease and more.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow do they work?ACE inhibitors work just like the name suggests, blocking angiotensin-converting enzyme (ACE) from converting angiotensin I into angiotensin II. Because angiotensin II raises blood pressure in multiple ways, reducing the amount in the body is an effective way to lower blood pressure.Why is blocking ACE so effective?ACE is part of your body’s blood pressure control process. Enzymes like ACE are useful because they are catalysts. That means they make it easier for certain chemical reactions to happen.ACE raises your blood pressure in two ways:Angiotensin I conversionAngiotensin (an-gee-oh-ten-sin) is a hormone found in your body in four different forms (the names of the forms use Roman numerals). ACE turns angiotensin I into angiotensin II, which has multiple effects throughout your body.Some of those effects — all of which increase your blood pressure — include:Circulatory system: causes your blood vessels to tighten and narrow.Kidneys: limits how much sodium and water are removed from your body.Endocrine system: causes your adrenal gland to release aldosterone, a hormone that your kidneys use to control sodium, potassium and fluid levels in your body.Bradykinin breakdownBradykinin (bray-dee-ky-nin) is a protein that lowers your blood pressure by relaxing your blood vessels and helping your kidneys remove sodium from your body. ACE breaks bradykinin down. Less available bradykinin makes your blood pressure go up.Blocking ACE means there’s less angiotensin II to raise your blood pressure, and there’s more bradykinin to lower your blood pressure.AdvertisementWhat conditions are treated by this class of medication?ACE inhibitors can treat the following conditions:High blood pressure (hypertension).Heart failure (including left ventricular systolic dysfunction, where the lower left chamber of the heart can’t pump well).Heart attack.Prevention of heart attack and stroke in people at high risk for either.Preventing and slowing the progression of kidney failure in people with diabetes.ACE inhibitors also treat several kidney diseases in people who don’t have diabetes, including:Nephrotic syndrome (having kidney damage or its symptoms).Proteinuria (too much protein in your urine).Glomerular disease (problems with your kidney’s filtration system).Post-transplant glomerulonephritis (kidney inflammation and filtration problems).Are ACE inhibitors commonly prescribed?ACE inhibitors are very commonly prescribed, especially for blood pressure and other cardiovascular conditions. In 2019, about 12.9 million people with Medicare Part D coverage — about 27% of all Medicare Part D beneficiaries — were prescribed an ACE inhibitor.AdvertisementHow many ACE inhibitors are there?There are 10 different ACE inhibitors (as of Aug. 2021) approved by the FDA. They are:Benazepril.Captopril.Enalapril.Fosinopril.Lisinopril.Moexipril.Perindopril.Quinapril.Ramipril.Trandolapril.All of the ACE inhibitors are taken orally (by mouth). One, enalapril, can also be given in intravenous (IV) form, meaning it can be delivered right to your bloodstream.Risks / BenefitsWhat are the advantages of ACE inhibitors?ACE inhibitors have several advantages that make them first-line medications for treating high blood pressure and other cardiovascular conditions. Those include:They work. ACE inhibitors have the support of extensive scientific research showing they’re effective.They’re preventive. One of the most important effects of ACE inhibitors is not just that they can treat existing problems. They can also prevent those problems from happening (either for the first time or again).They often combine well with others. ACE inhibitors are often combined with certain other types of blood pressure-managing medications into a single drug.They’re safe. Side effects of ACE inhibitors are usually minor. Severe side effects are especially rare.What are the possible side effects and complication risks of these medications?ACE inhibitors do have certain side effects. The majority of these are minor, but some are serious and need immediate medical care. Your healthcare provider can best explain the possible side effects, especially those you should watch for because they are dangerous or severe.In general, the most common side effects for almost all ACE inhibitors include:Dry cough. This is possible with all ACE inhibitors. For some people, it may go away. If it doesn’t, you can ask your healthcare provider about ways to remedy it.Dizziness. This is common with all blood pressure medications. You shouldn’t stand up too quickly after you start taking an ACE inhibitor. Standing up too quickly can make you feel dizzy or pass out.Headache.Drowsiness.Feeling fatigued.Weakness.Less-common side effects include:Abnormality in taste (decreased ability to taste, or a noticeable metallic taste).Upset stomach or nausea.Rash.Severe side effectsCertain severe side effects can happen with all ACE inhibitors. These include:Swelling of your face, eyes, mouth, lips, tongue, throat, or to your legs, feet or hands. Swelling is a sign of a condition called angioedema, and it can be dangerous if it affects any part of your mouth or throat. If you have this kind of swelling in your face, mouth or throat, you should get medical attention right away.Jaundice (yellowing of the whites of your eyes or your skin, which can be a sign of serious liver problems).Allergic reactions.What are the reasons I should not take these medications?There are several reasons why you shouldn’t take ACE inhibitors (these are “contraindications”). You should also ask your healthcare provider if you have any questions about reasons you should or shouldn’t take a medication. They are best prepared to explain any reasons why you shouldn’t take an ACE inhibitor, because they can listen to and answer your questions, review your medical record and look for any potential causes for concern.Some general reasons include the following:Pregnancy or breastfeeding. ACE inhibitors shouldn’t be taken when pregnant because they can cause severe birth defects or the death of a fetus. Some ACE inhibitors are compatible with breastfeeding, so continuing to take them is usually left to individual choice.History of angioedema — either inherited or idiopathic (meaning the cause is unknown) — or any past reaction to an ACE inhibitor.Severe kidney disease or disease of the arteries that supply blood to the kidney (renal artery stenosis).Do ACE inhibitors interact with any other medications?Because ACE inhibitors affect your circulatory system, they can interact with many medications. Your healthcare provider or a pharmacist are the best sources of information when it comes to explaining potential medication interactions.A few possible serious interactions include:Non-steroidal anti-inflammatory drugs (NSAIDs)These over-the-counter pain and inflammation relief medications can sometimes interact with ACE inhibitors and make them less effective or cause a decrease in kidney function. Talk to your healthcare provider before you take any NSAID if you are already taking an ACE inhibitor.NSAIDs come in both prescription and over-the-counter forms. Over-the-counter NSAIDs include:Aspirin (this doesn't count low-dose aspirin taken as recommended unless your healthcare provider tells you otherwise).Ibuprofen (commonly found in Advil® and Motrin®).Naproxen sodium (commonly found in Aleve®).NSAIDs are very commonly combined with other medications like acetaminophen (the main ingredient in Tylenol®, sometimes called paracetamol internationally), which isn’t an NSAID on its own. You may want to read the label and ask a pharmacist for guidance to make sure any over-the-counter medication you want to take doesn't contain an NSAID without your knowing.Medications that affect your potassium or sodium levelsACE inhibitors affect how your body retains (or doesn’t retain) sodium and potassium. That means other medications that also affect those levels can cause you to have too much of those. Hyperkalemia (too much potassium in the blood), in particular, is a concern with ACE inhibitors.Angiotensin-receptor blockersWhere ACE inhibitors stop angiotensin’s conversion into a usable form, angiotensin-receptor blockers (ARBs) keep your body from using most of its angiotensin II. When used together, they can sometimes affect your kidney function, lower blood pressure and cause dangerous hyperkalemia.Medications that affect your kidneysAn example of this is a medication called aliskiren, which inhibits an enzyme called renin. Renin is also an important part of your body’s control over blood pressure.Are there things I shouldn’t eat or drink while taking an ACE inhibitor?In general, follow your healthcare provider’s guidance when it comes to what you should or shouldn’t eat or drink. This is especially true if your provider tells you to follow a low-sodium diet. Not following that guidance could affect your sodium levels. You also should avoid salt substitutes that contain potassium until you talk to your provider about whether or not those substitutes are safe.While it isn't dangerous, capsaicin — the chemical compound that makes foods like peppers spicy — can sometimes worsen an ACE inhibitor-related cough.Recovery and OutlookHow long can I stay on ACE inhibitors?ACE inhibitors are typically safe for long-term use. In many cases, you can take them indefinitely and for the rest of your life.Can I ever stop taking these medications?You should talk to your healthcare provider before you stop taking these medications. Stopping them suddenly can cause serious and life-threatening medical events, especially ones like heart attack, stroke or worsening heart failure.Depending on why you take an ACE inhibitor, it may be possible to improve your blood pressure to the point where it’s no longer needed. Your doctor can help taper off your dose until it’s safe to stop taking it.In cases where you still have the original health condition but want to stop taking an ACE inhibitor, your healthcare provider can usually help you. They can offer medication alternatives and assist you in switching to another drug that can also help you.If you miss a doseIf you miss a dose of your ACE inhibitor — unless it is closer to the time for your next dose than the one you missed — you should take the dose as soon as possible. If it’s been too long, wait and take only the next dose. Don't take more than your prescribed dose to \"catch up\" because this can cause severe, dangerous lowering of blood pressure.When to Call the DoctorWhen should I call my healthcare provider?Your healthcare provider is the best person to advise you on when to call them or seek medical attention.In general, you should seek immediate medical attention if you experience any of the following:Swelling that may indicate angioedema, especially swelling in your face, mouth or throat.Any symptom of an allergic reaction, especially hives, itching or trouble swallowing or breathing.Fainting or passing out, including “near-misses” where you almost pass out.Any symptoms of a heart attack or stroke.A note from Cleveland ClinicACE inhibitors are an important tool when it comes to treating a wide range of health problems. Depending on what you need and your circumstances, they may be able to help improve your health now and prevent problems in the future. If you have questions about these medications, your primary care provider is a great source of information and guidance. They can offer you options and then help you as you work to manage your health and well-being.Care at Cleveland ClinicCardiology CareMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/22/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicCardiology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"