"Acupuncture: What To Know800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/AcupunctureAdvertisementAdvertisementAdvertisementAcupunctureAcupuncture is a traditional Chinese method used to relieve some health conditions and symptoms, such as pain. An acupuncturist inserts very thin steel needles into your skin at multiple “acupoints.” The needles rebalance your body’s energy, or qi, and prompt your body to release natural chemicals to fight the illness or symptom.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewAcupuncture is a treatment that uses very thin steel needles inserted into your skin to stimulate specific points throughout your body.What is acupuncture?Acupuncture is a treatment that uses very thin steel needles inserted into your skin to stimulate specific points throughout your body, including your back, neck, head and face. The goal of acupuncture is to relieve a health condition or symptom, such as pain. The practice comes from traditional Chinese medicine. Scientific studies have confirmed its effectiveness for some conditions. Acupuncture is mainly a supplemental therapy. You may need other medical treatments to help relieve your health issues.What does acupuncture treat?Acupuncture can help treat many types of health issues. Most often, people use it to relieve chronic (long-term) pain, such as:Arthritis.Back pain, neck pain or muscle pain.Headaches and migraines.Knee pain.Menstrual cramps.Sports injuries.Face pain and other nerve discomfort.Other health conditions acupuncture may help include:Cancer and cancer treatment side effects.Immune system problems.Infertility.Irritable bowel syndrome (IBS).Menopause and hot flashes.Pregnancy discomforts.Repetitive strain disorders and overuse syndrome.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAre there different types of acupuncture?Acupuncturists who follow more traditional/ancient Chinese principles focus exclusively on directing the flow of qi (pronounced “chee”), or energy, through your body. Modern acupuncture applies Western medicine, using needles to stimulate your body’s systems. Many acupuncturists use a combination of both approaches.Another acupuncture approach treats myofascial pain. This common condition involves muscles and their connective tissue. When muscles are stressed, strained or injured, they often form trigger points — tight, painful knots. A trigger point in one muscle can create pain in a different area of your body (referred pain).Acupuncturists can use trigger point therapy to ease myofascial pain. They use needles to try to “unknot” the trigger point.What is auricular acupuncture?Auricular acupuncture, or ear acupuncture, is a type of acupuncture that involves stimulating specific areas of your ear. Acupuncturists insert needles in specific ear acupuncture points to provide chronic back pain and cancer pain relief.Procedure DetailsHow does acupuncture work?Chinese medicine calls the energy that flows through your body qi. Chinese medicine practitioners believe qi disruptions create imbalances in your body’s energy that lead to illness.Some forms of acupuncture aim to rebalance qi with needles that touch acupuncture points (acupoints) throughout your body. There are hundreds of acupoints in your body along 14 major meridians, also called energy-carrying channels.The needles stimulate your body’s central nervous system and immune system to:React to an illness or symptom.Rebalance your body.Release natural chemicals, such as endorphins, your body’s natural painkillers, and neurotransmitters, chemicals that control nerve impulses.What happens during an acupuncture treatment?During your first appointment, your acupuncturist will talk to you about your condition. Then, they’ll examine your body for areas that’ll react to acupuncture. Your acupuncturist will tap the needles into points in your skin throughout your body.The acupuncture needles are sterile, disposable and as thin as a human hair. Your acupuncturist inserts needles at various depths, from a fraction of an inch to a couple of inches. The needles stay in for a few minutes or as long as 20 minutes.Does acupuncture hurt?You may feel a small prick with each needle. It’s less painful than the feeling when you get a vaccine or blood draw. Acupuncture needles are much thinner than medical needles. And they’re solid, not hollow.The needles may cause some muscle sensations, such as dull aches or tingling. Your practitioner will ask you to report when you feel a deep heaviness or numbness. Those sensations usually mean the treatment is working.What happens after an acupuncture treatment?Acupuncture has a calming effect, so you may want to get a ride home from your appointments — especially the first one. If that’s not possible, try to rest for five to 10 minutes before you drive. Your practitioner may suggest that you take it easy for a day or two after each session.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdvertisementRisks / BenefitsWhat are the benefits of acupuncture?Acupuncture benefits include relief from long-term (chronic) pain and other health conditions. Many people use acupuncture to relieve pain throughout their body, including for migraines, back pain and arthritis. Studies have also shown that acupuncture may be a successful treatment option for a variety of conditions, including immune system issues, infertility and the effects of menopause.What are the risks or complications of acupuncture?When a qualified professional performs acupuncture, it has very few complications or side effects.The U.S. Food and Drug Administration (FDA) regulates acupuncture needles. The agency requires that all needles be steel, solid, sterile, nontoxic and properly labeled. Only qualified professionals may use acupuncture needles. After one use, practitioners throw the needles away.Receiving acupuncture from unqualified practitioners can be harmful. An untrained provider or one who uses nonsterile needles can cause infections, organ punctures and central nervous system injuries.AdvertisementRecovery and OutlookHow often should I get treatments?The number of treatments depends on your condition, its severity and how your body responds. Most people have an appointment once a week. Others get treatment more or less often, depending on how long the effects last. Your acupuncturist will recommend a schedule that’s right for you.You may not get the full benefits of acupuncture on the first or second treatment. If you decide to try acupuncture, you should give it at least five treatments.When to Call the DoctorWill I need any other treatments besides acupuncture?Don’t use acupuncture to delay seeing a medical healthcare provider about a health problem. In most cases, people use acupuncture along with other treatments. For example, someone with chronic pain will likely take medications and also get acupuncture. Someone with cancer would still receive cancer treatment but also use acupuncture.You should continue taking your prescribed medications, no matter how good acupuncture makes you feel.Additional Common QuestionsDry needling vs. acupuncture – what’s the difference?Acupuncture is similar to dry needling, but it’s not the same procedure. Both involve the use of needles, but that’s where the similarities end.Acupuncture is based in Eastern medicine, and licensed acupuncturists perform it. Dry needling is based in Western medicine and healthcare providers such as physical therapists perform it.Acupuncture treats musculoskeletal pain and other body systems. Physical therapists usually use dry needling as part of a broader physical therapy approach that includes other treatments.Is acupuncture covered by insurance?Some insurance companies cover acupuncture, but others don’t. And there may be limits on the number of treatments that are covered. Ask your acupuncturist and your insurance company about coverage, including how many treatments your plan will cover. You may need a referral from a doctor or other healthcare provider.A note from Cleveland ClinicWe’re only beginning to understand the effects of acupuncture. Research stories from people who’ve tried it have shown that it may help alleviate some illnesses and symptoms. If you decide to try acupuncture, check your practitioner’s credentials first to be sure they’re qualified, experienced and use good sanitation practices.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/16/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.448.4325Appointments & LocationsSign Up for News & InfoFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"