"Adenoidectomy (Adenoid Removal): Surgery & Recovery \t\t800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Adenoidectomy (Adenoid Removal)AdvertisementAdvertisementAdvertisementAdenoidectomy (Adenoid Removal)An adenoidectomy is surgery to remove your child’s adenoid glands. Your child may need this surgery if their adenoids have become swollen or enlarged because of an infection or allergies. An adenoidectomy can help if your child is experiencing breathing problems or frequent ear and sinus infections because of enlarged adenoids.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewAdenoids located in the back of the mouth.What is an adenoidectomy?An adenoidectomy, or adenoid removal, is surgery to remove your child’s adenoid glands. Adenoids are small lumps of tissue located behind your nose in your upper airway. Adenoids are considered a vestigial organ in adults (a remnant with no purpose).Adenoid glands are part of your child’s immune system. They fight germs you breathe in, like viruses and bacteria. Adenoids usually shrink and disappear by the time most children turn 13.While adenoids help protect your child’s body from viruses and bacteria, they sometimes become swollen and enlarged. This swelling (inflammation) can be caused by infections, allergies or other reasons. Some children may also be born with abnormally large adenoids.Swollen adenoids may need to be surgically removed if they’re partially blocking your child’s airway.Who needs an adenoidectomy?An adenoidectomy is mostly for children between 1 and 7 years old. Children’s adenoids naturally begin shrinking around age 7 and are almost completely gone by the teens.What does an adenoidectomy treat?An adenoidectomy treats enlarged adenoids that can cause problems by partially blocking your child’s airway. A narrowed airway can cause a range of issues that require treatment, including:Trouble breathing: Your child may have trouble breathing during the day and when they’re trying to sleep. In more severe cases, swollen adenoids can cause sleep apnea, which makes you stop breathing at night.Trouble sleeping: Your child may snore and have trouble sleeping. They may be irritable during the day because they’re not getting enough rest at night.Ear infections: Your child may get frequent ear infections and chronic fluid in the ear, which can cause temporary hearing loss.Sinus infections: Your child may experience chronic (long-term) nasal drainage, congestion and frequent sinus infections.How does a healthcare provider determine if a child needs an adenoidectomy?After taking a health history, a healthcare provider will examine your child’s adenoids, either with an X-ray or with a small camera placed in your child’s nose.Based on your child’s symptoms and the appearance of their adenoids, your provider may recommend removing their adenoids.How common is adenoid removal surgery?Adenoid removal is extremely common. It’s one of the most common surgeries children receive.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow should I prepare for an adenoidectomy?Follow your healthcare provider’s instructions on which medicines your child should or shouldn’t take in the days and weeks leading up to their surgery. For instance, your provider may advise you to avoid aspirin, ibuprofen and other medication that can thin your child’s blood.Follow your provider’s guidance on fasting (temporarily not eating and drinking). Your child’s stomach should be empty for surgery.You should also monitor your child for symptoms of a cold, flu or other respiratory infection. Your provider may recommend postponing surgery if your child gets sick beforehand.What happens during an adenoidectomy?An adenoidectomy is a straightforward, relatively short procedure performed by an ear, nose and throat (ENT) surgeon. Most children go home the same day of their surgery.Your child will be placed under general anesthesia, which means they’ll be asleep the whole time. They won’t feel any pain.The surgeon will open your child’s mouth once they’re asleep and remove their adenoids. They’ll perform the surgery through your child’s mouth, which means they won’t have to make visible incisions (cuts) on your child’s skin.The surgeon may apply a heated wire to the incision site inside your child’s mouth to stop the bleeding. This technique is called electrocauterization surgery.The surgeon may also remove your child’s tonsils (tonsillectomy) at the same time if they’re also swollen and causing symptoms. These surgeries are commonly performed together.How long does an adenoidectomy take?An adenoidectomy is a quick procedure. The surgery only takes about 30 minutes.AdvertisementWhat happens after an adenoidectomy?Members of your child’s care team will take them to the recovery room, where your child will wake from the anesthesia. Once your child wakes, a provider will make sure they can breathe, cough and swallow.You’ll likely be able to go home that same day. If your provider wishes to monitor your child, they may need to stay in the hospital overnight.Care at Cleveland ClinicSchedule an AdenoidectomyFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of having adenoids removed?An adenoidectomy is a safe surgery that can relieve your child’s symptoms. Although adenoids are part of your child’s immune system, adenoid removal won’t make their immune system weaker. Immune systems are highly adaptable. Your child doesn’t need adenoids to fight germs. They’ll actually be healthier without having enlarged adenoids.AdvertisementWhat are the risks of an adenoidectomy?An adenoidectomy is a safe procedure. Still, as with any surgery, there are potential (but rare) risks.They include:Infection.Mild pain.A reaction to anesthesia.Excessive bleeding (very rare).Permanent changes in vocal quality.Failure to resolve the underlying breathing problems, ear infections or nasal drainage.It’s also possible for your child’s adenoids to grow back. It’s impossible to remove all traces of the tissue since the adenoids are so far back in your child’s nasal passage. If the tissue continues to cause problems, your child may need surgery twice. This is extremely rare.Recovery and OutlookWhat is the prognosis (outlook) for a child who has had an adenoidectomy?After an adenoidectomy, a child almost always has a full recovery. Children go on to live healthier lives with far fewer breathing and ear problems. Children without adenoids have immune systems that are just as strong as children with adenoids.What is the recovery time for an adenoidectomy?Your child should recover within a week or two following surgery. In the meantime, they may experience symptoms, such as:Vomiting or upset stomach (within the first 24 hours).Fever (for the first day or two following surgery).Bad breath (for a few weeks).Trouble swallowing.Noisy breathing.Sore throat.Neck pain.Earache.Your child may need pain medicine for a few days during recovery. Your provider can prescribe pain medications in liquid form that will be easier for your child to swallow.How do I care for my child during recovery?Follow your healthcare provider’s guidance on how much rest your child needs and what activities they should avoid. To protect your child while they’re healing, avoid places where they can be exposed to germs that may make them sick. It’s also a good idea to avoid smoky environments that may irritate their nasal passages.Your child may have trouble tolerating certain foods during their recovery period. As a rule, steer clear of foods that are spicy, crunchy or acidic (like citrus) that may irritate their throat and nasal passages. Instead, encourage them to eat and drink:Cold foods, like popsicles and ice cream.Soft foods, like Jell-O®, pudding and mashed potatoes.Fluids, including water, nonacidic fruit juices and soup.When can my child go back to school?Follow your provider’s guidance on when it’s safe to return to school. Many children need at least a week out of school to rest as part of their recovery.When to Call the DoctorWhen should I call my healthcare provider?Monitor your child closely after you take them home from surgery. Call your healthcare provider if you notice any of the following:Your child is having trouble swallowing.Your child is unable to keep food or drink down.Your child develops a fever three or more days after surgery.Your child coughs up blood clots or spits up blood that looks like coffee grounds.A note from Cleveland ClinicAn adenoidectomy is a common procedure that can give your child relief from ear infections, sinus infections, breathing and sleeping problems. If your child needs this procedure, ask your healthcare provider how you can prepare them for it. Ask your provider about the recovery timeline so you and your child know what to expect. Have your provider “perform” the surgery on a teddy bear or special toy so your child can see there’s nothing to fear. Having all your questions answered beforehand can provide you and your child more comfort and confidence as you plan for surgery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/23/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule an AdenoidectomyFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"