"Adjuvant Therapy: What It Is, Types & Procedures800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Adjuvant TherapyAdvertisementAdvertisementAdvertisementAdjuvant TherapyAdjuvant therapy targets cancer cells that primary cancer treatment didn’t destroy. Having adjuvant therapy means more time spent in cancer treatment, but reduces the chance you’ll have the same cancer again. Adjuvant therapy is often used as follow-up treatment for breast, colon and lung cancers.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewWhat is adjuvant therapy?If you’ve received cancer treatment, your healthcare provider may recommend that you have follow-up treatment, often called adjuvant therapy. Adjuvant therapy, sometimes called helper therapy, targets cancer cells that primary treatment didn’t destroy. Adjuvant therapy uses many common cancer treatments. Having adjuvant therapy often means more time spent in cancer treatment, but reduces the chance you’ll have that cancer again. Healthcare providers typically use adjuvant therapy for breast, colon and lung cancers.Why would my healthcare provider recommend adjuvant therapies?Healthcare providers make recommendations based on the kind of cancer you have and your primary or initial cancer treatment. Some factors they may consider when recommending adjuvant therapy include:You have a type of cancer that healthcare providers diagnosed and treated at an early stage. Studies show adjuvant therapy helps reduce the chance your cancer will come back.You have a type of cancer that was diagnosed and treated at a later stage, making it more likely you have cancer cells even after completing treatment.Your healthcare provider found several cancer cells in your lymph nodes. Cancer that’s spread to your lymph nodes is more likely to come back.My healthcare provider said my imaging tests results showed no signs of cancer. Why do I need adjuvant therapy?Cancer cells can be microscopic — so tiny that healthcare providers can’t spot them on imaging tests such as magnetic resonance imaging (MRI) or computed tomography (CT) scans. Your healthcare provider may recommend adjuvant therapy to destroy these microscopic cells.My healthcare provider recommends adjuvant therapy. Does that mean I still have cancer?Not necessarily. Since these cells can be microscopic and too small to see, healthcare providers can’t say if some cancer cells remain after treatment. The goal of adjuvant therapy is to eliminate any tiny amounts of cancer cells that remain, reducing the chance that the cancer comes back.What’s the difference between adjuvant therapy and neoadjuvant therapy?Neoadjuvant therapy is treatment given before your primary treatment. For example, if you’re going to have surgery to remove a cancerous tumor, your healthcare provider may recommend you have chemotherapy or radiation therapy before your surgery to shrink the tumor. When healthcare providers remove tumors, they also remove a margin, or section of healthy tissue that surrounds the tumor. By shrinking the tumor, your healthcare provider may be able to remove it without having to remove as much healthy tissue. Smaller tumors may also mean smaller incisions and an easier recovery.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat kinds of cancer are treated with adjuvant therapies?Healthcare providers typically treat breast cancer, colorectal (colon) cancer and non-small cell lung cancer with adjuvant therapy. They may recommend adjuvant therapy for other types of cancer. Healthcare providers are studying how to best use adjuvant therapy for many different types of cancers.Breast cancerAdjuvant therapy for breast cancer varies based on breast cancer type, the kind of breast cancer surgery and the chance breast cancer may come back. Common adjuvant therapies for breast cancer include:Radiation therapy: If you had a lumpectomy, your healthcare provider may recommend adjuvant radiation therapy to reduce the chance you’ll develop cancer in your remaining breast or nearby lymph nodes. If you had a mastectomy, they may recommend you have adjuvant radiation therapy if they couldn’t remove all of your cancer or if they found cancer in nearby tissue or your lymph nodes, muscle or tissue.Chemotherapy: Your healthcare provider may recommend adjuvant chemotherapy after surgery to kill any remaining cancer cells and to reduce the chances that your breast cancer may come back.Immunotherapy: Immunotherapy fights cancer by boosting your immune system so it can identify and destroy cancer cells. Your healthcare provider may recommend immunotherapy for stage II or stage III triple-negative breast cancer. Your healthcare provider may combine immunotherapy and chemotherapy before you have surgery. This is neoadjuvant therapy. They may continue treatment after your surgery.Hormone therapy: Healthcare providers use hormone therapy (also called endocrine therapy) cancer to treat hormone-sensitive tumors. Hormone therapy blocks your body’s ability to produce hormones or by interfering with hormones’ effect on breast cancer cells.If you have early-stage estrogen receptive positive (ER-positive) cancer, your healthcare provider may recommend adjuvant hormone therapy. Studies show people who’ve adjuvant hormone therapy after surgery reduce the chance their cancer will come back, or they’ll develop new cancer somewhere else in their body. The U.S. Food and Drug Administration (FDA) has approved tamoxifen and aromatase inhibitors as adjuvant therapy for breast cancer.Targeted therapy: Your healthcare provider may recommend adjuvant targeted therapy if you have HER2-positive breast cancer. This type of breast cancer tests positive for the human epidermal growth factor receptor protein. Targeted therapy blocks cancer’s growth and ability to spread by focusing on the tumor’s specific genes and proteins. Targeted therapy may include several different medications.Male breast cancerIf you’re male or assigned as male at birth (AMAB) and you have breast cancer, your healthcare provider may recommend you have radiation therapy after your breast cancer surgery. (Chemotherapy and hormone therapy guidelines are the same for males and females.)Colorectal (colon) cancerSurgery is the most common primary colorectal (colon) cancer treatment. Your healthcare provider may recommend adjuvant chemotherapy and/or radiation if you have stage II or stage III colorectal cancer. A diagnosis of stage II colon cancer means you have cancer that’s grown beyond your colon wall muscles but hasn’t reached your lymph nodes. A diagnosis of stage III colorectal cancer means you have cancer that’s spread to one or more lymph nodes and/or into your abdomen. In this case, your healthcare provider may recommend adjuvant chemotherapy.Rectal cancerIt depends on the type of pre-surgery treatment your healthcare provider uses. For example, if you haven’t had chemoradiation and/or chemotherapy, your healthcare provider may recommend adjuvant chemoradiation. This is a combination of chemotherapy and radiation. Chemoradiation increases radiation therapy effectiveness. If you have stage II or stage III rectal cancer, your healthcare provider may recommend adjuvant chemotherapy.Lung CancerThe FDA recently approved the first immunotherapy medication for adjuvant therapy for non-small cell lung cancer (NSCLC), adding that treatment after chemotherapy as adjuvant therapy for some types of NSCLC.Small cell lung cancerHealthcare providers typically treat small cell lung cancer with chemotherapy and radiation. They may perform surgery if they were able to diagnose the cancer in early stages. In that case, they may recommend adjuvant chemotherapy and radiation therapy.Can all cancer stages be treated with adjuvant therapies?Healthcare providers characterize all cancers in terms of the cancer stage. They set cancer stages after they have information about the tumor’s size and location. They also consider tumor growth and spread.Most cancers have four stages that range from cancer that’s restricted to a small area of your body and hasn’t spread to your lymph nodes or other tissues, to cancer that’s spread to other organs or areas of your body. Healthcare providers typically recommend adjuvant therapy for earlier-stage cancers.AdvertisementAre there adjuvant therapies for cancer other than breast, colorectal or lung cancer?Every year, different treatments receive FDA approval as adjuvant therapy for many types of cancer. At the same time, healthcare providers and researchers oversee adjuvant therapy clinical trials. If you’ve been treated for cancer, ask your doctor about recently approved adjuvant therapies or clinical trials.Risks / BenefitsWhat are adjuvant therapy risks and benefits?Just like cancer treatment, every adjuvant therapy has different risks and benefits:The overall benefit is that successful adjuvant therapy may reduce your risk that cancer will return.The overall risk is that nearly all adjuvant therapies have side effects. Depending on your situation, you may already know what to expect from any given treatment. Adjuvant therapy may include some new-to-you treatment side effects.You may need adjuvant therapy for months or years after treatment. While this isn’t a risk, it is something to keep in mind as you consider your treatment options.AdvertisementMy healthcare provider recommends adjuvant therapy. What should I keep in mind as I decide what to do?Your healthcare provider recommends adjuvant therapy because they believe you could still have cancer cells in your body. Leaving those cells behind could allow that cancer to return or cause new cancer. Some questions you might want to consider asking your healthcare provider include:What treatment do you recommend?Why do you recommend this treatment?Why am I a good candidate for this treatment?Have you provided this treatment before?Is this treatment commonly used as adjuvant therapy?How long would I need to have this treatment?What are the benefits of this treatment?How long would these benefits last?What are treatment side effects?Recovery and OutlookWhat is the prognosis for adjuvant therapy?Your healthcare provider is your best resource for understanding your adjuvant therapy prognosis. Apart from knowing the success rate of any given adjuvant therapy, your healthcare provider knows you:They know if your initial treatment was as successful as expected.They know how previous side effects affected you.They know about your overall health.They know how well people your age respond to a given adjuvant therapy.They know your personal preferences about treatment.What happens if I decide against adjuvant therapy?Adjuvant therapy is just like any other cancer treatment: It’s your choice to accept or decline treatment. Your healthcare provider will honor your decision. They’ll also be honest about the possible consequences of your choice, whether that choice is delaying or declining adjuvant therapy.A note from Cleveland ClinicWhen we’re dealing with tough situations — and having cancer certainly qualifies — some of us might cope by considering cancer treatment as a series of hurdles we need to leap to get to the finish line. If you’ve finished cancer treatment, adjuvant therapy may feel like an unexpected hurdle that’s slowing you down just as that finish line is in sight. If that’s your situation, give yourself time to understand adjuvant therapy’s benefits and drawbacks. Ask your provider for help with your decision. They’ll help you feel comfortable with your choice so you can cross that finish line.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/08/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"