"Adrenalectomy (Adrenal Gland Removal): Laparoscopic Surgery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Adrenalectomy (Adrenal Gland Removal)AdvertisementAdvertisementAdvertisementAdrenalectomy (Adrenal Gland Removal)Adrenal glands are a pair of small glands just above each kidney that produce important hormones. Adrenal tumors are uncommon, and most are not cancerous. But tumors can cause adrenal glands to make too many hormones, causing troubling symptoms. Adrenalectomy is surgery to remove one or both adrenal glands.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is an adrenalectomy?Adrenalectomy is surgery to remove one or both adrenal glands.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the adrenal glands?The adrenals are small glands just above each kidney. They are part of your endocrine system, which creates hormones that affect growth, development, sexual function and metabolism. The adrenal glands produce sex hormones, adrenaline and cortisol.Why is an adrenalectomy performed?Problems with the adrenal glands are pretty rare. Sometimes, though, an adrenal tumor that may or may not produce excessive hormones can develop. For tumors that produce excessive hormones, a surgeon must remove the gland and tumor so that hormone levels can get back within normal ranges. For some of the tumors that are not producing hormones, but are suspicious for cancer, likewise, the tumor needs to be surgically removed.AdvertisementWhat symptoms can adrenal problems cause?Although adrenal tumors are rarely cancerous, increased hormones may lead to health problems, such as:Anxiety.Excessive sweating (hyperhidrosis).Fatigue.Frequent urination.Headaches.Heart palpitations or rapid heart rate.High blood pressure (hypertension).Excess weight (obesity).Muscle weakness.Cushing’s syndrome (hypercortisolism) may occur when the adrenal glands make too much cortisol (also known as the “stress hormone”) for a long time. If left untreated, Cushing’s syndrome can be life-threatening.Primary hyperaldosteronism may occur when the adrenal produces a blood pressure hormone called “aldosterone” which can lead to salt wasting and high blood pressure resistant to medications.Pheochromocytoma is a condition related to over production of another group of blood pressure hormones called “catecholamines and metanephrines”. It can lead to a life-threatening high blood pressure problem.In addition to these more common hormonal syndromes, over production of sex steroids can lead to excessive hair growth and virilization.Procedure DetailsHow is adrenalectomy done?The surgeon will operate in one of two ways:Open adrenalectomy: Your surgeon may use open surgery if the tumor is large or might be cancerous. The surgeon makes an open large incision (cut) in the abdomen to remove the gland(s).Laparoscopic adrenalectomy: More commonly, the surgeon makes a few small incisions and performs a minimally invasive procedure. This method uses a laparoscope, a thin tube equipped with a tiny video camera so the surgeon can see inside the body. Robotic surgery uses the same incisions, but uses wristed, rather than rigid instruments. Whether laparoscopic or robotic, the procedure can either be done by placing the incisions on the back (posterior approach) or on the side (lateral approach). Both procedures are equally successful, with the back approach providing advantages of not entering the abdomen. The back approach is also preferred in patients with a history of prior upper abdominal incisions and 2-sided tumors. Due to the small working space with the back approach, only tumors smaller than 6 cm are approached through the back.AdvertisementDoes adrenalectomy remove one gland or both?The surgeon may remove only the tumor, one gland or both. Surgery that removes one gland is a unilateral adrenalectomy. A bilateral adrenalectomy removes both glands. People with a diagnosis of cortisol excess (Cushing’s syndrome may take a hydrocortisone supplement for about a year after surgery, until the remaining gland starts making enough hormone on its own. For other patients, testing is done after the surgery to decide if the patients need to be on steroid replacement.How can I prepare for adrenalectomy?Follow the advice from your healthcare providers. Your healthcare team may advise you to:Stop taking certain medications, especially nonsteroidal anti-inflammatory drugs (NSAIDs), which can interfere with blood clotting.Restrict food and water the day before surgery.Take medication to manage high blood pressure before surgery.Care at Cleveland ClinicAdrenal Disorders TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the risks and possible complications of adrenalectomy?As with any surgical procedure, complications may occur. They are more likely with open adrenalectomy than with laparoscopic adrenalectomy.Laparoscopic adrenalectomy leaves smaller scars, causes less pain and carries fewer risks. Patients who have laparoscopic adrenalectomy have a shorter hospital stay. They can usually get back to their usual activities faster. Still, your surgical team will monitor you for:Bleeding and blood clots.Damage to nearby organs.Hernia.Infection.Reactions to anesthesia.Problems with wound healing.Recovery and OutlookWhat is the recovery time after adrenalectomy?You will be sore for a week or two after surgery. The symptoms of the tumor and its hormone overproduction will go away almost immediately.Everyone gets better at a different pace, but most patients recover without complications in two to three weeks. If the tumor was cancerous, your healthcare provider will monitor you for cancer recurrence (coming back) and additional treatments may be necessary.What happens after an adrenalectomy?Your surgical team will give you detailed instructions for a safe recovery. You may want to:Rest and allow the area to heal.Talk to your doctor about medications and other ways to relieve pain. Take the medicines as directed.Eat your usual diet if it doesn’t upset your stomach, and drink plenty of water.Hold a pillow over the incisions when you cough or take a deep breath.Wash and care for your wound(s) as instructed.If you aren’t having regular bowel movements (pooping) without straining, talk to your healthcare provider.Introduce activity, like walks and work, only when you feel comfortable.How will my body function without the adrenal gland(s)?Your body needs only one healthy adrenal gland to function. If you have bilateral surgery, or if the remaining adrenal gland is not functional, medications can replace essential hormones.When to Call the DoctorWhen should I call the doctor after an adrenalectomy?Attend follow-up appointments. Your surgical team will make sure you are getting well and may need to remove stitches if you underwent an open adrenal surgery.Between appointments, call your surgical team if you:Have pain that doesn’t get better with pain medication.See that your stitches are loose or your incision opens.Notice signs of infection, such as an incision that feels warm, looks red, swells, bleeds, leaks pus or really hurts.Develop a fever.Don’t have regular bowel movements.Call 911 if you:Pass out.Have severe trouble breathing.Have chest pain or cough up blood.A note from Cleveland ClinicA tumor on the adrenal gland affects hormone levels and may cause concerning symptoms. Adrenalectomy can eliminate the symptoms and help you feel well in a few short weeks, especially if you have a minimally invasive laparoscopic/robotic procedure. Ask your primary care provider or endocrinologist to recommend good surgeons in your area. You will want a surgeon who has a lot of experience with adrenalectomy for the best results.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 12/01/2020.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicAdrenal Disorders TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6568Appointments & LocationsRequest an AppointmentVirtual Visits for DiabetesFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"