"Allergy Shots: Effectiveness, Side Effects & What To Expect800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Allergy ShotsAdvertisementAdvertisementAdvertisementAllergy ShotsAllergy shots are a long-term treatment option for allergy symptoms. They’ve very effective and have no long-term side effects. Risks may include allergy symptoms shortly after receiving your shot. You may need regular allergy shots for up to five years.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat are allergy shots?Allergy shots are injections that you receive over a long period of time to help reduce or even prevent allergy symptoms.Allergens are substances that cause your immune system to overreact, which leads to allergy symptoms. Allergy shots contain trace amounts of allergens. They slowly desensitize your body to allergens by changing your body’s reaction from inflammation to tolerance. Over time, the allergen amount in your shot increases. This helps strengthen your immune system so that you have no allergic reaction or a minor reaction the next time you encounter the allergen.Other names for allergy shots include:Allergen immunotherapy injections (sometimes shortened to “immunotherapy”).Subcutaneous immunotherapy (SCIT).What kinds of shots are given for allergies?Allergy shots are available for the following allergies:Airborne allergens. These include pet allergies, pollen from grasses, trees and plants, mold and dust mites.Stinging insects. These include bees, yellow jackets, hornets and wasps.Allergy shots don’t treat food allergies, medication allergies or latex allergies. The most common way to avoid an allergic reaction to food, medication and latex is to avoid them.How common are allergy shots?Allergy shots are very common. Healthcare providers have prescribed them more than any other type of allergy immunotherapy for over 100 years.Who can get allergy shots?Anyone over 5 years of age can receive allergy shots. An allergist will determine if allergy shots are safe and effective for you or your child.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens during allergy shot treatment?Before starting allergy shot treatment, an allergist will order skin tests or blood tests to determine your allergies. You’ll then receive your allergy shots in two phases:Buildup phase. You receive allergy shots one to three times a week for six to 10 months. The allergen dosage starts low and gradually increases as your immune system develops a tolerance.Maintenance phase. You receive allergy shots about once a month for three to five years. If you have severe allergies, your maintenance phase may last longer than five years.A healthcare provider will clean your skin with a disinfectant (usually an alcohol pad) before they inject the allergy shot into your upper arm, though they may also administer it in your thigh or hip.You must stay at your allergist’s office for at least 30 minutes after you receive your shot so they can monitor and treat you for a potential allergic reaction. Allergic reaction symptoms may include:Itching.Shortness of breath (dyspnea).Wheezing.Coughing.Hives.Severe allergic reaction symptoms may include anaphylaxis, which may cause:A drop in blood pressure (hypotension).An increased heart rate.Unconsciousness (syncope).Death.Treatment for a severe allergic reaction may include an epinephrine auto-injector (EpiPen®).After your allergy shots, you should avoid exercising or taking a hot bath or shower for at least two hours. Exercise and a hot bath can increase blood flow to your tissues. This can cause the allergens in your shots to spread throughout your body faster. It likely won’t cause a serious problem, but it’s a good idea to wait.What kind of healthcare provider gives allergy shots?An allergist (immunologist) gives allergy shots. An allergist a doctor who specializes in diagnosing and treating certain conditions that affect your immune system, including allergies and asthma.When shouldn’t I get allergy shots?Don’t take allergy shots if you:Have a fever of 100 degrees Fahrenheit (37.7 degrees Celsius) or higher, a cold or the flu.Have a sudden (acute) asthma attack. Allergy shots can make your asthma symptoms worse.Are taking beta-blockers. Beta-blockers are a type of medicine that treats conditions that affect your heart and circulatory system. They can prevent epinephrine from working in some people, which is what allergists use to treat a severe allergic reaction. If you’re taking beta-blockers, talk to your allergist about whether it’s safe for you to take allergy shots.How long until allergy shots start to work?Once you reach the maintenance phase, an allergy shot lasts about one month. The maintenance phase may last up to five years or longer until you no longer need to receive allergy shots.Don’t expect your allergy symptoms to improve immediately. For most people, it takes six to eight months to start noticing a reduction in their symptoms. It may take a full 12 months to see the full benefits.Care at Cleveland ClinicAllergy TreatmentFind a Doctor and SpecialistMake an AppointmentRisks / BenefitsAre allergy shots safe?For most people, allergy shots are usually safe. But allergy shots contain tiny amounts of allergens. If you have an allergic reaction to an allergy shot, your allergist will quickly give you medicine to stop it.AdvertisementWhat are the potential benefits of allergy shots?Most people get allergy shots so they have no allergy symptoms or reduced symptoms that they don’t need to treat with medicines. But if you have severe allergy symptoms, allergy shots can help protect you from severe symptoms, hospitalization and death.Do allergy shots really work?Yes, allergy shots are usually a good way to reduce long-term (chronic) allergy symptoms. They don’t cure your allergies, but you won’t need to use much or any medicine to relieve symptoms.Keep in mind that it may take up to a year of regular allergy shots before you start to see an improvement in your symptoms.How successful are allergy shots?About 80% of people see significant improvement in their allergy symptoms. This means there’s a reduction in their symptoms, though they won’t necessarily completely go away. About 60% of people have permanent benefits after three to five years of allergy shots.What is the downside to allergy shots?You may have an allergic reaction after receiving an allergy shot. Mild reactions include a stuffy nose, sneezing or hives. Severe reactions are rare, but may include difficulty breathing and a feeling of tightness in your chest. An allergist will monitor you for at least 30 minutes after giving you an allergy shot. They can treat you if you develop a reaction.If you’re afraid of needles (trypanophobia), it helps to know allergists use very small needles to give allergy shots — usually 27 gauge, which is about half the size of a ballpoint pen tip.Are there long-term risks with allergy shots?No, allergy shots have no long-term risks or complications.AdvertisementRecovery and OutlookHow long will it take for me to feel better?It depends. Your body is unique, and how you respond to allergy shots may be different from others. Some people may notice their symptoms improving six to eight months into the buildup phase. Others may take up to 12 months before they have noticeable improvement.When to Call the DoctorWhen should I call a healthcare provider?Reach out to your healthcare provider if:Your allergy symptoms remain the same or get worse after several months of allergy shots.You have any reaction or symptoms following your injections.You need to reschedule your appointment.You have any questions or concerns.Additional DetailsHow much do allergy shots cost?The cost of allergy shots is usually between $1,000 to $4,000 per year. But the price varies between allergists, medical facilities and health insurance coverage. Talk to an allergist to better understand their exact pricing.What is the difference between allergy shots and allergy drops?Allergy drops (sublingual immunotherapy or SLIT) are a type of liquid medicine you take under your tongue to treat allergy symptoms. They don’t have approval from the United States Food and Drug Administration (FDA), so insurance doesn’t cover allergy drops.Allergy tablets are another type of SLIT that has FDA approval. Currently, you can only use allergy tablets to treat certain airborne allergens. The following allergy tablets have FDA approval:Odactra 12®. This treats dust mite allergies.Oralair®. This treats mixed grass pollen allergies.Grastek®. This treats Timothy grass allergies.Ragwitek®. This treats short ragweed allergies.Allergy shots are injections that help treat allergy symptoms. An allergist usually gives you the injection in your arm.A note from Cleveland ClinicAllergy shots are a common, effective treatment for your annoying or even life-threatening allergy symptoms. It can be tough to be patient — you may not notice an improvement in your symptoms for up to a year, and you may need regular shots for five years or longer — but they can provide a great amount of relief from severe allergies. Talk to a healthcare provider about whether allergy shots are a good option for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/09/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicAllergy TreatmentFind a Doctor and SpecialistMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6503Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"