"Allogeneic Stem Cell Transplant: Procedure & Precautions800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Allogeneic Stem Cell TransplantationAdvertisementAdvertisementAdvertisementAllogeneic Stem Cell TransplantationAllogeneic stem cell transplantation uses donor stem cells to treat and sometimes cure certain blood disorders and blood cancers. Healthcare providers typically recommend stem cell transplantation if initial treatments don’t work or if conditions have come back. About 50% of people who need stem cell transplantation use stem cells donated by someone who’s not a family member.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is allogeneic stem cell transplantation?Healthcare providers use allogeneic stem cell transplantation to treat blood cancers and sometimes cure certain blood disorders. Providers may recommend allogeneic stem cell transplantation if initial treatments didn’t work or treatments worked but the condition has come back. In allogeneic stem cell transplantation, healthcare providers replace unhealthy stem cells with donated healthy stem cells. These new stem cells produce healthy new blood cells. Many people who need stem cell transplantation use stem cells donated by someone who’s not a family member.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat’s the difference between allogeneic and autologous stem cell transplantations?Allogeneic stem cell transplantation uses donated stem cells. These stem cells may come from a family member, from someone you don’t know or from umbilical cord blood. (Umbilical cord blood is blood collected from the umbilical cord and placenta after a baby is born.) An autologous stem cell transplantation uses your own blood stem cells.While both treatments help your bone marrow to develop new blood cells, studies show allogeneic stem cell transplantations work by causing the donor cells to attack unhealthy cells. Healthcare providers call this “graft-versus-tumor” effect (GVT).What cancers are treated with allogeneic stem cell transplantation?Healthcare providers use allogeneic stem cell transplantation to replace unhealthy cells that cause conditions, including:Acute myeloid leukemia (AML): People in remission from AML may be candidates for allogeneic stem cell transplantation. Remission means you’ve received treatment that’s eliminated AML signs and symptoms.Acute lymphocytic leukemia (ALL): Like AML, people in remission from ALL may be candidates for this procedure.AdvertisementWhat blood disorders are treated with allogeneic stem cell transplantation?Many times, allogeneic stem cell transplantation cures the following blood disorders:Aplastic anemia: Healthcare providers may recommend allogeneic stem cell transplantation for severe forms of aplastic anemia. This procedure usually cures aplastic anemia.Severe Combined Immune Deficiency Syndrome (SCID): This is a group of rare disorders caused by mutations in different genes involved in the development and function of infection-fighting immune cells.Thalassemia: This blood disorder affects your body’s ability to produce red blood cells. Providers may use allogeneic stem cell transplantation to treat severe forms of thalassemia.Studies show allogeneic stem cell transplantations cure the following rare inherited blood disorders:Diamond-Blackfan anemia: Providers may use allogeneic stem cell transplantation if other treatments aren’t successful.Fanconi anemia (FA): Allogeneic stem cell transplantation may cure some blood disorders FA causes.Chediak-Higashi syndrome: This disorder affects white blood cells. Allogeneic stem cell transplantation replaces damaged white blood cells.Leukocyte adhesion deficiency: This is an immune disorder that causes deep tissue infections.Chronic granulomatosis: Allogeneic stem cell transplantation treats the recurring and life-threatening infections this condition causes.Who is a candidate for allogeneic stem cell transplantation?Healthcare providers consider several factors before recommending allogeneic stem cell transplantation to treat blood disorders or cancer. Those factors include:You have a donor whose human leukocyte antigens (HLA) closely match yours.Your general health and medical condition. For example, people who have stem cell transplantation go through intensive chemotherapy before treatment. This is called conditioning. Providers will evaluate whether you’re able to manage conditioning side effects.Your medical condition. Not all cancers or blood diseases respond to stem cell transplantation, including allogeneic stem cell transplantation.Your previous treatments. Some medical treatments may affect transplantation.What makes a good match for an allogeneic stem cell transplantation?The best possible match is a healthy donor who has human leukocyte antigens (HLA) that are a close match to yours. HLA are blood proteins. Healthcare providers identify HLA with blood tests comparing your HLA with your prospective donor’s HLA. This is HLA typing.Providers evaluate donor stem cells by the number of antigens that match yours. A high number of matching antigens increases the chance the donated stem cells will make healthy new blood cells through a process called engraftment. In engraftment, donated stem cells produce new blood cells to replace the unhealthy blood cells.Close HLA matches also reduce the risk you’ll develop acute or chronic graft-versus-host disease (GVHD). Acute GVHD symptoms may develop a few weeks after your procedure and affect your skin, liver and gastrointestinal tract.Chronic GVHD symptoms can happen within weeks or several years after your transplantation. In addition to acute GVHD symptoms, chronic GVHD may affect your mouth, lungs, neuromuscular system or genitourinary tract.Who’s likely to be a good HLA match?People inherit their HLA from their biological parents. If you have biological siblings, there’s a 1 in 4 chance any one of your siblings will be HLA-matched for allogeneic stem cell transplantation.Recently, healthcare providers have found a way to perform allogeneic stem cell transplantations s using stem cells donated by people who are only partially HLA-matched. These are haploidentical (half-match) stem cells. That means that a person who needs stem cell transplantation may be able to use stem cells donated by their biological children or their biological parents. This is a relatively new treatment that providers started using to increase the pool of potential donors.About 70% of people who need transplantation won’t find a matching donor in their family. When that happens, providers turn to stem cell databases or registries for potential unrelated donors. Unrelated donors are people who volunteer to have their HLA type added to donor databases. Most matched stem cells come from unrelated donors.What goes into donating stem cells voluntarily to someone who’s not a relative?People who want to donate stem cells work with donation registries to see if they’re eligible to donate stem cells. Typically, registry staff will ask questions to confirm prospective donors are healthy enough to make donations and that their donated stem cells won’t pose an infection risk.Next, prospective donors take blood tests to identify their HLA type. Registry staff add those results to databases providers use to find potential matches for people who need stem cell transplantations. It’s important to remember registering with the donor database isn’t an obligation to donate.If a prospective donor and recipient have matching HLA, providers explain the transplantation process, including risks. Providers ask prospective donors to sign consent forms stating they understand the process and risks.Providers then complete physical examinations and blood tests to confirm the prospective donors are in good health and able to manage the bone marrow harvest procedure or peripheral stem cell harvest procedure.AdvertisementWhat happens if my healthcare provider can’t find an unrelated donor?Here are two options your provider may recommend using:Umbilical cord blood stem cells: These are stem cells from umbilical cords and placenta after a baby is born.Haploidentical (half-match) stem cells: These are stem cells from a biological parent, sibling or child whose HLA is an exact match for half of your HLA. Biological parents’ HLA are always half-match for their children. Biological siblings have a 50% chance of being a half-match.How common are allogeneic stem cell transplantations?More than 8,000 people in the United States received allogeneic stem cell transplantations in 2020. More people received stem cells from someone outside their family than from a family member.Procedure DetailsTo understand how allogeneic stem cell transplantation works, it may help to know more about stem cells and their role in your body.Stem cells are young or immature blood cells that your bone marrow produces. Your bone marrow is the soft, spongy center of your bone.These stem cells develop into all types of blood cells, including white blood cells that protect your body from infection, red blood cells that carry oxygen throughout your body and platelets that help your blood clot. Stem cells are constantly producing new blood cells to replace damaged, aging or worn-out blood cells.Some cancers and blood diseases happen when your stem cells can’t produce enough healthy blood cells.When this happens, healthcare providers may use chemotherapy or other treatments to destroy unhealthy stem cells and replace them with healthy stem cells.Allogeneic stem cell transplantations replace unhealthy stem cells with healthy stem cells that can make new, healthy blood cells.What happens before the actual procedure?If you’re a candidate for stem cell transplantation, your healthcare provider will perform tests to confirm you can manage procedure side effects, including high-intensity chemotherapy done before your transplantation. These tests may include:Electrocardiogram (EKG): This test checks your heart’s rhythm.Echocardiogram: This test checks how well your heart pumps.Complete blood count (CBC): This test measures and studies your blood cells. Your provider will also do a liver function blood test or kidney function blood test.Biopsy. If you have cancer, your provider may do a biopsy so they can study your cancerous cells for new changes and evaluate the risk your cancer may come back after your transplantation.Your provider may place a central venous catheter (CVC) in one of the large veins in your upper chest. CVCs are tubes that serve as central lines that providers use to take blood and provide medication and fluids. CVCs eliminate repeated needle sticks to draw blood or insert intravenous tubes throughout the transplantation process.What is transplantation conditioning?Transplantation conditioning is intensive chemotherapy and/or radiation therapy that kills cancer cells in your bone marrow. Conditioning also kills existing blood cells. Donor cells replace cancer cells and healthy cells.What happens during allogeneic stem cell transplantation?Providers use your CVC to insert donated stem cells into your bloodstream. Those donated stem cells make their way to your bone marrow so they can start producing new blood cells.What happens after allogeneic stem cell transplantation?You’ll stay in or close to the hospital so your healthcare providers can monitor your recovery and provide any treatment you may need. Here’s what you can expect after your allogeneic stem cell transplantation:Pre-treatment chemotherapy affects your immune system’s ability to protect you from infections. To reduce that risk, you’ll be alone in a carefully cleaned room with very limited physical contact with other people.You’ll receive immunosuppressant medication to reduce the chance your body will reject the donated stem cells.Some people have nausea, vomiting and diarrhea after their transplantation. Your providers will give you medication to ease those symptoms and fluids to replace what you lose.You may need blood transfusions to replace red blood cells and platelets.Care at Cleveland ClinicBlood and Marrow Transplant and Cellular TherapiesFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of allogeneic stem cell transplantation?Allogeneic stem cell transplantation may help someone who doesn’t have enough healthy stem cells for autologous stem cell transplantation. Both allogeneic and autologous stem cell transplantations replace unhealthy cells with healthy cells. Studies show allogeneic stem cell transplantation also kills cancer cells while restoring bone marrow and blood cell health.What are allogeneic stem cell transplantation risks or complications?Potential complications vary based on your overall health, age and previous cancer treatments. Allogeneic stem cell transplantations can result in graft-versus-host disease. This happens when your immune system attacks normal cells post-transplant. If you’re considering an allogeneic stem cell transplantation, your healthcare provider will outline potential complications so you can weigh those risks against potential benefits.Recovery and OutlookHow long does it take to recover from an allogeneic stem cell transplantation?It may take a few months to recover from the transplantation process, including recovering from the pre-transplantation conditioning. It may take a year or two for your immune system to recover while your new stem cells make new blood cells.What’s the success rate of allogeneic stem cell transplantations?It’s difficult to provide an overall success rate because healthcare providers use allogeneic stem cell transplantation to treat many different kinds of blood cancers and blood disorders. That said, recent studies show the following:More than 80% of people who had aplastic anemia are cured after allogeneic stem cell transplantation.More than half of all people who received allogeneic stem cell transplantations for acute leukemia in remission are cured.Approximately 40% of people who had myelodysplastic syndrome are cured after allogeneic stem cell transplantation.When to Call the DoctorWhen should I see my healthcare provider?People who had allogeneic stem cell transplantations are more likely to develop graft-versus-host disease (GVHD) than people who had autologous stem cell transplantations. Contact your healthcare provider if you have the following acute GVHD symptoms:You have a skin rash that itches.You notice your skin and/or eyes are turning yellow.You have nausea, vomiting, diarrhea or abdominal cramps.It’s important to remember your immune system likely will be weak for a year or so after your transplantation. Contact your provider if you develop any of the following symptoms:Fever (100.4 F, 38 C).Chills.Shortness of breath (dyspnea).Coughing, sneezing or runny nose.Frequent urination or painful urination (dysuria).Lightheadedness/dizzinessA note from Cleveland ClinicMore and more people who have blood disorders or blood cancer are relying on the kindness of strangers. About 70% of people who need stem cell transplantation won’t find a matching donor in their family. Fortunately, many of those people receive stem cells from unrelated donors. (People who can’t use donor cells still have options. They may find matching stem cells in donated umbilical cord blood. Recently, some people have used family members’ stem cells that match half of their stem cells.)There are risks involved when you receive stem cells from an unrelated donor. If you’re a candidate for stem cell transplantation, ask your healthcare provider about the benefits and risks of allogeneic stem cell transplantation. They’ll explain the process and help you weigh the risks and benefits.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/19/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicBlood and Marrow Transplant and Cellular TherapiesFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"