"Alpha-blockers: Types, Uses and Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Alpha-blockersAdvertisementAdvertisementAdvertisementAlpha-blockersAlpha-blockers are a class of medications that mainly treat high blood pressure, as well as certain conditions affecting your circulatory system, prostate and can help with treating certain types of tumors. They work by slowing down certain types of chemical communication between cells, especially between your nervous system and organs or tissues.ContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat are alpha-blockers?Alpha-blockers are medications that treat high blood pressure. They can also treat some conditions affecting the circulatory system, prostate, and help with treating certain types of tumors. They work by slowing down specific types of cell activity in your nervous system.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow do they work?Alpha-blockers work by partially blocking the way some cells in your body receive instructions. They do this by blocking alpha-receptors, which are found on cells in specific areas or organs in your body. Those receptors tell their cells when to squeeze, constrict or tighten. By blocking those receptors, those cells stay relaxed. Because many of those cells line your blood vessels — controlling how wide or narrow those vessels are — keeping them relaxed lowers your blood pressure.More about alpha-receptorsYour nervous system works by transmitting chemical and electrical signals throughout your body. That chemical communication works very similarly to a lock-and-key system. The chemical signals — also known as neurotransmitters — are the keys. They can travel through your bloodstream to various locations in your body. Receptors are the locks, allowing chemicals to attach and activate the cells.Some of those receptors found throughout your body are called adrenergic receptors (or sometimes adrenoceptors). They got their name because a chemical your body makes, adrenaline (also called epinephrine), acts as a master key and can activate all adrenergic receptors.Adrenergic receptors, including alpha-receptors (sometimes identified using the Greek letter α for alpha), come in multiple types and sub-types.How medications use alpha-receptorsIf a chemical has the right structure, it can attach to a receptor. Chemicals that can attach to a receptor are either agonists or antagonists:Agonists: These chemicals attach to a receptor and “unlock” it, activating the cell and telling it to take a certain action. They can be chemical signals made by your body, or they can come from medications you take.Antagonists: These chemicals can attach to receptor sites but can’t unlock and activate them. Antagonists hold onto the receptor site and prevent their activation. The effect is similar to putting a key into a lock that isn’t quite the right fit. It can go into the lock but can’t open it. Blocking enough receptors on enough cells slows down those cells’ activity.What do alpha-receptors control?Alpha-receptors come in two different subtypes, with the subtypes having some overlap but also controlling different functions.Alpha-1 (A1) receptorsLocations and functions of these receptors include:Smooth muscle. This type of muscle forms linings of your blood vessels, which is how they help regulate blood pressure. A1 receptors cause your blood vessels to constrict and cause an increase in your blood pressure.Eyes. A1 receptors cause the pupils in your eyes to get smaller, which helps you see in brighter conditions.Skin. A1 receptors control the muscles that cause your hair to stand up. This is what causes you to have goosebumps when you feel cold.Urinary tract. These receptors are how you control your bladder muscles. They’re also found in the prostate.Alpha-2 receptorsThese receptors are mostly found in the following locations:Smooth muscle. The smooth muscle that lines your blood vessels also has A2 receptors in addition to A1 receptors. That’s why A2 receptors also play a role in blood pressure.Nervous system. This includes your brain, spinal cord and nerves. A2 receptors in the nervous system help manage your neurotransmitter levels. This is especially true of norepinephrine (also called noradrenaline), a neurotransmitter that works alongside adrenaline.Blood. A2 receptors can activate platelet cells in your blood, causing them to clot and bunch together. Platelets are key in your body’s natural response to an injury, helping seal and repair wounds.Pancreas. A2 receptors in the beta cells of your pancreas slow and prevent the release of insulin into your body.Fat cells. Activating A2 receptors in fat cells stops them from breaking down for use as an energy source.AdvertisementAre there different types of alpha-blockers?Some alpha-blockers will target only certain alpha-receptors. This characteristic is “selectivity,” and it is a part of the decision process when choosing an alpha-blocker to treat a condition. Alpha-blockers can be non-selective or selective for A1 receptors. There are — for now — no approved selective alpha-2 blockers.The following alpha-blockers are currently approved and in use in the United States:NonselectiveSelective A1 blockersPhenoxybenzamineAlfuzosinPhentolamineDoxazosinPrazosinSilodosinTamsulosinTerazosinNonselectiveNonselectivePhenoxybenzamineSelective A1 blockersAlfuzosinPhentolamineSelective A1 blockersDoxazosinSelective A1 blockersPrazosinSelective A1 blockersSilodosinSelective A1 blockersTamsulosinSelective A1 blockersTerazosinWhat conditions are treated by alpha-blockers?Just like the name suggests, alpha-blockers are alpha-receptor antagonists. They attach to alpha-receptors and keep them activating certain cells.Alpha-blockers have approval from the U.S. Food and Drug Administration to treat the following conditions:High blood pressure (hypertension)Alpha-blockers treat high blood pressure by stopping A1 and A2 receptors from activating. Blocking that activation relaxes blood vessels, lowering blood pressure.Approved alpha-blockers for high blood pressure include:Doxazosin.Prazosin.Terazosin.Benign prostatic hyperplasia (BPH)Benign prostatic hyperplasia (also known as benign prostatic enlargement) is a condition that causes the prostate gland to enlarge. When this happens, it can make it hard to urinate (pee) because the prostate presses on the urethra. It can also cause urine to remain in your bladder, causing bladder stones and infections. Over time, it can also lead to kidney failure. Alpha-blockers can cause your prostate muscle to relax, making it easier for urine to pass through.Approved alpha-blockers for BPH are:Prostate gland-selective (these have fewer systemic side effects than non-selective)Alfuzosin.Doxazosin.Silodosin.Tamsulosin (this is non-selective for the prostate gland).Terazosin.Pheochromocytomas and paragangliomasThese are the same type of tumor but have different names depending on their location. They can be cancerous (malignant) or non-cancerous (benign). These tumors can — but don’t always — create extra adrenaline and norepinephrine. When you have too much of either in your body, it’s like you’re having an overdose on them, with symptoms to match. Those symptoms include headache, sweating, heart problems and more. Alpha-blockers keep the excess neurotransmitters from having an overdose-like effect.Pheochromocytomas (fee-oh-crow-mo-sigh-toe-ma): These form on your adrenal glands, located at the top of your kidneys.Paragangliomas (para-gang-lee-oh-mas): These are tumors that often grow near the carotid artery in your neck, but can also form around nerves elsewhere in your body.The following drugs have approval for treating pheochromocytomas and paragangliomas:Phentolamine (can also help diagnose these tumors).Phenoxybenzamine.Skin and soft tissue treatmentsPhentolamine can prevent damage to areas of skin caused by norepinephrine leaking out of your blood vessels and into the surrounding tissue. It can also reverse the effects of some local anesthetics.Off-label usesAlpha-blockers can also treat certain conditions even when not specifically approved by the FDA for those conditions. This is known as “off-label” prescribing. It’s often done when there's evidence a medication can treat a condition, and the benefits outweigh the potential risks. Off-label prescribing is legal, medically acceptable and ethical when done safely and responsibly.Alpha-blockers are commonly used off-label for the following conditions:Prazosin: This can treat nightmares and sleep disruptions caused by post-traumatic stress disorder (PTSD) and treatment of circulation issues caused by Raynaud’s phenomenon.Tamsulosin: This can treat chronic prostatitis (prostate inflammation) and chronic pelvic pain syndrome in men, as well as lower urinary tract symptoms in men. It can also help with passing kidney stones and treat symptoms caused by ureteral stents (scaffold-like devices that hold your urethra open, keeping them from being blocked by kidney stones or bladder stones).Alfuzosin, doxazosin, terazosin and silodosin: These four alpha-blockers see off-label use to treat kidney stones that have become stuck in the ureters, the tubes that run from your kidneys to your bladder.AdvertisementAre alpha-blockers commonly prescribed?Alpha-blockers are very commonly prescribed for certain conditions. In 2019, more than 5.4 million people with Medicare Part D coverage — about 11% of all Medicare Part D beneficiaries — were prescribed an alpha-blocker.Risks / BenefitsWhat are the advantages of alpha-blockers?Alpha-blockers can offer a medical alternative to surgery for certain conditions. They can also treat high blood pressure, and can be a part of treatment for certain tumors.What are the risks or side effects of alpha-blockers?Healthcare providers are often cautious when prescribing alpha-blockers because of some of the side effects. The likely side effects also depend on which the specific alpha-blocker. If you have side effects, your healthcare provider may have you try another alpha-blocker to see if those side effects are avoidable.Selective alpha-1-blocker side effectsSelective alpha-1-blocking medications commonly cause the following side effects, especially in those over age 65:Low blood pressure (hypotension). Alpha-blockers are very effective at lowering blood pressure. However, they work too well in some cases, causing orthostatic hypotension, a drop in blood pressure that happens when you stand up. This can cause dizziness or feeling lightheaded. If you're prescribed an A1-blocker, it's likely your healthcare provider will tell you to take it right before you go to bed.First-dose effect. An extremely common side effect of A1-blockers is that the first dose has a much stronger effect on blood pressure than later doses. Orthostatic hypertension symptoms — especially dizziness, feeling lightheaded or fainting — are common. This increases the risk of falls, which can be very dangerous for people who are older, who have weaker bones or who are on blood thinners (because fall injuries can cause dangerous internal bleeding). To minimize this effect, the first dose of an alpha-1 blocker is usually smaller.Sexual dysfunction. Alpha-blockers can cause priapism, an erection that lasts four or more hours. Priapism is a serious condition that needs immediate care because it can cause permanent impotence. In very rare cases, alpha-blockers can also cause anejaculation, which is an inability to ejaculate semen even though the sensation of orgasm still occurs.Non-selective alpha-blocker side effectsBecause non-selective alpha-blockers affect both A1 and A2 receptors, this can often mean there's extra norepinephrine in your body. That extra norepinephrine can activate other adrenergic receptors called beta-receptors. Beta-receptor activation can cause the following:Reflex tachycardia (fast heartbeat). When your blood pressure drops, your body reflexively speeds up your heartbeat to compensate.Muscle tremors. Beta-receptors help your body control certain muscles. Activating them too often causes trembling or shaking.PhenoxybenzaminePhenoxybenzamine is unique among the medications that block adrenergic receptors because its effects are irreversible. That means that any alpha-receptors blocked by this medication will stay blocked forever. Because of this permanent effect, it's not used widely.Do alpha-blockers interact with any other medications?Some alpha-blockers may also interact with alcohol, citrus juices or other foods. Because alpha-blockers affect your circulatory system — and therefore, your entire body — they can also interact with many other medications. Because the effects can vary from person to person, your healthcare provider is the best source of information on how alpha-blockers are most likely to affect you.Are there any conditions that should prevent me from taking these medications?There are several health concerns — called contraindications — that can prevent you from taking alpha-blockers.Cataract surgery. Because alpha-blockers are part of how the pupils in your eyes contract, alpha-blockers can cause complications during cataract surgery. Intraoperative floppy iris syndrome is a common example of this kind of complication.Breastfeeding. Both non-selective alpha-blockers, phentolamine and phenoxybenzamine, shouldn’t be taken when breastfeeding.History of orthostatic hypotension. Taking alpha-blockers can make this condition worse.Erectile dysfunction medications. In some cases, certain erectile dysfunction medications can interact with alpha-blockers.Kidney disease, circulatory diseases or respiratory infections. Non-selective alpha-blockers may not be an option if you have one or more of these conditions.Recovery and OutlookHow long can I stay on alpha-blockers?Depending on the medication and the treated condition, you can take selective A1-blockers for extended periods. Non-selective alpha-blockers are meant for short-term use.For conditions like high blood pressure or benign prostate hyperplasia, it’s common to take an alpha-blocker indefinitely. Your healthcare provider will explain options to you and help you decide what works best for you. Once decided, your provider can tell you how long you’ll need to follow that course of treatment.Can I ever stop taking alpha-blockers?You should never do stop taking an alpha-blocker without talking to your healthcare provider. That’s because suddenly stopping them can cause serious complications, some of which can be severe or even life-threatening.Depending on why you take an alpha-blocker, it may be possible for you to stop taking them in the following circumstances:You improve your blood pressure (which is possible through diet and exercise) so that you no longer need medication to control it.You undergo a medical procedure that removes your need for an alpha-blocker (such as prostate removal).You switch to another medication that isn’t an alpha-blocker but still has the same effect.When to Call the DoctorWhen should I see my healthcare provider?In general, you should contact your provider if you have any questions about your medications or any sudden changes in your symptoms, especially when side effects or symptoms interfere with your regular activities.You should seek immediate medical attention if you have any of the following:Fainting or passing out.Chest pain (angina).Shortness of breath.Fast or irregular heartbeat, or heart palpitations (the unpleasant feeling of your own heartbeat).Priapism (an erection that lasts for at least four hours and is often painful).Symptoms of a severe allergic reaction (anaphylaxis) can include hives, rash, itching, swelling and difficulty swallowing.A note from Cleveland ClinicAlpha-blockers are common prescriptions for a wide range of conditions. Their uses range from controlling high blood pressure to helping people who have chronic nightmares sleep. While their use is common, there are some cases where alpha-blockers aren’t the best choice. If your healthcare provider recommends taking an alpha-blocker, talk to them about your concerns. They can help you understand how best to take these medications, and what you can do to make these medications have a positive effect on your life.Care at Cleveland ClinicCardiology CareMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/18/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicCardiology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"