"Amnioinfusion: Purpose, Procedure, Results & Risks800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/AmnioinfusionAdvertisementAdvertisementAdvertisementAmnioinfusionAmnioinfusion is a procedure that adds amniotic fluid to your uterus during labor. Not having enough amniotic fluid can cause pregnancy and delivery complications. It’s only performed in a certain circumstances.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is amnioinfusion?Amnioinfusion is a technique healthcare providers use to add amniotic fluid to your uterus. It’s most commonly performed during labor when a fetus shows signs of a slow or irregular heart rate due to low amniotic fluid. Low amniotic fluid can compress the umbilical cord and cause other delivery complications. During amnioinfusion, your healthcare provider inserts saline or sodium lactate (lactated Ringer’s solution) into your uterus with a catheter. This fluid replaces lost amniotic fluid and helps stabilize your baby’s heart rate and prevent them from losing oxygen.What is amniotic fluid?Amniotic fluid is a substance that surrounds your baby in your uterus. It protects them from infection and umbilical cord compression and cushions their movements while they’re in the womb. Amniotic fluid also helps develop your baby’s digestive and respiratory system and regulates their temperature. Not having enough amniotic fluid can cause health problems in your baby or complications during labor and delivery.What is the umbilical cord?An umbilical cord is your unborn baby’s lifeline in the womb. It connects them to the placenta. A compressed cord can cause complications because it deprives your baby of oxygen, blood and nutrients.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat conditions does amnioinfusion treat?Adding amniotic fluid is only done under certain conditions. Amnioinfusion is performed when you have a condition called oligohydramnios (low amniotic fluid). It’s also used as a treatment for:Umbilical cord compression. A compressed umbilical cord can lead to fetal distress. Fetal distress is when your baby is in stress during labor or delivery.Preterm premature rupture of the membranes (especially before the third trimester of pregnancy). This may help the environment inside the womb and prevent you from going into preterm labor.Prevent meconium aspiration syndrome (the extra fluid can dilute meconium). Meconium is your baby’s first stool. Swallowing meconium is OK, but breathing it in can cause complications.Your healthcare provider can discuss the risks and benefits of amnioinfusion with you based on your medical history and pregnancy.When should amnioinfusion be done?Healthcare providers use amnioinfusion in specific instances when your unborn baby’s amniotic fluid is too low. Low amniotic fluid affects their environment in your womb and can cause them distress.There are circumstances where amnioinfusion should not be done such as:The fetus is in serious distress. When minutes count, amnioinfusion just delays delivery.You have an active genital herpes infection or other infection in your uterus.You have placenta previa or suspected placental abruption.The fetus is breech or is in any other position other than head down.AdvertisementCan they replace amniotic fluid?Yes, healthcare providers can replace amniotic fluid with saline during an amnioinfusion procedure. The procedure is only used in certain circumstances.Procedure DetailsHow is an amnioinfusion performed?Fluid is placed through your uterus using an intrauterine pressure catheter (IUPC). This is attached to a three-way device that connects the IUPC to a fetal monitor and an infusion pump (a device that delivers fluids). Intravenous tubing is used to transfer the saline solution.An IUPC is placed after your provider confirms your baby is in a head-first position in your uterus. Your cervix must also be dilated at least 1 to 2 centimeters. Since an IUPC connects to a monitor, it can also measure uterine contractions and fetal heart rate.Room temperature saline or lactated Ringer’s solution is inserted through the tubing and into your uterus. The exact recommendations may vary depending on your condition, but you can expect to receive fluids for 10 to 30 minutes.Your healthcare provider will continue to measure your amniotic fluid levels to ensure the fluid is being retained.After amnioinfusion, you may have mild discomfort or pain.AdvertisementRisks / BenefitsWhat are the advantages of amnioinfusion?Other than improving your baby's heart rate and other signs of distress, amnioinfusion can help:Lower your risk of needing a c-section.Decrease your risk of needing forceps, a vacuum or other instruments.Improve blood and oxygen flow to your baby via the umbilical cord.Help delay labor to avoid complications of premature birth.Reduce the amount of meconium-stained amniotic fluid.Improve Apgar scores.Decrease chances of infection (postpartum endometritis) due to not having amniotic fluid.What are the risks or complications of amnioinfusion?Overall, amnioinfusion seems to be a safe and effective technique. Like all procedures, there are some risks involved. Complications of amnioinfusion could include:Chorioamnionitis (infection of your placenta and amniotic fluid).Umbilical cord prolapse.Polyhydramnios (too much amniotic fluid).Preterm labor.Prolonged labor.Uterine overdistention (enlarged uterus).Perforated uterus.Recovery and OutlookHow successful is amnioinfusion?Most amnioinfusion procedures are successful. They tend to be more successful when you have less amniotic fluid. This means people who need more fluid replaced tend to see better outcomes. For example, when the initial amniotic fluid index is less than 4 centimeters, the procedure is successful 63% of the time. When the fluid index is 4 to 8 cm, the success rate decreases to 44%. Amniotic fluid index is a measurement providers use to assess the amount of amniotic fluid in your uterus.When to Call the DoctorWhen should I see my healthcare provider?Your healthcare provider can discuss amnioinfusion with you. It's not as well-studied as other procedures that have been in practice for many decades. Your provider can discuss the risks and benefits of amnioinfusion with you and determine the best course of treatment based on your medical condition.Contact your pregnancy care provider if you feel fluid leaking from your vagina during pregnancy. They can determine if you're leaking amniotic fluid. It's also important to keep and attend all your prenatal visits so your provider can monitor your baby's health and better detect complications caused by low amniotic fluid.A note from Cleveland ClinicAmnioinfusion is a procedure to replace amniotic fluid lost during labor. Having enough amniotic fluid ensures your pregnancy and delivery are healthy and safe. The procedure involves inserting saline or sodium lactate into your uterus. It's only performed in specific circumstances, like when your baby shows signs of distress during labor or when low amniotic fluid is detected in a prenatal ultrasound. Talk to your pregnancy care provider if you have any questions about amnioinfusion or your amniotic fluid levels during pregnancy. They can discuss the process with you and help you understand what to expect.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/13/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"