"Amputation: Definition, Indications & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/AmputationAdvertisementAdvertisementAdvertisementAmputationAmputation is surgery to remove all or part of a limb or extremity. You may need an amputation if you’ve undergone a severe injury or infection or have a health condition like peripheral arterial disease (PAD). Many people live a healthy, active lifestyle after an amputation, but it may take time to get used to life without a limb.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is an amputation?Amputation is surgery to remove all or part of a limb or extremity (outer limbs). Common types of amputation involve:Above-knee amputation, removing part of the thigh, knee, shin, foot and toes.Below-knee amputation, removing the lower leg, foot and toes.Arm amputation.Hand amputation.Finger amputation.Foot amputation, removing part of the foot.Toe amputation.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy are amputations done?Amputation can be necessary to keep an infection from spreading through your limbs and to manage pain. The most common reason for an amputation is a wound that does not heal. Often this can be from not having enough blood flow to that limb.After a severe injury, such as a crushing injury, amputation may be necessary if the surgeon cannot repair your limb.You also may need an amputation if you have:Cancerous tumors in the limb.Frostbite.Gangrene (tissue death).Neuroma, or thickening of nerve tissue.Peripheral arterial disease (PAD), or blockage of the arteries.Severe injury, such as from a car accident.Diabetes that leads to nonhealing or infected wounds or tissue death.How does peripheral arterial disease (PAD) lead to the need for amputation?PAD causes damage to arteries, blood vessels that carry blood from your heart to your limbs. This damage can lead to poor circulation (blood flow).Without enough blood flow, your cells may not get the oxygen and other nutrients they need to survive or heal a wound. As a result, your tissue can die. Dying tissue is more prone to infection.Without treatment, these infections can lead to sepsis. This severe infection spreads through the body. It can cause organ failure and death.AdvertisementProcedure DetailsWhat happens before an amputation?Your surgeon will provide specific instructions for how to prepare for amputation surgery. Most likely, you will need to fast for at least six hours before the operation. Your surgeon may prescribe medications to take the morning of your surgery.Before the operation, you will receive anesthesia (medication so you won’t feel pain). Most often, healthcare providers use general or spinal anesthesia. General anesthesia makes you remain asleep during surgery. Spinal anesthesia numbs you from the waist or limb down.What happens during an amputation?In amputation surgery, your surgeon removes all diseased tissue. Your team will keep as much healthy tissue intact as possible. Your providers will plan a surgery that sets you up for the best function after you recover. They include plans for a prosthetic (artificial replacement limb) if you will have one.During the procedure, your surgeon:Removes damaged tissue and crushed bone.Smooths any uneven bone.Seals the blood vessels to prevent bleeding.Shapes the muscles so that the stump (end of the limb) can be fitted with a prosthetic limb if desired.Places a sterile dressing (bandage) over the wound.Your surgeon may use stitches or staples to sew the stump closed immediately. Or your surgeon may wait a few days to allow your wound to drain.AdvertisementWhat happens after an amputation?After an amputation, you will need to stay in the hospital for a few days. Some people stay as long as a week or two.Your surgical team will track your healing and progress. You may take pain medications to relieve discomfort or antibiotics to prevent infection. You will start working with a physical therapist within the first few days after surgery.Many patients go to a rehab facility for a little while after an amputation. This is so you can learn to do things with as much independence as possible.Will I need an artificial arm or leg?After arm or leg amputation, you may be a candidate for a prosthetic limb. Prosthetic limbs mimic the movements of natural limbs, but may feel awkward to use at first. A physical therapist teaches you exercises to help you get used to the artificial limb.Typically, fitting for a prosthetic occurs about six to eight weeks after surgery and when the incision is completely healed. When you receive your prosthesis, you will learn the basics of using it, including how to:Put the prosthetic on.Take the prosthetic off.Walk and move with the prosthetic limb.Care for the prosthetic and the skin of the stump.What if I don’t want or can’t get a prosthetic?Depending on the type of amputation, your overall health and your preferences, you may not get a prosthetic. Your healthcare team will provide education about how to move and function without your natural limb.You may choose to use a walking aid, such as a cane or walker. You will also work with a physical therapist or occupational therapist to learn how to engage in everyday activities after an amputation.Care at Cleveland ClinicAmputation Care TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of an amputation?Amputation surgery stops your infection from progressing into other parts of your limb or body. It can also help manage pain when there are no other options.Many people have a prosthetic limb after surgery. Today’s prosthetics are lightweight and highly functional. With them, you can still live an active lifestyle after limb loss.What are the risks or complications of an amputation?As with any surgery, amputation carries some risks. Complications may include:Bleeding.Swelling (Edema).Infection.Wounds.Muscle weakness.Pain.What is phantom limb pain?The most common complication of amputation surgery is phantom limb pain. Phantom pain occurs when nerves in your stump send pain signals to the brain even though your limb is no longer there.Phantom limb pain usually goes away in time. Physical therapy can help reduce the discomfort.Recovery and OutlookWhat is the recovery time after an amputation?Your recovery time after an amputation will vary, depending on:The limb you had amputated.The complexity of your surgery.Whether or not you’re using a prosthetic limb.In general, you will start learning to use your prosthetic limb about two months after surgery. This learning process may take two to six months.As you become more active, remember that learning to move and function without your natural limb can be a lengthy process. Stay in touch with your healthcare provider to manage any issues that come up.When to Call the DoctorWhen should I see my healthcare provider?Throughout your recovery, you may need to reach out to different members of your healthcare team. Call your:Surgeon if you notice news signs of infection, such as sores or wounds on your stump.Physical therapist if you experience stiffness or challenges with movement.Prosthetist (prosthetic limb specialist) if your artificial limb rubs, pinches or doesn’t fit correctly.Mental health professional if the changes to your body result in issues like anxiety or depression.Additional DetailsA note from Cleveland ClinicYou may need an amputation due to a severe injury, infection or disease. After amputation surgery, it will take some time to get used to moving without your natural limb. You will need to practice physical therapy exercises to build strength, balance and mobility. If you had an arm or leg amputation, you might want to use a prosthetic limb. Amputation surgery can be a lifesaving procedure. But it can also be life-changing. You may find that learning to function without your natural limb leads to frustration, depression or other mental health challenges. Ask your healthcare provider for a referral to a psychologist or mental health counselor. Many people live a full and healthy life after an amputation.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/21/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicAmputation Care TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"