"Anabolic Steroids: What They Are, Uses, Side Effects & Risks800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Anabolic SteroidsAdvertisementAdvertisementAdvertisementAnabolic SteroidsAnabolic steroids have legitimate medical purposes. Healthcare providers prescribe them for certain conditions, such as male hypogonadism and certain types of breast cancer. But anabolic steroid misuse is common. People often misuse these drugs to build lean muscle mass. Misusing anabolic steroids can be harmful to your health.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewWhat are anabolic steroids?Anabolic steroids are medications that are manufactured forms of testosterone. The technical term for these compounds is “anabolic-androgenic steroids” (AAS). “Anabolic” refers to tissue building (mainly muscle), and “androgenic” refers to a group of sex hormones called androgens.Testosterone is the main androgen. It stimulates the development of male characteristics. Levels of testosterone are naturally much higher in men and people assigned male at birth (AMAB) than in women and people assigned female at birth (AFAB).Healthcare providers mainly prescribe anabolic steroids to treat low testosterone (male hypogonadism). But they use it for other conditions as well, such as to stimulate muscle growth for people with certain cancers or acquired immunodeficiency syndrome (AIDS).Some athletes, bodybuilders and others misuse these drugs in an attempt to enhance performance and/or improve their physical appearance. Anabolic steroids are the most common appearance- and performance-enhancing drugs (APEDs). Anabolic steroid misuse is common. Approximately 3 to 4 million people in the United States use anabolic steroids for nonmedical purposes.Anabolic steroids come in several different forms, including:Pills.Injections.Creams or topical gels.Skin patches.Implantable pellets.List of anabolic steroidsThere are several prescription anabolic steroids, including:Danazol (Danocrine®).Fluoxymesterone (Androxy®, Halotestin®).Mesterolone (Proviron®).Methyltestosterone (Android®, Methitest®, Testred®, Virilon®).Nandrolone Deconoate (Deca-Durabolin®).Nandrolone Phenpropionate (Durabalin®).Oxandrolone (Oxandrin®).Oxymetholone (Anadrol®).Testosterone buccal system (Striant®).Testosterone capsules (Jatenzo®).Testosterone injection (Andro-L.A.®, Aveed®, Delatestryl®, Depo-Testosterone®, Virilon® Xyosted®).Testosterone nasal gel (Natesto®).Testosterone patches (Androderm®, Testoderm®).Testosterone skin solution (Axiron®).Testosterone subcutaneous pellets (Testopel®).What is the difference between steroids and anabolic steroids?General steroids, called corticosteroids, are medications that reduce inflammation and the activity of your immune system. They’re manufactured drugs that closely resemble cortisol, a hormone that your adrenal glands produce naturally.Anabolic steroids are manufactured drugs that closely resemble the hormone testosterone or other androgens.Healthcare providers provide corticosteroids much more often than anabolic steroids.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat do anabolic steroids treat?The U.S. Food and Drug Administration (FDA) has approved certain anabolic steroids for the treatment of the following conditions:Primary male hypogonadism.Hypogonadotropic hypogonadism (a form of hypogonadism that’s due to an issue with your pituitary gland or hypothalamus).Delayed puberty in children assigned male at birth.Gonadotropin and luteinizing hormone-releasing hormone deficiency.Certain types of breast cancer in women and people AFAB.Endometriosis.Osteoporosis.Healthcare providers sometimes prescribe anabolic steroids for other conditions. This is considered an off-label, or non-FDA-approved, use of the medication. It’s legal and generally safe. Off-label uses include:Bone marrow stimulation in people with leukemia.Aplastic anemia.Kidney failure.Growth failure.Stimulation of appetite.Stimulation of muscle mass for people with certain cancers or AIDS.Procedure DetailsHow do anabolic steroids work?Anabolic steroids (artificial androgens) work by activating androgen receptors in your body and mimicking the effects of natural androgens.Prescription anabolic steroids work in different ways to treat conditions. For example:For people who have naturally low testosterone levels, prescription anabolic steroids return their testosterone levels to a healthy range.Anabolic steroids help treat estrogen receptor (ER) positive breast cancer by lowering your estrogen levels. The cells of this type of breast cancer have receptors that allow them to use estrogen to grow. Anabolic steroids can block the growth of cancer cells by lowering estrogen levels.For people who have muscle atrophy due to cancer or AIDS, anabolic steroids increase the number of androgen receptors in skeletal muscle, which can lead to increased muscle size and strength.Anabolic steroid misuseThe main reason people misuse anabolic steroids is to increase lean muscle mass when using them in conjunction with weight training.Non-athlete weightlifters (bodybuilders) typically misuse them to improve their appearance. Anabolic steroid misuse is often associated with a form of body dysmorphic disorder called muscle dysmorphia.For athletes, increasing muscle mass may also promote strength, which can improve strength-based sports performance.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdvertisementRisks / BenefitsWhat are the side effects of anabolic steroids?Each type of prescription anabolic steroid and each brand has different possible side effects. It’s important to talk to your healthcare provider or a pharmacist about possible side effects of the specific medication you’re taking or thinking of taking.In general, common side effects of prescription anabolic steroids include:Acne or oily skin.Swelling in your ankles from mild fluid retention.Stimulation of your prostate, which can cause urinary symptoms such as difficulty peeing.Breast enlargement or tenderness in men and people AMAB.Decrease in breast size in women and people AFAB.Worsening of sleep apnea.Smaller testicles.Vaginal dryness, burning, itching or bleeding.Menstrual cycle changes.What are the side effects and complications of anabolic steroid misuse?Misuse of anabolic steroids can cause a variety of side effects ranging from mild to harmful or even life-threatening. Most side effects are reversible if you stop taking the drugs, but others may be permanent.Nonprescription doses are often 10 to 100 times higher than the doses healthcare providers prescribe to treat medical conditions. This is why the side effects are usually more severe than the side effects of prescribed anabolic steroid use.Side effects and complications of anabolic steroid misuse for anyone include:High blood pressure.Blood clots.Heart issues, including heart attack.Stroke.Liver damage.Short stature (if you’re an adolescent).Severe acne and cysts.Male-pattern baldness.Aggression.Mania.Delusions.Major depressive disorder.Side effects and complications of anabolic steroid misuse in men and people AMAB include:Decreased sperm production.Enlarged breasts.Decrease in testicle size.Increased risk of testicular cancer.Side effects and complications of anabolic steroid misuse in women and people AFAB include:Voice deepening.Decreased breast size.Excessive body hair growth.AdvertisementCan anabolic steroids be used safely?Yes, if you take prescription anabolic steroids under the supervision of your healthcare provider for a medical reason, anabolic steroids are generally safe.Misuse of anabolic steroids can be harmful to your health.When to Call the DoctorWhen should I call my healthcare provider?You should have regular appointments with your healthcare provider when taking an anabolic steroid to assess how well it’s working.Otherwise, talk to your healthcare provider in the following situations:If you develop bothersome side effects.If your symptoms aren’t improving or if they’ve gotten worse.If you’re thinking of stopping the medication.A note from Cleveland ClinicAnabolic steroids are powerful medications that affect your hormone levels and body composition. Due to their possible health risks, it’s important to follow your healthcare provider’s instructions for taking the medication. Don’t take more than your daily recommended dose or share or sell them. Talk with your healthcare provider as soon as possible if you feel like you’re dependent on anabolic steroids.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/07/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6568Appointments & LocationsRequest an AppointmentVirtual Visits for DiabetesFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"