"Anesthesia: What It Is, Side Effects, Risks & Types800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/AnesthesiaAdvertisementAdvertisementAdvertisementAnesthesiaAnesthesia uses drugs called anesthetics to keep you from feeling pain during medical procedures. Local and regional anesthesia numbs a specific area of your body. General anesthesia makes you temporarily unconscious (fall asleep) so you can have more invasive surgeries.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is anesthesia?Anesthesia refers to the use of medications (called anesthetics) to keep you from feeling pain during procedures or surgery. Anesthetics temporarily block sensory signals from your nerves at the site of the procedure to the centers in your brain.Different types of anesthesia work in different ways. Some anesthetic medications numb certain parts of your body. Other anesthetics numb your brain so you can sleep through more invasive surgical procedures.Types of anesthesiaThe anesthesia your healthcare provider uses depends on the type and scope of the procedure. Options include:Local anesthesia: This numbs a small section of your body. Providers commonly use local anesthesia for minimally invasive procedures like cataract surgery or skin biopsy. You’re awake during the procedure.Sedation: Also called “twilight sleep,” sedation relaxes you to the point where you’ll nap but can wake up if needed to communicate. Examples of procedures often performed with sedation include wisdom teeth removal, cardiac catheterization and some colonoscopies. Although you won’t be completely unconscious, you’re not as likely to remember the procedure.Regional anesthesia: Regional anesthesia blocks pain in a larger part of your body, like a limb or everything below your chest. Examples include an epidural to ease the pain of childbirth or an arm block for hand surgery. Providers might administer regional anesthesia in addition to sedation, or they may administer it by itself.General anesthesia: This treatment makes you unconscious and insensitive to pain or other stimuli. Providers use general anesthesia for more invasive procedures or surgeries of your head, chest or abdomen.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWho administers anesthesia?If you’re having a relatively simple procedure that requires numbing a small area, the provider performing your procedure will often administer the local anesthetic. For more complex and invasive procedures, a physician anesthesiologist will prescribe the anesthetic medications and manage your pain before, during and after surgery. In addition to your anesthesiologist, your anesthesia team may include:Physicians in training (fellows or residents).A certified registered nurse anesthetist (CRNA).A certified anesthesiologist assistant (CAA).How should I prepare for anesthesia?Make sure your healthcare provider has a current list of the medications, vitamins and other supplements you take. Certain drugs can interact with anesthesia or increase the risk of complications. You should also:Avoid food and drinks for eight hours before you go to the hospital unless directed otherwise.Quit smoking, even if it’s just for one day before the procedure, to improve heart and lung health. For best results, stop smoking two weeks before your appointment.Stop taking herbal supplements for one to two weeks before the procedure as directed by your provider.Stop taking Viagra® or other medications for erectile dysfunction at least 24 hours before the procedure.Take certain (but not all) blood pressure medications with a sip of water as instructed by your healthcare provider.AdvertisementWhat happens during anesthesia?During anesthesia, a provider:Administers one or more types of anesthesia. They may also give you anti-nausea medications.Monitors vital signs, including blood pressure, blood oxygen level, pulse and heart rate.Identifies and manages issues like an allergic reaction or change in vital signs.Provides guidelines for managing pain after surgery.What should I do after getting anesthesia?For procedures using local anesthesia, you can return to work or most activities after treatment unless your healthcare provider says otherwise. You’ll need more time to recover if you’ve received regional or general anesthesia or sedation. You should:Have someone drive you home.Rest for the remainder of the day.Not drive or operate equipment for 24 hours.Abstain from alcohol for 24 hours.Only take medications or supplements approved by your provider.Avoid making any important or legal decisions for 24 hours.Care at Cleveland ClinicSchedule General SurgeryFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the potential side effects of anesthesia?Most anesthesia side effects are temporary and go away within 24 hours, often sooner. Depending on the anesthesia type and how providers administer it, you may experience:Back pain or muscle pain.Chills caused by low body temperature (hypothermia).Difficulty urinating.Fatigue.Headache.Itching.Nausea and vomiting.Pain, tenderness, redness or bruising at the injection site.Sore throat (pharyngitis).What are the potential risks or complications of anesthesia?Every year, millions of Americans safely receive anesthesia while undergoing medical procedures. However, anesthesia does carry some degree of risk. Potential complications include:Anesthetic awareness: For unknown reasons, about 1 out of every 1,000 people who receive general anesthesia experience awareness during a procedure. You may be aware of your surroundings but unable to move or communicate.Collapsed lung (atelectasis): Surgery that uses general anesthesia or a breathing tube can cause a collapsed lung. This rare condition occurs when air sacs in the lung deflate or fill with fluid.Malignant hyperthermia: People who have malignant hyperthermia (MH) experience a dangerous reaction to anesthesia. This rare inherited syndrome causes fever and muscle contractions during surgery. It’s important to relate a personal or family history of MH to your physician anesthesiologist before your anesthetic to avoid drugs that trigger this reaction.Nerve damage: Although rare, some people experience nerve damage that causes temporary or permanent neuropathic pain, numbness or weakness.Postoperative delirium: Older people are more prone to postoperative delirium. This condition causes confusion that comes and goes for about a week. Some people experience long-term memory and learning issues.Who’s at risk for anesthesia complications?Certain factors make it riskier to receive anesthesia, including:Advanced age.Diabetes or kidney disease.A family history of malignant hyperthermia (anesthesia allergy).Heart disease, high blood pressure (hypertension) or strokes.Lung disease, like asthma or chronic obstructive pulmonary disease (COPD).Obesity (body mass index, or BMI, of 30 or more).Seizures or neurological disorders.Sleep apnea.Smoking.Recovery and OutlookHow long does anesthesia stay in your system?Anesthetic drugs can stay in your system for up to 24 hours. If you’ve had sedation or regional or general anesthesia, you shouldn’t return to work or drive until the drugs have left your body. After local anesthesia, you should be able to resume normal activities, as long as your healthcare provider says it’s OK.When to Call the DoctorWhen should I call my healthcare provider?You should call your healthcare provider if you’ve had anesthesia and experience:Difficulty breathing.Extreme itching, hives or swelling.Numbness or paralysis anywhere in your body.Slurred speech.Dysphagia (difficulty swallowing).Additional Common QuestionsHow long does anesthesia last?It depends on the procedure. Your provider will determine your dosage based on your individual needs and how long the surgery takes.Is anesthesia a pain killer?Not technically, though it does prevent you from feeling pain. When people refer to pain killers, they’re really referring to analgesics, or pain medications. Analgesia is pain relief without loss of sensation or consciousness. Anesthesia, on the other hand, refers to the loss of physical sensation with or without loss of consciousness.How does anesthesia affect pregnancy?Local anesthesia affects a small area of the body. It’s generally safe for people who are pregnant or breastfeeding (chestfeeding). Many pregnant people safely receive regional anesthesia like an epidural or spinal block during childbirth. Your healthcare provider may recommend postponing elective procedures that require regional or general anesthesia until after childbirth.How does anesthesia affect breastfeeding?Anesthesia is generally safe for breastfeeding people and their babies. Medications used in all types of anesthesia, including general anesthesia, leave your system quickly. Your healthcare provider might recommend expressing your first breast milk after general anesthesia. Ask your provider if this is something you should consider.A note from Cleveland ClinicAnesthesia is one of the most important and widely used discoveries in healthcare. Because of anesthetics, you can comfortably and safely undergo all types of surgeries, big or small. It’s normal to feel nervous before having anesthesia. If you have specific questions, talk to your healthcare provider. They’re here to help. They can help determine what type of anesthesia is right for you and talk with you about what to expect.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/30/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule General SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7243Questions 216.444.9134Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"