"Anger Management: What It Is, Skills & Techniques800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Anger ManagementAdvertisementAdvertisementAdvertisementAnger ManagementEveryone gets angry. But anger can take a toll on your physical and mental health. Anger management is a type of therapy that improves your coping and communication skills. It also teaches relaxation techniques so you can keep your cool.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewHealth issues associated with poorly managed anger.What is anger management?Anger management is how we handle situations that make us angry. It’s also a form of cognitive behavioral therapy (sometimes, called talk therapy) that can take place in one-on-one or group counseling. You might even take an anger management class. In anger management therapy, you’ll work with a mental healthcare provider to recognize when you’re angry and develop coping skills and strategies so you can deal with these feelings in a way that’s healthy and sustainable for you. You’ll learn about:What causes anger and how people express it.Problem-solving and communication skills.Relaxation techniques.In some cases, your therapist may recommend that you see a physician to prescribe medications to help you deal with psychological issues — like depression or anxiety — that often underlie chronic anger issues.What is anger?Anger is that beating-heart feeling that rises in your chest as you try to ease your car into a too-small parking space made smaller when your neighbor parked way over the line. It’s that feeling that leads you to shake your fist into your rearview mirror or mutter something under your breath when someone cuts you off in traffic. Or holler at a losing sports team. It can make a toddler bite — or a teen stomp to their room and slam their door — when they don’t get their own way.So, what’s behind all this? Anger is an emotional reaction to a situation that motivates you to make changes. It stimulates your sympathetic nervous system to trigger a fight-or-flight response, which starts a number of physical changes. Your heart rate and breathing speed up. Your body floods with stress hormones and more blood goes to your muscles. Your focus increases. All this means you have more resources to move away from danger. But the stress of anger isn’t always related to a physical threat. You may also feel angry in social situations, like if you have a conflict with a friend or loved one, notice an injustice, have needs that aren’t met or someone makes fun of you.Everyone experiences anger differently depending on their personal and relationship history, medical status and current situation. Some people anger faster and feel it more intensely than others. It can range from a slight irritation to a full-on rage.What happens if you don’t find healthy ways to express your anger?If you suppress (don’t express) your anger, it can affect your thinking and behavior patterns and create (or make worse) a number of physical problems. When you’re angry more than you’re not, healthcare providers call it chronic anger. Chronic anger has been linked to health issues, including:High blood pressure.Heart disease.Headaches.Skin disorders like atopic dermatitis (eczema) and psoriasis.Digestive problems like abdominal pain, constipation and diarrhea.Is anger bad?Anger is a very common and natural emotion. It can be harmful or helpful — it depends on how you handle it. If you try and fail to get into that parking spot, for example, you might take a minute until that feeling in your chest goes away before driving away. Or you might get out of the car and leave a harsh note on your neighbor’s windshield. You’re angry in both scenarios. But in the first scenario, you notice the anger and let it go. In the second, you spread the negativity around. And probably carry it with you for the rest of the day.Anger is a very useful emotion. But when you’re angry more often than you’d like, or if it starts to affect your job or relationships, it might be time to ask for help with anger management.Who needs anger management therapy?Everyone can benefit from learning anger management skills. And if you have a mental health condition, anger management therapy can make a big difference in your quality of life and relationships. These conditions include:Attention-deficit/hyperactivity disorder.Bipolar disorder.Borderline personality disorder.Depression.Disruptive mood dysregulation disorder.Generalized anxiety disorder.Intermittent explosive disorder.Oppositional defiant disorder.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens during anger management classes or therapy?In anger management therapy, you’ll learn coping skills that help you understand what makes you angry and what anger looks like for you. Your therapist might ask questions like:What makes you angry?What are you really angry about? Is the intensity of your anger appropriate for the situation?Is your anger masking another emotion? Fear? Anxiety? Hurt? Shame? An underlying health problem? Is it a reaction you learned as a child?How does anger feel in your body?Then, you’ll work with your therapist to develop coping skills or strategies. These are practical skills and things you can do when you notice that you’re angry. Anger management coping skills include:Changing the way you think about situations. Your healthcare provider might call this cognitive restructuring. Instead of dwelling on or exaggerating negative feelings, you’ll learn to shift your perspective. You might swap negative self-talk like, “This is the worst thing that’s ever happened to me,” with something more positive. Instead, you might say: “This is bad and it’s OK to be upset, but it’s not the end of the world.”Communication skills to help you express your anger in healthy ways. You’ll learn different ways to gauge your reactions and talk about your feelings. You may also benefit from assertiveness training.Relaxation techniques to help you pause before reacting. They can also help you let go after you’ve resolved an issue rather than rehashing the same issues over and over again (rumination). This may include meditation, breathing exercises or yoga. Or you might work together with your therapist to figure out what’s calming for you.You’ll also practice these new skills with your therapist during your therapy session. Anger management classes often include practice outside your therapy sessions as well. You’ll need to practice your new plan until you’ve had some success managing your anger (a reduction in the number or severity of angry outbursts) and the techniques start to feel more natural.There are different approaches to anger management therapy. It also looks different depending on your age, so it’ll be different for your school-age child than your teen, and different for you than your parents. Your therapist’s approach will be based on their previous experience and what they think will work best for you.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentRisks / BenefitsWhat are the potential benefits of anger management?With anger management therapy, you may notice improvements in your relationships at home and at work. You’ll feel more in control of your emotions. You may even sleep better and be less likely to get certain diseases.AdvertisementWhat are the risks or complications of anger management?During anger management therapy, you might feel some discomfort talking about your feelings. After developing a trusting relationship with your therapist, they may ask you questions about your past bring back old hurts. But dealing with these uncomfortable thoughts and memories is often a necessary step to feeling better in your daily life.Recovery and OutlookHow long will I need this treatment?Anger management therapy generally involves a series of sessions with your therapist over several months. If you’re diligent about practice, you can start to see the effects of your new techniques fairly quickly.Your relationship with your therapist may last beyond the anger management series, and it’s normal to need to revisit therapy as things change in your life. For example, the anger management skills you need as a young adult are different from what you need as the parent of a toddler. Work situations change and life events happen, so give yourself some grace and don’t beat yourself up if you need a bit of a tune-up in anger management.AdvertisementWhen to Call the DoctorWhen should I call my healthcare provider?If your symptoms get worse or you’re worried that you might hurt yourself or others, reach out to a provider right away. If it’s after hours or your distress feels overwhelming, call 988 to reach the Suicide & Crisis Lifeline.A note from Cleveland ClinicAnger is a normal part of being human. But sometimes, it can get out of hand. If you’re feeling like you’re angry more often than not, or if you’ve hurt someone you love with harsh words or actions, you might benefit from learning anger management skills.It can be painful to explore negative events and emotions. So, it’s important to choose your therapist carefully. Make sure you see a licensed professional who’s trained to teach anger management and assertiveness skills. But you’ll also be spending hours with your therapist throughout your treatment, so it’s important to find someone you feel gets you. Don’t be discouraged if it takes couple times to find the right fit.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/26/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"