"Ankle Arthroscopy: Procedure, Surgery & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Ankle ArthroscopyAdvertisementAdvertisementAdvertisementAnkle ArthroscopyAnkle arthroscopies are used to address a wide range of ankle issues. There’s a very low risk of complications, and you’ll be able to go home the same day as your surgery. Most people recover in a few months after an ankle arthroscopy.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewAn ankle arthroscopy performed on a person’s right ankle.What is ankle arthroscopy?Ankle arthroscopy is a surgery used to treat issues inside of your ankle joint. Your surgeon will insert a special tool called an arthroscope into your ankle to identify and repair damage. The arthroscope includes a camera and a light that lets your surgeon see what’s going on inside of your ankle while only making a few small incisions (cuts) in your skin. Your surgeon will also insert any other tools they need during the surgery through additional tiny cuts.Because the incisions required to perform an ankle arthroscopy are much smaller than other forms of surgery — less than half an inch across in most cases — it’s less stressful on your body than other procedures.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs ankle arthroscopy?Anyone with ankle pain or other issues in their ankle joint that hasn’t responded to other treatments is a good candidate for ankle arthroscopy. It can also help people who are having trouble moving properly because of an issue inside of their ankle joint. Typically, your healthcare provider will recommend arthroscopy after other nonsurgical treatments, like steroid injections or physical therapy, haven’t completely solved your issues.What does ankle arthroscopy treat?Ankle arthroscopy is an effective, minimally invasive surgery that can treat a wide range of conditions, including:Instability: Something inside of your ankle joint, like a bone deformity, might make it hard to securely stand or move. Your surgeon can diagnose and repair what’s making you unsteady during arthroscopy.Impingement: If tissues in or surrounding your ankle are overused, they can become swollen and sore. Eventually, this swelling causes stiffness that makes it hard to move your ankle.Removing pieces of bone, cartilage or scar tissue: After an injury, your bones or cartilage might be damaged, or loose pieces inside of your joint might cause pain. Your body may have formed scar tissue inside of your joint while the injury healed.Torn ligaments: Ligaments are like rubber bands that hold your bones together. If you tear or damage a ligament in an accident, fall or other trauma, your ankle won’t function properly.AdvertisementHow common is ankle arthroscopy?Ankle arthroscopy is very common, and surgeons are able to treat more conditions than ever before thanks to recent technological advances.Arthroscopy is becoming a standard procedure as surgeons are able to perform increasingly complex operations with less invasive methods and lower risks.Procedure DetailsWhat happens before ankle arthroscopy?Before your ankle arthroscopy, you might need to reduce how often you:Take blood thinners: Tell your surgeon all the medicines you’re taking — including over-the-counter drugs or supplements. Medicines that thin your blood — including those prescribed to prevent blood clots — can be dangerous during and after surgery. Your surgeon will tell you which medications to stop or how to alter your daily routine.Smoke: If you smoke or use other kinds of tobacco products, you should quit at least four weeks before your surgery. In addition to the everyday health risks, smoking makes it harder for your body to heal after a surgery.Drink alcohol: Alcohol thins your blood, which can make it dangerous to have in your system before and after surgery.Eat or drink: Your surgeon will tell you if you need to avoid eating and drinking anything before your ankle arthroscopy. You might need to plan ahead and not eat or drink anything other than water up to 12 hours before surgery.AdvertisementWhat happens during ankle arthroscopy?During an ankle arthroscopy, your surgeon will make a few small cuts (usually less than half an inch across) in the skin around your ankle and insert the arthroscope into your joint. They’ll make additional tiny incisions to insert other tools they need to repair any damage to your bones or connective tissues. Once they’re able to see inside of your ankle with the arthroscope, your surgeon can repair your joint.You’ll receive either regional anesthesia near your ankle to make sure you don’t feel pain during the surgery or general anesthesia to put you to sleep during the operation.Most arthroscopies take around an hour, but the length of your surgery will depend on your unique needs.What is debridement?There are a few techniques your surgeon can use to complete your arthroscopy, depending on what needs fixed. Debridement is one of the most common. Debridement is how surgeons refer to cleaning up something in your body. In the case of ankle arthroscopy, this means removing damaged tissue, or reshaping your bones to fix impingement or arthritis.Think about it this way: It doesn’t matter if your kitchen needs a top-to-bottom scrub or just a little tidying. Either way, it still needs cleaned. Whether it takes all afternoon or just a few minutes, the end result is the same: A kitchen that’s spic and span. It’s the same during your arthroscopy. Even if you need more extensive debridement, your surgeon will be able to clean up your joint to fix what’s causing you pain or discomfort.The more significant your symptoms, the more debridement you’ll likely need. In most cases, it shouldn’t impact your recovery time too much.What happens after ankle arthroscopy?Ankle arthroscopy is almost always an outpatient surgery, and you should be able to go home the same day as your procedure.Your provider or surgeon will go over the results of your surgery and tell you what you need to do to heal and recover.You may need to:Avoid putting weight or pressure on your ankle or foot.Ice and elevate your ankle.Keep the incision clean and covered.Take NSAIDs for pain.Take showers, not baths, until the incision heals. You might also need to keep your incision covered and to prevent it from getting wet.You’ll probably have to wear a splint on your ankle for a few weeks after your surgery. Your surgeon will tell you when you can start moving your ankle and when you’ll start physical therapy.Care at Cleveland ClinicSchedule Ankle SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of ankle arthroscopy?Ankle arthroscopy is one of the least invasive surgeries you can have. It lets surgeons identify and repair lots of issues with very little disruption to your body. Even if you have a more complicated underlying condition, your surgeon will still only need to make a few small incisions to correct it. This means you should experience:A fast recovery time — often as little as a few weeks.Less pain after the arthroscopy than open surgery.Minimal blood loss and minor scarring.Dramatically decreased risk for complications compared to more invasive types of surgery.What are the risks or complications of ankle arthroscopy?Potential complications from ankle arthroscopy include:Allergic reaction to anesthesia.Nerve damage.Blood clots, including deep vein thrombosis (DVT).Damage to tissue surrounding your ankle, foot and leg.Excessive bleeding or swelling.Infections.Numbness or tingling in your ankle and foot.A need for further surgery if your original issues aren’t fully corrected.Recovery and OutlookWhat is the recovery time for ankle arthroscopy?Most people recover from an ankle arthroscopy in a few months. Your exact time to heal fully depends on your reason for needing surgery, and how quickly you regain your stability, strength and range of motion.You might need crutches or to wear a splint on your ankle for a few weeks after surgery. After that, you should be able to start walking in a boot.You’ll also need physical therapy after your arthroscopy. This could be as simple as at-home stretches and exercises you do yourself. Your surgeon or provider will show you how to perform them safely after your surgery. Depending on how complicated your surgery is, you might need to work with a physical therapist to get your ankle back to its usual level of strength and mobility.You should be able to return to intense exercise and/or sports a few months after surgery, depending on how quickly your ankle heals.When can I go back to work or school after ankle arthroscopy?You should be able to return to work or school a few weeks after an ankle arthroscopy — as long as it’s possible to do your job or schoolwork seated. Ask your provider or surgeon how long you should wait before resuming any activity that might put stress on your ankle. Your surgeon may also recommend that you avoid sitting still for too long. You may need to take several short breaks throughout the day to stretch and move about.When to Call the DoctorWhen should I see my healthcare provider?You should call your healthcare provider if you experience:Intense pain or bleeding.Nausea and vomiting.Signs of an infection, such as fever or discoloration at the incision site.A note from Cleveland ClinicAnkle arthroscopy is a safe, effective surgery that will get you back on your feet. It’s used to treat a wide range of ankle issues. Even in more complicated cases, it’s still less invasive than almost any other surgery. It’s one of the most common surgeries performed in the U.S. each year because it’s so helpful for so many people experiencing pain or mobility issues.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/29/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Ankle SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2606Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"