"Anoscopy: What It Is & What To Expect During the Procedure800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/AnoscopyAdvertisementAdvertisementAdvertisementAnoscopyAn anoscopy is a diagnostic exam that looks inside your anus with a lighted scope, called an anoscope or anal speculum. It’s a simple bedside procedure that a healthcare provider can perform on short notice, with no preparation necessary.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewAn anoscopy examines your anus with a special type of scope.What is anoscopy?An anoscopy is a medical exam that looks inside your anus with a special scope, called an anoscope. The anoscope examines the lining of your anus and lower rectum to look for signs of injury or disease.What is a high-resolution anoscopy?A high-resolution anoscopy adds a magnifying device called a colposcope to the anoscope. The colposcope can detect subtle changes in your tissues that the anoscope alone might not.A healthcare provider might use a high-resolution anoscopy to look specifically for abnormal cells in your anal lining. If they find any, they might take a sample (biopsy) to analyze in the lab.What is the difference between an anoscopy vs. protoscopy?A protoscopy uses a different kind of scope, called a protoscope, to look inside both your anus and rectum. Your rectum is the section of your large intestine that’s just above your anus. It’s about six inches long.A protoscope is a longer scope that’s used to visualize your rectum, while an anoscope is better for visualizing your anus specifically (the last inch or two of your intestine). A proctoscopy also may involve some preparation in advance.What is the difference between an anoscopy vs. colonoscopy?A colonoscopy uses a colonoscope to look inside the entire length of your large intestine, including your anus, rectum and colon. This is a longer procedure that also involves some preparation in advance.A colonoscopy may show signs of anal conditions but isn’t necessary to diagnose most anal conditions. It may be helpful for diagnosing conditions affecting your entire large intestine, including your anus.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy would I need an anoscopy?An anoscopy is a diagnostic procedure, which means it helps healthcare providers diagnose anorectal conditions. Your provider might suggest an anoscopy if you’re experiencing symptoms in your anus.Your provider might also suggest an anoscopy to screen for certain anal conditions that don’t always cause symptoms — such as cancer and viral infections — if you’re at a higher risk of acquiring these.Symptoms that an anoscopy might investigate include:Anal bleeding.Anal discharge.Anal pain.Anal itching.Anal swelling.Anal lesions.Anal protrusions.Difficulty pooping or holding poop in.Conditions that an anoscopy might help diagnose include:Hemorrhoids.Anal fissure.Anal yeast infection.Anal STIs.Anal abscess.Anal fistula.Anal trauma.Rectal prolapse.Anal dysplasia.Anal cancer.Procedure DetailsHow do I prepare for an anoscopy?No special preparation is necessary, but your healthcare provider might suggest that you:Avoid anal penetration.Avoid using anal medications or products.Empty your bowels and bladder before your procedure.Use an enema — or don’t — depending on your condition.Who performs an anoscopy?A gastroenterologist or colorectal surgeon may perform your anoscopy. Both are specialists in gastrointestinal diseases and in endoscopic procedures that look inside your intestines.Where do I get an anoscopy?You may have an anoscopy in a provider’s office or outpatient clinic.AdvertisementWhat does an anoscope look like?The anoscope is a rigid, hollow instrument, usually about 1 to 2 inches wide and 3 to 5 inches long. The pediatric anoscope used for children is smaller. An anoscope is also called an anal speculum.Different models have slight variations. Some have a tapered shape, while others have straight sides with a beveled tip. Some are made of translucent plastic, while others are opaque with slotted sides.Does an anoscope hurt?The instrument itself shouldn’t hurt. It’s lubricated and designed to pass smoothly through your anus. But you might feel some discomfort from internal pressure, like bloating or cramping.Are you awake during an anoscopy?Yes, most people are because most find it easy to tolerate. If your condition makes your anus extra sensitive to touch, you can discuss your options for anesthesia with your healthcare provider.What happens during the anoscopy procedure?When you arrive for your procedure, your healthcare provider will:Ask you to remove your underwear. You’ll have a cover or hospital gown for privacy.Position you on an exam table. They might ask you to bend forward over the table, to lie prone (on your stomach) on the table or lie in a fetal position (on your side with your knees bent).With a lubricated gloved finger, perform an initial digital rectal exam to check for anything unusual in your anus or rectum before inserting the anoscope.Occasionally, apply a topical numbing medication inside your anus, such as lidocaine. For some severe conditions, they might use additional pain medications or anesthesia.During your anoscopy, your healthcare provider will:Lubricate the anoscope and gently insert it into your anus.Advance the four-inch scope through your anus and into the lower two inches of your rectum.Remove the obturator. This is a removable plug that’s inserted through the anoscope to help guide it in place while shielding the lens. When it’s removed, the anoscope is able to “see.”Slowly withdraw the anoscope, examining tissue along the way. Some types may be slowly rotated during withdrawal. A slotted anoscope may be too uncomfortable to rotate and may instead require several “passes” through your anal canal in order to examine all sides.Use a cotton swab to take a sample of any unusual substances, such as mucus or pus. They’ll place the swab in a culture tube and later develop the culture to identify the infection.Use a cotton swab to take a sample of fecal matter and test it for invisible traces of blood, if indicated (fecal occult blood test).Use surgical forceps to pinch off a small tissue sample of any suspicious masses for biopsy.If you’re having a high-resolution anoscopy, your healthcare provider will:Insert a cotton swab coated with an acetic acid solution through the anoscope.Withdraw the anoscope while leaving the swab in place for a few minutes. The solution will turn abnormal cells in your anal lining white.Remove the swab and reinsert the anoscope with the magnifying device (colposcope) attached.Perform the anoscopy, looking for any white cells. They’ll take a biopsy of those cells.How long does the procedure take?A typical anoscopy exam takes only a few minutes to complete. But it could take longer if you’re having a high-resolution anoscopy or if your provider takes samples during the exam.What does an anoscopy feel like?Most people describe mild discomfort related to internal pressure in their anus and lower rectum. It might feel like you have gas or like you need to have a bowel movement.Some people may be extra tender in their anus due to their conditions. Topical anesthetic is meant to make this more comfortable, but some people may feel a little pain anyway.AdvertisementWhat happens after the procedure?Your healthcare provider will be able to let you know right away what they found. If they took samples to test in the lab, they’ll let you know what they’re testing for, and you'll get these results back later.In some cases, your provider might be able to treat your condition right away. For example, if you have hemorrhoids, your provider might be able to stop them from bleeding using various techniques.Risks / BenefitsWhat are the benefits of this procedure?An anoscopy is a simple and inexpensive bedside procedure that doesn’t usually require a bowel preparation (cleaning out your bowels) or anesthesia (medication to relax you or put you to sleep).Are there risks or side effects to the procedure?You may have some mild discomfort or bleeding during or after the exam, depending on your condition and whether your provider took a biopsy. This is normal and should resolve within a few days at most.Recovery and OutlookWhat is the recovery like from an anoscopy?An anoscopy is an outpatient procedure, and in most cases, you can go home soon after you’re done. If you had anesthesia, you may have to stay longer and may have to have someone else drive you home.You might feel a little sore or have a little bleeding after the procedure. This should resolve in a day or so. To soothe your anus, you can try sitting in a warm bath, using ice or applying topical medications.When to Call the DoctorWhen should I call my healthcare provider?Let your provider know if you have excessive pain or bleeding after your procedure, or if it lasts longer than two days. Call right away if you have symptoms of acute illness, such as fever or nausea.A note from Cleveland ClinicAn anoscopy might seem intimidating at first, but it’s quick and easy for most people. If you have anal symptoms, it’s a good bet this exam will lead you to the diagnosis and the treatment you need. Remember, your healthcare provider isn’t embarrassed by your anus — they see them every day. Their concern is the same as yours — to identify what’s causing your symptoms and what will bring you relief.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/17/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"