"Antipsychotic Medications: What They Are, Uses & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Antipsychotic MedicationsAdvertisementAdvertisementAdvertisementAntipsychotic MedicationsAntipsychotic drugs treat psychosis, a collection of symptoms that affect your ability to tell what’s real and what isn’t. These drugs are a critical part of treating conditions that involve psychosis. Without them, many of these conditions are so disruptive or severe that they need 24/7 psychiatric care.ContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat are antipsychotics?Antipsychotic medications are drugs that mainly treat psychosis-related conditions and symptoms. But taking an antipsychotic drug doesn’t always mean you have a symptom or condition related to psychosis. That’s because these drugs are very important for treating other conditions, too.What is psychosis?Psychosis isn’t a medical condition. It’s a collection of symptoms that indicate your brain isn’t processing certain kinds of information as it should. The symptoms all involve a disconnection from reality. The main symptoms are hallucinations and delusions. It can also involve disorganized thoughts and actions, or dampen how you show emotions.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAre there different types of antipsychotics?There are two main types of antipsychotic medications:First-generation antipsychotics. Also known as “typical antipsychotics,” these drugs were the first types of medications developed for treating psychosis. Most aren’t commonly used for treating psychosis now.Second-generation antipsychotics. Also known as “atypical antipsychotics,” these are now the main drugs for treating psychosis. That’s mostly because they have fewer side effects.First-generation (typical) antipsychoticsChlorpromazine. The brand name of this medication (Thorazine) is no longer available in the U.S., but generic versions still are.Fluphenazine. The brand names of this medication (Prolixin, Permitil) are no longer available in the U.S., but generic versions still are.Haloperidol (Haldol®).Loxapine (Adusuve®). One of the brand names of this medication (Loxitane) is no longer available in the U.S., but generic versions still are.Molindone. The brand name of this medication (Moban) is no longer available in the U.S., but generic versions still are.Perphenazine. The brand name of this medication (Trilafon) is no longer available in the U.S., but generic versions still are.Pimozide (Orap*).Prochlorperazine (Compro®). One of the brand names of this medication (Compazine) is no longer available in the U.S., but generic versions still are.Thiothixene. The brand name of this medication (Navane) is no longer available in the U.S., but generic versions still are.Thoridazine. The brand name of this medication (Mellaril) is no longer available in the U.S., but generic versions still are.Trifluoperazine. The brand name of this medication (Stelazine) is no longer available in the U.S., but generic versions still are.Second-generation (atypical) antipsychoticsAripiprazole (Abilify®, Aristada®).Asenapine (Secuado®, Saphris®).Brexpiprazole (Rexulti®).Cariprazine (Vraylar®).Clozapine (Clozaril®, Versacloz®). One of the brand names of this medication (Fazaclo) is no longer available in the U.S., but generic versions still are.Iloperidone (Fanapt®).Lumateperone (Caplyta®).Lurasidone (Latuda®).Olanzapine (Zyprexa®, Lybalvi®, Symbyax®).Quetiapine (Seroquel®).Paliperidone (Invega®).Pimavanserin (Nuplazid®).Risperidone (Perseris®, Risperdal®).Ziprasidone (Geodon®).How do antipsychotics work?All antipsychotics work by changing how your brain uses certain signals known as neurotransmitters. Cells throughout your nervous system have receptors, which are like locks, on their surfaces. Neurotransmitters are like keys, and they have very specific shapes.If a neurotransmitter with the right shape attaches to a receptor, it can activate the cell and tell it to do something. Some neurotransmitters have nearly the right shape, but they don’t activate the cell. Instead, they block neurotransmitters that could activate the cell.Antipsychotics rely on the lock-and-key system for neurotransmitters and receptors in different ways:First-generation antipsychotics: These block the way your brain uses several neurotransmitters, especially dopamine. They also block acetylcholine (pronounced “Uh-SEE-till-CO-lean”), histamine and norepinephrine from latching onto various receptors.Second-generation antipsychotics: These block certain dopamine and serotonin receptors. But unlike first-generation antipsychotics, these medications don’t just block receptors. They also activate certain other dopamine and serotonin receptors. Blocking some receptors and activating others is why these medications work differently.AdvertisementWhat conditions do antipsychotics treat?Antipsychotics treat conditions that cause or involve psychosis. Those include:Schizophrenia (and its related spectrum of disorders, including schizoaffective disorder and schizophreniform disorder).Bipolar disorder.Mania.Major depressive disorder with psychotic features.Delusional disorder.Severe agitation.Borderline personality disorder.Dementia.Delirium.Substance-induced psychotic disorder.Providers may treat other conditions with antipsychotics, but those drugs aren’t their main treatment. These conditions include:Tourette syndrome.Huntington’s disease.Parkinson’s disease.Lesch-Nyhan syndrome.Obsessive-compulsive disorder.Are antipsychotics commonly prescribed?Antipsychotic medications see widespread use. Approximately 4 million adults in the U.S. have a prescription for at least one of these medications.AdvertisementRisks / BenefitsWhat are the potential benefits of antipsychotics?Antipsychotic medications have several benefits, including:Range of conditions they treat. Antipsychotics can treat specific brain-related conditions. They can also treat mental health conditions (many of which happen for brain-related reasons that aren’t fully understood).Type of conditions they treat. Antipsychotics treat conditions that can be very complex, disruptive and severe. Some of these conditions are very difficult (if not impossible) to treat with other kinds of medications. Also, many people with these conditions would need long-term (or even lifelong) care 24/7 without these drugs.History of research and use. First-generation antipsychotics came into use in the early 1950s. The first second-generation antipsychotic came into use in the 1960s. That means these medications have decades of research and study supporting them.Number of drugs available. There are many different types of antipsychotic drugs. That means your healthcare provider can often offer options for you to choose from when recommending a medication.Contributions to other treatment approaches. Antipsychotics can also make other types of mental health treatments more effective. When used together, antipsychotics and mental health therapy (the technical term is “psychotherapy”) usually have a much better chance of helping a person.What are the possible disadvantages, side effects and complications of antipsychotics?Antipsychotics are useful, but there are possible drawbacks. Antipsychotic medications can have various side effects and complications, including:Drug-induced movement disorders. First-generation and second-generation antipsychotics can cause an inability to hold still (akathisia) or uncontrolled face muscle movements (tardive dyskinesia). Other symptoms include tremors or parkinsonism-like symptoms. They can also cause neuroleptic malignant syndrome, a possibly deadly complication. Scientists developed second-generation antipsychotics to avoid that side effect.Heart and circulatory problems. Antipsychotic drugs may alter your heart rhythm. They can also cause orthostatic hypotension, which is a blood pressure drop when you stand or sit up quickly that can make you fall or pass out.Interactions. Antipsychotic medications can interact with several other types of medications. Be sure to tell your healthcare provider about every medication, supplement, vitamin or herbal remedy you take. That can help them determine if there’s a risk of interactions with an antipsychotic medication they prescribe for you.Metabolism effects. Antipsychotic drugs can cause high cholesterol (hyperlipidemia) and high blood sugar (hyperglycemia). They can also increase your risk of developing Type 2 diabetes.Dizziness and sedation. All antipsychotics can have a sedative effect, meaning they make you tired. They can also cause dizziness, increasing your risk of falls and injuries.High prolactin levels (hyperprolactinemia). Antipsychotics can affect your levels of the hormone prolactin. This can affect fertility and cause missed periods (amenorrhea) and leaky discharge from your breasts when you aren’t breastfeeding/chestfeeding (galactorrhea) in women and people assigned female at birth. It can cause infertility and sexual dysfunction in men and people assigned male at birth.Immune disruption. Some antipsychotics can cause agranulocytosis, a dangerous condition that involves a weakening of your immune system.Jaundice. This is when your skin and the whites of your eyes (sclera) turn yellow because of a problem in your liver.Other less serious side effects can include:Weight gain.Dry mouth.Constipation.Urinary retention.Recovery and OutlookHow long can I stay on antipsychotics?Some antipsychotic medications are for short-term use only. Others, you can take for years or even indefinitely. This can vary depending on the medication you take, why you take it, other conditions you have or medications you take, side effects that you experience or want to avoid and much more. Your healthcare provider is the best person to tell you what they recommend when it comes to how long you take one of these medications.Can I work or drive if I’m taking antipsychotics?Some antipsychotic drugs can cause you to feel tired or sleepy. You should talk to your doctor about whether or not you can drive after you take one of these drugs. They can tell you when it’s safe to drive and what you can do to minimize side effects that could affect driving.What are the reasons I can’t take antipsychotics?Several conditions can get worse if you take antipsychotics. Fortunately, there are many different antipsychotic medications, so your healthcare provider can likely recommend one that has little or no risk of worsening another medical issue you have.If you have any of the following, it’s important to tell your healthcare provider:Liver damage or disease (cirrhosis).Heart disease.A history of stroke or circulatory problems in your brain (cerebrovascular disease).Parkinsonism (including Parkinson’s disease and many conditions that cause similar symptoms).Bone marrow or immune problems.Blood pressure that’s severely high (hypertension) or low (hypotension).Type 2 diabetes.Glaucoma.Enlarged prostate (benign prostatic hyperplasia).Stomach ulcers.Chronic respiratory conditions.When to Call the DoctorWhen should I call my healthcare provider?Antipsychotics may cause serious side effects or complications for some people. Your healthcare provider can tell you which symptoms to watch for and what you should do if you notice them.In general, you should call your healthcare provider as soon as possible if you notice any of the following symptoms:Shaking or tremors.Uncontrolled face movements.Yellowing of your skin or whites of your eyes.Symptoms of neuroleptic malignant syndrome, including high fever, rigid or stiff muscles, confusion or unusual/unexpected changes in mental status.If you suspect someone may try to harm themselves or someone elseAntipsychotics treat mental health conditions that can greatly increase the risk of self-harm, suicidal thoughts and behaviors, or violent behavior toward others.You should get immediate help if you have thoughts about harming yourself or others, or if you suspect someone you know is in danger of trying to harm themselves or others. Resources that can help include:Dial 988 for the National Suicide and Crisis Lifeline (United States). This line can help you if you have suicidal thoughts or impulses, and you can also call this line even when you’re not in crisis. To call this line, dial 988. You can also get help via text message. To do so, text HELLO to 741741.911 (or your local emergency services number). You should call 911 (or the local emergency services number) if you feel like you are (or someone you know is) in immediate danger of self-harm or suicide. Operators and dispatchers for 911 lines can often help people in immediate danger because of a severe mental crisis and send first responders to assist.Additional Common QuestionsWhat is the best antipsychotic drug, or what is the safest antipsychotic drug?There’s no single answer to these questions. That’s because the best or safest antipsychotic drug for you may be different from the best drug for someone else, even someone else with the same condition. The biggest factors that determine what drug is best for you include:The condition you have.The side effects that various drugs might cause.Any conditions that side effects or complications could affect or make worse.Your healthcare provider is the best source of information about which drugs they recommend. They can help you understand why they recommend a drug and what you should expect.What is the most commonly prescribed antipsychotic drug?The most commonly prescribed first-generation antipsychotic drugs are:Haloperidol.Perphenazine.The most commonly prescribed second-generation antipsychotics are:Ziprasidone.Olanzapine.Quetiapine.Risperidone.A note from Cleveland ClinicAntipsychotics are a key medication for treating psychosis, a collection of symptoms that affect your understanding of what’s real and what isn’t. Psychosis symptoms can happen with many conditions, and these conditions can be extremely severe and disruptive.Antipsychotics offer a treatment option that can help people who would otherwise need in-hospital mental healthcare. That means antipsychotics can help people experiencing psychosis-related conditions return to their homes, lives and routines.Care at Cleveland ClinicMental Health CareMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/12/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicMental Health CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"