"Antiseizure Medication (Anticonvulsants): What It Is & Uses800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Antiseizure Medications (Formerly Known as Anticonvulsants)AdvertisementAdvertisementAdvertisementAntiseizure Medications (Formerly Known as Anticonvulsants)Antiseizure medications (anticonvulsants) help treat epilepsy and other causes of seizures. They can treat other conditions as well, like anxiety and neuropathic pain. There are several different types of antiseizure medications. You and your healthcare provider will work together to find the best one for you.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional Common QuestionsOverviewWhat are antiseizure medications (anticonvulsants)?Antiseizure medications (previously known as antiepileptic or anticonvulsant medications) are prescription medications that help treat and prevent seizures. Healthcare providers may prescribe these medications to treat other conditions as well.A seizure happens when you have a temporary, unstoppable surge of electrical activity in your brain. This overloads the affected areas of your brain. It can cause a wide range of symptoms, including:Abnormal sensations.Loss of awareness.Falling.Uncontrolled muscle movements (convulsions).People most commonly associate epilepsy with seizures, but there are several other causes of seizures (often called symptomatic seizures).Why are these medications no longer called anticonvulsants?Healthcare providers now call these medications antiseizure medications because they help treat and prevent seizures. While people often associate seizures with convulsions, not every seizure involves convulsions (jerking movements). For example, some seizures cause temporary confusion, a staring spell and/or loss of consciousness or awareness.Therefore, “antiseizure medications” is a more accurate term than “anticonvulsants” to describe what these medications help treat.List of antiseizure medications (anticonvulsants)Healthcare providers can prescribe several types of antiseizure medications in the United States. They include:Brivaracetam (Briviact®).Cannabidiol (Epidiolex®).Carbamazepine (Epitol®, Tegretol®).Cenobamate (Xcopri®).Clobazam (Onfi®).Clonazepam (Ceberclon®, Klonopin®).Eslicarbazepine (Aptiom®).Ethosuximide (Zarontin®).Felbamate (Felbatol®).Fosphenytoin (Cerebyx®).Gabapentin (Horizant®, Gralise®, Neurontin®).Lacosamide (Vimpat®).Levetiracetam (Keppra®, Roweepra®).Oxcarbazepine (Trileptal®).Perampanel (Fycompa®).Phenobarbital (Solfoton®, Luminal®).Phenytoin (Dilantin®, Phenytek®).Pregabalin (Lyrica®).Primidone (Mysoline®).Rufinamide (Banzel®).Stiripentol (Diacomit®).Tiagabine (Gabitril®).Topiramate (Topamax®, Topiragen®).Valproate products: Valproate sodium (Depacon®), divalproex sodium (Depakote®), valproic acid (Depakene® and Stavzor®).Vigabatrin (Sabril®).Zonisamide (Zonegran®).All of these medications have specific uses based on:The type(s) of seizures you experience, such as focal seizures or absence seizures.The underlying condition causing the seizures, such as Lennox-Gastaut syndrome or Dravet syndrome.Your age.Healthcare providers also break antiseizure medications into two general groups:Broad-spectrum antiseizure medications: These medications treat a wide variety of seizure types. Providers generally prescribe these first if they’re uncertain of your seizure type. Some broad-spectrum antiseizure medications include levetiracetam, lamotrigine, zonisamide and topiramate.Narrow-spectrum antiseizure medications: These medications mainly treat focal or partial seizures. Some narrow-spectrum antiseizure medications include ethosuximide, pregabalin, gabapentin and carbamazepine.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is an antiseizure medication used for?Healthcare providers prescribe antiseizure medications to treat epilepsy and symptomatic seizures. They also prescribe these medications to prevent and/or treat seizures that happen during or following brain surgery.Providers may prescribe antiseizure medications for other non-seizure-related conditions. Some antiseizure medications are approved by the U.S. Food and Drug Administration (FDA) for other conditions. Providers may also prescribe antiseizure medications for a condition even though they’re not FDA-approved for that condition. This is considered an off-label use of the medication. Certain antiseizure medications may help treat:Anxiety.Migraine headaches.Bipolar disorder.Neuropathic pain.Fibromyalgia.Restless leg syndrome.Parkinson’s disease.Some providers prescribe zonisamide or topiramate to aid in weight loss.Procedure DetailsHow do antiseizure medications work?In general, antiseizure medications work by controlling abnormal electrical activity in your brain. There are many different types of antiseizure medications, and they do this in different ways.Your brain contains billions of cells known as neurons. Neurons transmit and relay chemical and electrical signals to each other. At any given time, neurons can be resting or exciting (triggering) or inhibiting (blocking) other neurons.Seizures happen when a malfunction causes neurons to fire electrical signals uncontrollably. That causes a domino effect, meaning more and more neurons become involved in generating abnormal electrical discharges.Antiseizure medications work in different ways to either reduce excitation or promote inhibition of processes that result in electrical signals. Specifically, they can act by:Changing electrical activity in neurons by affecting ion (sodium, potassium, calcium and/or chloride) channels.Changing chemical transmission between neurons by affecting neurotransmitters (like GABA).Researchers don’t know precisely how some antiseizure medications work.AdvertisementHow long will I need to take an antiseizure medication?How long you’ll need to take an antiseizure medication depends on your unique situation and why you’re taking it.If you have epilepsy and become seizure-free after taking antiseizure medications, the possibility of coming off antiseizure medications depends on a number of factors, including:The type of epilepsy you have.The number of antiseizure medications you’re taking.How long you’ve been seizure-free.When you first developed epilepsy.How long you had epilepsy before becoming seizure-free.The number of seizures you’ve had prior to becoming seizure-free.Whether you have other neurological conditions.The presence of abnormal EEG findings.If you’ve undergone epilepsy surgery.Together, you and your healthcare provider will decide what’s best for you.Care at Cleveland ClinicEpilepsy and Seizures TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the side effects of antiseizure medications?Each type of antiseizure medication and each brand has different possible side effects. It’s important to talk to your healthcare provider or a pharmacist about possible side effects of the specific medication you’re taking.In general, common side effects of antiseizure medications include:Headaches.Fatigue.Dizziness.Blurred vision.Nausea.Weight gain or loss.Mood changes.Use of some antiseizure medications long-term may lead to osteoporosis. Because of this, providers usually recommend supplementing your diet with calcium and vitamin D.AdvertisementAre antiseizure medications effective?Antiseizure medications can prevent seizures in about 7 out of 10 people who experience them. However, it may take time to find the type of medication that works best for you, as everyone is different.Other treatments can help manage seizures if medications don’t work, including:Epilepsy surgery.Diet changes, like the ketogenic diet.Responsive neurostimulation.Deep brain stimulation.Vagal nerve stimulation.What are the possible risks or complications of antiseizure medications?Rare but serious complications of antiseizure medications include:Stevens-Johnson syndrome.Agranulocytosis.Aplastic anemia.Liver failure.Pancytopenia (a lack of all three cellular components of your blood — red cells, white cells and platelets).Drug-induced delayed multi-organ hypersensitivity syndrome (an allergic reaction that affects your skin, liver, lymphatic system and other body systems).Psychosis.Lupus.Other possible complications include:Drug interactions.Toxicity.Risk of suicidal thoughts or behavior.Drug interactionsAdverse drug interactions most commonly occur with older-generation antiseizure medications. This is because they can affect liver enzymes — either making too many or blocking their production. This can affect how your body metabolizes (uses) other medications you’re taking.Be sure to tell your healthcare provider about all the medications you’re taking before starting an antiseizure medication, including prescriptions, over-the-counter medications and supplements. In addition, if you’re already taking an antiseizure medication, make sure you tell your provider before starting any new medications.ToxicityAntiseizure medication toxicity can happen if you take too much of the medication at once — accidentally or knowingly.Symptoms include:Confusion.Nystagmus.Ataxia.Slow and shallow breathing (respiratory depression).Certain antiseizure medications can also cause dysrhythmia (irregular heartbeat).Antiseizure medication toxicity is a medical emergency. Call 911 or get to the nearest emergency room if you or a loved one have these symptoms. Without treatment, it can lead to coma or death.It’s important to take your medication exactly as your healthcare provider prescribes it to avoid toxicity. Be sure to store your medications in a safe place away from children and pets.Increased risk of suicideIn 2008, the FDA issued a warning that all antiseizure medications might increase the risk of suicidal ideation and suicidal behavior. However, studies show that this risk is low.If you or your child have suicidal thoughts or behavior, call your healthcare provider who prescribed the medication immediately. You can also dial 988 on your phone to reach the Suicide and Crisis Lifeline. Someone is available to help you 24/7.When to Call the DoctorWhen should I call my healthcare provider?You should have regular appointments with your healthcare provider when taking an antiseizure medication to assess how well it’s working.Otherwise, talk to your healthcare provider if:You develop bothersome side effects.Your symptoms aren’t improving or if they’ve gotten worse.You’re thinking of stopping the medication.In addition, you’ll need to get regular bloodwork to check the levels of the medication in your blood in addition to:Complete blood count.Comprehensive metabolic panel.Liver function tests.Additional Common QuestionsAre antiseizure medications safe during pregnancy?Medical guidelines recommend you remain on your current antiseizure medication during pregnancy, as the benefits of taking it outweigh the potential risks to the fetus. Stopping antiseizure medications can result in breakthrough seizures and status epilepticus, which can be harmful to you and the developing fetus.Research is lacking on which antiseizure medications are safest during pregnancy. Certain antiseizure medications (such as valproic acid) during pregnancy can result in an increased risk of major congenital malformations and certain cognitive issues. It’s important to discuss with your healthcare provider the best antiseizure medication for you prior to becoming pregnant.If you have any questions or concerns about taking an antiseizure medication during pregnancy, be sure to talk to your healthcare provider.A note from Cleveland ClinicAntiseizure medications are an important part of treatment for epilepsy and symptomatic seizures. It can take time to find the antiseizure medication that works best for you. Talk to your healthcare provider about any concerns or questions you have. They’re available to help.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/03/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicEpilepsy and Seizures TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"