"Antibiotics: What To Know800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/AntibioticsAdvertisementAdvertisementAdvertisementAntibioticsAntibiotics are powerful, lifesaving medications that treat bacterial infections like strep throat and urinary tract infections. But they’re not for every sickness, and they can cause side effects like diarrhea. Learning when you need antibiotics and how to take them properly can help you benefit from these medications with the least risk.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat are antibiotics?Antibiotics are medications that fight bacterial infections. They don’t work against viral infections like cold or flu.Bacteria are microscopic germs that live inside your body, on your skin and all around you. Most types of bacteria won’t hurt you. Some types (like some in your gut or on your skin) help keep you healthy. But certain bacteria can make you sick, with the effects ranging from a mild infection to a severe one that lands you in the hospital.That’s why antibiotics are so important. They can help you feel better and are often lifesaving. But when it comes to antibiotics, it’s possible to have too much of a good thing. Using antibiotics when they’re not needed — like for viral infections or mild bacterial infections that would go away on their own — can lead to unnecessary side effects and contribute to the global problem of antibiotic resistance.Most people need antibiotics at some point during their lives, and probably many times. You can reap the benefits of antibiotics by following your healthcare provider’s instructions on when you need them and how to use them. You can also learn how these medications work and what they treat. This knowledge can empower you to understand what’s going on inside your body and how to play an active role in your treatment.How do antibiotics work?Antibiotics work by killing bacteria or stopping them from multiplying. For example, antibiotics can kill bacteria by destroying crucial parts they need to survive, like their cell walls or DNA. Antibiotics can stop the growth of bacteria by preventing them from making certain proteins they need to multiply.What does “antibiotic” mean?An antibiotic refers to any substance that stops bacteria from growing. The antibiotics you take may be entirely made from natural products. Or, they may include synthetic (made in a lab) substances. Scientists are constantly researching and developing new antibiotics to fight infections.Proper antibiotic useFor antibiotics to work as they should (and help you feel better), you need to use them properly. Here are some tips:Take your antibiotics exactly as your provider instructs. They’ll tell you the total course of your treatment (how many days you need to take the antibiotics). They’ll also tell you how many times per day you need to take them, and whether or not you should take them with food. Ask if anything is unclear.Don’t save any of your antibiotics for a later time. This isn’t safe and won’t help you in the future. You should only use antibiotics to treat the specific infection you received them for.Don’t take medicine a provider prescribed for someone else. Prescriptions are like custom-made outfits. They’re tailored to you and your needs, including the type of infection you have and other factors like your health history and allergies.Safely throw away unused medicine. Usually, you’ll receive the exact amount of medicine you need. But if you have any medicine left over, ask a pharmacist what to do with it.What conditions do antibiotics treat?Antibiotics treat a wide range of conditions that affect many different parts of your body, from your innermost organs to the outer surface of your skin. Below are some examples.Skin and soft tissue infectionsCellulitis.Gas gangrene.Impetigo.Infections from animal or human bites.Necrotizing fasciitis.Staph infection.Infections in your throat and respiratory systemBacterial pneumonia.Strep throat.Whooping cough.Infections in your urinary system and reproductive systemBacterial vaginosis (BV).Some sexually transmitted infections (STIs).Urinary tract infection (UTI).Eye infectionsPink eye.Orbital cellulitis.Other conditionsAnthrax.Endocarditis.Lyme disease.Sepsis due to a bacterial infection.When should you not use antibiotics?You shouldn’t take antibiotics for viral infections. Antibiotics target bacteria, not viruses. So, they won’t work against conditions like:The flu.A common cold or runny nose.Most instances of bronchitis.A sore throat (unless it’s strep throat).A sinus infection caused by a virus.You likely don’t need antibiotics for some bacterial infections that typically go away on their own. These include:Some sinus infections caused by bacteria.Some ear infections.Your healthcare provider will tell you if you need antibiotics for these common infections.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat forms do antibiotics come in?Antibiotics come in several different forms, including:Oral antibiotics. These are medicines you take by mouth. They may be tablets or capsules that you swallow, or liquids that you drink.Topical antibiotics. These are medicines you apply on the outside of your body. For example, you may rub a cream or antibiotic ointment onto your skin. Or, you may put antibiotic drops into your eyes or ears to treat certain infections.Injections and intravenous (IV) antibiotics. A healthcare provider gives you these medicines through an injection into your muscle or an IV in your vein. Providers typically use these forms for more serious infections.What are the different types of antibiotics?Antibiotics are powerful because they aren’t just a single type of medicine. Antibiotics are a large collection of medicines, and no two are exactly alike.Imagine a walk-in closet that has hundreds of outfits in all different styles. One day you need a suit because you’re giving a presentation. The next day you must spend eight hours doing yard work. So, you choose a long-sleeved shirt to protect your arms from thorns and sunlight and some old, soft jeans you can kneel down in. But you’d never dream of wearing your suit to dig up weeds.It’s similar with antibiotics. Your provider chooses what you need in each specific situation. A medicine that worked for one infection might not be appropriate for another one down the road. Your provider knows the chemical structure of each medicine and how it’ll work in your body, just as you know your wardrobe and which pieces meet a given day’s demands.Just like you think of your clothes in terms of groups (like formal wear and casual wear), healthcare providers classify antibiotics into groups, or classes. Within each class, there are specific medicines, and those are the names you see on your prescription label.The chart below lists some of the antibiotic classes used in the U.S. along with examples of the individual medicines your provider might prescribe. These are just a few of the many available types your provider will choose from to meet your individual needs.List of antibioticsAntibiotic classMedicines your provider may prescribePenicillinsPenicillin; Amoxicillin; Ampicillin.CephalosporinsCephalexin; Cefazolin; Cefdinir; Cefaclor; Cefepime; Ceftaroline.MacrolidesAzithromycin; Erythromycin; Clarithromycin.TetracyclinesTetracycline; Doxycycline; Minocycline.Beta-lactams with increased activityAmoxicillin/clavulanate; Ceftazidime/avibactam.QuinolonesCiprofloxacin; Levofloxacin.AminoglycosidesStreptomycin; Gentamicin; Tobramycin.LincosamidesClindamycin.NitroimidazolesMetronidazole; Tinidazole.Antibiotic classAntibiotic classPenicillinsMedicines your provider may prescribePenicillin; Amoxicillin; Ampicillin.CephalosporinsMedicines your provider may prescribeCephalexin; Cefazolin; Cefdinir; Cefaclor; Cefepime; Ceftaroline.MacrolidesMedicines your provider may prescribeAzithromycin; Erythromycin; Clarithromycin.TetracyclinesMedicines your provider may prescribeTetracycline; Doxycycline; Minocycline.Beta-lactams with increased activityMedicines your provider may prescribeAmoxicillin/clavulanate; Ceftazidime/avibactam.QuinolonesMedicines your provider may prescribeCiprofloxacin; Levofloxacin.AminoglycosidesMedicines your provider may prescribeStreptomycin; Gentamicin; Tobramycin.LincosamidesMedicines your provider may prescribeClindamycin.NitroimidazolesMedicines your provider may prescribeMetronidazole; Tinidazole.What are prophylactic antibiotics?Prophylactic antibiotics are medications your provider gives you to prevent bacterial infection. Your provider may decide you need prophylactic antibiotics (also called antibiotic prophylaxis) if you:Are having certain surgeries or procedures, including some dental procedures.Have a health condition that raises your risk of infection.Have a wound or bite that could become infected.What are broad-spectrum antibiotics?Broad-spectrum antibiotics are medicines that can target lots of different types of bacteria. Examples include quinolones and tetracyclines. These medicines can be useful in certain situations, like when it’s not clear which type of bacteria is making you sick.But using them when they’re not needed can fuel the creation of antibiotic-resistant bacteria. Such bacteria don’t respond as expected to antibiotics and are much harder to treat. They’re like a stubborn stain in your carpet that won’t go away no matter how many different stain removers you use on it.So, experts advise using broad-spectrum antibiotics only when necessary. If you need one, your provider will tell you why you need it and how it’ll help you.How long does it take for antibiotics to work?It depends on the type of antibiotic you’re using and what it’s treating. No matter the situation, you need to take a full course of antibiotics exactly as your provider prescribes it. You may start to feel better in just a few days, but you should still take the rest of the medicine. It’s common for your symptoms to ease up before the infection is totally gone from your body.How long do antibiotics stay in your system?Antibiotics typically stay in your system anywhere from a few hours to several days after you stop taking them. Many factors (including the type of antibiotic you’re taking, its dosage and your age) can affect the amount of time the drug stays in your system. Talk to your provider to learn more about the specific medication you’re taking and how long it’ll stay in your body.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentRisks / BenefitsWhat are the benefits of antibiotics?Antibiotics have many benefits. They can:Successfully clear bacterial infections from your body.Ease your symptoms and help you feel better.Speed up your recovery.Stop you from spreading an infection to others.Protect you from serious illness or complications.Save your life.AdvertisementWhat are the possible side effects of antibiotics?Common (and usually mild) side effects of taking antibiotics include:Diarrhea.Nausea and vomiting.Dizziness.Rash.Yeast infections.Serious side effects, which are less common, include:C. diff infection.Allergic reactions, some of which may be severe or life-threatening (anaphylaxis).Be sure to read the instructions and warnings that come with your antibiotics. Learn all possible side effects and the signs of an allergic reaction. Contact your healthcare provider if you have side effects or any questions or concerns.Do antibiotics cause diarrhea?Diarrhea is a common side effect of antibiotics. It’s often a temporary nuisance rather than a serious concern. However, it can also be a symptom of a C. diff infection, which is a more serious side effect of antibiotics.If you have diarrhea while taking antibiotics or soon after finishing them, tell your healthcare provider. This is especially important if the diarrhea doesn’t improve after a few days or gets worse. Your provider will talk to you about your symptoms and may run tests to see if you have a C. diff infection.Can you be allergic to an antibiotic?Yes. Allergic reactions to antibiotics aren’t common, but they can happen and range from mild to severe. On the mild end, you might have an itchy rash (hives).More severe reactions may lead to:Blistering of your skin.Swelling of your face, lips, tongue or throat.Breathing problems, including wheezing.Call 911 or your local emergency number if you have symptoms of a severe allergic reaction. Quick treatment can be lifesaving.Do antibiotics make you tired?Feeling tired or fatigued isn’t a typical side effect of antibiotics. Fatigue may affect up to 1 in 20 people who take a specific antibiotic called vancomycin. But in most cases, you feel tired because you’re sick and your body is trying to recover. Getting plenty of rest and staying hydrated can help you regain your energy and feel better.If you have concerns about your energy level or still feel very tired after finishing your medicine, talk to your healthcare provider.What are the possible risks of antibiotic use?The major risks of antibiotic use include drug interactions and antibiotic resistance.Drug interactionsSome antibiotics can interact with other medications. This means taking antibiotics with certain other drugs at the same time may cause adverse effects, or unexpected resultsInteractions can occur with many different medications, including some that treat cardiovascular disease and manage common problems like indigestion and pain. Just a few examples of drugs that can interact with some types of antibiotics include:Warfarin.Beta-blockers.Antacids.NSAIDs.Most antibiotics don’t affect birth control (hormonal contraception). Exceptions are some antibiotics used to treat tuberculosis and meningitis.Always tell your provider which medications you’re taking (prescription and over-the-counter) before they prescribe you antibiotics. You should also tell them about any herbal or vitamin supplements you’re using. Your provider needs this information to prescribe an antibiotic that’s safe for you.Antibiotic resistanceAntibiotic resistance is a global public health problem. It happens when bacteria adapt so that they no longer respond to antibiotics that could previously get rid of them.AdvertisementRecovery and OutlookHow long will it take for me to feel better?It depends on the type of infection you have and your treatment plan. For many common infections like urinary tract infections and strep throat, you should start to feel better within a few days of starting antibiotics. Your provider can tell you what to expect in your situation.Can you take probiotics with antibiotics?Yes, you can take probiotics while you’re on antibiotics. In fact, healthcare providers encourage it in some cases. Probiotics can help restore a healthy balance of bacteria in your gut and prevent diarrhea.However, it’s a good idea to talk to your provider before taking probiotics to make sure they’re safe for you (for example, they may not be safe for people with compromised immune systems).When to Call the DoctorWhen should I call my healthcare provider?Call your provider if you have side effects from antibiotics (like diarrhea) or signs of a mild allergic reaction (like a mild rash).Call 911 or your local emergency number if you have signs of a severe allergic reaction (anaphylaxis). This often starts with sudden and severe itchiness in your eyes or face. Within a few minutes, you may have other symptoms like swelling in your face and throat. You may find it difficult to swallow or breathe. Don’t delay seeking care. Without quick treatment, anaphylaxis can be life-threatening.Additional Common QuestionsDo I need antibiotics for a sinus infection?Many people don’t need antibiotics for a sinus infection, but it depends on your individual situation. Viruses cause most sinus infections, and so antibiotics won’t help. If your symptoms don’t improve after 10 days, you may have a bacterial sinus infection. In that case, your provider may prescribe antibiotics.Do I need antibiotics for strep throat?Yes, you need antibiotics to treat strep throat. This type of common bacterial infection can lead to serious complications (like rheumatic fever) without proper treatment.Do I need antibiotics for UTI?Yes, you’ll most likely need antibiotics to clear a urinary tract infection (UTI). Rarely, a minor UTI may go away on its own. But it’s always safest to check with a healthcare provider. Don’t try to diagnose an infection as “minor” on your own.If you have symptoms of a UTI, including pain when you pee, call a healthcare provider right away. They may order tests, like a urinalysis and urine culture, to look for signs of an infection and see what type of bacteria is causing it.Antibiotics your provider may prescribe include nitrofurantoin or sulfamethoxazole/trimethoprim.Can I get over-the-counter antibiotics?In the U.S., you need a prescription from a healthcare provider to legally get oral antibiotics. This is for your safety and protection. A prescription makes sure you receive the correct medication for your infection and one that’s safe for you based on your medical history.You can get some forms of topical antibiotics (like those that treat minor skin cuts) over the counter.Can you drink alcohol while taking antibiotics?To be on the safe side, you may want to avoid beverages containing alcohol while you’re taking antibiotics. Some antibiotics probably won’t interact with alcohol, while others might.These antibiotics may cause adverse reactions, some of which may be severe, and liver problems:Cefamandole.Cefmetazole.Cefoperazone.Cefotetan.Ceftriaxone (injection).Erythromycin.Griseofulvin.Isoniazid.Ketoconazole.Pyrazinamide.It’s always best to ask your healthcare provider what you should avoid while taking a specific antibiotic. You should also read the package insert closely and ask your provider if anything’s unclear. Some specific questions you may want to ask your provider regarding alcohol and antibiotics include:Will drinking alcohol make this antibiotic less effective for me?Are there side effects I might experience from drinking alcohol while taking this antibiotic?Should I be concerned about damage to my liver?When will it be safe for me to drink alcohol after finishing this medication?Can you take antibiotics while pregnant?Some antibiotics are safe to take during pregnancy. But others — like tetracyclines — aren’t safe while pregnant or breastfeeding (chestfeeding). Tell your healthcare provider if you’re pregnant or could be pregnant before taking any antibiotics or other medications.Is amoxicillin an antibiotic?Yes, amoxicillin is an antibiotic. It’s part of the penicillin class of antibiotics. Providers may prescribe amoxicillin to treat bronchitis, an ear infection or a sinus infection in certain situations.How common are antibiotics?Antibiotics are an extremely common and life-saving form of medication. In 2021, healthcare providers in the U.S. wrote out over 211 million prescriptions for oral antibiotics to outpatients (people not staying in a hospital). This translates to about 636 in 1,000 people receiving a prescription.Antibiotics are even more common in hospital settings. Researchers estimate that healthcare providers prescribe antibiotics to about 1 in 3 people staying in a hospital.Penicillins are by far the most commonly prescribed class of antibiotics, followed by cephalosporins and macrolides.A note from Cleveland ClinicWhen your head is clogged and you can’t stop blowing your nose, it can be upsetting to hear you can’t have antibiotics. You may remember taking them a few years back for strep throat and feeling like a new person after just a couple of days. Why can’t that happen now for this miserable cold?We all want to feel better instantly when sickness strikes. But viruses, not bacteria, are the culprits in many common infections, like colds and flu. No matter how awful your symptoms are, taking antibiotics for a cold simply won’t work. It’s like putting a bandage on sunburn or rubbing aloe onto a paper cut. The fix doesn’t match the problem. It won’t help, and it might even make things worse.Talk to your healthcare provider any time you have questions or concerns about treatments, including antibiotics. They can help explain why you need or don’t need certain medicines and how best to care for yourself at home.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/24/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementQuestions 216.444.2538Appointments & LocationsRequest an AppointmentFind a Primary Care ProviderFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"