"Antidepressants: What They Are, Uses, Side Effects & Types800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/AntidepressantsAdvertisementAdvertisementAdvertisementAntidepressantsAntidepressants are common prescription medications that can help treat depression and other conditions like anxiety and obsessive-compulsive disorder. There are several types of antidepressants. You and your healthcare provider will work together to find the best one for you.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat are antidepressants?Antidepressants are prescription medications that help treat depression. Healthcare providers prescribe them to treat other conditions as well.Depression is a mood disorder that causes a persistent feeling of sadness and a loss of interest in things and activities you once enjoyed. It can also cause difficulty with thinking, memory, motivation, eating and sleeping.There are several types of depressive disorders, some of which include:Clinical depression (major depressive disorder).Bipolar depression.Persistent depressive disorder (PDD).Premenstrual dysphoric disorder (PMDD).Atypical depression.Seasonal depression (seasonal affective disorder).Antidepressants are one type of treatment for depression. While they can treat the symptoms of depression, they don’t always address its causes. This is why healthcare providers often recommend psychotherapy (talk therapy) in addition to depression medication.Antidepressants were invented in the 1950s. Since then, researchers have developed several different types of the medication. Today, antidepressants are one of the most frequently prescribed medications in the United States.What conditions do antidepressants help treat?The U.S. Food and Drug Administration (FDA) has approved the use of antidepressants for the following conditions:Clinical depression and other depressive disorders (most common use of antidepressants).Bipolar depression.Bulimia.Generalized anxiety disorder (GAD).Obsessive-compulsive disorder (OCD).Panic disorder.Post-traumatic stress disorder (PTSD).Social anxiety disorder (social phobia).Healthcare providers sometimes prescribe antidepressants for other conditions. This is considered an off-label, or non-FDA-approved, use of the medication. For example, providers sometimes prescribe tricyclic antidepressants for chronic pain, insomnia and migraine.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the types of antidepressants?There are several types (classes) of antidepressants, including:Selective serotonin reuptake inhibitors (SSRIs). These are the most common type of prescribed antidepressants.Serotonin/norepinephrine reuptake inhibitors (SNRIs).Tricyclic antidepressants (TCAs). TCAs are an older class of antidepressants often reserved for treatment-resistant depression and anxiety due to increased rates of side effects.Atypical antidepressants.Serotonin modulators.Monoamine oxidase inhibitors (MAOIs). These are the oldest antidepressants. Though highly effective, they’re often reserved for treatment-resistant depression and anxiety. This is because taking an MAIO requires dietary modifications to avoid hypertensive reactions caused by interactions with the amino acid tyramine, which is present in high levels in some foods.N-methyl-D-aspartate (NMDA) antagonists.There are also several kinds of medications (and brands) within each class.How commonly are antidepressants used?Antidepressants are a very commonly used prescription medication. More than 1 in 10 people in the United States take them. The use of antidepressants is increasing across the world.What is the most common type of antidepressant?SSRIs are the most commonly prescribed type of antidepressant. Fluoxetine (Prozac®) is probably the most well-known SSRI.AdvertisementProcedure DetailsHow do antidepressants work?In general, antidepressants change the way your brain uses certain chemicals (called neurotransmitters) to better regulate your mood and behavior. More specifically, they affect neurotransmission involving serotonin, norepinephrine and, less commonly, dopamine. The different types of antidepressants all work differently to do this.Studies also show that antidepressants induce neuroplasticity, a process by which your brain can alter its structure through strengthening or weakening connections between brain cells called neurons.How do you take antidepressants?Antidepressants typically come in pill (tablet) form. You swallow the pills with a liquid, like water. When you first start taking an antidepressant, your healthcare provider will likely prescribe the lowest possible dose of the medication that they think is necessary to improve your symptoms. Over time, they’ll adjust the dose if necessary.It can take multiple weeks before you start to experience an improvement in your symptoms.Treatment usually lasts at least six months after you start to feel better. If you have recurrent, chronic or severe depression, your provider may recommend taking the antidepressant for the foreseeable future.Care at Cleveland ClinicDepression TreatmentFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsHow effective are antidepressants?Antidepressants are the most effective medication for treating depression symptoms. But just like with many other medications, antidepressants may help some people more than others.Studies show that the benefit of the antidepressant generally depends on the severity of the depression — the more severe the depression, the greater the benefit or “effectiveness” will be. Antidepressants are usually effective in moderate, severe and chronic depression. They don’t tend to help mild depression.It’s important to remember that psychotherapy is another important part of depression treatment. Combining psychotherapy and depression medication will usually produce the largest improvement in your symptoms.What are the side effects of antidepressants?Each type (class) of antidepressant and each brand has different possible side effects. It’s important to talk to your provider or a pharmacist about possible side effects of the specific medication you’re taking or thinking of taking.In general, common side effects of antidepressants include:Upset stomach.Diarrhea.Headache.Drowsiness.Sexual dysfunction.Side effects of antidepressants are usually mild and improve with time. Talk to your provider if you experience unpleasant side effects. They may recommend adjusting your dose or trying a different medication.Do antidepressants cause weight gain?Weight gain is a possible side effect of some antidepressants, though some are associated with no weight gain or even weight loss. It’s important to remember that several factors can contribute to weight gain. For example:Some people lose weight due to loss of appetite caused by untreated depression. Taking antidepressants to treat depression can improve your mood and appetite, which could lead to weight gain due to your appetite being restored.Adults tend to gain weight as they age in general.If you’re concerned about this possible side effect, talk to your provider. Know that the benefits of taking an antidepressant may outweigh possible weight gain. There are also steps you can take to manage your weight, such as exercise or adjusting your eating patterns.What are the possible complications of taking antidepressants?Possible complications associated with antidepressants include:Risk of suicidal thoughts or behavior.Antidepressant discontinuation syndrome.Serotonin syndrome.Overdose.SSRI medications are also associated with a modest increase in the risk of upper gastrointestinal bleeding. This risk is significantly elevated when you take an SSRI in combination with nonsteroidal anti-inflammatory drugs (NSAIDs). Talk to your healthcare provider about this risk.Suicidal thoughts or behaviorIn some cases, children, teens and adults under the age of 25 may experience an increase in suicidal thoughts or behavior when taking antidepressants, especially when they first start them or when they take a different dose.If you or your child have suicidal thoughts or behavior, call the healthcare provider who prescribed the medication immediately. You can also dial 988 on your phone to reach the Suicide and Crisis Lifeline. Someone is available to help you 24/7.Antidepressant discontinuation syndromeAntidepressant discontinuation syndrome can happen if you suddenly stop taking your antidepressant if you’ve taken it for at least six weeks. It happens in about 20% of these cases.Symptoms of antidepressant discontinuation syndrome include:Flu-like symptoms, such as fatigue, headache, achiness and sweating.Insomnia.Nausea.Dizziness and lightheadedness.Sensory issues, such as burning, tingling or shock-like sensations.Anxiety, irritability and agitation.These symptoms are usually mild, but they can be unpleasant. They typically last one to two weeks.Never stop taking your antidepressant without talking to your healthcare provider first. Safely stopping antidepressants is a process. It usually takes at least four weeks to taper off by slowly reducing your dose.Serotonin syndromeSerotonin syndrome is an extremely rare but potentially life-threatening drug reaction that results from having too much serotonin in your body.Serotonin syndrome can happen when you either take a new antidepressant or take an increased dose. If your body processes serotonin differently or it can’t process an increased amount of serotonin, serotonin syndrome can happen.The syndrome most often happens when you take an antidepressant and other serotonergic drugs such as triptan migraine drugs or certain opioids such as meperidine.Symptoms of serotonin syndrome include:Nervousness.Nausea and vomiting.Diarrhea.Dilated pupils.Muscle issues, like twitching, involuntary contractions, spasms and rigidity.Sweating and shivering.Side-to-side eye movements.Severe symptoms include:Confusion or delirium.Rapid heart rate (tachycardia).High blood pressure.Fever.Seizures.Loss of consciousness.Symptoms usually begin within a few hours of taking a new medication or increasing the dose of a drug you’re already taking.Get immediate medical help if you’re experiencing these symptoms. Serotonin syndrome can be fatal if it’s not treated in time.OverdoseThe toxicity of antidepressants varies greatly. It’s important to talk to your healthcare provider or pharmacist about the risk of overdose. Always take your medication as prescribed and store your medications safely away from children and pets.Tricyclic antidepressants are the class of antidepressants with the highest risk of fatality if they are taken in overdose. If you ever suspect an overdose — in yourself or a loved one — get medical help right away.Signs and symptoms of an overdose of tricyclic antidepressants include:Heart rhythm issues.Low blood pressure.Drowsiness.Rigid muscles.Mental confusion.Coma.Other classes of antidepressants can lead to overdose as well, but the symptoms may be different. For example, SSRI overdoses can cause high blood pressure and certain types of arrhythmias.Recovery and OutlookHow long does it take for antidepressants to work?It can take four to eight weeks for antidepressants to work and for your symptoms to ease. Symptoms such as sleep issues, appetite, energy or concentration may improve before your mood improves.It’s important to follow your healthcare provider’s directions and take the prescribed medication for the recommended amount of time before deciding whether it works. Don’t stop taking the medication without talking to your provider first.When to Call the DoctorWhen should I call my healthcare provider?You should have regular appointments with your healthcare provider when taking an antidepressant to assess how well it’s working.Otherwise, talk to your healthcare provider in the following situations:If you develop bothersome side effects.If your symptoms aren’t improving or if they’ve gotten worse.If you’re thinking of stopping the medication.When should I seek emergency care?If you have symptoms of serotonin syndrome or overdose or are having suicidal thoughts, call 911 or go to the nearest emergency room.Additional Common QuestionsHow do I know which depression medicine is right for me?Due to the wide variety of depression medicine options, it may be overwhelming to know where to start or which one to choose. You’ll work closely with your healthcare provider to determine which one is most likely to work best for you based on certain factors, such as:Your particular symptoms.Possible side effects of the medications.Interactions with other medications you take.Other physical or mental health conditions you have.Cost and health insurance coverage.It can take time to find the best antidepressant for you. Try to be patient. Let your provider know if you have bothersome side effects or no significant improvement in your symptoms after several weeks of starting the medication. They may recommend changing the dose, trying a different antidepressant or taking more than one antidepressant at a time.Can I take antidepressants while pregnant?There are certain risks and benefits associated with taking depression medications while pregnant. Because of this, you should have a conversation with your healthcare provider. They make recommendations on a case-by-case basis because each person and situation is unique.The main risk for the fetus due to antidepressant exposure is the possibility of birth defects (congenital conditions). This risk is generally very low, but certain antidepressants are more likely to cause issues than others.However, untreated major depression during pregnancy can lead to an increased risk of:Decreased fetal growth.Premature birth.Low birth weight (less than 5.5 pounds).Untreated depression during pregnancy can also be harmful to the pregnant person and increases their risk of postpartum depression.Who can prescribe antidepressants?Primary care physicians (PCPs) and psychiatrists commonly prescribe antidepressants.A PCP is a healthcare provider who helps you manage your health. They’re the first person you talk to when you have a health issue or medical problem that’s not an emergency. As depression is a common condition — and antidepressants are a common medication — primary care providers have expertise in prescribing these medications.A psychiatrist is a medical doctor who’s an expert in diagnosing and treating mental, emotional and behavioral disorders. They have specific expertise in medications for mental health conditions, including antidepressants. If you have treatment-resistant depression and/or other mental health conditions, you may benefit from seeing a psychiatrist instead of a PCP for prescribing medications.Can I drink alcohol with antidepressants?Healthcare providers generally don’t recommend drinking alcohol while taking antidepressants. This is because alcohol (a depressant substance) can make depression symptoms worse. In addition, both alcohol and antidepressants can make you drowsy and less alert. These effects can increase when you take them together.Some healthcare providers allow moderate alcohol consumption at most.Are antidepressants addictive?Antidepressant medicines don’t have addiction potential. They don't produce feelings of euphoria, have a tranquilizing effect or produce a craving for more.A note from Cleveland ClinicAntidepressants are a very common prescription medication that can help treat depression and other conditions. It can take time to find the antidepressant that works best for you. Talk to your healthcare provider about any concerns or questions you have. They’re available to help.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/01/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicDepression TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"