"Antihyperlipidemics: How They Help Cholesterol800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/AntihyperlipidemicAdvertisementAdvertisementAdvertisementAntihyperlipidemicAntihyperlipidemic medicines can help people bring their cholesterol levels into a normal range. You may need cholesterol-lowering drugs if changing your eating and exercise habits didn’t improve your cholesterol numbers. Improving your cholesterol levels can lower your risk of heart attack and stroke.ContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat are antihyperlipidemic drugs?Antihyperlipidemic drugs are medicines that help you lower your cholesterol levels. Many people have high cholesterol because of:Cholesterol and saturated fat in foods that come from animals (like meat and dairy products) and fried foods (including palm oil products).A lack of exercise.A genetic issue that causes high cholesterol levels.Everyone needs some cholesterol in their bodies, but your liver produces the cholesterol you need. The rest is extra, and that excess can lead to atherosclerosis and slow down blood flow in your blood vessels.What are antihyperlipidemic drugs used for?Antihyperlipidemic drugs help you improve your cholesterol levels. Your healthcare provider will discuss your personal risk factors and cholesterol goal. If diet and exercise aren’t enough to reach that goal, they might prescribe medicines. Your provider might discuss using different medications with you to lower your cholesterol, as well, depending on your personal risk factors.What drugs are antihyperlipidemic?Types of cholesterol-lowering drugs include:Statins (Lipitor®, Crestor®, Zocor® and others).PCSK9 inhibitors (Praluent®, Repatha® and Leqvio®).Fibric acid derivatives or fibrates (Tricor®, Lopid®, Antara® and others).Bile acid sequestrants or bile acid resins (Colestid®, Questran®, Locholest® and others).Nicotinic acid or niacin (Niacor® and Niaspan®).Selective cholesterol absorption inhibitors (Zetia® and Nexlizet®).Omega-3 fatty acids and fatty acid esters (Epanova®, Lovaza® and others).Adenosine triphosphate-citrate lyase (ACL) inhibitors (Nexletol® and Nexlizet).Your healthcare provider will discuss these options with you and together, you can decide which type of high-cholesterol medication, if any, would be best for you.StatinsStatins are one of the better-known types of cholesterol-lowering drugs. Providers choose these for most people because they work well and are considered first-line treatment for most people with elevated cholesterol. Statins decrease cholesterol by blocking the HMG CoA reductase enzyme that your liver uses to make cholesterol. Providers may also use the name HMG CoA reductase inhibitors when talking about statins.Statins also:Improve the function of the lining of your blood vessels.Reduce inflammation (swelling) and damage in your blood vessels.Reduce the risk of blood clots by stopping platelets from sticking together.Make plaques (fatty deposits) less likely to break away and cause damage.These extra benefits help prevent cardiovascular (heart and blood vessel) disease in people who’ve had events like heart attacks and in people who are at risk.PCSK9 inhibitorsPCSK9 inhibitors attach to a particular liver cell surface protein, which results in lowered LDL (“bad”) cholesterol. You can take this class of drug with statins. A provider can inject PCSK9 inhibitors for you. They’re usually for people at high risk of heart disease who haven’t been able to lower their cholesterol enough in other ways.Fibric acid derivatives (fibrates)Fibric acid derivatives are antihyperlipidemics that reduce blood lipid (fat) levels, especially triglycerides. Your body creates triglycerides (fats) from food when you consume calories but don’t burn them.Fibric acid derivatives may also increase the level of HDL, the “good” cholesterol, while lowering liver production of LDL, the “bad” cholesterol. People who have severe kidney disease or liver disease shouldn’t take fibrates.Bile acid sequestrants (bile acid resins)This class of cholesterol medication works inside your intestine by attaching to bile, a greenish fluid made of cholesterol your liver produces to digest food. The binding process means that less cholesterol is available in your body. Resins decrease LDL cholesterol and give a slight boost to HDL cholesterol levels.Selective cholesterol absorption inhibitors (ezetimibe)This class of antihyperlipidemic works in your intestine to stop your body from absorbing cholesterol. These inhibitors reduce LDL cholesterol, but may also reduce triglycerides and increase HDL, or “good,” cholesterol. You can combine them with statins.Nicotinic acidNicotinic acid, or niacin, is a B-complex vitamin. You can get over-the-counter (OTC) versions of this, but some versions are prescription-only. Niacin decreases LDL cholesterol and triglycerides and increases HDL. If you have gout or severe liver disease, you shouldn’t take niacin.Omega-3 fatty acid esters and polyunsaturated fatty acids (PUFAs)People often call these antihyperlipidemics fish oils. They use them to lower triglycerides. Some products are available over the counter, while others need a prescription (like ethyl eicosapentaenoic acid). Fish oils might interfere with other medications, and some people are allergic to fish and shellfish. Fish oils aren’t for everyone, so talk to a provider before taking them.Adenosine triphosphate-citric lyase (ACL) inhibitors (bempedoic acid)Bempedoic acid works in your liver to slow down cholesterol production. You should take it with statin medications, but you’ll need to limit your dosage if you take it with simvastatin or pravastatin.How common are antihyperlipidemic medications?Antihyperlipidemic medications are very common, especially statins. Tens of millions of people have taken statins since the first one went on the market in 1987.How do antihyperlipidemics reduce cholesterol?Different kinds of antihyperlipidemics work in various ways, like:Keeping your liver from accessing something it uses to make cholesterol.Stopping your body from absorbing cholesterol.Slowing down or reducing cholesterol production.Helping your liver break down cholesterol.Helping your body make more of the “good” cholesterol.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyRisks / BenefitsWhat are the advantages of an antihyperlipidemic?Antihyperlipidemic medicines can:Reduce your risk of heart attack and stroke.Decrease your LDL cholesterol.Decrease your VLDL cholesterol.Decrease your triglyceride level.Increase your HDL cholesterol.What are the side effects of an antihyperlipidemic?Like any other drugs, antihyperlipidemic medications may give you side effects. Let your provider know if they’re bothersome.Statin side effectsThese may include:Constipation.Nausea.Headaches.Cold-like symptoms.Sore muscles.Liver enzyme abnormalities.Increased blood glucose levels.Reversible memory issues.If you can’t take statins because of the side effects, you’re statin-intolerant. With certain statins, you should avoid grapefruit products because they can increase side effects. You should limit the amount of alcohol that you drink because combining alcohol and statin usage can increase your risk of liver damage. You may want to talk with your provider or pharmacist if you’re concerned about any other types of interactions.PCSK9 inhibitor side effectsPossible PCSK9 inhibitor side effects include:Pain, including muscle pain (myalgia) and back pain.Swelling at the drug injection site.Flu-like or cold-like symptoms.Cost may be another drawback as these products can be expensive. People often need special approval from their insurer.Fibric acid derivative side effectsPossible side effects of fibrates include:Constipation or diarrhea.Weight loss.Bloating, belching or vomiting.Stomachache, headache or backache.Muscle pain and weakness.Bile acid resin side effectsPossible side effects of bile acid sequestrants include:Sore throat.Stuffy nose.Constipation or diarrhea.Weight loss.Belching.Bloating.Nausea and vomiting.Stomach pain.If your high cholesterol medication is a powder, never take it dry. Always mix it with at least 3 to 4 ounces (oz) of liquid like water, juice or a noncarbonated beverage.If you take other medications besides these, make sure you take the other drugs one hour before or four hours after taking the bile acid resin.Cholesterol absorption inhibitor side effectsPossible side effects of cholesterol absorption inhibitors include:Diarrhea.Fatigue.Joint pain.Niacin side effectsThe main side effect of niacin is flushing of your face and upper body. Taking niacin with meals may make this better. You might have less flushing if you take aspirin about 30 minutes before taking niacin.Other side effects include:Skin issues, such as itching or tingling.Headache.Stomach upset.Increased blood sugar.Coughing.Omega-3 product side effectsPossible side effects of omega-3 products include:Belching.Skin issues like rash or itching.Gas.Fishy taste.Slower blood clotting after a cut.Bempedoic acid side effectsSome possible side effects of bempedoic acid include:Upper respiratory infection.Stomach, back or muscle pain.Increased levels of uric acid.Tendon injury.AdvertisementRecovery and OutlookHow can I take care of myself while taking an antihyperlipidemic?Antihyperlipidemics are more effective if you continue to eat heart-healthy foods. Your healthcare provider may refer you to a dietitian for help with this. Exercise also helps with cholesterol levels.Medicine can only help you reduce cholesterol if you take it correctly. Here are some tips:Follow your provider’s instructions for taking antihyperlipidemics. Ask questions if anything isn’t clear.Don’t decrease your medication dosage for any reason, including to save money. You need to take the full amount to get the full benefits. If your medicines are too expensive, ask your provider or pharmacist about finding financial assistance. Some companies provide discounts.Fill your prescriptions regularly and don’t wait until you’re out of them to get a refill.Have a routine for taking your medicines at the same time every day. You can use a weekly pillbox, calendar or smartphone app to help you keep track.If you forget to take a dose, take it as soon as you remember. However, if it’s almost time for your next dose, skip the missed dose and go back to your regular dosing schedule. Don’t take two doses to make up for the dose you missed.When traveling, keep your medicines with you so you can take them as scheduled. On longer trips, bring extra doses and copies of your prescriptions in case your travel plans change and you need more doses than you planned.Always discuss any new medication with your provider, including over-the-counter drugs and herbal or dietary supplements. They may need to adjust your antihyperlipidemic dose. Make sure you tell your dentist and other providers what medications you’re taking, especially before having surgery with a general anesthetic.When to Call the DoctorWhen should I see my healthcare provider?Contact your provider if you have side effects that don’t get better. They can talk with you about switching to another medicine.AdvertisementAdditional Common QuestionsWhat about using red yeast rice or plant stanols (phytosterols) instead of prescription drugs to lower cholesterol?Many people say they prefer to take “natural” medicines over prescription drugs. However, just because something is natural doesn’t mean that it’s safe. The United States doesn’t regulate supplements as closely as medicines. Supplements can also interfere in dangerous ways with medications that you already take.But red yeast rice extract does contain the same chemical that’s in certain prescription statins like lovastatin. In some cases, you and your healthcare provider might agree that you should try the supplement with monitoring.Plant stanols are another nonprescription choice for lowering cholesterol. Plant stanols stop your body from absorbing cholesterol in your intestines. You can buy capsules or get plant stanols in some margarine substitutes.A note from Cleveland ClinicIt’s frustrating to keep seeing high cholesterol levels when you’ve changed your exercise and eating habits. You’re not alone. Many people need medications to improve their cholesterol numbers. There are several options, but many of them will work better if you exercise and eat nutritious foods. Remember to discuss any new medication with your provider. This includes over-the-counter products like herbs or dietary supplements. Let them know if you have problems getting to the pharmacy to pick up your medicines or paying for your medicines.Care at Cleveland ClinicCardiology CareMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/22/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicCardiology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"