"Aortic Valve Surgery: Procedure Details & Benefits800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Aortic Valve SurgeryAdvertisementAdvertisementAdvertisementAortic Valve SurgeryAortic valve surgery is a life-saving treatment for aortic valve disease. A surgeon repairs or replaces the valve that connects your heart to your aorta. This improves heart function in people who have a narrowed or leaky aortic valve. Surgical approaches include open-heart surgery and minimally invasive surgery (smaller incisions).ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewAortic valve surgery repairs or replaces your aortic valve to improve blood flow through your heart. Treating aortic valve disease allows your heart to pump blood out to your body more efficiently.What is aortic valve surgery?Aortic valve surgery is a treatment for aortic valve disease. It involves repairing or replacing your aortic valve. This “door” manages blood flow from your heart’s main pumping chamber (left ventricle) into your main artery (aorta).Aortic valve disease prevents your aortic valve from working as it should. Your valve opening may be too narrow, which limits how much blood can flow through. Or, your valve may be leaky, which means some blood flows backward each time your valve closes. Some people are born with congenital heart defects that may affect valve function.Aortic valve surgery can address these issues and lower your risk of complications of valve disease. These include heart failure and cardiac arrest.What does aortic valve surgery treat?Cardiac surgeons perform aortic valve surgery to treat:Aortic valve regurgitation (leaky valve).Aortic valve stenosis (narrowed valve opening).Nonsurgical treatments like medications may help manage your aortic valve disease for a long time. However, you may need surgery if you have symptoms, evidence of heart damage or heart failure.Types of aortic valve surgeryThere are two main types of aortic valve surgery:Aortic valve repair. Your surgeon fixes damaged parts of your valve while keeping as much of the natural tissue as possible.Surgical aortic valve replacement (SAVR). Your surgeon removes your damaged valve and puts a new one in its place. SAVR is an option for some people who aren’t candidates for transcatheter aortic valve replacement (TAVR/TAVI).Many factors determine the type of surgery you need, including:The results of your diagnostic tests.Your age.The structure of your heart.The presence of other medical conditions.Your surgeon will talk to you about your options and explain the most appropriate treatment plan for you.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before aortic valve surgery?Your provider may order preoperative (“pre-op”) tests before your surgery. Possible tests include:Cardiac catheterization (heart cath).Chest X-ray.Computed tomography (CT) scan.Echocardiogram (echo).Electrocardiogram (EKG).Lab tests, including blood tests and urine tests.Your provider will give you instructions that you should follow closely. These instructions will tell you:When you should begin fasting (no foods or drinks). Usually, this is after midnight the night before your surgery.Whether you should make any changes to your medication schedule.When to arrive at the hospital.Ask your provider if anything is unclear. It’s important to understand exactly what you need to do before your surgery.What happens during aortic valve surgery?To perform aortic valve surgery, your surgeon and care team will:Give you anesthesia so you’ll be asleep and pain-free during the surgery.Make one or more cuts in your skin (incisions) to access your heart.Connect you to a heart-lung machine.Repair or replace your aortic valve.Disconnect you from the heart and lung machine.Close your incision(s).Move you to recovery.The exact details of your surgery depend on the surgical approach.Approaches to aortic valve surgeryApproaches to aortic valve repair or replacement surgery include:Traditional open-heart surgery. Your surgeon makes a 6- to 8-inch incision down the center of your chest to access your heart.Minimally invasive heart surgery. Your surgeon uses smaller, 2- to 4-inch incisions without opening your whole chest. This typically involves a “J” incision. This approach reduces blood loss, trauma and length of hospital stay. You may also have a faster recovery.The most appropriate method for you depends on many factors, including:The nature of your valve disease (for example, how complex it is).Other heart problems that require treatment.Your overall health.Your surgeon will talk to you about the approach that’s best for you, and why.AdvertisementWhat happens after aortic valve surgery?Here’s what you can expect after your surgery:You’ll recover in the intensive care unit (ICU) and then a regular hospital room. The total hospital stay after heart valve surgery is typically five to seven days.Your care team will monitor your vital signs and encourage you to start moving around a little more each day.Your provider may recommend cardiac rehab to help you continue your recovery and regain your strength.Care at Cleveland ClinicAortic Valve Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of aortic valve surgery?Aortic valve surgery is life-saving. It fixes problems with your heart valve that, over time, could be fatal without treatment. Aortic valve disease is the deadliest form of valve disease. It accounts for over 60% of all deaths from any type of valve disease.Therefore, surgery to repair or replace your aortic valve can help you live longer. It can also relieve symptoms so you feel better day-to-day and have an improved quality of life.AdvertisementWhat are the risks of this procedure?Like all surgeries, aortic valve surgery has some risks. Possible complications include:Abnormal heart rhythm (arrhythmia).Allergic reaction to anesthesia.Bleeding.Heart attack.Heart failure.Infection.Stroke.Risks are higher for some people compared to others. Factors that influence your risk for complications include:Your age.Your medical conditions.The method of surgery (open vs. minimally invasive).Talk to your provider about your individual level of risk and how to lower it.Recovery and OutlookWhat can I expect for recovery?Recovery from heart valve surgery generally takes four to eight weeks. It may be shorter if you have minimally invasive surgery.You can expect to feel tired for a few weeks after your surgery. That’s normal, and it’s important not to push yourself. However, it’s also important to follow your provider’s guidance for exercise, including cardiac rehab. A gradual, safe return to movement will support your recovery and long-term health.Your provider will tell you when it’s safe to:Drive.Return to work.Lift heavy objects.Remember that each person’s recovery is unique. Try not to compare your recovery or how you’re feeling to others who’ve had heart surgery. If you need more time to feel normal again, that’s OK. Give your body the time it needs to rest and heal.Some people experience depression after heart surgery. This is common and treatable. Talk to your healthcare provider or a counselor if you have symptoms of depression. These may include feeling very sad or hopeless or losing interest in your usual activities.When to Call the DoctorWhen should I call my healthcare provider?Call your healthcare provider if you have signs of complications, such as:Chest pain or pressure.Drainage or pus around your incision site.Fever or chills.Heart palpitations.Pain near your incision.Swelling or redness around your incision site.Swelling (edema) in your legs or feet.Weight gain of more than 3 pounds in one week.A note from Cleveland ClinicTalk to your healthcare provider about the benefits and risks of aortic valve surgery in your unique situation. Make sure you understand exactly what’s involved and what your outlook will be after the surgery. You may also want to ask your surgeon about the number of surgeries they’ve performed and their success rate. Having surgery at a high-volume hospital that commonly treats aortic valve disease can help you get the best possible outcome.As you plan your surgery, talk to your family and friends about it. Offer them chances to help you prepare and recover. Having a support system close by can aid your physical and emotional recovery from this major life event.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/23/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicAortic Valve Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"