"Appendectomy (Appendix Removal Surgery): Preparation & Procedure800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/AppendectomyAdvertisementAdvertisementAdvertisementAppendectomyIf you have appendicitis, you’ll most likely need an appendectomy to treat it. That means your appendix will be removed in surgery. Appendectomy is an emergency procedure to prevent the dangerous complications of appendicitis. There are two kinds of appendectomy surgeries: laparoscopic and open. Your surgeon will determine the best type for you.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is an appendectomy?An appendectomy is a surgical procedure to remove your appendix. Appendectomy is the standard surgical treatment for appendicitis, a painful inflammation of the appendix. Because an inflamed appendix has the potential to rupture, appendicitis is considered a medical emergency. A ruptured appendix can be very dangerous. A healthy appendix, on the other hand, doesn’t appear to have any essential function. If you have to have your appendix removed, you won’t miss it.What is the appendix?Your appendix is a small, tubular pouch that protrudes from the bottom of your colon, like a little tail. It’s about the length of your pointer finger. It’s located on the lower right side of your abdomen. (If you have appendicitis, you’ll feel the painful spot acutely.) Scientists aren't sure if your appendix serves any purpose at all. If it does, it's a small one. No one has ever observed any consequence from removing it.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is appendicitis an emergency?Because it's so small, your appendix swells quickly with inflammation and doesn’t take much to burst. A burst appendix can spread infectious agents throughout your abdominal cavity, leading to peritonitis (inflammation in your abdominal lining). If the infection spreads to your bloodstream, it can lead to sepsis, a serious systemic illness. Sepsis can be life-threatening. Your appendix can rupture within 36 hours of your first symptoms of appendicitis, so when you seek treatment, time is of the essence.Why is the appendix removed?In most cases, appendectomy is considered the safest treatment for appendicitis. There are a few exceptions — for example, some people might be unfit for surgery. Some people might respond to antibiotics alone if their appendicitis is uncomplicated and caught early enough. These people are at risk of recurrent appendicitis, however. Ultimately, the risk of rupture is much greater than the low risk associated with the surgery. If your appendix is inflamed enough to rupture, it’s safest to remove it.AdvertisementHow common is appendix removal surgery?Appendectomy has been the standard treatment for appendicitis for 120 years. In the U.S., 300,000 appendectomies are performed each year.Procedure DetailsLaparoscopic appendectomy uses just a few small incisions.Is appendectomy a major surgery?Not necessarily. In the U.S. today, laparoscopic appendectomy is more common than the traditional open appendectomy. Laparoscopic surgery offers a less-invasive alternative to open abdominal surgery by using several micro-incisions instead of one larger incision. Laparoscopic appendectomy is associated with less pain and faster recovery time. The type of appendectomy you receive may depend on your condition as well as the training and judgment of your surgeon.AdvertisementIs appendectomy painful?During the surgery, you will be asleep under general anesthesia. Afterward, you will probably feel some moderate pain at the site of the incision(s). This should improve within a few days. Your healthcare provider can prescribe appropriate pain medication to help you manage during your recovery. Many people manage well without prescription pain medication, but you may use it for a few days.What happens before an appendectomy?Most appendectomies are scheduled within 24 hours of your diagnosis with acute appendicitis. Your healthcare team will install an IV line into your vein to begin treating your infection with antibiotics as soon as possible. The antibiotic therapy will continue until sometime after the surgery — one to seven days, depending on the severity of the infection. In some cases, your healthcare team may monitor your response to the antibiotics to ensure that surgery is necessary before proceeding.Your healthcare team might need to take some additional diagnostic tests, such as blood tests and imaging scans, to learn more about the nature of your appendicitis. They’ll also need to take a complete medical history, including any current medications, allergies or conditions. Based on these and other factors, they’ll explain the type of surgery they want to perform and ask for your consent. You’ll have to avoid eating and drinking for 8 hours before the surgery, but you’ll receive fluids through your IV line.What happens during an appendectomy?For the procedure, you’ll remove your jewelry and change into a hospital gown, then proceed to the operating room. You’ll lie on your back and will be given general anesthesia to put you into a deep sleep. You’ll also be given a muscle relaxant to prevent muscle spasms. A thin tube will be placed through your mouth into your throat to maintain a clear airway and monitor your breathing. Your anesthesiologist will monitor your vital signs continuously during the surgery.Laparoscopic appendectomyFor a laparoscopic appendectomy, your surgeon will begin with a tiny incision near the belly button. They’ll insert a tiny port into the incision, and through the port, they’ll insert a tiny tube called a cannula. The cannula is used to inflate your abdominal cavity with carbon dioxide gas. This makes more room for the operation and allows the abdominal cavity and its contents to show up more clearly in photographic images.After that, they’ll remove the cannula and insert a laparoscope — a long, thin tube with a tiny light and high-resolution camera attached. The camera will display the surgery on a video screen, allowing the surgeon to locate the appendix and guide the instruments through one to three tiny incisions. Occasionally, the laparoscope may reveal complications that weren’t expected, and a laparoscopic surgery may need to convert to open surgery to manage them.Open appendectomyFor an open appendectomy, your surgeon will make one larger incision in your lower right abdomen. They will open the abdominal cavity and separate your abdominal muscles to locate the appendix beneath. If your appendix has ruptured, there may be an abscess or fluid in the abdominal cavity to drain before they can perform the appendectomy. Then they will rinse the abdominal cavity with a saline solution.In both procedures, your appendix is tied off with stitches, then detached from the intestine and removed. Excess fluids and gas will be drained through your incisions. If you had peritonitis, your surgeon may leave a drainage tube in your abdomen to continue draining fluids and remove it later. Your breathing tube will be removed and your incisions will be closed with stitches, cleaned and dressed. You’ll be moved to a recovery room until you wake up.What happens after an appendectomy?If you had an uncomplicated laparoscopic appendectomy, you might go home the same day. You’ll have to have someone else drive you home, though, while the anesthesia is still wearing off. If you had a ruptured appendix or open surgery, you might be in the hospital for a few more days. You’ll continue to receive intravenous antibiotics while your healthcare team monitors your condition. You may still have to have your drainage tube removed.What are the side effects of having your appendix removed?You might experience some side effects of the surgery over the next few days. Common side effects include:Nausea.Constipation.Gas pain after laparoscopy. This can extend to your chest and shoulders.Abdominal bloating. This will diminish over the next several weeks.Care at Cleveland ClinicSchedule Pediatric SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the possible complications of appendectomy?Complications are rare, but possible. They include:Bleeding.Wound infection.Blocked bowels.Injury to nearby organs.Recovery and OutlookHow long does it take to recover from an appendectomy?Recovery time varies depending on how complicated your appendicitis and surgery were and how your body responds to the surgery. In general, pain and side effects should be greatly reduced within a few days. It may take a few days to weeks to return to your normal activities. Most people recover fully within six weeks.What are the do's and don’ts to follow after an appendectomy?While you are recovering at home, follow these guidelines:Do:Keep your incision(s) clean and dry to prevent infection.Eat soft foods until your bowels can tolerate more solid foods. Take it slow.Limit your physical activity. If you had open surgery, your abdominal muscles may ache after standing too long.Call your doctor if you notice any strange symptoms.Don’t:Take medication that your doctor hasn’t approved. Some pain medications may cause you to bleed more easily.Bathe except as directed. Don’t go swimming until your stitches are removed.Strain your abdominal muscles. Avoid stair climbing and lifting heavy objects.Be completely sedentary. It’s important to get up and walk around now and then to prevent blood clots and encourage your digestive system along.When to Call the DoctorWhen should I contact my healthcare provider about my recovery?In general, you should schedule a follow-up appointment with your healthcare provider within two or three weeks of your surgery. However, you should contact your healthcare provider right away if you notice any signs of infection, such as:Redness or swelling at the incision site.Fever.Stomach cramps.Loss of appetite.A note from Cleveland ClinicNo one wants to have abdominal surgery. But if you ever have appendicitis, you’ll need swift relief. Appendectomy is still the safest and most effective way we know to not only treat appendicitis but to prevent it from returning and from spreading infection, which can be catastrophic. Recent innovations such as laparoscopy have made it possible to perform appendectomy as a minimally-invasive outpatient procedure when circumstances allow. We hope you don’t have to have one, but if you do, you'll be in good company among the hundreds of thousands each year who have successful appendectomies.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/26/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Pediatric SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"