"ARNI to Treat Heart Failure800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/ARNIAdvertisementAdvertisementAdvertisementARNIARNI (angiotensin receptor/neprilysin inhibitor) medication is a newer treatment for heart failure. The combination of sacubitril and valsartan has helped people live longer and have a better quality of life. However, like all medicines, ARNI drugs have side effects.ContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is an ARNI drug?ARNI, or an angiotensin receptor/neprilysin inhibitor, is made up of two drugs put together to treat heart failure. It contains an ARB (angiotensin II receptor blocker) and a neprilysin inhibitor.Sacubitril/valsartan is the only ARNI drug available now. The Food and Drug Administration approved the drug in 2015.How ARNI worksValsartan is the ARB part of an ARNI drug. It lowers your blood pressure by keeping your blood vessels from constricting.Sacubitril is the neprilysin inhibitor. Inhibiting or limiting neprilysin allows your body to:Get rid of more sodium (salt).Open your blood vessels wider.Make more pee.When your body gets more sodium (salt) out of your blood, your blood pressure comes down. This makes it easier for your heart to push blood out to your cells.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho can take an ARNI medication?You can take an ARNI drug if you just got a diagnosis of heart failure with a reduced ejection fraction (a measure of your heart’s pumping function) of 40% or less. A normal ejection fraction is 55% to 65%.Also, you can switch to an ARNI drug if you were taking an ACE inhibitor or ARB for heart failure.However, if you’re switching from an ACE inhibitor to an ARNI medication, you’ll need to wait 36 hours between stopping one and starting the other. This prevents swelling that could happen under your skin (angioedema).What dose of ARNI do I take?Most people start with a dose of 49/51 mg (milligrams) sacubitril/valsartan twice a day. After the first two to four weeks, they gradually increase their dose to 97/103 mg sacubitril/valsartan twice a day. Your provider will give you guidance in figuring out your doses.If your kidneys aren’t working well or you have low blood pressure, you may take a dose of 24/26 mg sacubitril/valsartan. Also, people who’ve already been taking a small dose of an ACE inhibitor or ARB may take this smaller dose of an ARNI medication instead.AdvertisementWhy is ARNI used?Many people start taking an ARNI drug because they want to stop taking an ACE inhibitor that makes them cough. Also, an ARNI medication helps your left ventricle work better. This is important because your left ventricle pumps oxygen-rich blood to your whole body.One study showed that after taking ARNI medication for a year, people increased their left ventricle’s ejection fraction from 28.2% to 37.8%.Who shouldn’t take ARNI drugs?You shouldn’t take ARNI drugs if you:Got angioedema (facial swelling) when you took an ACE inhibitor or ARB drug.Are pregnant or nursing.Are still taking an ACE inhibitor or ARB drug.Have a serious liver problem.Are taking aliskiren.Are overly sensitive to ARBs or ARNIs.AdvertisementWhat does ARNI treat?ARNI drugs treat heart failure with reduced ejection fraction (Stage C). During Stage C of heart failure, you have structural heart disease and heart failure symptoms.Also, ARNI medication can help people who have heart failure with preserved ejection fraction (normal pumping function but your heart is stiff and can’t hold as much blood). This is an ejection fraction of 50% or higher.How common are ARNI drugs?Only about 10% of the more than 2 million people who could benefit from an ARNI drug are using it. Possible reasons for this low usage of ARNI drugs include:Providers aren’t familiar with ARNI medication.Providers don’t want to change medications for people who are stable on other drugs.Insurers won’t pay for ARNI drugs.People aren’t willing to switch to a different medicine.Risks / BenefitsWhat are the advantages of ARNI drugs?Compared to ACE inhibitors or ARBs, ARNI drugs can:Help you live longer.Improve your quality of life.Slow down your heart failure progression.Reduce the amount of time you spend in a hospital.Every year, about 60,000 people die from heart failure. ARNI medication could prevent more than 28,000 deaths a year if providers prescribed it to more people instead of ACE inhibitors or ARBs.A large study found that participants taking an ARNI drug had a 20% drop in their risk of cardiovascular death or hospitalization for heart failure.What are the side effects of ARNI medication?ARNI side effects include:Kidney dysfunction.Low blood pressure (hypotension).High potassium (hyperkalemia).Angioedema (very rare, but more common in Black people).Your healthcare provider will need to do a blood test to check your potassium level during the first few weeks that you’re taking an ARNI drug. They’ll also want to check your blood pressure and make sure your kidneys are working right.If you’re having kidney issues, you may need to take a smaller dose of ARNI medication or stop taking it. Your provider will advise you about what you should do. Don’t stop taking ARNI medication unless your provider tells you to stop.You can keep your blood pressure from getting too low by taking blood pressure medicines at different times than your ARNI dose. Talk with your healthcare provider about spreading out the timing of your blood pressure medicines.Side effects normally go away in 14 days. If they don’t go away, your provider can give you a smaller dose of ARNI medication. Then they can increase your dose a week or two after your side effects stop.Recovery and OutlookWhat is the outlook for someone taking an ARNI drug?Estimates based on studies predict that ARNI medication may give a person age 55 or older another 2.1 years without a heart-related hospital stay or fatal event. Someone age 65 or older may get another 1.6 years without those occurrences.When to Call the DoctorWhen should I see my healthcare provider?Contact your healthcare provider if you have:Dizziness.Lightheadedness.Fainting.Low blood pressure (a systolic or first number lower than 90 millimeters of mercury).A note from Cleveland ClinicAlthough you may feel safer sticking with a medication you’ve taken for a while, it may be worth trying a new one. Talk with your healthcare provider about the benefits and disadvantages of trying a new heart failure drug. Understanding the study results and your provider’s opinion on it can help you make an informed decision that’s best for you.Care at Cleveland ClinicCardiology CareMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/29/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicCardiology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"