"Aromatase Inhibitors for Breast Cancer800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Aromatase InhibitorsAdvertisementAdvertisementAdvertisementAromatase InhibitorsAn aromatase inhibitor (AI) is a type of hormone therapy for cancer. Healthcare providers use aromatase inhibitors to treat a common breast cancer type. This therapy reduces your risk that breast cancer will come back after surgery. If you’re at an increased risk of a specific breast cancer, taking an aromatase inhibitor may reduce that risk.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is an aromatase inhibitor?An aromatase inhibitor (AI) is a type of hormone therapy for cancer. Healthcare providers use aromatase inhibitors to treat hormone receptor-positive (ER-positive) breast cancer. ER-positive breast cancer often affects women and people assigned female at birth (AFAB) who are age 50 and older.Aromatase inhibitors work by reducing the amount of estrogen in your body. Estrogen is an essential hormone. It supports your sexual and reproductive health. It also regulates important processes in your skeletal, cardiovascular and central nervous systems that affect your overall health.But high estrogen levels may increase your risk of developing ER-positive breast cancer. Aromatase inhibitors block the enzyme aromatase, which turns other hormones into estrogen. By reducing your estrogen levels, aromatase inhibitors keep cancerous cells from growing and spreading.Providers typically use aromatase inhibitor therapy for people with breast cancer who’ve gone through menopause. (Women and people AFAB who haven’t gone through menopause typically don’t receive aromatase inhibitor therapy because their ovaries are still making estrogen.)Aromatase inhibitors also keep ER-positive breast cancer from recurring, or coming back, after breast cancer surgery. If you have an increased risk of developing ER-positive breast cancer, taking an aromatase inhibitor may reduce your risk.How common is this treatment?It’s very common. ER-positive cancer affects about 8 in 10 people. Providers use aromatase inhibitor therapy as front-line or initial treatment for ER-positive breast cancer. They may also prescribe aromatase inhibitor therapy if:You’ve had surgery for ER-positive breast cancer, to reduce the risk the cancer will come back.You have ER-positive breast cancer that’s spread to nearby lymph nodes.You have metastatic (spread outside your breast) ER-positive breast cancer that’s spread to your organs. Breast cancer may spread to your lungs, bones, brain or liver.You develop ER-positive breast cancer before you’ve gone through menopause. You may have an additional treatment to block ovarian estrogens.You’re at increased risk of developing ER-positive breast cancer. Studies show certain aromatase inhibitors reduce breast cancer risk. The U.S. Food and Drug Administration (FDA) hasn’t approved this use.You’re a man or assigned male at birth (AMAB) with ER-positive breast cancer. (While estrogen is typically considered a female hormone, men and people AMAB have estrogen, just at lower levels than people who are AFAB.) In this case, your provider may combine aromatase inhibitor therapy with estrogen-blocking therapy.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow do you take an aromatase inhibitor?Aromatase inhibitors are pills that you take every day. Some people may start treatment with an aromatase inhibitor or take tamoxifen for a few years and then start aromatase inhibitor therapy.Most people take aromatase inhibitors for five years, stopping treatment if they don’t have signs of recurring or new breast cancer.Once you’ve completed treatment, you may be considered in remission if five years have passed and you don’t have cancer symptoms and tests don’t find signs of cancer.That said, studies show breast cancer can come back as long as 20 years after treatment. This is late recurrence breast cancer. If you’re receiving treatment for ER-positive breast cancer, ask your healthcare provider to explain your risk of late recurrence breast cancer.What are common aromatase drugs?The three most common drugs are:Letrozole.Anastrozole.Exemestane.What are the side effects?Aromatase inhibitors reduce estrogen levels in your body and prevent ER-positive breast cancer from spreading. But estrogen helps keep your bones and heart healthy. If you take aromatase inhibitors, you may have the following side effects:Increased risk of osteoporosis and bone fractures.Muscle pain (myalgia).Joint pain.Hot flashes.Vaginal dryness.Cardiovascular disease.Care at Cleveland ClinicGet Cancer CareMake an AppointmentRisks / BenefitsWhat are the potential benefits of this treatment?The most significant benefit is being free of ER-positive breast cancer. Studies show 95% of people who receive aromatase inhibitor therapy after breast cancer surgery don’t have breast cancer signs five years after completing treatment.What is the survival rate without aromatase inhibitors?If you have ER-positive breast cancer, aromatase inhibitor therapy significantly reduces your risk that breast cancer will come back. One early study compared outcomes for those who took the aromatase inhibitor letrozole after tamoxifen and people who didn’t. The study showed that taking letrozole reduced the risk of dying of breast cancer by 24% to 35%.AdvertisementRecovery and OutlookWhat can I do to help recover from aromatase inhibitor therapy?Aromatase inhibitors can cause severe joint pain. If you have this side effect, ask your healthcare provider for help. They may recommend:Anti-inflammatory medications, including nonsteroidal anti-inflammatory drugs (NSAIDs) such as ibuprofen.Switching your medication to another aromatase inhibitor.Substituting tamoxifen.When to Call the DoctorWhen should I call my healthcare provider?Call your healthcare provider if:Your side effects become more severe than you expected.Your side effects don’t improve with the medication your provider recommended.You notice changes in your body that may be symptoms of recurrent breast cancer. Ask your provider about watching for specific changes.A note from Cleveland ClinicAromatase inhibitor therapy is one of the most effective ways to treat ER-positive breast cancer in people who have gone through menopause. Studies show people who take aromatase inhibitors after breast cancer surgery remain free of breast cancer for five or more years after treatment. Aromatase inhibitor therapy has side effects that may affect your quality of life. If you’re taking an aromatase inhibitor, ask your healthcare provider about ways to reduce side effects so you can continue treatment that helps you live free of breast cancer.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/03/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Cancer CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"