"Arthroplasty (Joint Replacement Surgery): Procedure and Details800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Arthroplasty (Joint Replacement)AdvertisementAdvertisementAdvertisementArthroplasty (Joint Replacement)Arthroplasty, also called joint replacement, is surgery to replace a damaged joint with an artificial joint (made of metal, ceramic or plastic). Providers usually replace the entire joint (total joint replacement). Less often, they replace only the damaged part of the joint. Hips, knees and shoulders are the most common joints they replace.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is arthroplasty?The definition of arthroplasty is surgical joint replacement. During the procedure, your healthcare provider removes a damaged joint and replaces it with an artificial joint. The artificial joint (prosthesis) can be metal, ceramic or heavy-duty plastic. The new joint looks like the natural joint and moves in a similar way.Surgeons can replace joints in any part of your body, but the most common types of arthroplasty are hip replacement and knee replacement.Most people who get this procedure need a total joint replacement. A small number of people are good candidates for a partial joint replacement. This procedure only replaces the part of the joint that’s damaged. Recovery time for arthroplasty varies. It depends on your age and lifestyle, the type of procedure and the joint you have replaced.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs arthroplasty (joint replacement)?Your surgeon may recommend arthroplasty if you have:Joint pain that hasn’t gotten better with nonsurgical treatments such as physical therapy (PT), medications, bracing, injections, walking assistive devices and rest.Joint stiffness and limited mobility that make it difficult or impossible for you to do your everyday activities.Swelling (inflammation) that doesn’t improve with medications or lifestyle changes.These symptoms can result from several conditions, including:Arthritis, specifically osteoarthritis.Rheumatoid arthritis.Fractures, including a hip fracture.Joint abnormalities, such as hip dysplasia.Avascular necrosis (lack of blood supply to the bone).These symptoms can result from several conditions, including:Arthritis, specifically osteoarthritis.Rheumatoid arthritis.Fractures, including a hip fracture.Joint abnormalities, such as hip dysplasia.Avascular necrosis (lack of blood supply to the bone).Procedure DetailsWhat joints do orthopedic surgeons replace?Most often, surgeons replace the hip joint, knee joint or shoulder joint. Providers call these procedures hip arthroplasty, total knee arthroplasty and shoulder arthroplasty. In the United States, surgeons perform about 500,000 hip replacements and more than 850,000 knee replacements every year.Currently, surgeons can replace all of the following joints:Ankles.Elbows.Hips.Knees.Shoulders.Toes.Wrists.AdvertisementWhat happens before arthroplasty (joint replacement)?Your provider will help you prepare for the procedure. They may recommend physical therapy, exercise or a diet program for you to follow in the weeks leading up to surgery. These programs can ensure that you’re healthy for the operation.Before arthroplasty, you may need several tests to evaluate your overall health such as blood work, an electrocardiogram and a chest X-ray. Depending on your health history, you may need to visit your primary care provider or another specialist for pre-operative evaluation. Some procedures require a CT scan or MRI for surgical planning.Tell your provider about your health history and any medications you take. You may need to stop taking certain medications (such as blood thinners) before surgery. Your provider will tell you what time to stop eating and drinking the night before your procedure.What happens during arthroplasty?You may have your surgery in an outpatient clinic or at a hospital. The technique your surgeon uses varies depending on the type of surgery and the joint you need replaced. Right before your procedure, you will receive anesthesia. This ensures you won’t feel pain during arthroplasty.Your surgeon makes incisions (cuts) and removes the damaged joint. Then they replace it with an artificial joint. They use stitches, staples or surgical glue to close the incisions. Your provider wraps the joint in a bandage. You may also need a brace or sling.Surgeons can do some joint replacement procedures using minimally invasive techniques. These techniques use fewer incisions and special tools. The recovery time for minimally invasive procedures can be less than it is for traditional procedures. Your surgeon will recommend the most appropriate procedure for you.AdvertisementWhat happens after arthroplasty?Depending on the type of procedure you have, you may go home the day of surgery, or you may need to stay in the hospital for a day or two. Talk to your provider about planning for recovery. You will need to have someone drive you home. You may also need help getting around or performing tasks like laundry or bathing.After surgery, you will feel some pain. The first few days after your procedure, you should:Avoid physical activity. Take time to rest as you recover from surgery. Your provider may recommend placing ice or a cold compress on the new joint for about 20 minutes at a time.Perform your physical therapy and home exercise program as prescribed. It is important to follow your provider’s instructions. They will not only help in your recovery to restore function but also help to protect the new joint.Elevate. Depending on the joint you had replaced, your provider may recommend keeping the joint elevated while you rest. For example, if you had a knee replacement, rest with your foot on a stool or chair instead of the floor.Keep your incisions clean and covered. Follow your provider’s incision care instructions carefully. Ask your provider when you can remove the dressing, take a shower or bathe after your procedure.Take pain medication. Your provider may recommend over-the-counter nonsteroidal anti-inflammatory drugs (NSAIDs) or prescription pain medication. Be sure to follow your provider’s instructions when taking pain medication. You may also need drugs to reduce swelling or prevent blood clots.Care at Cleveland ClinicGet Orthopaedic CareMake an AppointmentRisks / BenefitsWhat are the advantages of arthroplasty (joint replacement)?Joint replacement procedures can help you move without pain and stiffness. After a joint replacement, many people can take part in activities they once enjoyed. These surgeries greatly improve quality of life and overall health by allowing people to have an active lifestyle.What are the risks or complications of arthroplasty?As with any surgery, there is a risk of complications from arthroplasty. The risks include:Blood clots.Infection.Injury or damage to nerves around the replaced joint.Joint stiffness, weakness or instability that may lead to a fracture.Problems with the new joint, including dislocation.You have a higher risk of complications from arthroplasty if you have certain health conditions. Before surgery, tell your provider if you have diabetes, hemophilia or an autoimmune disease such as lupus. These conditions can make recovery from joint replacement more difficult.Recovery and OutlookWhen can I go back to my usual activities after arthroplasty?Everyone recovers differently from joint replacement. Ask your provider when you can get back to the activities you enjoy after your arthroplasty. It’s a good idea to have this conversation before surgery so you know what activities are appropriate following a full recovery.Your recovery time will depend on several factors, including:Activity level and lifestyle.Age.Joint that was replaced.Other health conditions or orthopedic problems.Whether you had a total joint replacement or a partial joint replacement.For most people, a physical therapy program can speed recovery time. PT strengthens the muscles around the replaced joint. This helps them better support the joint. These exercises also increase flexibility and help you move.How long do joint replacements last?A new joint usually lasts about 10 to 15 years. But everyone has different results after arthroplasty. Talk to your provider about what you can do to take care of your new joint. If your joint replacement wears out after 15 years, it may be possible to revise it with a new joint.When to Call the DoctorWhen should I see my healthcare provider after an arthroplasty?After the procedure, call your provider if you have:Bleeding.Signs of infection, including fever, severe swelling or drainage (pus) from the incisions.Pain that is severe or doesn’t go away with pain relief medications.A note from Cleveland ClinicArthroplasty can help people who have joint pain and stiffness get back to the activities they enjoy. Many people regain mobility and live a more active lifestyle after a joint replacement. But everyone recovers differently and you may need to make changes to your activities to protect your new joint. Before surgery, have an open conversation with your provider about what you can expect following the operation. It’s important to have realistic expectations. For the best results, stick to a PT program and follow your provider’s instructions during recovery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/21/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Orthopaedic CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2606Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"