"ASD Closure: Procedure, Risks and Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/ASD ClosureAdvertisementAdvertisementAdvertisementASD ClosureASD closure is a procedure to close an atrial septal defect (ASD). An ASD is a hole in the heart between the two upper chambers. The procedure uses a device to plug the hole, a patch to cover it or sutures to sew it shut. It may involve open-heart surgery or a minimally invasive procedure using a catheter to place the closure device.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is ASD closure?ASD closure is a procedure to close an atrial septal defect (ASD) or hole in your heart.An atrial septal defect (ASD) is an abnormal opening in the wall (septum) between your heart’s two upper chambers (atria). Every baby is born with a small opening there. The hole usually closes a few weeks or months after birth. But sometimes a baby is born with a larger hole that doesn’t close properly.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs ASD closure?If the hole is small, it may not cause any problems or need treatment. But if the ASD is large, it can allow blood to leak into the wrong chambers of your heart. This can make your heart and lungs work harder, causing symptoms and complications, including:Abnormal heart rhythm (arrhythmia) like atrial fibrillation or atrial flutter.Enlarged heart.Heart failure.High pressure in your lungs (pulmonary hypertension).Shortness of breath.Stroke.Your healthcare provider may suggest ASD closure if you’re at risk for those complications. They also might recommend the procedure if you’re already having surgery for another congenital heart defect.Surgeons often perform ASD closure on young children to avoid future heart damage and complications.Who performs ASD closure?ASD closure is performed by a heart surgeon or interventional cardiologist, both specialists in heart procedures.AdvertisementProcedure DetailsHow does an ASD closure work?There are several techniques for ASD closure. It may require open-heart surgery. Sometimes, it can be accomplished with a minimally invasive procedure called cardiac catheterization using a catheter threaded from a vein in your groin up to your heart.The hole can be:Covered by a patch made of synthetic material or your own tissue, taken from another area of your heart.Plugged with a closure device.Sewn shut with sutures (stitches).Your healthcare provider will recommend the appropriate technique for you, depending on:Any other heart conditions you may have.The size and location of the hole.Your overall health.Some medical facilities even use robotic-assisted surgery to repair an ASD.What happens during surgical ASD closure?During surgery for ASD closure, you’re under general anesthesia. You receive medications that put you to sleep, so you feel no pain during the operation.A healthcare provider connects you to several machines that monitor your vital signs, including heart rate and breathing. They also connect you to a heart-lung machine to take over the work of your heart during the procedure.Your heart surgeon makes an incision (cut) in your chest. Your surgeon may make the incision:Down the middle of the chest over your breastbone.On the right side of your chest.In another location determined by your surgeon.Your surgeon then uses a special tool to spread your ribs. Using an endoscope, a thin tube with a light and camera at the end, your surgeon locates the ASD. Then they close it with a plug, patch or sutures.AdvertisementWhat happens during transcatheter ASD closure?If you have a smaller ASD and no other heart conditions that need correcting, you may be able to have transcatheter ASD closure. This method is less invasive and generally makes recovery easier and faster.For transcatheter ASD closure, you may receive general anesthesia or medications that sedate you. Sedation makes you sleepy and relaxed, but you’re still conscious (unlike general anesthesia).To perform a transcatheter ASD closure, your interventional cardiologist:Makes a small incision in the femoral vein and sometimes also a femoral artery in your groin.Inserts a thin tube called a catheter, which holds the closure device on the end.Uses imaging technology such as X-ray and echocardiogram to guide the catheter and device through the vein to your heart.Places the closure device into the hole.Removes the catheter.What happens after ASD closure?After ASD closure, your healthcare team monitors you as you recover from anesthesia. They also take images of your heart to make sure the procedure was successful. You typically stay in the hospital for one or more nights, depending on the type of procedure you had.Care at Cleveland ClinicAdult Congenital Heart Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of ASD closure?ASD closure can reduce the symptoms and complications associated with a hole in your heart. This can protect your heart and lungs, helping you live a longer, more productive life.What are the risks or complications of ASD closure?ASD closure is usually safe and effective, but it does carry some risks, including:Allergies to materials used during the procedure.Abnormal heart rhythm (arrhythmia).Bleeding, which may require a blood transfusion.Damage or puncture of heart tissue or veins, requiring surgical correction.Infection of the incision or around the closure device.Kidney failure.Stroke or transient ischemic attack (mini-stroke).Some complications can be life-threatening.Recovery and OutlookWhat is the recovery time after ASD closure?Your healthcare provider will talk to you about what to expect during recovery. You may have to limit physical activity for a few weeks especially if you have surgical ASD closure. For transcatheter closure, you should be able to resume your normal activity within one week.You’ll likely need to take medications to prevent blood clots for six months after the procedure. You’ll need to take antibiotics to prevent infections, especially when you’re planning dental procedures at least within the first six months after the procedure.It’s essential to attend all follow-up appointments with your cardiologist or surgeon. The doctor will perform tests to ensure the procedure was effective. Tests may include:Ambulatory monitors.Echocardiograms.Electrocardiograms.Exercise stress tests.Can an ASD come back after closure?Occasionally, some people need repeat surgery to close an opening left behind after ASD closure or a reopened hole. But this is rare, and a repeat procedure is necessary only if the hole is large enough to cause problems.What’s the life expectancy after ASD closure?Studies show that a younger person (25 or younger) who’s had ASD closure has about the same life expectancy as other people the same age who never had an ASD. But older individuals who receive ASD closure have a slightly shorter lifespan than their counterparts who haven't had ASD closure.Importantly, people with an ASD who get the hole closed live longer than people with an ASD who don't have the procedure.When to Call the DoctorWhen should I call my healthcare provider?After ASD closure, there are risks of serious complications like infection, heart problems and stroke. Seek medical attention right away if you experience any signs of a complication, such as:Blood, fluid or pus coming from the incision site.Chest pain.Confusion or fainting.Fever.Pain that gets worse or doesn’t get better with pain medication.Shortness of breath.Irregular heart rhythm, such as a fluttering feeling in your chest.A note from Cleveland ClinicASD closure is a procedure to close an atrial septal defect (ASD) or hole in the heart. If you or your child has an ASD, talk to your healthcare provider about the benefits of closure. They’ll help you understand which treatment is right for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/08/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicAdult Congenital Heart Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementCall Appointment Center 24/7 866.320.4573Questions 216.444.2200Request an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"