"Ablation to Treat Atrial Flutter 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Atrial Flutter AblationAdvertisementAdvertisementAdvertisementAtrial Flutter AblationAtrial flutter ablation is a procedure that uses hot or cold methods to damage heart cells that send abnormal signals that cause fast heartbeats. Damage to these cells in your atrium (upper heart chamber) stops the irregular signals for most people who have this procedure. However, the issue happens again in a small percentage of people.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is atrial flutter ablation?Atrial flutter ablation is a procedure to destroy cells in your heart that are causing atrial flutter, an abnormal rhythm of the heart.Usually, providers use radiofrequency ablation (heat), but some use cryoablation to freeze the tissue that makes your heart beat too fast. Both methods stop abnormal cells from sending signals.In atrial flutter, the upper chambers of your heart beat irregularly. This can cause symptoms such as palpitations, and can be bad for your heart in the long term. Normal cells in your heart’s upper chambers send organized signals to make your heart beat in sync. Abnormal cells send irregular signals through your heart.Why is atrial flutter ablation done?If medicine or cardioversion doesn’t work, a healthcare provider may recommend ablation for atrial flutter.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before atrial flutter ablation?A provider will ask you to stop eating and drinking for six to eight hours before your atrial flutter ablation. They’ll also tell you if you need to stop taking some of your medicines before an ablation for atrial flutter.It’s very important that you don’t miss a dose of your anticoagulant before your procedure unless your cardiac electrophysiologist tells you to.How is atrial flutter ablation done?During an atrial flutter ablation, you may receive twilight sedation with medicine meant to make you sleepy and not feel pain, or you may have general anesthesia. This puts you to sleep and includes placement of a breathing tube. Then, a provider will do the following:Place a needle through the skin in your groin.Put multiple catheters (tubes) into veins in your groin.Put an electrode catheter through the tube, through your blood vessel and to your heart.Use the electrode catheter to send signals that help them identify abnormal heart cells.Use radiofrequency energy to heat and damage abnormal cells.Providers do this procedure in a cardiac catheterization lab. It’s not open-heart surgery.How long does atrial flutter ablation take?Atrial flutter ablation can take two to four hours.AdvertisementWhat happens after atrial flutter ablation?A provider will remove everything they put into your blood vessels. They’ll put pressure on the puncture spot in your skin. Then they’ll ask you to keep your leg stretched out for six to eight hours.Once you go home, make sure you don’t miss any doses of your anticoagulant unless your cardiac electrophysiologist tells you to. If you’re having a lot of bleeding, make sure you call your doctor right away.Care at Cleveland ClinicCardiology CareMake an AppointmentRisks / BenefitsHow successful is ablation for atrial flutter?Atrial flutter ablation has a 90% or higher success rate. It restores a normal rhythm in most people. However, atrial flutter can return in 4% to 6% of people.Success rates may be lower in people with atypical atrial flutter.AdvertisementWhat are the risks or complications of an atrial flutter ablation procedure?Atrial flutter ablation has a complication rate of less than 1%. Rare complications of atrial flutter ablation include:Heart block.Stroke.Cardiac perforation (putting a hole in your heart by mistake).Infection.Bleeding.If you’re having a lot of bleeding, weakness, confusion or slurred speech that won’t go away, or if you feel lightheaded like you’re going to pass out, make sure you call your doctor right away.Recovery and OutlookHow long does it take to recover from atrial flutter ablation?You should be able to get back to your normal activities the day after you go home. Wait three days before doing physically demanding activities.You’ll need to take anticoagulants without missing any doses for the short term. This prevents blood clots that can form. On a long-term basis, you’ll likely continue anticoagulants if there’s any sign you still have atrial flutter or another abnormal rhythm, but your cardiologist will decide.When to Call the DoctorWhen should I see my healthcare provider?Call 911 if your wound swells up without warning or if you can’t slow down the bleeding.Contact your healthcare provider when you have:Shortness of breath.Dizziness.Chest pain.Numbness in the leg that has the wound.Swelling or bruising around your wound.A heartbeat that seems abnormal.Upset stomach.A note from Cleveland ClinicHaving an abnormal heart rhythm can make you uneasy, but treatments are available. Atrial flutter ablation success rates are high. Talk with your provider to find out if this treatment is a good option for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 12/13/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicCardiology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"