"Auditory-Verbal Therapy: What It Is & Treatment800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Auditory-Verbal TherapyAdvertisementAdvertisementAdvertisementAuditory-Verbal TherapyA child fitted with a hearing aid or cochlear implant can learn to listen, understand sound and use speech just like a child who isn’t hearing impaired. Auditory-verbal, a relatively new and revolutionary therapy, can help your child with school, making friends, working mainstream jobs and living independently.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is auditory-verbal and auditory-based therapy?Auditory-verbal therapy (AVT) — sometimes called auditory-based therapy — is a type of early intervention therapy for young children who are deaf and hard of hearing, or those who use hearing technology such as hearing aids or cochlear implants. Even if your child’s hearing loss is severe to profound, their therapist may be able to teach them how to listen and communicate through spoken language. Parents and other caregivers actively take part in the therapy lessons and continue the activities at home.The goal of auditory-verbal therapy (AVT) is for your child who is deaf or hard of hearing to learn, listen and have the same ability to speak like children who can hear. Children who go through auditory-verbal therapy generally succeed in mainstream education. They excel in math and reading, make friends, gain self-esteem and live with independence.While hearing aids and cochlear implants help your child hear sounds, they must still learn how to interpret those signals.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow effective is auditory-verbal therapy? Is it successful?Hearing impairment is the most common congenital condition, meaning born with. But just because there’s a hearing difference, that doesn’t mean your child can’t learn to hear. In fact, children with hearing aids or cochlear implants can often achieve impressive audibility.Experts have found that by the time they go to first grade, the majority of children who are deaf and hard of hearing, who go through auditory-verbal therapy, have similar — or even better — spoken language skills than their hearing peers. Studies have also shown that these children do better in school than those who have hearing loss but don’t take part in AVT.Who can take part in auditory-verbal therapy?Auditory-verbal therapy (AVT) is most successful when children start early — as young as two to three months old. If your young child is deaf or hard of hearing, and they’re using either hearing aids and/or cochlear implants, they may benefit from auditory-verbal therapy. Make sure that your newborn goes through the Universal Newborn Hearing Screening (UNHS). If needed, babies can be fitted with hearing aids. If hearing aids aren’t sufficient, your child can be evaluated for cochlear implants as early as nine months of age.It doesn’t matter if your child was born deaf or hard of hearing or if something else caused their hearing difference. They may benefit from auditory-verbal therapy if they struggle to hear out of one ear or two, if their condition is permanent or temporary, or if their hearing loss is mild up through severe/profound.Take part in the therapy session with your child. Your healthcare provider will coach you along the way. It’s helpful if you learn like they do. Then your “job” will be to continue teaching them outside of the lessons with their clinician.AdvertisementWhat are hearing aids? What are cochlear implants?Hearing aids make speech and other sounds louder. Some people hear certain frequencies better than others, and their hearing aids can be customized to help. But just because your child hears you louder, that doesn’t automatically result in comprehension. Auditory-verbal therapy (AVT) can help.If hearing aids aren’t sufficient for your child, their healthcare provider may recommend cochlear implants. Inside of your inner ear is a hollow bone called the cochlea. When it works correctly, your inner ear transforms sound waves into electrical impulses that your brain understands. If your inner ear needs help, a surgeon can fit an implant within your cochlea. The device bypasses the damage and can provide your child with access to sound.Your child must typically be fitted with hearing aids and/or cochlear implants to take part in auditory-verbal therapy.How common is auditory-verbal therapy?Auditory-verbal therapy is relatively new. In 2022, there are just over 1,000 certified listening and spoken language specialists in the world. It’s often difficult to find one in your area.AdvertisementWhere is auditory-verbal therapy conducted?Auditory-verbal therapy often takes place at the therapist’s office but, more importantly, it also happens in your own home where you’re your child’s first and most important teacher. Keep the following tips in mind when “coaching” your child:Speak near your child’s hearing aid or the microphone of their cochlear implant.Speak slowly, but as naturally as possible.Don’t speak loudly — use your regular volume.Get rid of all background noise. This includes fans and air conditioners, as well as background music or other stimuli.Repeat what you say, as needed.Speak expressively and with a melodic rhythm. This can help “capture” your child auditorily.What kind of healthcare provider provides the therapy?Audiologists and speech-language pathologists work with children who are deaf and hard of hearing. They may also train to become a listening and spoken language specialist (LSLS) who can conduct auditory-verbal therapy with expertise.What’s the difference between auditory-verbal therapy and other types of therapies for the deaf and hard of hearing?Other communication techniques like lip-reading and sign language depend on visual cues. This can leave the auditory cortex of your child’s brain unstimulated. AVT helps your child develop their “auditory brain” — their ability to listen and talk.Auditory-verbal therapy also involves a child’s caregivers. Caregivers are coached on different techniques and strategies so they can teach their child at home during play and other activities throughout the day.How does auditory-verbal therapy work?An auditory-verbal therapy session includes your child, your child’s caregivers (this can include parents, siblings, grandparents, etc.) and their clinician. Your child will be taught how to listen and speak through natural interactions like:Playing.Talking.Singing.Playing games.There are 10 principles that auditory-verbal therapists go by:Promote early diagnosis of hearing loss in newborns, infants, toddlers and young children, followed by immediate audiologic management and auditory-verbal therapy.Recommend immediate assessment and use of appropriate state-of-the-art hearing technology to obtain maximum benefits of auditory stimulation.Guide and coach parents to help their child use hearing as the primary sensory modality in developing listening and spoken language.Guide and coach parents to become the primary facilitators of their child’s listening and spoken language development through active consistent participation in individualized auditory-verbal therapy.Guide and coach parents to create environments that support listening for the acquisition of spoken language throughout the child’s daily activities.Guide and coach parents to help their child integrate listening and spoken language into all aspects of the child’s life.Guide and coach parents to use natural developmental patterns of audition, speech, language, cognition and communication.Guide and coach parents to help their child self-monitor spoken language through listening.Administer ongoing formal and informal diagnostic assessments to develop individualized auditory-verbal treatment plans to monitor progress and to evaluate the effectiveness of the plans for the child and family.Promote education in mainstream schools with peers who have typical hearing and with appropriate services from early childhood onwards.With the application of the above-listed principles, parents can become the most important “change agent” for their children, and in conjunction with today’s incredible “hearing sensory technology,” even children with severe and profound hearing loss can make use of auditory information to develop spoken language — through listening!Why does audio-verbal therapy work?Your child’s brain has optimal neural plasticity in their first three and a half years. “Optimal neural plasticity” means that it’s easier for their brain to adapt and change through learning and early stimulation. You’ll need to take advantage of this narrow window to help your child’s future.The brain of an individual who is deaf or hard of hearing can become a “visual” brain instead of a “visual and auditory” brain. Ideally, you’ll want your child to be able to see visual cues after establishing an ability to listen, instead of just one or the other.Procedure DetailsHow do I prepare for auditory-verbal therapy?Be sure that your child’s hearing aids or cochlear implants are working before you go to a lesson. You should also check the hearing technology throughout the day as you’re playing with your child.What should I bring to auditory-verbal therapy?You’ll be encouraged to take notes and keep everything organized, so bring a notebook or a three-ring binder with paper. You’ll use these for:Writing down or drawing ideas for activities to do with your child at home.Recording goals.Noting your child’s progress.You may also want a physical or digital photo album or scrapbook. Take pictures that show your child’s progress and include a note about your observations.How long does auditory-verbal therapy last?This depends on the program you join. Your healthcare provider will make recommendations based on your child’s age, progress and type of hearing technology they use.The program usually lasts three years or more. It’s very important that you attend the sessions with your child, so work around your schedule, as well as theirs. Remember, what’s most important is that you work with your child outside of sessions, as well as during!Care at Cleveland ClinicHearing Loss TreatmentFind a Doctor and SpecialistsRequest a Hearing Assessment in OhioRequest an Appointment in FloridaRisks / BenefitsWhat are the advantages of auditory-verbal therapy?Auditory-verbal therapy gives your child the ability to take part in “mainstream” society. They can grow up getting the same education as their peers and have access to anything they may want to do. Their hearing doesn’t need to define them.What are the disadvantages of auditory-verbal therapy?Auditory-verbal therapy isn’t like taking a magic pill. You and your child will have to consistently work and play for the therapy to be most effective.What are the risks of auditory-verbal therapy?Auditory-verbal therapy is risk-free for you and your child.Recovery and OutlookWhat’s the prognosis (outlook) for people who get auditory-verbal therapy?The outlook for kids who go through auditory-verbal therapy is most positive. Most studies show that ATV “graduates” are fully integrated into the communities. They fit right in with people who can hear as well as people who might not. They’re not limited in the careers they choose and most don’t need sign language to communicate.When to Call the DoctorWhen should I contact an auditory-verbal therapist?About 6% of the world’s population has hearing loss. Children aged 1 to 15 years make up 7% of that group. Get in touch with resources as soon as you find out that your baby is hearing impaired. Therapy can start right away.Additional DetailsDoes insurance cover auditory-verbal therapy?The answer to this question depends on many factors. Your insurance policy, your therapist’s credentials and the state you live in all affect whether or not your child’s auditory-verbal therapy is covered. Some policies only pay if your child was born unable to hear (vs. losing their hearing due to an illness or injury), while others only pay for the hearing aids. Talk to your insurance provider about what they cover.Some areas may help pay for AVT services. Contact services in your local area for help.A note from Cleveland ClinicAuditory-verbal therapy has lifelong benefits. It can provide your child with a strong foundation, where spoken language and listening are just a normal part of life. With the help of auditory-verbal therapy and hearing technology, your child can learn to listen, communicate effectively and reach their greatest potential.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/05/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicHearing Loss TreatmentFind a Doctor and SpecialistsRequest a Hearing Assessment in OhioRequest an Appointment in FloridaAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"