"Autologous Stem Cell Transplant: How It Works, Benefits & Risks800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Autologous Stem Cell TransplantAdvertisementAdvertisementAdvertisementAutologous Stem Cell TransplantIf cancer or blood disease affect your body’s ability to produce healthy cells, you may benefit from an autologous stem cell transplant. This procedure replaces abnormal or damaged stem cells with healthy ones from your body.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is an autologous stem cell transplant?“Auto” means self, so this procedure uses your own stem cells to replace stem cells that are damaged by high-dose chemotherapy. The transplanted cells help support your body to produce healthy stem cells.All the cells in your body start as stem cells. In their early stages, most stem cells live in the spongy material inside of your bones (bone marrow). As they mature, many of them become blood cells. They also support cell development and repair throughout your body.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy might I need a stem cell transplant?You might need a stem cell transplant if you have a type of cancer that affects bone marrow or starts in your blood cells. This includes:Multiple myeloma.Hodgkin lymphoma.Non-Hodgkin lymphoma.Autologous stem cell transplants are also used for other conditions, like:Certain types of solid tumorsGerm-cell tumors, including testicular cancer.Neuroblastoma.Soft tissue sarcoma.Autoimmune diseasesMultiple sclerosis.Scleroderma.Is an autologous stem cell transplant my only option?Another type of transplant uses cells from a healthy donor (allogeneic stem cell transplant). For this transplant to succeed, it’s essential to find a donor whose genetic material is similar to yours, like a sibling. But an allogeneic transplant may be the only option for some people and certain diagnoses.The option that’s best for you depends on your diagnosis and other medical needs. An allogeneic stem cell transplant is the best option for people with bone marrow disorders like chronic myeloid leukemia, acute myeloid leukemia and myelodysplastic syndrome.AdvertisementProcedure DetailsHow do I prepare for an autologous stem cell transplant?The first phase involves collecting and processing stem cells. Stem cells may be collected from your blood, bone marrow or cord blood. The process includes:Having tests, such as lung function testing, heart function testing and a bone marrow biopsy, to determine whether you’re healthy enough to donate stem cells.Receiving growth factor injections that trigger your body to make and release stem cells from your bone marrow.Collecting stem cells, which is known as harvesting.Running your blood through a machine that removes stem cells. This process is known as apheresis.Repeating the stem cell collection process several times.Freezing stem cells with liquid nitrogen.Storing them in a lab until you’re ready for your transplant.What else happens before an autologous stem cell transplant?After the harvesting process, you receive high-dose chemotherapy to kill cancer cells. Chemotherapy also destroys the rest of your blood cells in your bone marrow. Some people undergo radiation therapy, too. This process is called conditioning.AdvertisementHow does a stem cell transplant work?After completing chemotherapy (and radiation therapy if necessary), you’re ready for your transplant. It doesn’t involve surgery like other types of transplants. Instead, your healthcare providers deliver stem cells using an intravenous catheter.The stem cells travel through your bloodstream to reach your bone marrow. There, they produce new blood cells to replace the abnormal ones. This process, known as engraftment, can take a few weeks. You may receive growth factor injections to speed up the process. You’ll need to stay in the hospital until your blood cell counts return to safe levels.Risks / BenefitsWhat are the benefits of an autologous stem cell transplant?A successful transplant helps many people become cancer-free or delay the progression of cancer.What are the risks associated with an autologous stem cell transplant?Each step of the stem cell transplant process carries risks. They include:Bone pain with growth factor for mobilization.Dizziness or tingling in your hands or feet during apheresis.Side effects from chemotherapy, which include pain, fatigue and nausea.Bruising easily and excessive bleeding. Many people who undergo autologous stem cell transplants need blood or platelet transfusions.Infection and other illnesses until engraftment occurs. Germs that might not have made you sick in the past can cause severe complications.Lung issues, including inflammation and pneumonia.Recovery and OutlookWhat is recovery like from an autologous stem cell transplant?Until engraftment occurs, your immune system is weak because the chemotherapy destroyed all of your blood cells. You face a higher risk of infections, which is why it’s important to stay in the hospital for the first part of recovery.Once you get home, you can expect to feel tired. Some days, you may feel more like your old self. Other days, you may be too exhausted to get out of bed. It can take several months to fully recover.You may face emotional challenges in addition to physical side effects, too. The unpredictability of recovery can make it difficult to move forward with your life. You may worry about whether the transplant will be successful.Also, medications that are part of your treatment may affect your appearance and self-image. Your healthcare provider can help you access counseling and additional resources to make this time a little easier.What’s the success rate of autologous stem cell transplants?The success rate of autologous stem cell transplants depends on various factors, such as your diagnosis and how severe your condition is. Other variables include additional medical problems you might have and how well you tolerate chemotherapy.Even if signs of disease return after a transplant, you may still have options, including novel treatments such a chimeric antigen receptor T-cell (CAR T) therapy.When to Call the DoctorWhen should I contact my healthcare provider after an autologous stem cell transplant?If you experience signs of complications, it’s essential to contact your healthcare provider as soon as possible. These include:Fever.Chills.Shortness of breath (dyspnea).Coughing, sneezing or runny nose.Frequent urination or painful urination (dysuria).Rash.Lightheadedness/dizzinessA note from Cleveland ClinicAn autologous stem cell transplant uses your own stem cells to replace damaged or diseased cells. There are many risks associated with this treatment, and it can take several months to recover. But transplants also enable some people to become cancer-free or delay the progression of cancer. The decision of whether to have a stem cell transplant is yours. Discussing the risks and benefits that apply to your unique circumstances with your physician can help you decide what’s best for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 12/02/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"