"Orthostatic Hypotension Due to Autonomic Dysfunction800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Autonomic DysfunctionAdvertisementAdvertisementAdvertisementAutonomic DysfunctionOrthostatic hypotension due to autonomic dysfunction is a nervous system issue that causes a drop in blood pressure when you stand up. This type of orthostatic hypotension happens with many common chronic conditions, especially Type 2 diabetes and Parkinson’s disease. It’s usually treatable with medication and nonmedical methods and approaches.ContentsArrow DownOverviewRisks / BenefitsWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewRisks / BenefitsWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is orthostatic hypotension due to autonomic dysfunction?Orthostatic hypotension (low blood pressure) is a condition that causes your blood pressure to drop when you stand up too quickly. Depending on why it happens and how severe it is, this drop in blood pressure — also known as postural hypotension — can cause you to feel dizzy or even pass out. This can happen anywhere between immediately to a few minutes after standing up.The treatments for orthostatic hypotension that happens with autonomic nervous system issues can take many forms. To understand those different treatments, however, it helps to know more about this condition itself.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow does orthostatic hypotension happen?Your brain has an incredibly high demand for blood flow compared to most other parts of your body. Even a few seconds without blood flow are enough to disrupt your brain function.When you stand up, gravity pulls blood downward, reducing the blood pressure in your brain. Normally, your body tries to offset this effect, raising your blood pressure when you stand up. The increased pressure farther down in your body pushes blood upward. The effect is similar to filling a balloon half-full with water. You can push the water inside the balloon upward by squeezing the bottom of the balloon.But various medical conditions can keep your body from adjusting properly, allowing the drop in blood pressure to happen. That interrupts circulation in your brain, causing this condition’s symptoms. In addition to dizziness or passing out, this condition can cause:Dimming or blurring of your vision.Nausea.Sudden leg weakness, which may cause you to fall.Headache.Chest pain.Why this happens with autonomic dysfunctionYour blood pressure is one of your body’s autonomic functions. These are processes that happen automatically without you thinking about them. A special subdivision of your nervous system, the autonomic nervous system, carries these signals to the various systems in your body.Autonomic dysfunction means there’s a problem with how your body manages these processes, keeping them from working correctly. Orthostatic hypotension is a condition that can develop because of autonomic dysfunction.This problem is relatively common because it happens with several common conditions. Some of the most common causes of autonomic dysfunction are:Type 2 diabetes.Parkinson’s disease.Multiple system atrophy.Small fiber neuropathy.What treatments are possible for orthostatic hypotension due to autonomic dysfunction?The most common forms (with more about each immediately below) are:Medications.Support garments.Diet changes.Changing certain behaviors.MedicationsMedications can have multiple roles with orthostatic hypertension that happens due to autonomic dysfunction. They can indirectly help with diagnosing it, and they can help directly by treating it.How medications help with diagnosis: Many people show the first signs of orthostatic hypertension because they’re taking medications to lower their blood pressure. That offers a clue that can help healthcare providers diagnose autonomic dysfunction. In these cases, the first treatment is often to have a person stop taking blood pressure-lowering medications.How medications help with treatment: Medications that raise blood pressure can help treat orthostatic hypertension. Many different medications can cause this effect. Many of these medications are ones you can take in pill form daily (or multiple times daily).Diet changesWhen healthcare providers advise people to lower their blood pressure, one way they often suggest doing that is by decreasing sodium intake. With orthostatic hypotension, the advice is the exact opposite. Increasing sodium intake, especially salt, can help increase your blood pressure and avoid episodes of orthostatic hypotension. The recommended amount of sodium for orthostatic hypotension is between 3 grams and 5 grams (3,000 milligrams to 5,000 milligrams) per day. However, doing this is NOT recommended without first talking to your healthcare provider.Staying hydrated is also a key part of preventing orthostatic hypotension symptoms. Dehydration can make low blood pressure much worse. Staying hydrated can help reduce or prevent these symptoms.Changing certain behaviorsOrthostatic hypotension is often worst when standing up quickly. To help avoid this, healthcare providers will often teach you how to stand up slowly. A key time to do this is when you’re getting out of bed. For these situations, providers will often offer guidance on how to get up slowly, or ways to lie down or sleep that elevate your head. Elevating your head means your body has less of a vertical height change — and less of a blood pressure drop — to compensate for when you stand.Another key time that this condition happens is after eating a big meal. Many people often experience orthostatic hypotension at these times because their body diverts blood flow to their stomach and digestive tract to help them process what they ate. Carbohydrate-heavy meals are especially prone to causing this. Healthcare providers often recommend eating smaller meals — with some caution about the quantity of carbs — to avoid this.Support garmentsSupport or compression garments, such as leggings, hosiery or socks, can apply gentle pressure to your lower legs and feet. That pressure can be enough to push some of the blood in your legs upward, making it easier for your body to maintain blood pressure in your head. You should also talk to your healthcare provider before trying this approach.AdvertisementRisks / BenefitsWhat are the advantages of treating orthostatic hypotension due to autonomic dysfunction?Treating orthostatic hypotension is important because this condition increases the risk of passing out. People who fall because they pass out are at risk for serious injuries, especially when this happens to people who are older or who have circumstances that make falling especially dangerous (such as osteoporosis or taking blood thinners, which increases bleeding risk).What are the risks or complications of this procedure?The possible complications or side effects depend on the specific treatment(s). Because there are so many different medications a person can take for this, there are many possible side effects. A healthcare provider is the best person to tell you about the side effects, complications or other possible risks with treatment.AdvertisementWhen to Call the DoctorWhen should I see my healthcare provider?You should see a healthcare provider anytime you have recurring dizziness or near-faints that happen repeatedly and unexpectedly. You should also see a healthcare provider anytime you pass out unexpectedly. That’s because passing out is a key symptom of several health conditions involving your heart, such as a heart attack or irregular heart rhythms (arrhythmias), many of which are dangerous or life-threatening.Additional Common QuestionsWhat are some ways I can prevent the symptoms of orthostatic hypotension?There are many different ways to help reduce the symptoms of orthostatic hypotension. But you should always talk to a healthcare provider before trying these. That’s because orthostatic hypotension isn’t a condition you should try to self-diagnose and self-treat. This is even more important when it happens because of autonomic dysfunction, a problem that worsens over time and ultimately has severe or dangerous symptoms.Some of the things you can do include:Strengthen your leg muscles. This can help your body maintain blood pressure in your head.Drink water immediately after getting up. Healthcare providers often recommend drinking about 17 ounces (500 milliliters) after waking up to boost the fluid volume in your body.Talk to a healthcare provider about other options to improve your physical health. Seated chair yoga, physical therapy and group exercise classes can all help with physical health, while also giving you a chance to be social and meet other people with similar challenges and concerns.Don’t neglect your mental health. People who have chronic conditions often experience mental health symptoms like anxiety or depression. Don’t ignore these. These are medical concerns, the same as orthostatic hypotension, not signs of weakness or failure.A note from Cleveland ClinicOrthostatic hypotension that happens with autonomic dysfunction is a widespread concern. Treating this issue can take many different forms. That means people who experience this condition have options that can help them reduce the impact of these symptoms or prevent them altogether. If you have the symptoms of orthostatic hypotension, it’s important to talk to a healthcare provider. Early diagnosis and treatment are always the best option and can help avoid dangerous complications like falls or injuries.Care at Cleveland ClinicParkinson's Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/25/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicParkinson's Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"