"AV Node Ablation to Treat A-Fib800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/AV Node AblationAdvertisementAdvertisementAdvertisementAV Node AblationAV node ablation is a minimally invasive treatment for atrial fibrillation and other issues in your heart’s upper chambers. It’s a permanent procedure that can’t be reversed, but it has a high success rate and quick recovery. People who have AV node ablation will always need a pacemaker.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is AV node ablation?Atrioventricular (AV) node ablation is a minimally invasive procedure offered to patients with atrial fibrillation that uses heat or cold energy to strategically damage your AV (atrioventricular) node.The AV node is a small area of tissue whose job is to send an electrical heartbeat signal from your upper chambers (atria) to your lower chambers (ventricles).After an AV node ablation, a permanent pacemaker placed before or during the procedure will take over the job of transmitting this electrical signal. This results in a more coordinated heartbeat and may improve the strength of your heart.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs to have AV node ablation?If all the other treatments for atrial fibrillation have not worked, your healthcare provider may recommend AV node ablation.With atrial fibrillation, you have irregular, rapid and disorganized electrical signals coming from your upper chambers (atria).These irregular signals result in weaker, out-of-sync contraction of your atria. This may lead to the weakening of your lower chambers (ventricles) and the overall strength of your heart.Atrial fibrillation may also result in blood clots forming in your upper heart chambers, which may come loose and cause a stroke.Candidates for AV node ablation include those who:Already have a pacemaker.Can't tolerate medications to control abnormal heart rhythm due to side effects.Have failed to control abnormal heart rhythm with medications or other procedures such as pulmonary vein isolation.How serious is AV node ablation?Atrial fibrillation is a serious problem that needs treatment, but AV node ablation isn’t for everyone. AV node ablation is serious because it’s not reversible. Also, people who have it will need a pacemaker for life.AdvertisementWhat does AV node ablation treat/manage?AV node ablation treats abnormal heart rhythms that happen in your heart’s upper chambers (atria). These conditions include:Atrial fibrillation.Supraventricular arrhythmias.Atrial flutter.Procedure DetailsWhat happens before AV node ablation?If you don’t already have one, you’ll need a permanent pacemaker several weeks before your atrioventricular node ablation. Sometimes it’s done in the same procedure or after AV node ablation.Your healthcare provider will do an electrophysiology study, where they map the electrical signals of your heart and locate exactly where the AV node is located.The initial steps of the procedure include:Placing a small IV in your arm and give you sedatives.Numbing an area on your arm, groin, or neck.Placing tiny catheters (long, flexible, thin tubes) into the veins in your arm, groin, or neck.AdvertisementWhat happens during AV node ablation?Once the catheters are in place, the provider will:Continuously monitor your vital signs and heart rhythm.Use X-ray guidance and electrical mapping to advance the catheters to the AV node.Use a special catheter tip that applies heat (radiofrequency ablation) or cold (cryoablation) energy to burn the AV node.What happens after AV node ablation?After atrioventricular node ablation, your healthcare provider will:Remove the catheters.Press (about 15 minutes) on the areas where catheters went into your skin.Ask you to lie on your back for a few hours.AV node ablation and pulmonary vein isolationPulmonary vein isolation (PVI) is a similar procedure that people may get instead of an AV node ablation to treat atrial fibrillation. The disorganized electrical signals causing atrial fibrillation originate from the pulmonary veins, which enter your top chambers (specifically, the left atrium). In pulmonary vein isolation, heat or cold energy is used to create scar tissue around the pulmonary veins, with the goal of getting rid of the atrial fibrillation.It isn't always necessary to have a pacemaker after PVI, while it is with AV node ablation. However, pulmonary vein isolation has only a 60% to 80% success rate. Up to 5% of people can have complications from pulmonary vein isolation.Care at Cleveland ClinicCardiology CareMake an AppointmentRisks / BenefitsWhat are the advantages of AV node ablation?AV node ablation has multiple benefits, including:An improved heart rhythm without drugs to control it. (You may need to keep taking blood thinners, though.)Improved symptoms and quality of life.Ability to exercise more.Fewer hospitalizations and emergency visits for heart failure.What are the risks or complications of AV node ablation?Complications are rare, but may include:Problems with the pacemaker your healthcare provider implants before or after AV node ablation.Ventricular arrhythmias (abnormal heart rhythms).Sudden death.Decreased function of the left ventricle (which can be fixed by placing an extra pacemaker lead for what is called biventricular pacing).Is AV node ablation safe?Yes, multiple studies (including one with 9,000 people) have found atrioventricular node ablation to be safe.Is AV node ablation reversible?No. AV node ablation isn’t reversible. It’s a permanent procedure. That’s why people who have it will need a pacemaker for the rest of their lives.Recovery and OutlookWhat is the recovery time?Although the procedure takes several hours, the recovery time for AV node ablation is short. You may spend one night in the hospital and go home the next day.When can I go back to work?You’ll probably feel tired for a couple of days after your atrioventricular node ablation. You also may feel sore. After a few days, you’ll be able to go back to doing the things you normally do.What is the life expectancy after AV node ablation?Researchers who checked in with people for up to four years after they had AV node ablation found a death rate between 12% and 41%. Another study that followed up for more than eight years found a 23% death rate.What is the success rate of AV node ablation?The success rate of AV node ablation is 90% or higher.When to Call the DoctorWhen should I see my healthcare provider?One month after you get a pacemaker, you’ll need a follow-up appointment with your provider. After that, they’ll want to see you once or twice a year.Contact your provider if have signs of infection (even months after getting your pacemaker), including:Fever.Chills.Pain in the area where your pacemaker is located.Contact your provider if you think your pacemaker isn’t working. Signs include:Dizziness.Fainting.Shortness of breath.A note from Cleveland ClinicDeciding to have AV node ablation may not be easy because it’s not reversible, and some people aren’t comfortable with needing a pacemaker for the rest of their lives. Still, the success rate for this procedure is high. Talk with your healthcare provider about your choices and any questions you may have. Once you have the information you need, you can make an informed decision that makes sense for your situation.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/05/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicCardiology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"