"Ileostomy: What Is It, Surgery, Complications & Recovery 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/IleostomyAdvertisementAdvertisementAdvertisementIleostomySurgeons perform ileostomies when your colon or rectum can’t be used to eliminate digestive waste (poop). An ileostomy is used to treat several conditions. Some conditions involve surgery that requires a temporary ileostomy that will be reversed when you recover from the initial surgery. Other conditions call for permanent ileostomies.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is an ileostomy?Sometimes illness or medical treatment disrupts how your body gets rid of digestive waste (poop). Surgeons perform ileostomies when the large intestine can’t be used to store and move waste.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy would someone need an ileostomy?An ileostomy is used to treat several conditions. Some conditions involve surgery that requires a temporary ileostomy that will be reversed when you recover from the initial surgery. Other conditions call for permanent ileostomies.Surgeries that might involve temporary ileostomies include:Colorectal cancer.Diverticulitis surgery.Ulcerative colitis surgery.Crohn’s disease.Familial adenomatous polyposis surgery.Conditions that might call for permanent ileostomies include:Crohn’s disease.Colonic motility dysfunction.Blocked, damaged or ruptured large intestines.What are the different types of ileostomy?Based on your condition, your healthcare provider may recommend a permanent or temporary ileostomy.Permanent IleostomyPermanent ileostomies use external or internal pouches called ileal pouches to collect and store digestive waste.The standard or Brooke ileostomy is the most common ileostomy. Standard ileostomies use external pouches.In the standard or Brooke ileostomy (also known as an end ileostomy), surgeons pull the ileum up and through an incision in the abdomen. Then they turn the ileum inside out and suture it to the abdomen to create a stoma. Waste coming through the stoma is deposited into an external pouch. Since the flow of waste can’t be controlled, the external pouch has to be worn all the time.Temporary IleostomyTemporary ileostomies are reversible procedures done after bowel surgery so the bowel can rest and heal. Temporary ileostomies are also used as the first step in performing a permanent ileostomy called an ileoanal reservoir or J-pouch. In some circumstances, surgeons might make a temporary loop ileostomy so the new pouch can heal. The temporary loop ileostomy is later removed.The J-pouch and K-pouch ileostomies use internal pouches. (Internal pouches were first used in 1978 when the S-pouch was introduced. Pouch types are often named after the shape of the pouch used.)The J-PouchThe J-pouch, also known as the pelvic pouch or ileoanal reservoir, is a common reason for an ileostomy. A J-pouch is performed when the large bowel has been completely removed and can allow waste to exit through the anus.Constructing a J-pouch requires several stages. As with the standard or Brooke ileostomy, the procedure begins with surgeons making an incision in the abdomen to reach the ileum. The ileum is pulled through the incision to create a temporary end stoma. The temporary stoma will route waste to an external ileostomy pouch. The large bowel is removed during this stage.In the second step, surgeons use ileum loops to make a pouch to place in the pelvis. The pouch connects to the anus. Waste then passes from the small intestine into the pouch. It is stored there until there is an urge to poop so that waste can pass through the anus. In some circumstances, surgeons might make a temporary loop ileostomy so the new pouch can heal. The temporary loop ileostomy is later removed.The K-pouchThe K-pouch is known as the continent or Kock ileostomy. The K-pouch requires a stoma but does not require an external ileostomy pouch. The K-pouch is less common than the J-pouch.As with a standard ileostomy, the ileum is pulled up and through the abdominal incision. Surgeons use loops from the ileum to make an internal pouch and a valve so that waste can be stored without leaking through the ileostomy. People empty the pouch by inserting a catheter through the stoma to drain the pouch.AdvertisementProcedure DetailsWhat happens before an ileostomy?Before the surgery, you will be given general anesthesia. Your healthcare provider will tell you about any steps you should take prior to surgery, such as fasting.What happens during an ileostomy?All ileostomies begin with your surgeon making a small incision in the right side of your abdomen so they can reach the last part of the small intestine (the ileum.) They might do this as a surgical incision or by using laparoscopic surgery.AdvertisementWhat happens with laparoscopic surgery?This is surgery done with a laparoscope. A laparoscope is a thin tube-shaped instrument with a light and a lens to guide the surgery. The laparoscope might also have a tool to remove tissue to be examined under a microscope for signs of disease. Laparoscopic surgery can help reduce blood loss during surgery and pain after surgery.In a standard ileostomy, surgeons use a laparoscope to create a small opening and then bring a loop of the ileum through the incision. The ileum is turned inside out to expose the inner surface. This is the stoma.What does a stoma look like?Most stomas look like the inside of your cheek, as they are pink or red. They feel warm and moist. Some stomas secrete a small amount of mucus.A stoma is round or oval.A stoma can lie flat against your abdomen or stick up a bit. Stomas do shrink some after surgery.Stomas are also used for continent or Kock ileostomies or K-pouch procedures. Ieloanal reservoir procedures, also known as J-pouch procedures, require temporary stomas.In K-pouch procedures, surgeons pull the ileum up and through the abdominal incision to create a stoma. Then they use loops from the ileum to make an internal pouch with a nipple valve. To empty the internal pouch, people insert a catheter through the stoma to drain the pouch.In J-pouch procedures, surgeons create temporary stomas that are reversed once internal pouches are placed in the pelvis and connected to the anus. Waste that passes into the pouch remains in the pouch until you have an urge to poop. Waste then passes through the anus.People who do not have K-pouch or J-pouch ileostomies use ileostomy bags to collect poop.What is an ileostomy bag?Ileostomy bags collect poop discharged through the stoma. An ileostomy bag is a small pouch that lies flat on the abdomen. Ileostomy bags are attached to the stoma, which is the small opening in the abdomen that routes poop from the small intestine.Can I control when my poop passes from the stoma into my ileostomy bag?If you have a standard ileostomy, you won’t be able to control when poop passes since stomas do not have a valve or muscle that will shut off and on. With a continent ileostomy, there is an external stoma that serves as a valve.Risks / BenefitsWhat are the risks of an ileostomy?Most surgeries involve weighing the risks against the benefits. Every person’s circumstance is different.Be sure to talk to your healthcare provider about your circumstances, the health benefits of ileostomies and typical risks. The following risks have been associated with ileostomies:Bleeding inside the small intestine or from the stoma.Damage to nearby organs.Infection (pouchitis).Not being able to absorb enough nutrients from food.Intestinal blockage caused by scar tissue.Recovery and OutlookAn ileostomy is a major surgery and requires some recovery time. You might remain in the hospital for up to one week. Your small intestine needs to heal for you to completely recover, and that might take up to two months.If you have a temporary ileostomy, you will probably have reversal or closure surgery. Reversal surgery might be done three to six months after your ileostomy.When can return to my normal activities such as going to work, driving or exercising?Once your ileostomy has healed, you should be able to resume most daily activities such as driving, going to work, exercising or playing sports and having sex.Will someone show me how to take care of myself after surgery?We know people might have questions or concerns about living with an ileostomy, even on a short-term basis.People who have ileostomies work with specially trained nurses, sometimes called wound ostomy continence nurses or ostomy nurses. These nurses coordinate care and teach people with ileostomies how to care for themselves.For example, the nurse will discuss ileostomy diets and how to take care of your ileostomy bag.Is there a specific ileostomy diet I should follow to help with my recovery?Your ostomy nurse will help you establish an ileostomy diet. Here are some general guidelines to help you get started:Focus on simple, bland foods during the first few weeks after your surgery.Thoroughly chew your food and hydrate. Chewing food and drinking lots of liquids helps digestion.Eat small meals at regular times during the day and evening.Hydrate. Drinking lots of liquids helps digestion.What foods should I avoid?In general, avoid any food that is hard to digest such as nuts, popcorn, seeds or crunchy vegetables. Your ostomy nurse will help you identify foods you should avoid.How do I take care of my ileostomy bag?Your ostomy nurse will walk you through ileostomy bag care and answer your questions.When should I empty my ileostomy bag?You should empty your ileostomy bag when it is about one-third to one-half full. That way the bag won’t bulge or leak.How do I empty my ileostomy bag?To empty the bag, you can either sit far back on the toilet or in front of the toilet. Unclip the end of the bag and roll it out so you can empty the contents into the toilet. Use toilet paper to clean the bag inside and out, and then roll it up and re-clip the bag.Will my ileostomy bag smell bad?There are several ways to reduce or eliminate odor, including:Avoid foods that produce odor such as eggs, cabbage, cheese, cucumber, onion, garlic, fish, dairy and coffee.Confirm the piece of the pouching system that sticks to your body is tightly fastened.Empty the pouch frequently.Use an odor-resistant pouch.Talk to your provider about special odor-reducing tablets or liquids you can put in your pouch.Your provider might also have suggestions for a medication you can take to reduce odor.Will I have gas (flatulence)?Most people with ileostomies report having lots of gas (flatulence). Certain foods and beverages can increase gassiness.Talk to your healthcare provider about foods and beverages you should avoid. Eating regular meals and eating smaller amounts of food four to five times a day helps to reduce gassiness.You might also notice your stomach making a loud rumbling noise, like the noise our stomachs might make when we are hungry. You can muffle the rumbling sound by pressing your arm against your ileostomy bag.How do I care for the skin around my stoma?The output from your stoma might make the skin around the stoma tender or sore. Here are suggestions to prevent problems:Clean the skin around the stoma with water. Dry the skin completely before putting on the skin barrier or pouch.Check your skin barrier opening and pouch for the right fit. Openings that are too small might cause your stoma to swell. Openings that are too large might let poop out.Set a regular schedule for changing your pouch to avoid leaks and skin irritation.Be gentle when pulling the pouching system away from your skin. Don’t pull the skin barrier away from your skin. Instead, push your skin away from the barrier.Unless there’s a problem, don’t remove the pouching system more than once a day.When to Call the DoctorYou should call your healthcare provider when you have:Cramps lasting more than two or three hours.Continuous nausea and vomiting.Cramps and nausea if you go more than four to six hours since your stoma has moved poop, and you’re having cramps, pain or nausea. These symptoms might mean you have a bowel obstruction.Bad odor lasting more than a week. (This may be a sign of infection.)A cut in the stoma.Injury to the stoma.Bad skin irritation or deep sores (ulcers).Additional Common QuestionsWhat is the difference between an ileostomy and a colostomy?Ileostomies and colostomies perform the same function. The difference is a colostomy creates a pathway from the large intestine rather than the small intestine.A note from the Cleveland ClinicAn ileostomy can be a life-changing event, even if the ileostomy is temporary. People who have ileostomies might have difficulty adjusting to routines that ileostomies require. Talk to your healthcare provider any time you have questions about living with an ileostomy. In addition to offering treatment, your provider can direct you to support organizations.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/17/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"