"How Immunotherapy Works To Treat Cancer 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/ImmunotherapyAdvertisementAdvertisementAdvertisementImmunotherapyImmunotherapy for cancer uses your body’s immune system to find and destroy cancerous cells. There are several different immunotherapy types, but all immunotherapy works by training your immune system so it can do more to fight cancer. Immunotherapy may help some people with cancer to live longer.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewImmunotherapy is cancer treatment that helps your immune system fight cancer. Healthcare providers typically use immunotherapy to treat advanced cancer, cancer that hasn’t respond to other treatments and cancer that’s come back. There are five types of immunotherapy, including checkpoint inhibitors, adoptive cell therapy, cancer vaccines, monoclonal antibodies and immune system modulators.What is immunotherapy?Immunotherapy is a cancer treatment that uses your body’s immune system to find and destroy cancer cells. Your immune system identifies and destroys intruders, including cancerous cells. Immunotherapy boosts your immune system so it can do more to find and kill cancer cells.Immunotherapy for cancer is a very effective treatment that may help some people with cancer live longer. Medical researchers are developing new immunotherapy drugs to treat more types of cancer.How does immunotherapy work?Your immune system’s everyday job is to protect your body from intruders, from allergens and viruses to damaged cells that could become cancerous. It has special cells that constantly patrol your body for intruders. When they find a damaged or cancerous cell, they destroy it. That keeps cancerous tumors from growing and spreading. But cancer is a moving target. Cancerous cells constantly look for ways to dodge immune system defenses. Immunotherapy works by:Training your immune system so it can do more to find and kill cancer cells.Helping your body produce cancer-fighting immune cells that effectively locate and destroy cancer cells.What cancers does immunotherapy treat?Healthcare providers consider immunotherapy a first-line or initial treatment for many types of metastatic cancer, or cancer that’s spread. They may combine immunotherapy with chemotherapy, targeted therapy or other cancer treatments. Providers use different types of immunotherapy to treat many kinds of cancer. Each immunotherapy type uses different elements of your immune system.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are types of immunotherapy?Immunotherapy types include:Checkpoint inhibitors.Adoptive cell therapy (T-cell transfer therapy).Monoclonal antibodies.Cancer vaccines.Immune system modulators.Checkpoint inhibitorsYour immune system is a powerful defense system — sometimes too powerful. Your body has checkpoints to keep your immune system from overreacting to intruders and damaging healthy cells.For example, your bone marrow makes white blood cells called T lymphocytes, or T-cells. T-cells protect your body from infection and tackle cancer cells. Immune checkpoints connect with proteins on the surface of T-cells.How checkpoint inhibitors workCheckpoint proteins and other proteins manage the flow of signals to T-cells, telling the cells when to turn off and on. (Think traffic monitors that manage traffic flow by switching traffic lights off and on.) T-cells turn on to kill cancerous cells. They turn off so they don’t damage normal cells.Checkpoint inhibitors are immunotherapy drugs that work by breaking the connection between the checkpoint proteins and other proteins. Breaking the connection keeps protein cells from telling T-cells to turn off. That way, T-cells keep on killing cancerous cells.What cancers are treated with checkpoint inhibitors?Healthcare providers typically use checkpoint inhibitors to treat many different types of cancer. In general, providers use checkpoint inhibitors to treat advanced cancer, cancer that’s spread, cancer that can’t be treated with surgery or cancer that hasn’t responded to other treatments. They may combine checkpoint inhibitor drugs with other treatments, including chemotherapy or targeted therapy. The list below is expected to grow as medical researchers find ways to use immunotherapy to treat many more kinds of cancer:Bladder cancer.Cervical cancer.Esophageal cancer.Head and neck cancer.Hepatocellular carcinoma.High-risk triple-negative breast cancer.Kidney cancer.Melanoma.Mesothelioma.Non-small cell lung cancer.Adoptive cell therapy (T-cell transfer therapy)This treatment improves your immune system’s ability to destroy cancerous cells. Healthcare providers take your immune cells and grow them in a laboratory. Once your cells have grown, providers insert the cells back into your body so they can kill cancerous cells. CAR T-cell therapy and tumor-infiltrating lymphocyte therapy are the two main types of T-cell transfer therapy.How CAR T-cell therapy worksChimeric antigen receptor (CAR) T-cell therapy works by turning your T lymphocytes, or T-cells, into more efficient cancer-fighting machines. Your T-cells are white blood cells in your immune system. Your immune system monitors your body for intruders, such as cancerous cells, by tracking proteins called antigens that are located on the surface of intruder cells. Your immune system relies on T-cells to track and kill intruders.Your T-cells have their own proteins called receptors. Receptors are like the anti-virus software on your computer. When your T-cell security team senses intruder antigens, they use their receptors to catch and block the intruders. More than that, your T-cells can kill the intruders. But antigens have their own form of protection. They can disguise themselves to hide from your T-cells. CAR T-cell therapy ensures your T-cells aren’t fooled by antigens in disguise.Cancers treated with CAR T-cell therapyCAR T-cell therapy treats certain blood cancers, including some types of leukemia, lymphoma and multiple myeloma. Medical researchers are investigating CAR T-cell therapy as a way to treat breast cancer and brain cancer.How tumor-infiltrating lymphocytes (TIL) workTumor-infiltrating lymphocytes (TIL) act like a small group of soldiers doing reconnaissance into enemy territory. TIL cells can sneak close to or into cancerous tumors, but they can’t put up an effective fight against the cells because they’re outnumbered. They can’t call for reinforcements because they can’t keep cancerous cells from sending signals that suppress your immune system.In TIL therapy, healthcare providers grow larger and stronger TIL cells. They take the cells from tumors and treat them with substances so the TIL cells will grow. When the new and improved TIL cells are returned to the cancerous tumors, they’re able to kill cancerous cells and disrupt signals suppressing your immune system.Cancers treated by TILThe U.S. Food and Drug Administration (FDA) hasn’t approved TIL therapy as a standard cancer treatment. Medical researchers are studying TIL therapy as a way to treat melanoma, cervical squamous carcinoma and cholangiocarcinoma (bile duct cancer).Monoclonal antibody therapyAntibodies are part of the first line of defense when your immune system detects intrudes. Antibodies are proteins that fight infection by marking intruders so your immune system will destroy them. Monoclonal antibody therapy for cancer involves lab-made antibodies that can support your existing antibodies or become their own attack force.How monoclonal antibodies workThe lab-made antibodies may attack parts of a cancerous cell. For example, they may block abnormal proteins in cancerous cells. Monoclonal antibodies can also target cancerous cells for special delivery of drugs, toxins or radioactive material that can kill cancerous cells. (Healthcare providers consider monoclonal antibody therapy a form of targeted therapy. In targeted therapy, providers target a cancer’s specific genes, proteins or the tissues where tumors are growing.)Cancers treated with monoclonal antibody therapyThe FDA has approved more than 60 different monoclonal antibody drugs that treat a wide range of cancer. Common types of cancer treated by different monoclonal antibodies include:Bladder cancer.Breast cancer, including triple-negative breast cancer.Colorectal cancer.Lymphomas, including non-Hodgkin lymphoma, cutaneous T-cell lymphoma and B-cell lymphoma.Leukemia, including acute lymphoblastic leukemia, hairy cell leukemia, acute myeloid leukemia and chronic lymphocytic leukemia.Multiple myeloma.Non-small cell lung cancer.Cancer vaccinesVaccines protect your body against certain diseases. Some vaccines, such as the vaccine against human papillomavirus (HPV), protect against an infectious disease that’s linked to anal cancer, throat cancer and penile cancers. These vaccines prevent you from getting an infection that can later lead to cancer. Cancer vaccines don’t prevent cancer. But if you develop cancer, cancer vaccines train your body to fight it.How cancer vaccines workVaccines that protect against cancer work by helping your immune system identify antigens in cancerous cells. Just like other kinds of vaccines, cancer vaccines use all or part of cancerous cells to help your body identify a harmful tumor in your body.Medical researchers are evaluating different ways to make cancer vaccines. The FDA has approved a cancer vaccine that uses an immune cell that responds to specific antigens on prostate cancer cells.Immunomodulators/immune system modulatorsImmunomodulators are substances that boost your body’s response to cancer. Immune system modulators include cytokines, BCG and immunomodulatory drugs.CytokinesCytokines are proteins that manage your immune system’s response to intruders, including cancerous cells. They help manage immune cell and blood cell growth and activity.For example, cytokines signal your immune system when it’s time to take care of intruders such as cancerous cells. They drive communication between immune system cells so the cells can coordinate attacks on specific cancerous targets. Cytokines also help destroy cancerous cells by sending signals that may help healthy cells to live longer and cancerous cells to die. Healthcare providers treat cancer with two different cytokines:Interferons: Interferons help your immune system fight cancer and slow cancer cell growth. Healthcare providers may use lab-made interferons to treat many different types of cancer.Interleukins: These proteins start an immune response and help immune system cells to communicate. A specific interleukin, IL-2, increases the number of white blood cells in your body. This includes T-cells and B-cells, which help fight cancer. Like interferons, providers may use lab-made interleukins to treat cancer, specifically melanoma and kidney cancer.Immunomodulatory drugsImmunomodulatory drugs, also called biologic response modifiers, are medications that boost your immune system. Some of these drugs keep cancerous tumors from developing new blood vessels. Healthcare providers may use these drugs to treat people with advanced forms of certain kinds of lymphoma. Immunomodulatory drugs include:Thalidomide (Thalomid®).Lenalidomide (Revlimid®).Pomalidomide (Pomalyst®).Imiquimod (Aldara®, Zyclara®).Thalidomide, lenalidomide and pomalidomide make cells release the cytokine IL-2. IL-2 helps your body make additional white blood cells to fight cancer. The three drugs also help stop cancerous tumors’ growth. They do that by preventing the tumors from developing the new blood vessels the tumors need to keep growing. Another immunomodulatory drug, imiquimod, makes cells release cytokines.Thalidomide, lenalidomide (Revlimid) and pomalidomide (Pomalyst) are classified as immunomodulatory drugs, which stimulate your immune system. These drugs also keep new blood vessels from forming and feeding myeloma cells.Thalidomide and lenalidomide are approved to treat people who are newly diagnosed. Lenalidomide and pomalidomide are also effective for treating recurrent myeloma. These drugs stimulate your immune system. Some drugs keep cancerous tumors from forming the new blood vessels the tumors need to grow. Healthcare providers often use these drugs to treat metastatic cancer.What are immunotherapy side effects?Like most cancer treatments, immunotherapy causes side effects that can affect your daily life. Your immune system protects your entire body. Immunotherapy modifies your immune system so it’s a more effective cancer-fighting process.But immune cells may attack healthy cells, causing inflammation in healthy tissue. This is an immune-related adverse effect, or irAE. About 20% of people receiving immunotherapy have severe irAE. Side effects include:Fatigue.Itchy rash.Diarrhea.Nausea and vomiting.Decreased thyroid hormone levels.AdvertisementProcedure DetailsHow do people receive immunotherapy?People receive immunotherapy through an intravenous (IV) infusion. You may receive immunotherapy daily, weekly, monthly or in a cycle. With cyclic immunotherapy, you take a rest period after treatment. The break gives your body time to produce healthy cells. Treatment length depends on:Cancer type and stage.Type of immunotherapy drug.Your body’s response to treatment.Care at Cleveland ClinicGet Cancer CareMake an AppointmentRisks / BenefitsWhat are the benefits of immunotherapy treatment?Immunotherapy may be an effective treatment for cancers that haven’t responded to traditional treatment or that have come back after traditional treatment.AdvertisementWhat are the risks or complications?Immunotherapy doesn’t work on all kinds of cancer and it may not work for every person who receives treatment. Most immunotherapy treatments cause side effects. If your healthcare provider recommends immunotherapy, they’ll explain specific treatment side effects and ways they’ll help you manage those side effects.Recovery and OutlookCan immunotherapy cure cancer?No, but immunotherapy can control cancer so people can live longer. In some cases, it slows down cancer’s growth. In other cases, it may shrink cancerous tumors. Unfortunately, not everyone who receives immunotherapy responds to treatmentWhat questions should I ask my healthcare provider?Immunotherapy is a relatively new area of focus for cancer treatment. You may not know much about the treatment. If immunotherapy is an option for you, you may have the following questions for your healthcare provider:What type of immunotherapy do you recommend?Will I receive other cancer treatment?What immunotherapy clinical trials are open to me?How will I receive immunotherapy treatment?How long will each treatment take? How often will I need to get this treatment?What are the possible short-term side effects of immunotherapy? How can these be managed?What are the possible long-term side effects of this immunotherapy? How can these be managed?What side effects should I let you know about right away?How will this treatment affect my daily life? Will I be able to work, exercise and do my usual activities?How will we know if this immunotherapy is working?When to Call the DoctorWhen should I see my healthcare provider?Most of the time, immunotherapy side effects are mild, but some side effects require immediate medical treatment. You should contact your healthcare provider any time you have immunotherapy side effects that are more severe than usual.A note from Cleveland ClinicImmunotherapy for cancer helps your immune system do more to find and kill cancerous cells. Healthcare providers may recommend immunotherapy if you have certain kinds of advanced cancer or if traditional treatments have stopped working. Immunotherapy is an effective treatment for many kinds of cancer, but not all kinds of cancer. And not everyone with cancer responds to immunotherapy treatment. That said, medical researchers are finding new ways to use immunotherapy so it can do more to manage cancer and help people live longer. If you have cancer and wonder if immunotherapy might be effective, talk to your healthcare provider. They’re your best resource for information.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/15/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Cancer CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"