"Immunotherapy for Breast Cancer800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Immunotherapy for Breast CancerAdvertisementAdvertisementAdvertisementImmunotherapy for Breast CancerImmunotherapy treats breast cancer by boosting your immune system so it can do more to kill cancerous cells. Healthcare providers may use immunotherapy to treat high-risk early-stage and metastatic triple-negative breast cancer. There are hundreds of clinical trials evaluating immunotherapy as a way to treat different types of breast cancer.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewWhat is immunotherapy for breast cancer?Immunotherapy for breast cancer is treatment that helps your immune system attack and kill breast cancer cells. Healthcare providers now use immunotherapy to treat high-risk curable (early-stage) and metastatic triple-negative breast cancer.Early stage means tests detect the tumors before they metastasize (spread). High-risk means tumors are likely to come back (recur) after treatment. Researchers are also evaluating immunotherapy as treatment for HER2-positive and ER-positive breast cancer.How does immunotherapy for breast cancer work?Immunotherapy trains your immune system so it can do more to find and kill cancer cells. It also helps your body produce cancer-fighting immune cells that find and destroy cancer cells. Breast cancer immunotherapy can be active or passive:Active immunotherapies are drugs that focus your immune system on breast cancer cells. To create these drugs, healthcare providers examine your breast cancer cells for antigens. Your healthy cells have antigens. So do intruders like cancer cells. Providers use what they learn about specific antigens to make drugs that focus your immune system on antigens in breast cancer cells.Passive immunotherapies are lab-made drugs that improve your immune system’s existing cancer-fighting tools.What immunotherapy drugs treat breast cancer?The U.S. Food and Drug Administration (FDA) has approved two immunotherapy drugs for breast cancer treatment: pembrolizumab and dostarlimab.Pembrolizumab (Keytruda®)Healthcare providers may use this drug to treat triple-negative breast cancer. This drug boosts your immune system’s response to cancerous cells. It also blocks a protein on cancer cells that lets the cells hide from your immune system. About 20% of triple-negative breast cancers have this specific protein. You may receive this medication before and after breast cancer surgery to reduce the risk that breast cancer will come back.Providers may use pembrolizumab to treat metastatic breast cancer that is triple negative, but only if the breast cancer tumor carries specific tumor markers (biomarkers) that signal changes in your DNA that lead to cancer.Dostarlimab (Jemperli®)This drug treats metastatic breast cancer that’s spread during or after treatment and that has a specific tumor marker.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow would I receive immunotherapy?Healthcare providers inject the drugs into your veins through an intravenous (IV) line. Specific treatment depends on your situation, but most people receive immunotherapy every three to six weeks for months up to two years.Care at Cleveland ClinicBreast Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of immunotherapy for breast cancer?Immunotherapy is an effective option to improve the cure rate for triple-negative breast cancer. It’s also an option for certain metastatic breast cancers.What’s the success rate for immunotherapy for breast cancer?This treatment is relatively new and only approved to help people with high-risk triple-negative breast cancer and triple-negative metastatic breast cancer. One groundbreaking study showed people with triple-negative breast cancer who received the immunotherapy pembrolizumab and chemotherapy lived longer than people receiving chemotherapy alone.There are hundreds of clinical trials evaluating different ways that immunotherapy may be a treatment for more types of breast cancer or different breast cancer stages. Immunotherapy treatments will continue to evolve as researchers learn more about ways the body’s immune system can slow breast cancer’s progress.AdvertisementWhat are common side effects?People react to immunotherapy in different ways. If you’re receiving immunotherapy, ask your healthcare provider what you can expect. Some common immunotherapy side effects are:Diarrhea.Fatigue.Skin rash.Thyroid issues.Other, more serious side effects occur less often:Infusion reactions: Symptoms may include fever, chills, itchy skin, feeling dizzy or a flushed face. You might have trouble breathing or begin to wheeze.Autoimmune reactions: Sometimes, your immune system starts to attack other areas of your body, causing a variety of issues.When to Call the DoctorWhen should I see my healthcare provider?Ask your healthcare provider to explain potential side effects and when you should contact them.A note from Cleveland ClinicImmunotherapy is an effective treatment for hard-to-treat triple-negative breast cancer. It’s too soon to say how immunotherapy will continue to change how healthcare providers treat breast cancer. But it’s not too soon to be hopeful about its potential. There are hundreds of clinical trials assessing different ways immunotherapy may be an effective treatment against breast cancer. If you have breast cancer, ask your provider if you’re a candidate for a clinical trial. They’ll be glad to answer your questions.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/19/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicBreast Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"