"Implantable Cardioverter Defibrillator (ICD)800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Implantable Cardioverter Defibrillator (ICD)AdvertisementAdvertisementAdvertisementImplantable Cardioverter Defibrillator (ICD)An implantable cardioverter defibrillator (ICD) is a medical device that monitors your heart and manages heart rate when needed. It’s surgically placed under your skin and connects to your heart with thin wires (leads). The battery-powered device can deliver an electric shock to correct life-threatening arrhythmia and prevent sudden cardiac arrest.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is an implantable cardioverter defibrillator?An implantable cardioverter defibrillator (ICD) is a medical device that’s surgically placed under the skin on your chest. It consists of a battery and thin wires called leads. The battery is about the size of a stopwatch and the leads go into your heart chambers to regulate your rhythm.The battery-powered device constantly tracks heart rate and rhythm. Its pulse generator delivers an electric shock when needed to correct arrhythmia. The leads carry the shock to your heart.ICDs are used to:Correct arrhythmia, such as a heart rate or rhythm that’s irregular, too fast (tachycardia) or too slow (bradycardia).Prevent sudden cardiac arrest.Gather data about your heart’s function to help your healthcare providers make treatment recommendations.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat’s the difference: Implantable cardioverter defibrillator vs. a pacemaker?An ICD is different than a pacemaker. A pacemaker consistently maintains a normal heart rate. An ICD monitors your heart rate and intervenes only when necessary. However, some ICDs can function as pacemakers, too.Who needs an implantable cardioverter defibrillator?You may need an ICD if you have certain heart conditions that can’t be managed with other treatments. Conditions often treated with ICDs include:Brugada syndrome.Certain types of congenital heart disease.Hypertrophic cardiomyopathy.Long QT syndrome.Previous sudden heart attack (myocardial infarction) or cardiac arrest.Ventricular arrhythmia.Ventricular fibrillation.AdvertisementWho puts in an ICD?A cardiac surgeon or an electrophysiologist implants an ICD.How long do the batteries last in an ICD?ICD batteries last about seven years. Your healthcare provider should check them every three to six months.AdvertisementWhat else can an ICD do?Depending on the type of ICD you get, the device may be able to store data about your heart rhythm and keep a record. Your healthcare provider can then review that information remotely to make treatment decisions.Some ICDs can provide a range of treatments as ordered by your doctor. For example, a doctor can remotely direct the ICD to deliver a mild to strong shock as needed.Procedure DetailsWhat happens before ICD implantation?Before you get an ICD, your healthcare provider may ask you to:Fast for several hours beforehand (not eat or drink anything except water).Get blood tests, urine tests and an electrocardiogram to ensure you’re healthy enough for the procedure.Inform them if you have any bleeding disorders or if you’re taking any blood thinners.Report any allergies to contrast dye, iodine, bee stings, shellfish or medications.Tell the healthcare team if you have asthma, diabetes, kidney disease or any other medical conditions.What happens when an automatic implantable cardioverter defibrillator is implanted?An ICD procedure is usually performed in a hospital or clinic. It takes a few hours.The type of procedure you have depends on your health, the type of device and other surgical interventions you need at the same time.The transvenous approach is the most common procedure. It requires a small incision near your collarbone. Your healthcare provider threads the leads through veins and accesses your heart. But sometimes implantation requires open-heart surgery.ICD processes can vary widely. But in general, your healthcare provider will:Give you anesthesia through an IV to help you relax or put you to sleep.Numb an area on the skin with a local anesthetic.Make an incision near the collarbone, chest or abdomen (belly).Access the subclavian vein and put the wires into the heart chambers.Place the ICD in a pouch under the skin.Connect the leads to the heart and the ICD.Test the device and the wires to ensure they are connected correctly and working well.Close the incision.Test the system again before sending you to recovery.What happens after this procedure?After ICD implantation, you may feel tired and sore, especially near the incision. Your healthcare provider may suggest pain medications to make you more comfortable.Many people go home the day after surgery. Depending on your health and the type of procedure you had, you may have to stay in the hospital for a few days.Just before you go home, your healthcare provider may test the ICD system again.What does an ICD shock feel like?An ICD can be programmed to give low-energy or high-energy shocks. A low-energy shock can feel like a flutter or thump in your chest. High-energy shocks are for more severe conditions and can be painful for a moment, like a blow to the chest.How many shocks will an ICD deliver?Most people need only one shock to restore normal heart rhythm, but some may receive two or more shocks in 24 hours. Your healthcare provider can adjust the frequency and intensity of shocks.If you have three or more shocks in a short amount of time, seek immediate medical attention. That’s called an electrical storm or arrhythmia storm. It could mean you’re having a cardiac emergency or that the ICD isn’t functioning properly.Care at Cleveland ClinicArrhythmia TreatmentsFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of this procedure?An ICD can prevent life-threatening arrhythmia and sudden cardiac arrest. It also can provide important information about your heart to your cardiologist.What are the risks or complications of this procedure?ICD implantation is generally safe. But, as with any surgery, the procedure comes with risks, including:Bleeding or bruising.Collapsed lung (pneumothorax).Damage to blood vessels from the leads.Infection of the incision site.Malfunction.Movement of the device, which can tear internal tissue.Swelling.Recovery and OutlookWhat should I know about living with an ICD?If you have an ICD, carry a card in your purse or wallet to alert emergency personnel. This will help them make medical decisions if you have a medical emergency and are not able to tell them about the device.Similarly, you should tell all your healthcare providers that you have an ICD. This includes dentists and imaging technicians, who may use equipment that can interfere with an ICD’s function.What can interfere with my ICD?Some technology can interfere with an ICD’s function. Ask your healthcare provider if you should use caution with:Antitheft systems at retail stores.Citizen’s band (CB) radios and amateur “ham” radios.Electric fences, such as invisible fences for pets.Headphones used with MP3 players.Jumper cables and portable car battery chargers.Machinery that contains magnets.Metal detectors for security, such as those at airports.Some medical alert systems.Some medical procedures, such as MRI.When to Call the DoctorWhen should I call my healthcare provider?After surgery for ICD implantation, tell your healthcare provider if you develop any signs of infection:Bleeding or other fluids, like pus, coming from the incision.Fever or chills.Pain that’s getting worse or isn't getting better with time.Redness or swelling that doesn’t improve.After ICD surgery, seek medical attention immediately if you receive several shocks in a short period of time.A note from Cleveland ClinicAn implantable cardioverter defibrillator (ICD) is a medical device that constantly tracks your heart rate and rhythm, then delivers an electric shock if it detects an irregular heart rhythm. If you have an ICD, tell all your healthcare providers. And be aware of the things that can interfere with the device’s function.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/15/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicArrhythmia TreatmentsFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"