"Implanted Port: What Is It, Procedure & Management800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Implanted PortAdvertisementAdvertisementAdvertisementImplanted PortHealthcare providers use implanted ports to give IV treatments and blood transfusions directly into a vein. A port also allows easy access to a vein for blood draws. People with cancer, severe infections, kidney failure and IBD may need implanted ports. With the device, you need fewer needle sticks for certain treatments, like chemotherapy.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is an implanted port?Implanted ports are devices that make it easier for healthcare providers to access a vein. They help people who often need IV treatments or blood draws.The plastic or metal disc-shaped port is about the size of a quarter. The device goes beneath your skin in your chest, arm or abdomen. It’s usually barely visible under the skin. When you no longer need it, your provider takes it out.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the parts of an implanted port?A port has a:Septum: This soft silicone top serves as the vein access point. Special needles go into the septum for treatments or blood draws.Catheter: This thin, flexible tube connects the port directly to a vein. It links the port to your circulatory system.Who needs an implanted port?Implanted ports can help adults and children. They work for anyone who needs frequent or long-term IV treatments, blood transfusions or blood draws.Your healthcare provider may recommend a port if you or your child has:Cancer that requires chemotherapy, IV fluids or frequent blood draws.Infection that requires long-term IV antibiotics.Inflammatory bowel disease (IBD) that requires parenteral (IV) nutrition.Kidney failure that requires dialysis.AdvertisementWhat are the types of implanted ports?Types of implanted ports include:Single lumen: This port has one access point (septum). It is the most common type.Double lumen: This triangular-shaped port has two access points to a vein. Two ports are helpful if you need to get more than one medication at the same time.Power-injectable: Many single- and double-lumen ports are power-injectable. Providers can inject contrast dyes into the port to perform imaging scans like CT scans and MRIs.Procedure DetailsWhat happens before a port implant procedure?Before you get an implanted port, you may:Get blood tests to check your kidney function and how your blood clots.Give your provider a list of the medications and supplements you take.Stop taking medications like aspirin that thin the blood.Fast (not eat or drink) for a specified amount of time before the procedure.AdvertisementWhat happens during a port implant procedure?A port implant is an outpatient procedure that takes about an hour. You go home the same day, but someone should drive you.Most people get ports under the skin on the right side of their chest. Sometimes, providers place ports in the inner side of the upper arm or in abdominal skin below the ribcage.You’ll receive anesthesia to put you into a light sleep. You’ll be conscious during the procedure but won’t remember it. You’ll also get local anesthesia to numb the surgical site. A child may have general anesthesia to sleep more deeply through the procedure.To place a port in your chest, your provider:Uses continuous X-ray imaging (fluoroscopy) to guide the procedure.Makes a small incision in the neck area to reach the vein (typically the superior vena cava, jugular vein or subclavian vein).Creates an access point in the vein.Makes a small incision in the chest, arm or abdomen to place the port.Uses that incision to create a pouch under the bottom (subcutaneous) layer of skin.Places the port in the pouch of skin.Threads the catheter from the port to the vein.Uses the neck incision to connect the catheter to the vein.Performs a chest X-ray to make sure the device is in the right spot.Closes the incisions with dissolvable stitches.What happens after a port implant procedure?You may be able to feel or see a slight bulge in the skin from the port. Nonsteroidal anti-inflammatory drugs (NSAIDs) can ease any pain after the placement procedure. You won’t see the port or its rubber cap once the incision heals.You’ll need to wear a bandage over the incision site. Once the incision heals, you shouldn’t have any discomfort. Avoid lifting anything heavy or doing strenuous activity until your provider gives the OK.How do implanted ports work?You may go to your provider’s office to receive treatments. For your child, your provider can teach you how to give some treatments at home using the port. Blood draws and transfusions take place at a healthcare facility.To give IV treatments, you or a healthcare provider:Apply an anesthetic cream to numb the skin over the port (if needed). Over time, the skin over the port thickens, making it less sensitive to needle sticks.Sterilize the skin with an antiseptic.Place a sterile dressing (bandage) on the skin covering the port to lower infection risk.Insert a thin needle into the septum (silicone top).Administer the medicine (or draw blood) and gently remove the needle.Use another needle to flush the device with a solution that helps prevent blood clots.Gently remove the needle and cover the site with a bandage. This dressing is clear so you can watch for signs of infection, like red streaks.How long will I have an implanted port?Ports can last for years. They can handle up to 2,000 needle sticks before replacement becomes necessary. Depending on your treatment plan, you may only need a port for a few weeks or months.How are implanted ports removed?Port removal is faster than placement. You shouldn’t need anesthesia. You may want to take NSAIDs afterward if you have pain.Your provider:Applies numbing cream to the skin.Makes a small incision in the skin at the port site.Gently pulls on the catheter to dislodge it from the vein.Removes the port and catheter through the incision.Uses dissolvable stitches to close the incision.Care at Cleveland ClinicSchedule General SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of an implanted port?An implanted port offers many benefits. With the device, you can have:At-home treatments like chemotherapy or dialysis.Fewer times you get stuck with a needle.More than one medicine at a time (if you have a double-lumen port).Multiple blood tests and treatments in the same day with just one needle stick.Treatments (such as strong antibiotics) that last multiple days.The port reduces your risk of:Pain, bruising, bleeding and infections.Leaks of IV fluid from a vein and into nearby tissues.Vein damage (such as from strong chemotherapy) or ruptures.What are the potential risks or complications of an implanted port?About one in three people have problems with implanted ports. Infections are the most common complication. Any infection raises the risk of a potentially life-threatening infection called sepsis.Other potential complications include:Blockages in the port or catheter.Blood clots in the catheter or vein.Collapsed lung (pneumothorax).Cracked port.Dislodged catheter tip.Embolism (air bubble in a blood vessel).Hemothorax (blood that pools in the pleural cavity between the chest wall and lungs).Recovery and OutlookHow do I care for an implanted port?The skin covering the port doesn’t need any special care. If you aren’t receiving regular treatments, you or your provider will flush out the port and catheter once a month. Flushing lowers the risk of clots and blockages. It keeps the line open and ready for the next use.Do I need to restrict activities while I have an implanted port?After the incision site heals, you can resume most activities. You should check with your healthcare provider about participating in contact sports like football or high-impact activities.When to Call the DoctorWhen should I call the doctor?You should call your healthcare provider if you experience:Bleeding or fluid around the port site.Dizziness or fainting.Shortness of breath.Signs of infection, such as fever or redness, swelling and warmth at the port site.Swelling in the arm on the same side as the port.A note from Cleveland ClinicImplanted ports make it easier for you or your child to get prolonged treatments or blood draws for certain chronic illnesses. Once in place, a port is barely noticeable. It shouldn’t interfere with most daily activities. Your healthcare provider can discuss the pros and cons of using an implanted port.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/25/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule General SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"