"Incontinence After Prostate Cancer Surgery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Incontinence After Prostate SurgeryAdvertisementAdvertisementAdvertisementIncontinence After Prostate SurgeryProcedures like the urethral sling and artificial urinary sphincter may reduce the risk of urinary incontinence after prostate cancer surgery. About 6% to 8% of men who have their prostate removed have long-lasting incontinence.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewWhat is urinary incontinence, and how is it related to prostate cancer surgery?Urinary incontinence is the loss of the ability to regulate urination (peeing). Urinary incontinence sometimes occurs in men who've had surgery for prostate cancer.If you’ve had prostate cancer surgery, you might experience stress incontinence, which means you might leak urine when you cough, sneeze or lift something that is heavy. This happens because of stress or pressure on the bladder. There is also a type of incontinence that is called urge incontinence. When this happens, you are hit with a sudden need to urinate right away and have leakage before you can make it to the bathroom.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is the prostate's role in urination?When urine is emptied into the bladder from the kidneys, it's kept inside the body by a couple of valves (sphincters) that stay closed until your body “tells” them to open when you urinate.If you’ve had your prostate completely removed, you’ve had a surgery called radical prostatectomy. Along with the prostate gland, the surgeon has to remove one of the valves outside the prostate that open and close to let urine out or keep it in. Usually having one working valve is enough, but there might also be also be some effect on the nerves and muscles in the area from the surgery that allows urine to leak. Approximately 6% to 8% of men who've had surgery to remove their prostates will develop urinary incontinence.How long does urinary incontinence after prostate surgery last?It's impossible to say exactly how long it lasts. The chances of you having urinary problems may be influenced by your age, weight and the physical characteristics of your urethra (the tube that moves urine from your bladder out of your body).However, a majority of men are eventually continent (able to regulate urine) after a radical prostatectomy. In many cases, men are able to go safely without any kind of incontinence product (pads or adult diapers) after about three months. This is especially true of men who are healthy overall and fall into the age range of 40 to 60 years. If you are having persistent problems, it’s important to know that there are ways to treat urinary incontinence after prostate surgery.AdvertisementHow is urinary incontinence after prostate surgery treated?If you find you’re having issues with mild to moderate leakage after surgery, your healthcare provider might suggest starting with noninvasive therapies like medications or physical therapy exercises for the pelvic floor muscles. These treatments may also cut down on the number of times that you have to get up each night to pee.These methods can sometimes help men who have mild to moderate leakage. Men who have persistent leakage or a more severe problem may need surgery if they do not want to continue to use pads.What kinds of surgeries treat urinary incontinence after your prostate is removed?There are two types of surgery for urinary incontinence: the urethral sling and the artificial urinary sphincter. Usually, the incontinence needs to last for about one year after the prostatectomy to be sure there is not going to be further improvement before your healthcare provider suggests this type of therapy.AdvertisementProcedure DetailsWhat is a urethral sling procedure, and how does it help with urinary incontinence?In the urethral sling procedure, a synthetic (man-made) mesh tape is placed around part of the urethra, moving the urethra into a new position. This is a minimally invasive procedure, which means that the surgeon only has to make a small incision (cut) in the perineum (the space between the base of the scrotum and the anus).Your provider may recommend a urethral sling procedure if you have mild to moderate urinary incontinence after a radical prostatectomy that hasn’t improved using other more conservative measures. It's highly successful in helping men overcome incontinence, or reduce episodes of leaking urine.Before the surgery, the provider may do some tests, including the following:A urodynamic study, to test how well the bladder is working.A 24-hour pad test (to identify how many pads the man uses and how much urine he leaks).A cystoscopy, a test in which the doctor looks inside the bladder with an instrument called a cystoscope.You don’t have to donate any of your own blood before surgery.What is an artificial urinary sphincter (AUS), and how does it help with urinary incontinence?An artificial urinary sphincter (AUS) can help men who have moderate to severe urinary incontinence due to poorly functioning muscle or sphincter valve after prostate cancer surgery.The AUS has three parts:An inflatable cuff that is placed around the upper urethra. The cuff closes off the urethra to prevent leakage of urine.A pump that is inserted into the scrotum. It's completely on the inside and not visible, and the pump controls the opening and closing of the cuff.A small pressure-regulating balloon (about the size of a Ping-Pong ball) that is placed in the abdomen, under the muscles. The balloon maintains fluid under pressure within the urethral cuff to pressurize the system and hold urine back.If you have this surgery, you’ll press on the pump when you feel the need to pee. This opens the cuff to allow urine to pass. When you’re done peeing, the cuff automatically closes again on its own.The AUS procedure provides a very good and satisfactory result in 90% of cases. Risks are uncommon and include:Failure of the device (usually because of a fluid leak).Erosion of the cuff into the urethra.Infection.All of these would require additional surgery.Risks / BenefitsWhat are the risks and complications of the urethral sling procedure?The main risk of the urethral sling procedure is a temporary inability to urinate.Complications are rare and may include bleeding and infection (of the mesh or the bone area or pubic bone), erosion, or continuing leakage.Recovery and OutlookWhat happens after urethral sling surgery?Patients usually recover from this surgery quickly. It's best to limit demanding activities for approximately six weeks after surgery to avoid having the sling loosen before healing is complete.After surgery, there may be swelling that makes it difficult to urinate. You'll have a catheter (a hollow tube) coming out of the urethra for two to three days. After this, the catheter is removed and just about everyone is able to void on their own. In rare cases, the catheter may have to be reinserted for a few days or up to a week if you cannot urinate.After the swelling goes down, you’ll gradually be able to urinate on your own and empty your bladder. However, your normal urination pattern may not return for a few weeks.The majority of men who've had this procedure have been cured of their urinary incontinence and no longer use pads. The others usually improve to the point where they don't use as many pads as they were before.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/31/2020.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"