"Indiana Pouch: Causes, Symptoms, Complications & Surgery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Indiana PouchAdvertisementAdvertisementAdvertisementIndiana PouchAn Indiana pouch is a new reservoir that a healthcare provider creates to hold your pee after they remove your bladder. A provider may suggest an Indiana pouch if a severe condition prevents your bladder from working as it should. You’ll use a catheter to empty your Indiana pouch multiple times a day through a valve in your stomach.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is an Indiana pouch?An Indiana pouch is a reservoir that you use to store and remove urine (pee) from your body. You may need one if you no longer have a urinary bladder. Your urinary bladder is a small, hollow organ that holds your pee.An Indiana pouch reconstruction surgery is a type of surgery in which healthcare providers remove your bladder (cystectomy) as part of a treatment plan and then make a new bladder for you (urinary diversion). Unlike other forms of urinary diversion where pee is constantly leaking out (incontinent diversion), the Indiana pouch holds pee in your body, similar to a bladder (continent diversion). Throughout the day, you’ll insert a drainage tube (catheter) into a valve (stoma) in your belly to drain your pee, which the Indiana pouch holds. Once the pouch is empty, you can remove the catheter.Not all patients are candidates for an Indiana pouch or a continent diversion. Your healthcare team will make this decision according to several factors.Other names for an Indiana pouch include a continent urinary reservoir, continent cutaneous pouch or continent cutaneous diversion.What does this procedure manage?A healthcare provider may remove your bladder to treat:Bladder cancer.Bladder muscles that can’t squeeze properly to release pee (decompensated bladder). This can happen after radiation therapy or because of brain or spinal cord conditions (neurogenic bladder).Bladder exstrophy.Interstitial cystitis/bladder pain syndrome (IC/BPS).Any other severe conditions that affect your bladder.Your healthcare provider may recommend an Indiana pouch to create a new way for you to remove pee from your body.What is an Indiana pouch made of?An Indiana pouch consists of parts of your large intestine (colon). The stoma consists of parts of your small intestine (small bowel).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow should I prepare for this procedure?Before an Indiana pouch procedure, you’ll meet with a healthcare provider. They’ll talk to you about other urinary diversion options and explain why they recommend an Indiana pouch. They’ll check your general health and take your vitals (temperature, pulse and blood pressure). They’ll also detail how they perform an Indiana pouch procedure and answer any questions you may have.Tell your healthcare provider about any prescription or over-the-counter (OTC) medications you’re taking. These include herbal supplements. Aspirin, anti-inflammatory drugs, certain herbal supplements and blood thinners can increase your risk of bleeding. Be sure to check with a healthcare provider before stopping any medications.Tell your healthcare provider about any allergies you have, as well. Include all known allergies. These include allergies to medications, skin cleaners like iodine or isopropyl alcohol, latex and foods.Your healthcare provider will also give you specific directions on eating and drinking before your Indiana pouch procedure. You shouldn’t eat or drink anything after midnight the night before your surgery. If you must take medications, you should take them with a small sip of water.What happens during this procedure?A special team of healthcare providers will perform an Indiana pouch procedure. The team typically consists of:A urologist.An anesthesiologist.Nurses.The anesthesiologist will sedate you (put you under) with general anesthesia. You’ll be asleep for the procedure and won’t feel any pain.Your urologist will most likely perform a radical cystectomy to remove your entire bladder. Your urologist may perform open surgery or minimally invasive (laparoscopic or robotic) surgery.During open surgery, your urologist will make one long, vertical surgical incision (cut) of about 6 to 7 inches (15 to 18 cm) to access your bladder and intestines.During minimally invasive surgery, your urologist will make five to six very small incisions in your belly and use a laparoscope or surgical robot to help perform the procedure.After removing your bladder, your urologist will perform the Indiana pouch reconstruction surgery. They’ll remove sections of your intestines and form them into a ball-like (spherical) shape. This is the Indiana pouch. They’ll create a small stoma out of your small intestine that you can access through your belly and attach the Indiana pouch to your ureters. Your ureters are tubes of muscle that carry pee from your kidneys to your Indiana pouch. Once they attach the ureters, your kidneys will deposit pee directly into the Indiana pouch.They’ll also reattach the ends of your intestines so you can continue to digest food.Once the procedure is complete, a healthcare provider will use stitches to close your incisions.How long does this procedure take?An Indiana pouch procedure takes approximately six to eight hours to perform.AdvertisementWhat happens after this procedure?After an Indiana pouch procedure, a healthcare provider will stitch your incisions and cover them with bandages. They may also secure a small silicone tube (surgical drain) to remove blood or fluid from inside your body. A surgical drain is usually in place for a few days after surgery before a provider removes it. Removing a surgical drain usually isn’t painful and doesn’t require any extra pain medications or anesthesia.The anesthesiologist will stop putting anesthesia into your body. You’ll be conscious (awake) within a few minutes, but you’ll likely still feel groggy.You’ll then move to a recovery room. Healthcare providers will wait for you to wake up more fully and track your overall health. They’ll also treat your pain. You may need pain medication. A provider may also teach you techniques to manage pain.You may need to stay in the hospital between a day and a week. This depends on whether you have a minimally invasive or open procedure. An open procedure requires a longer hospital stay.During your hospital stay, providers will monitor your recovery and make sure you’re beginning to heal and aren’t having any issues with pain management. They’ll also teach you how to care for your Indiana pouch.How do you catheterize an Indiana pouch?Follow these steps to insert a drainage tube into (catheterize) an Indiana pouch:Wash your hands with antibacterial soap and water.Remove the bandage or covering over your stoma.Use a clean paper towel to remove moisture or mucus from your stoma.Apply a lubricating jelly, such as petroleum jelly (Vaseline™), or a skin care ointment (Aquaphor™) all over your catheter.Once lubricating jelly completely covers the catheter, slowly insert it into your stoma.If you feel any resistance, you may need to adjust your catheter. Pull it out slightly, and then try to push the catheter through your stoma again. You also may need to adjust the angle at which you insert the catheter. It’s also a good idea to take a deep breath to help relax your muscles.Once your catheter enters your Indiana pouch, pee will start to flow. Be sure to let your pee flow into a toilet or a container. You may need to adjust your catheter a few times to make sure your Indiana pouch is completely empty.Once your Indiana pouch is empty, very slowly remove your catheter. If you take it out too fast, pee may leak onto yourself or your surroundings. It’s a good idea to put a towel over your clothes.Throw away the catheter.Clean the lubricating jelly off your stoma.Wash your hands.Put a new bandage or tape clean gauze onto your stoma to help keep it clean and prevent infection.How often do you drain an Indiana pouch?Most people drain their Indiana pouch about six times per day. You may need to empty your Indiana pouch more often if you drink a lot of fluids.How do you irrigate an Indiana pouch?Your stoma consists of a piece of your small intestine, which creates mucus. Irrigating (rinsing) your Indiana pouch flushes out the mucus so that pee drains out easily. It also helps prevent infections and the formation of kidney stones.Follow these steps to irrigate an Indiana pouch:Catheterize your Indiana pouch.Reinsert a clean catheter into your stoma.Open a bottle of saline solution and draw up to 60 ml of saline solution into a syringe.Insert the syringe into the catheter. Slowly press down on the syringe to release the saline solution into your Indiana pouch.Remove the syringe and drain the saline solution into a bag or container.You may need to repeat steps 5 through 7 until the drained saline solution looks clear.Remove the syringe from the catheter, and then remove the catheter from your stoma.Throw away the catheter.Clean the lubricating jelly off your stoma.Wash your hands.Put a new bandage over your stoma.How often do you irrigate an Indiana pouch?Most people irrigate their Indiana pouch once or twice per day. You may need to irrigate more often if your stoma creates a lot of mucus.Care at Cleveland ClinicUrology CareMake an AppointmentRisks / BenefitsWhat are the benefits of this procedure?The main benefit of an Indiana pouch is that you can control when you pee. Other benefits of an Indian pouch include:You don’t need to use a bag outside of your body to collect your pee (urostomy bag or pouch).If you wish, your urologist can put your stoma below your waistline. Your stoma won’t be visible if you’re not wearing a shirt, like if you’re swimming.AdvertisementWhat are the risks or complications of this procedure?The main disadvantage of an Indiana pouch is that you can’t pee as you did through your urinary bladder. You must empty your pouch with a catheter every few hours. You may even have to set an alarm in the middle of the night to empty your Indiana pouch.Other risks or complications include:You may be at a higher risk of urinary tract infections (UTIs).You may be at a higher risk of kidney stones.Mucus can develop on your stoma and it can also clog catheters.Your stoma may leak.Your stoma may narrow, which makes it hard to drain your Indiana pouch.Rarely, your stoma may reabsorb certain electrolytes and waste products that normally leave your body when you pee. This causes electrolyte abnormalities in your blood.Recovery and OutlookWhat is the recovery time?It may take several months to recover from a cystectomy and Indiana pouch procedure. You may also need time to adjust to the changes in your body. Your healthcare providers will work with you to help you adapt to these changes.When can I go back to work or school?After a few weeks, you should be able to return to work or school and resume some light physical activities.When to Call the DoctorWhen should I call my healthcare provider?Contact your healthcare provider right away if you have:Signs of infection, including fever, chills and cloudy pee.Difficulty catheterizing or irrigating your Indiana pouch.Blood in your pee (hematuria).Pain in your belly or between your ribs and hips (flank).Your provider can also answer any other questions or concerns or connect you with support groups.Additional Common QuestionsWhy is it called an Indiana pouch?Healthcare providers at the Indiana University School of Medicine developed this procedure in the 1980s, which is where the procedure gets its name.Is an Indiana pouch the same as a neobladder?An Indiana pouch is similar to a neobladder, but they aren’t the same. A neobladder also consists of parts of your intestines. However, a neobladder connects to your urethra (the tube through which pee leaves your body), so pee will come out of your body the same way it did before the procedure. With an Indiana pouch, you must drain pee from a stoma in your belly multiple times a day with a catheter.A note from Cleveland ClinicYour life will be different after an Indiana pouch procedure. You’ll have to adjust to new habits and routines. However, many of these changes can increase your overall comfort and well-being. Your healthcare provider is available to answer questions, address concerns and provide support.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/22/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicUrology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"