"Why Informed Consent Matters800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Informed ConsentAdvertisementAdvertisementAdvertisementInformed ConsentInformed consent is an ethical and legal requirement for medical treatment. You must understand and agree to testing and treatment before it can proceed. This is a basic ethical concept in medicine — but in practice, it can be more complicated. Some elements and examples of informed consent are outlined below.ContentsArrow DownOverviewProcedure DetailsContentsArrow DownOverviewProcedure DetailsOverviewWhat is informed consent in healthcare?You have the right to fully understand and agree to any medical procedure or treatment you receive before it proceeds. Informed consent is your understanding and agreement. Your healthcare provider is responsible for effectively communicating with you about your condition and your testing and treatment options. They must obtain your informed consent before proceeding with any option.Informed consent is one of the nine core principles of the American Medical Association’s Code of Medical Ethics. Opinion 2.1.1 in the Code of Medical Ethics states, “Informed consent to medical treatment is fundamental in both ethics and law. Patients have the right to receive information and ask questions about recommended treatments so that they can make well-considered decisions about care.”Informed consent is an ethical concept first, a legal concept second, and finally, a formal administrative process. In the United States, informed consent laws vary by state and by circumstances. Some cases require a signed document indicating your informed consent, while others only require a verbal agreement. But in all cases, healthcare providers have to keep some record of the process.Why is informed consent important?Consent codes and laws protect both caregivers and care receivers. They help establish trust in your caregiver while respecting your autonomy as a care seeker. They help to prevent misunderstandings and lapses in communication that could lead to you being unhappy with the care that you receive. They make sure that you understand what to expect, including the chances of less-than-optimal outcomes.Most healthcare providers have good intentions to treat care seekers ethically, including being honest about their options, their risks and their prognosis. But sometimes practical limitations and human error thwart these intentions. That’s where formal processes and laws can help. These processes and laws have evolved over time to take into account some of the stumbling blocks we’ve met along the way.For example:What if you and your healthcare provider don’t speak the same first language?What if they’ve given you information in writing, but it reads like a medical textbook and you find it hard to grasp?What if you’ve agreed to have a procedure at a teaching hospital, but you didn’t realize students or residents would be involved?Scenarios like these have required healthcare providers to revise their approach.Which medical procedures require informed consent?Laws vary, but in general, informed consent applies whenever you’re accepting a risk. Many medical procedures carry a low risk of complications or a moderate risk of minor side effects. In addition to protecting your body, you also have the right to protect your privacy. The principles of informed consent protect all of these rights. In practice, procedures that are likely to require signed consent include:Treatment with high-risk medications, such as opioids.Tests and medical interventions that go inside your body, such as endoscopy.Childbirth interventions, such as forceps delivery or episiotomy.Surgery.Biopsy.Medical implants.Use of anesthesia.Use of radiation.Chemotherapy.Blood transfusions.Genetic testing.Clinical trials involving human research subjects (including psychology research).Procedures involving medical students.Certain vaccines.Any transfer of your personal information.What are some examples of informed consent in healthcare practice?Treatment planning: You’ve just learned that you have cancer, and based on the type and stage that you have, there are a few different treatment options. All of the options have different risks and side effects. Your doctor recommends one option, but you read about an alternative treatment that interests you. It’s your doctor’s job to explain their opinion while also fairly addressing your concerns and personal preferences. This is how both of you can cooperate in the decision process.Unplanned interventions: You’ve been in labor for several hours, but labor isn’t progressing. You didn’t want medical intervention, but now your healthcare team is telling you that they’re concerned for you or your baby. There are a few different ways they could intervene to assist you, but they will have to act quickly if they do. All options have risks, including not intervening. Your team will explain your options and their recommendations so that you can decide how you want them to proceed.Authorized consent: You’ve been diagnosed with a complex condition that you’ve never heard of before. Your doctor has explained it, but you find the details confusing and overwhelming to consider. You don’t really want to become an amateur researcher or second-guess your doctor’s judgment. You just want to trust your doctor to take care of it for you. You can authorize this. They’ll tell you what they want to do and why, but you can request minimal details and decision-making.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat are the four elements of informed consent?Stakeholders generally agree that informed consent requires these four conditions:The healthcare provider must verify that you (the patient) have the capacity to understand and make decisions about your healthcare. If you can’t, they must appoint someone to make decisions in your place (a surrogate).The healthcare provider must disclose enough information for the decision-maker to make an informed choice. (More on what constitutes “enough for an informed choice” below.)The healthcare provider must judge that the decision-maker understands the information.The decision-maker must freely authorize the treatment plan, usually with their signature.What are the five components that healthcare providers must discuss with me regarding treatment?In order for you to make an “informed choice,” your healthcare provider must disclose:Your diagnosis. Even if you’ve appointed a surrogate to make decisions for you, healthcare providers must tell you the name and the nature of your condition. Informed consent laws prevent them from withholding this information, even at your family’s or surrogate’s request.The proposed treatment plan. Your healthcare provider must explain the treatment or treatments they want you to consider. They may have a clear recommendation, or there may be no single “best” option. You may also get different recommendations from different specialists.The risks and benefits of the plan. When healthcare providers recommend treatment, they must disclose what the potential risks are, how likely those risks are, what the potential benefits are and how likely it is to succeed. However, they may leave out very remote risks, risks related to factors they couldn’t have known about or risks that are considered common knowledge.Alternative options. Even if your provider has a clear recommendation for your treatment plan, they should mention any medically recognized alternatives that you might want to consider. This discussion should also include the risks and benefits of alternative treatments.What happens if you do nothing. You have the right to refuse or delay treatment, but your healthcare provider must make sure that you understand the risks and benefits if you do.AdvertisementWhat methods can or should they use to communicate the necessary information?Your healthcare provider may use a variety of media to communicate about your condition, including oral communication, written pamphlets, infographics and videos. They should ensure that the wording is accessible for non-medical people to understand. If you aren’t fluent in the same language, they must provide a qualified translator to communicate with you and obtain your informed consent.Is my signed consent the last word on the subject?No. A signed document may be one required part of the informed consent process. But it’s not the beginning or the end. Healthcare providers must also document the full communication process leading up to it, including allowing time for you to ask questions and to think about it. You can also change your mind at any time. Signing your consent doesn’t obligate you to continue with the original plan.AdvertisementWhat are the exceptions to the rule of informed consent?Informed consent as described above isn’t practical or appropriate in every situation. Some of the recognized exceptions to the rule include:When you are incapacitated. What happens if a medical condition interferes with your ability to understand information and make decisions? Maybe it’s a condition you’ve had for some time, or maybe it’s a temporary condition affecting you at a moment when you need medical care. Your healthcare provider will have to identify an appropriate surrogate to make decisions for you in this case. You may have already designated one, or they may need to refer to a family member, friend or partner, according to the local laws. If you have any ability to participate in the informed consent process, your provider should try to involve you as much as possible. If your provider is unsure of your mental capacity, they may need to have you evaluated first.When it’s an emergency. Sometimes you need urgent care, and delaying that care to get informed consent first could put your life at risk. When time is of the essence, your provider may not discuss all the possible treatment alternatives in order to get on with the treatment they believe you need. Emergency conditions also commonly cause temporary incapacitation. You may be able to give your informed consent after treatment has begun, but you may not recover that ability before treatment begins. When this is the case, healthcare providers presume your consent to save your life. They will attempt to obtain your explicit consent as soon as you are able to give it, and they will strive to keep you informed going forward.When you’re a child. If you’re a legal minor, your parent or legal guardian is your default surrogate, responsible for giving informed consent to your care. However, some states accept that minors of a certain age may be mature enough to consider and make decisions about their own care. This is called the “mature minor” exception, and it works differently in different situations. A different type of law called “medical emancipation” can release a minor from involving their parent or guardian in their medical care. In this case, though, minors aren’t necessarily granted autonomy. The court may assign a different surrogate to decide medical matters for them. But the parent or guardian won’t be entitled to that information or consent.A note from Cleveland ClinicInformed consent is a core principle of ethics in medical care. It acknowledges your freedom and independence to understand and choose what happens to your body and information about your body. Different laws have been written to uphold this principle in different places and circumstances. These laws continue to evolve as our understanding and practice of informed consent also evolve.In practice, informed consent is a shared responsibility between you and your healthcare provider. They’re obliged to inform you in the best way they know how. You may also seek additional information from credible sources to reinforce your understanding. Our health library is a great place to begin your research, with introductory information on a wide variety of medical conditions and procedures.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/01/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"