"Inotropes: Types, Purpose and Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/InotropesAdvertisementAdvertisementAdvertisementInotropesInotropes are a type of drug that can help you with a number of heart problems. They can help your heart muscles contract with more or less power, depending on what’s needed. Positive inotropes can help with cardiogenic shock and a slow heart rate. Negative inotropes can help you with high blood pressure and chest pain.ContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat are inotropic drugs?Inotropes are drugs that tell your heart muscles to beat or contract with more power or less power, depending on whether it’s a positive or negative inotrope.Positive inotropes can help when your heart can’t get enough blood to your body because it is too weak to pump the amount of blood your body needs. Positive inotropes make your heart muscle contractions stronger, raising your cardiac output to a normal level and increasing the amount of blood your heart can pump out. This helps your organs get the blood and oxygen they need to keep working.Negative inotropes keep your heart muscles from working too hard by beating with less force. This is helpful when you have high blood pressure, chest pain, an abnormal heart rhythm or a disease like hypertrophic cardiomyopathy.Inotropic drug listPositive inotropic agents include:Epinephrine (Adrenalin® or Auvi-Q®).Norepinephrine (Levophed® or Levarterenol®).Dopamine.Dobutamine.Levosimendan.Milrinone.Digoxin (Cardoxin® or Lanoxin®).Amrinone.Enoximone.Negative inotropic agents include:Flecainide.Verapamil (Calan® or Verelan®).Cibenzoline.Clonidine (Catapres® or Kapvay®).Atenolol.Disopyramide.Sunitinib.Itraconazole (Onmel® or Sporanox®).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow inotropes workInotropes act on your cardiomyocytes, the cells in your heart muscle. Positive inotropic drugs help your heart beat with more force. Negative inotropic drugs tell your heart muscles to contract with less force.Who needs to have inotropes?Most people who get positive inotropes are critically ill with congestive heart failure and are in the intensive care unit (ICU) of a hospital. They receive inotropic therapy through an IV (through the vein) tube in a large central vein. If you’re receiving inotropes, your provider will keep checking your heart rhythm, vital signs and fluid levels. Some people with end-stage heart failure may go home with IV inotropes.People who get negative inotropes usually aren’t dealing with life-threatening situations. They may take their medicine on a regular basis to keep their blood pressure normal, for example.AdvertisementWhy are inotropes used?Positive inotropes help make your heart muscle contractions more powerful so your heart can get blood to your vital organs. Providers often order the smallest dose of inotropes that works for the shortest time, but they can also prescribe them for longer.Positive inotropes may be used along with vasopressors. If your provider is treating you for shock, for example, they may start with a vasopressor to constrict your blood vessels and raise your blood pressure. Then, they may also give you an inotropic agent to help your heartbeat with more strength.Negative inotropes can help you keep your blood pressure in a normal range and keep chest pain or an abnormal heart rhythm from happening again.What do inotropes treat?Healthcare providers use positive inotropic medications to treat people with:Cardiogenic shock.Septic shock.Heart failure.Pulmonary hypertension.Postoperatively after open-heart surgery.Bradycardia.Major surgery.Major trauma.Allergic reactions.Providers use negative inotropes to treat:High blood pressure.Angina (chest pain).Arrhythmia (abnormal heart rhythm).Hypertrophic obstructive cardiomyopathy.AdvertisementRisks / BenefitsWhat are the advantages of inotropes?Positive inotropes help you increase your cardiac output and can save your life.Negative inotropes can bring your blood pressure down to normal and help with chest pain and heart rhythm problems.Side effects of positive inotropes include:Arrhythmias.Tachycardia.Hypotension.Hypertension.Anxiety.Fever.High blood pressure.Headache.Myocardial ischemia (not enough blood and oxygen getting to your heart muscle).Pulmonary edema (fluid in your lungs).Intracranial (brain) bleeding.Eosinophilic myocarditis (rare).Increased risk of death with long-term use.Side effects of negative inotropes include:Dizziness.Weakness.Headache.Constipation.Dry mouth.Nervousness.Nausea.Blurry vision.Gas.Throwing up.Diarrhea.Sweating.Recovery and OutlookWhat is the recovery time?Your recovery will take some time if you’ve been in the hospital. As your condition improves, your provider will slowly decrease the amount of positive inotropes you get. However, some people have worse symptoms when their provider tries to stop giving them inotropes. In these cases, they need to keep getting inotropes until they can get a heart transplant or mechanical heart device. Some people who can’t get well can have inotropic therapy at home as a part of hospice care.If you’re taking negative inotropes, you may have to take them long-term to prevent heart problems.When to Call the DoctorWhen should I see my healthcare provider?After you go home from the hospital, you should call your provider if your symptoms come back or get worse. You should also let them know if you’re having a bad reaction to a new medicine you’ve started taking.If you weren’t in the hospital, let your provider know if the medicine you’re taking isn’t helping or is giving you bad side effects.A note from Cleveland ClinicEven if you’re feeling better, make sure you don’t miss any doses of medicines your provider gave you. You’ll also want to go to all follow-up appointments with your provider. Check with your provider before you take herbs, supplements or drugs you can buy without a prescription. Any of these may interact with the prescriptions you’re taking.Care at Cleveland ClinicCardiology CareMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/17/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicCardiology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"