"Insulin Pen Injections800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Insulin Pen InjectionsAdvertisementAdvertisementAdvertisementInsulin Pen InjectionsAn insulin pen is an injection device with a needle that delivers insulin into the subcutaneous tissue (the tissue between your skin and muscle).  This article provides detailed instructions on how to use an insulin pen.ContentsArrow DownOverviewProcedure DetailsAdditional DetailsContentsArrow DownOverviewProcedure DetailsAdditional DetailsOverviewInsulin PenWhat is an insulin pen?An insulin pen is an injection device with a needle that delivers insulin into the subcutaneous tissue (the tissue between your skin and muscle). Subcutaneous tissue, which is also called sub Q tissue, is found all over your body.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhen should I use an insulin pen?To determine when you should inject insulin, pay attention to the times you check your blood sugar, when you eat and what kind of insulin you are taking:Check your blood sugar no more than 30 minutes before you eat.If you take rapid-acting insulin before meals, inject the insulin when you sit down to eat.If you take regular insulin before meals, inject the insulin no more than 30 minutes before the meal.If you take intermediate- or long-acting insulin, inject the insulin at the same time each day.There is no standard or “typical” dose of insulin. Your dose will be the amount of insulin that you need in order to keep your blood sugar well managed. Your doctor will prescribe an insulin dose that is right for you.Procedure DetailsHow do I use an insulin pen?Select a clean, dry work area. The supplies you will need include:The prescribed insulin penPen needles and alcohol wipesA container for used equipment. You can use a hard plastic container with a screw-on or tight lid, or a commercial “sharps” container.Here are the steps you will take:Begin by washing your hands.Remove the cap of the insulin pen.If the insulin in the pen appears cloudy, roll the pen in your hands and turn it from side to side for one full minute. You do not have to roll the pen if the insulin is completely clear. Do not shake the pen.Wipe the rubber stopper with an alcohol wipe.Attach a new pen needle onto the insulin pen. Pen needles come in different sizes. Talk to your healthcare provider to choose the pen needle that is best for you.To attach the pen needle, pull the paper tab off the pen needle, screw the new needle onto the pen, and remove the outer cap of the needle. You will need the outer cap to remove the needle from the pen when you are done with the injection. Remove the inner cap.Prime the insulin pen. Priming means removing air bubbles from the needle, and ensures that the needle is open and working. The pen must be primed before each injection.To prime the insulin pen, turn the dosage knob to the 2 units indicator. With the pen pointing upward, push the knob all the way. At least one drop of insulin should appear. You may need to repeat this step until a drop appears.Select the dose of insulin that has been prescribed for you by turning the dosage knob.Check that the dose is correct. Set the pen down without letting the needle touch anything.AdvertisementWhere on the body do I inject with the insulin pen?Recommended injection sites include the abdomen, front and side of the thighs, upper and outer arms and buttocks. Do not inject near joints, the groin area, the navel, the middle of the abdomen, or scar tissue.You will also need to rotate, or switch, your injection sites. If you use the same injection site over and over again, you may develop hardened areas under your skin that keep the insulin from working properly. Rotating your injection sites will make your injections easier, safer and more comfortable.Follow these guidelines:Ask your healthcare provider which sites on your body you should use for injections.The injection site is about two inches of skin. Clean this area with an alcohol wipe in a circular motion.Move the site of each injection. Inject at least one-and-a-half inches away from the last spot where you injected.Try to inject in the same general area of your body at the same time each day.Keep a record of which injection sites you have used. Every time you give yourself an injection, write down the date, time and site.Depending on which type of insulin you are taking, different parts of the body may absorb the insulin differently.Injecting insulin with an insulin pen:Using the hand you write with, wrap your fingers around the insulin pen, keeping your thumb free to push down on the knob.Insert the needle with a quick motion into the skin at a 90-degree angle. The needle should go all the way into your skin.Slowly push the knob of the pen all the way in to deliver your full dose. Remember to hold the pen at the site for 6-10 seconds, and then pull the needle out.You may bleed at the spot of the injection. If you notice bleeding, apply pressure with a clean alcohol wipe or cotton ball. Cover the injection site with a bandage if necessary.Carefully place the outer cap on the needle, unscrew the needle (the needle should come off with the outer cap) and drop into your container for used “sharps” equipment.Replace the pen cap and store it at room temperature.Care at Cleveland ClinicDiabetes CareMake an AppointmentAdvertisementAdditional DetailsImportant tips to remember about using an insulin pen:Always check your medicine type and the expiration date printed on the box before you leave the pharmacy.Store unopened pens in the refrigerator. They will be good until the expiration date printed on the box. Write the date on the insulin pen when you first open it.Store open insulin pens at room temperature. Avoid temperatures that are too hot or too cold. This can change how the insulin works.Most pens are good for 28 days once opened. Check with your pharmacist or read the drug insert for exact instructions.Do not use insulin pens that have lumps, are discolored or have been frozen.Place used pen needles and lancets for blood sugar testing in a hard plastic or metal container with a screw-on or tight lid, or a commercial “sharps” container.If you have questions about the subcutaneous injection procedure, please ask your healthcare providers.The most common side effect of insulin is low blood sugar, or hypoglycemia. Low blood sugar happens when the level of sugar in the blood falls below 70 mg/dl. Symptoms include sleepiness, shaking, sweating, dizziness and hunger. Be sure you know how to treat low blood sugar before you start using insulin.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/08/2018.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicDiabetes CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6568Appointments & LocationsRequest an AppointmentVirtual Visits for DiabetesFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"