"Endarterectomy: Treatment for Peripheral Artery Disease800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/EndarterectomyAdvertisementAdvertisementAdvertisementEndarterectomyAn endarterectomy is a procedure to remove plaque buildup from narrowed or blocked arteries. It may be a treatment for peripheral artery disease or carotid artery disease. Your provider makes an incision over the blocked artery during the procedure. Then, they use a special tool to remove plaque.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is an endarterectomy?An endarterectomy is a surgery to open narrowed or blocked arteries. Arteries are blood vessels that carry oxygenated blood throughout your body.Your healthcare provider uses the procedure to remove plaque, a fatty and calcified substance that can build up in arteries. Providers use endarterectomies to improve blood flow and reduce your risk of blood clots or stroke.What are the types of endarterectomies?The type of endarterectomy you have depends on where you have a blocked artery:Carotid endarterectomy removes plaque from the arteries running through your neck to your brain.Femoral endarterectomy removes plaque from arteries in your groin going to your legs.Aortic and iliac endarterectomy removes plaque from the main arteries in your abdomen and pelvis.Who needs an endarterectomy?You may need an endarterectomy if you have atherosclerosis. Atherosclerosis is plaque buildup in an artery, eventually leading to stiff, narrowed arteries.Usually, providers recommend an endarterectomy for moderate to severe atherosclerosis, especially if it causes symptoms. However, everyone’s situation is unique.What conditions does an endarterectomy treat?An endarterectomy is a treatment option for some people with peripheral artery disease (PAD). In PAD, plaque builds up in the arteries in your legs or arms. This blocks blood flow and may lead to pain, wounds and eventual death (gangrene) of your tissues.You may also need an endarterectomy to treat carotid artery disease. In carotid artery disease, plaque builds up in your carotid arteries, the blood vessels that carry blood to your brain. Carotid artery narrowing can lead to a stroke or a transient ischemic attack (TIA) if you don’t get treatment.Who isn’t a candidate for an endarterectomy?Some people have risk factors that mean endarterectomy isn’t a suitable treatment option. You may not be a candidate for an endarterectomy if you have conditions that would make the surgery more dangerous, such as:Decompensated congestive heart failure.Recent heart attack (myocardial infarction).Severe emphysema or COPD.Radiation damage to the area.Infection in the area.Extensive calcification or thrombus.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat tests will I have before an endarterectomy?Before an endarterectomy, you’ll likely have tests to evaluate the extent of the artery blockage, including:Angiography, using a contrast dye and X-rays to take pictures of your blood vessels.Doppler ultrasound, using sound waves to evaluate blood flow through your blood vessels.Magnetic resonance angiography, using magnets and radio waves to take pictures of your blood vessels.CT angiogram, using advanced X-rays to make a three-dimensional picture of your body and blood vessels.You may also have tests to assess your overall heart health, such as an echocardiogram or stress test. Cardiovascular tests help your provider evaluate your heart attack risk and determine if you’re a good candidate for surgery.What happens before an endarterectomy?Your provider gives you instructions to prepare for an endarterectomy. You may need to stop taking certain medications, such as blood thinners (anticoagulants), temporarily. In other cases, your provider may tell you to start taking medicines that inhibit platelets and clots, such as aspirin, for a period before the procedure.You’ll need to fast before an endarterectomy. Your anesthesia team will tell you how long to fast before the operation.AdvertisementWhat happens during an endarterectomy?You receive anesthesia so you don’t feel any pain during an endarterectomy. Your provider sometimes keeps you awake during a carotid endarterectomy to better monitor brain function.During the procedure, your healthcare provider:Makes an incision directly over the blocked artery.Places a tube (shunt) to keep blood flowing to your brain during the procedure.Removes plaque from the artery.Closes the artery with sutures, sometimes using a patch to widen the area to prevent re-narrowing. The patch can come from a synthetic graft or a piece of a healthy vein from another part of your body, if needed.Closes the incision.What happens after an endarterectomy?You may have a drainage tube extending from the incision site immediately after surgery to keep the area from bruising. Your provider will remove this before releasing you to go home. The hospital stay will depend on the type of surgery and location. For example, carotid endarterectomy patients are usually in the hospital for one day. Femoral endarterectomies, typically for two to four days and aortic endarterectomies, usually a week.Care at Cleveland ClinicPeripheral Artery Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the advantages of an endarterectomy?Endarterectomy removes the blockages and restores your artery back to its normal healthy size. The cleaned-out vessel can resolve leg pain with walking, help heal leg wounds due to poor circulation, resolve abdominal pain from poor circulation and significantly reduce your risk of stroke.The results of an endarterectomy usually last for many years.What are the risks or complications of an endarterectomy?Endarterectomies are typically safe, but there’s a risk of complications such as:Bleeding.Heart problems, such as a heart attack.Infection.Nerve damage (often temporary).Re-narrowing in your artery.Stroke.In most people, the risk of serious complications is low and depends on the reason for the surgery and the location of the surgery. If your provider recommends an endarterectomy, it means that they believe the benefits of the procedure outweigh the potential risks.Are there conditions that put me at a higher risk for complications after an endarterectomy?Yes. Some factors can increase your risk of experiencing complications after an endarterectomy, including:Age, with risk increasing the older you are.Untreated coronary artery disease and chest pain (angina).Severe lung disease.Decompensated congestive heart failure.History of previous surgery or radiation to the area of your body where the operation will take place.Plaque buildup in multiple arteries throughout your body.Recovery and OutlookWhat is the recovery time after an endarterectomy?You have a follow-up visit with your healthcare provider about four weeks after the procedure. Your provider examines the incision and will image the repair over time with ultrasonography or CT scans. Most people can return to work after this follow-up visit.Exercise can help recovery, but it’s important to avoid strenuous activity until your provider tells you it’s OK. You may need to wait one or two months to return to work if you have a job that requires manual labor or strenuous physical activity.When to Call the DoctorWhen should I see my healthcare provider?Call your healthcare provider right away if you experience any signs of complication after an endarterectomy, including:Chest pain.Difficulty breathing.Fever or chills.Numbness or weakness.Swelling, increased redness or discharge around the incision site.Vision changes, slurring of speech or drooping of your face.Nausea or vomiting.Additional DetailsHow serious is a femoral endarterectomy?A femoral endarterectomy is an open surgery, meaning it’s a major operation. You may stay in the hospital for several days, and recovery takes several weeks. But complications of a femoral endarterectomy are uncommon. Most people have long-lasting positive results.How serious is an aortic and iliac endarterectomy?An aortic and/or iliac endarterectomy is an open surgery, meaning it’s a major operation. You may stay in the hospital for several days, and recovery takes several weeks to months. But aortic and iliac endarterectomy are usually well tolerated with infrequent major complications. Most people have long-lasting positive results.How serious is a carotid endarterectomy?A carotid endarterectomy is an open surgery. You’ll most likely be in the hospital for one day, but recovery takes several weeks. However, complications of a carotid endarterectomy are uncommon. Most people have long-lasting positive results.A note from Cleveland ClinicAn endarterectomy is a surgery to remove plaque from narrowed or blocked arteries. You may have an endarterectomy to treat peripheral artery disease or carotid artery disease. Your provider makes an incision directly over the blocked artery during the procedure. Then, they use a special tool to remove plaque. You usually stay in the hospital for one to two days, and recovery takes several weeks.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/29/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPeripheral Artery Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"