"Intestinal PAD Bypass Surgery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Intestinal PAD Bypass SurgeryAdvertisementAdvertisementAdvertisementIntestinal PAD Bypass SurgeryContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookResourcesContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookResourcesOverviewWhat is a surgical bypass for visceral ischemic syndrome?A surgical bypass reroutes blood flow around a blocked blood vessel by creating a new pathway for blood flow using a graft.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is this procedure performed? Why do I need this procedure?The goal of treatment is to re-direct the blood flow in the artery to bypass a blockage. You may need this procedure if your arteries become too narrowed or blocked from plaque inside the artery walls. If arteries are blocked, blood cannot get through to nourish the tissues of the bowel or gastrointestinal system (intestines).Acute mesenteric ischemia is a life-threatening condition. In contrast, chronic mesenteric ischemia is characteristically associated with abdominal pain after meals. The onset of pain is usually gradual and progressive. Eventually, this situation results in substantial weight loss and a marked alteration in dietary intake.Each patient is evaluated, and treatment will be individualized for the patient's circumstances.Where is the procedure performed and who performs this procedure?This procedure is performed in the hospital surgical suite by a vascular surgeon.AdvertisementProcedure DetailsBefore the ProcedureSpecial precautions are taken to decrease these risks, and there may be other possible risks. When you meet with your doctor, please ask questions to make sure you understand the risks of the procedure and why the procedure is recommended.How do I find out if I am a candidate for this procedure?Your doctor will discuss the specific risks and potential benefits of the recommended procedure with you. A few days before the procedure, pre-procedure tests may be performed to ensure that it is safe to perform the surgery. You may need to discontinue certain medications before the procedure. Your healthcare team will provide specific instructions to help you prepare for the procedure. The surgical bypass will be performed under general anesthesia.To bypass the blockage, the surgeon makes a small opening just below the blockage in the diseased artery and places a graft, which is either a portion of one of your veins or a man-made synthetic tube. The surgeon will connect the graft above and below the blockage to allow blood around the blockage. Most patients require routine admission to an intensive care unit for close monitoring for about one to two days after the surgery. Once the patient is transferred to the nursing unit, the hospital stay is about three to seven more days.Most patients will receive physical therapy during the recovery period. As with any surgical procedure, you will feel somewhat tired for a few weeks. You will have mild pain along the incisions. Some patients will experience cramping and abdominal pain, and may have intermittent constipation and/or diarrhea for a few weeks.To find out if you are a candidate for this procedure, please call the Vascular Surgery Department at 216.444.4508 or 800.223.2273 ext. 4-4508.AdvertisementHow do I prepare for the procedure?A few days before the procedure, pre-procedure tests may be performed to ensure that it is safe to perform the surgery. You may need to discontinue certain medications before the procedure. Your health care team will provide specific instructions to help you prepare for the procedure.What happens during the procedure?The surgical bypass will be performed under general anesthesia. To bypass the blockage, the surgeon makes a small opening just below the blockage in the diseased artery and places a graft, which is either a portion of one of your veins or a man-made synthetic tube. The surgeon will connect the graft above and below the blockage to allow blood around the blockage.How long does the procedure last?The procedure itself generally takes three to five hours, but the preparation and recovery time add several hours. The surgery may require a minimum hospital seven to 10 days.What happens after the procedure?Most patients require routine admission to an intensive care unit for close monitoring for about one to two days after the surgery. Once the patient is transferred to the nursing unit, the hospital stay is about three to seven more days. Most patients will receive physical therapy during the recovery period.Your doctor will provide specific guidelines for your recovery.Care at Cleveland ClinicPeripheral Artery Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the risks and potential complications of the procedure?Your doctor will discuss the specific risks and potential benefits of the recommended procedure with you.Bypass surgery usually has no complications, but there may be a risk of injury to the blood vessel. Another possible complication is the development of a hernia at the site of incision. In addition, the return of normal bowel function may be slow, and patients may not be able to eat for several days following the surgery. Your vascular surgeon will discuss the important risks and benefits with you.Are there any side effects of the treatment?As with any surgical procedure, you will feel somewhat tired for a few weeks. You will have mild pain along the incisions. Some patients will experience cramping and abdominal pain, and may have intermittent constipation and/or diarrhea for a few weeks.Recovery and OutlookWhat are typical results of the procedure?Restoring blood flow by performing a surgical bypass usually provides good relief of symptoms. In addition to following a low-fat diet, eating small, frequent meals is recommended for patients with ischemia. Regular exercise, as well as managing blood pressure, cholesterol and diabetes, also are recommended.ResourcesDoctors Who TreatDoctors vary in quality due to differences in training and experience; hospitals differ in the number of services available. The more complex your medical problem, the greater these differences in quality become and the more they matter.Clearly, the doctor and hospital that you choose for complex, specialized medical care will have a direct impact on how well you do. To help you make this choice, please review our Miller Family Heart, Vascular & Thoracic Institute Outcomes.Cleveland Clinic Heart, Vascular & Thoracic Institute Vascular Medicine Specialists and SurgeonsChoosing a doctor to treat your vascular disease depends on where you are in your diagnosis and treatment. The following Heart, Vascular & Thoracic Institute Sections and Departments treat patients with all types of vascular disease, including blood clotting disorders:Section of Vascular Medicine: for evaluation, medical management or interventional procedures to treat vascular disease. In addition, the Non-Invasive Laboratory includes state-of-the art computerized imaging equipment to assist in diagnosing vascular disease, without added discomfort to the patient. Call Vascular Medicine Appointments, toll-free 800-223-2273, extension 44420 or request an appointment online.Department of Vascular Surgery: surgery evaluation for surgical treatment of vascular disease, including aorta, peripheral artery, and venous disease. Call Vascular Surgery Appointments, toll-free 800-223-2273, extension 44508 or request an appointment online.IVC Filter Retrieval Clinic - to make an appointment, call Vascular Medicine at 216.444.4420. Ask for Dr. Bartholomew in the Filter Retrieval Clinic. Your appointment will include a consultation with Dr. Bartholomew and the physicians who will perform the IVC filter retrieval procedure.You may also use our MyConsult second opinion consultation using the Internet.The Heart, Vascular & Thoracic Institute also has specialized centers and clinics to treat certain populations of patients:Aorta CenterThrombosis CenterLower Extremity Wound ClinicFMD ClinicSCAD ClinicLearn more about experts who specialize in the diagnosis and treatment of vascular and arterial disease.See About Us to learn more about the Sydell and Arnold Miller Family Heart, Vascular & Thoracic Institute.ContactIf you need more information, click here to contact us, chat online with a nurse or call the Miller Family Heart, Vascular & Thoracic Institute Resource & Information Nurse at 216.445.9288 or toll-free at 866.289.6911. We would be happy to help you.Becoming a PatientMake an appointmentPlan Your VisitBilling & InsuranceVisitor AmenitiesConditionsVascular DiseaseIntestinal Ischemic SyndromesTreatment GuidesAortic AneurysmMay Thurner SyndromeThoracic Outlet SyndromeVein and VascularAll Miller Family Heart, Vascular & Thoracic Institute Treatment GuidesDiagnostic TestsDiagnostic tests are used to diagnose your abnormal heartbeat and the most effective treatment method.Diagnostic testingWebchatsOur webchats and video chats give patients and visitors another opportunity to ask questions and interact with our physicians.Vascular Disease, Peripheral Arterial Disease & Thrombosis webchats and video chatsAll Miller Family Heart, Vascular & Thoracic Institute webchatsVideosVascular Disease and Treatments VideosAll Miller Family Heart, Vascular & Thoracic Institute VideosInteractive ToolsAll Miller Family Heart, Vascular & Thoracic Institute VideosResource LinksRecovery at homeSupport Groups and InformationVisit Health Essentials* - Read articles on vascular disorders and healthy living on Health EssentialsFollow Heart, Vascular & Thoracic Institute webchats and news stories on Twitter*Subscribe to Heart, Vascular & Thoracic eNewsAmerican Stroke Association *American Heart Association *Vascular Cures*VascularWeb - Resources for Vascular Disease and Treatment**A new browser window will open with this link. The inclusion of links to other websites does not imply any endorsement of the material on those websites nor any association with their operators.Surgical OutcomesWhy choose Cleveland Clinic for your care?Our outcomes speak for themselves. Please review our facts and figures and if you have any questions don't hesitate to ask.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/01/2019.Learn more about our editorial process.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPeripheral Artery Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"