"Intercostal Nerve Block: What It Is, Procedure, & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Intercostal Nerve BlockAdvertisementAdvertisementAdvertisementIntercostal Nerve BlockAn intercostal nerve block may provide temporary pain relief for your chest or upper abdomen. The injection goes under one of your ribs. Healthcare providers use these blocks to help manage pain with postherpetic neuralgia, rib fractures and chest surgeries.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is an intercostal nerve block?An intercostal nerve block is an injection of medication under your rib that helps relieve pain in your chest area or upper abdomen.Your intercostal nerves are located under each of your ribs. When one of these nerves or the tissue around it gets irritated or inflamed, it can cause pain. A nerve block, which contains a steroid medication and local anesthetic, can help reduce the inflammation and alleviate the pain.Healthcare providers also use intercostal nerve blocks to help diagnose the source of pain.What is an intercostal nerve block used for?Intercostal nerve blocks have a few different uses. One is to provide temporary pain relief for acute (sudden and short) or chronic (long-term) pain. The nerve block may reduce inflammation and allow your nerves to heal. Intercostal nerve blocks may help with pain related to:Rib fractures.Shingles or postherpetic neuralgia.Anesthesiologists or surgeons may administer intercostal nerve blocks before surgeries to help manage pain after the procedure. They usually use this in addition to general anesthesia for complex surgeries. For some smaller surgeries, you may be able to have an intercostal nerve block instead of anesthesia. Providers may use intercostal nerve blocks for:Thoracic (chest) surgery.Thoracostomy (chest tube placement).Breast surgery.Upper abdominal surgery.Healthcare providers may also use intercostal nerve blocks to determine if the pain you’re experiencing is visceral pain or somatic pain. Visceral pain is pain related to your internal organs. Somatic pain occurs in tissues such as your muscles, skin or joints. Visceral pain is often a deep, squeezing pain that’s vague and difficult to localize.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow do I prepare for an intercostal nerve block?You usually don’t have to do anything special to prepare for an intercostal nerve block.However, you should tell the healthcare provider who’s performing the nerve block if you’re taking blood thinner medications (anticoagulants) such as warfarin. Blood thinners may increase your risk of bleeding after the injection. But don’t stop taking your medication without talking to the provider who prescribes the medication.In some cases, your provider may recommend sedation for the procedure. If you’re receiving sedation, you’ll need to fast for six to eight hours before it. You’ll also need someone else to drive you home after the procedure.In any case, your healthcare provider will let you know how to prepare. Be sure to follow their instructions. Don’t hesitate to ask questions.How is an intercostal nerve block done?In general, you can expect the following when you receive an intercostal nerve block:You’ll lie on a table, on your side (the side not causing pain) or your stomach.You may receive a mild sedative through an IV line in your arm to help you relax.The provider will clean your skin with an antiseptic solution. They’ll give you an injection of a local anesthetic to numb the area where you’ll receive the nerve block. You may still feel a pinch or some discomfort as the needle enters your skin.The provider may use imaging guidance, such as ultrasound or fluoroscopy, to locate the exact spot where the injection needs to go. They’ll then inject the medication as close to the affected nerve as possible.After the procedure, you’ll rest until the medication takes effect.What happens after an intercostal nerve block injection?After the injection, you’ll rest for 15 to 30 minutes to let the medication take effect. A nurse will also observe you during this time to make sure you don’t have any unexpected side effects. You’ll then be able to go home.Care at Cleveland ClinicSchedule General SurgeryFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsDo intercostal nerve blocks work?Intercostal nerve blocks are usually successful at providing temporary pain relief. But the duration of pain relief can vary from person to person. The intercostal nerve is easy for healthcare providers to access for the injection (as compared to other types of nerve blocks).Some people don’t experience any effects from the block and may require different treatment methods to manage their symptoms.What are the risks or possible complications of an intercostal nerve block?You may experience bruising or soreness at the injection site, but this should resolve within a couple of days.Serious complications are rare but can include:Bleeding.Infection.Collapsed lung.Nerve damage.AdvertisementRecovery and OutlookHow long does an intercostal nerve block last?How long the pain relief lasts is different for each person. Some people report pain relief soon after the injection, but the pain may return a few hours later as the anesthetic wears off. Longer-term relief usually begins in two to three days once the steroid begins to work.For some, the relief lasts several months. If the treatment works for you, you may be able to have periodic injections to manage your pain.When to Call the DoctorWhen should I call my healthcare provider?Contact your healthcare provider immediately if you experience any new symptoms or complications from the intercostal nerve block. This includes signs of infection (fever, redness or pus at the injection site) or nerve issues like weakness or tingling.A note from Cleveland ClinicIntercostal nerve blocks can help treat certain pain-related conditions in your chest and upper abdomen. But the results can vary from person to person. If you’re feeling anxious about receiving an intercostal nerve block injection, don’t hesitate to ask your healthcare provider about it and the procedure. They can answer any questions you may have.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/01/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule General SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7243Questions 216.444.9134Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"