"Integrative Medicine: What Is It, Types, Risks & Benefits800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Integrative MedicineAdvertisementAdvertisementAdvertisementIntegrative MedicineIntegrative medicine uses an evidence-based approach to treat the whole person — your mind, body and soul. Your physical, emotional, mental and spiritual needs are all involved, so integrative medicine uses a combination of therapies. It “integrates” conventional approaches and complementary therapies to achieve optimal health and healing.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is integrative medicine?Integrative medicine focuses on you as a whole person and not just your illness or disease. While it seeks to understand the underlying cause of your symptoms or condition, it does so by looking at your complete mind, body and spirit. Integrative medicine uses an evidence-based approach to improve your health and wellness.Integrative medicine believes your physical, mental, emotional and spiritual needs affect your health. It believes those needs rely on each other and affect your entire well-being. There are many different aspects to address, so integrative medicine uses a combination of therapies and lifestyle changes.With integrative medicine, the relationships between you and your healthcare providers are important. You are equal partners in your healing process. Integrative medicine aims for well-coordinated care among different providers and specialists. It brings together conventional healthcare approaches (like medication and psychotherapy) and complementary therapies (like acupuncture and yoga). In this way, integrative medicine “integrates” all aspects of your well-being to achieve optimal health and healing.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat type of providers deliver integrative medicine?A variety of healthcare providers delivers care through integrative medicine. These providers may include:Physicians.Chiropractic doctors.Holistic mind-body psychotherapists.Acupuncturists.Chinese herbal therapists.Tai chi practitioners.Yoga practitioners.Massage therapists.Nutritionists.Chefs (culinary medicine).How can integrative medicine help me?Integrative medicine physicians don’t replace your primary care provider or specialist. They work together with all members of your healthcare team to heal your mind, body and spirit. Their expertise lies in preventing and managing chronic diseases. They don’t treat acute medical problems. For acute care and medical emergencies, you should seek help from your primary care or emergency medicine physician.AdvertisementWho is integrative medicine for?Many people can benefit from integrative medicine, including healthy people. People with long-lasting (chronic) or complex conditions may especially find the approach helpful. Integrative medicine can help you find relief for many health and medical conditions, including:Autoimmune diseases.Acute and chronic pain.Breathing disorders.Headaches and migraines.Cancer and cancer-related side effects.Chronic fatigue.Cold/flu symptoms.Digestive disorders.Infertility.Menopausal symptoms.Menstrual issues.Mental and emotional health issues.Obesity.High blood pressure (hypertension).Sleep issues.Procedure DetailsWhat types of integrative medicine are available?Integrative medicine covers a broad range of practices, techniques and services. Integrative medicine techniques may include:AcupunctureAcupuncture uses thin needles to maintain the flow and balance of your body’s energy (Qi). This can help activate your body’s natural healing capability. Acupuncture may help relieve:Joint pain.Fibromyalgia.Migraines.Cancer-related symptoms.Anxiety and depression.Hot flashes.Fatigue.Chinese herbal therapyCertified Chinese herbalists use formulas from a traditional Chinese medicine text. It contains thousands of herbs, minerals and other extracts and their intended uses. Chinese herbal therapy may help relieve:Fatigue.Digestive disorders.Pain.Menopausal symptoms.Cold/flu symptoms.Chiropractic therapyChiropractic doctors perform soft tissue adjustments and manipulate your spine and joints. Chiropractic therapy may help relieve:Back and neck pain.Pelvic pain.Shoulder, elbow and wrist pain.Knee, hip or ankle pain.Other musculoskeletal problems.Culinary medicineCulinary medicine combines the evidence-based science of food, nutrition and medicine with the joy and art of cooking. It may use special diets, including vegan, low-carb and FODMAP to improve your wellness. Culinary medicine can help improve and/or reverse common chronic diseases. These conditions include:Diabetes.High blood pressure (hypertension).Obesity.Non-alcoholic fatty liver disease.Holistic psychotherapyHolistic psychotherapy uses evidence-based therapies to improve mood, anxiety, post-traumatic stress disorder (PTSD) and other symptoms. These therapies include:Traditional talk therapy.Hypnosis.Hypnotherapy.Cognitive behavioral techniques like breathing and relaxation.Guided imagery.Massage therapyMassage therapy uses soft tissue manipulation and body movement to promote health and well-being. It can help treat physical disorders and improve clinical outcomes. Massage therapists can use different techniques to relieve:Muscle pain and tightness.Respiratory disorders (such as sinus pressure).Congestive chest symptoms.Neurological and muscular disorders (such as headaches and low back pain).Digestive disorders (such as constipation).Post-operative pain and lymphedema.ReikiReiki is a method of energy healing that involves balance. It restores your body’s natural energy fields. It can increase vitality, balance your emotions and improve your health. Reiki may help relieve symptoms of various conditions. These may include:Cancer.Chronic pain.Stress.Infertility.Digestive disorders.Parkinson’s disease.Yoga and tai chiYoga and tai chi combine specific postures and movements with breathing to unify your mind and body. They may help:Reduce stress and pain.Enhance immune response.Lower blood pressure.Improve posture and body alignment.Increase muscle strength.Provide a sense of joy and well-being.AdvertisementRisks / BenefitsWhat are the benefits of integrative medicine?Integrative medicine techniques support your body’s natural ability to heal. It helps you reduce stress and promotes a state of relaxation that leads to better health. It can help you achieve optimal health when you engage in your own healing and feel empowered to make lifestyle changes. Adding integrative medicine to your healthcare routine can help you regain control of your well-being.What are the risks of integrative medicine?All recommended therapies and lifestyle changes are very safe with minimal risk. But the treatments aren’t substitutes for regular medical care from your primary care physician and specialists. Integrative medicine should be used together with your regular medical treatments. Integrative medicine providers communicate their care recommendations with your other medical providers. In this way, they can coordinate care and avoid confusion.Recovery and OutlookWhat is the outlook for people receiving integrative medicine?Your outlook depends on your diagnosis, health history and treatments you receive. Ways you can improve the likelihood of good results include:Learn about complementary therapies that may be appropriate for you.Discuss risks and benefits with your primary care physician and integrative medicine providers.Keep in mind that complementary therapies aren’t meant to replace treatment from your primary care physician.Always let your healthcare provider know about any complementary therapies you receive.When to Call the DoctorWhen should I contact my healthcare provider about integrative medicine?You should be in contact with your healthcare provider throughout treatment. Letting them know about the integrative medicine therapies you’re receiving helps them better tailor care to keep you safe.Additional DetailsWhat’s the difference between integrative medicine and functional medicine?Integrative medicine and functional medicine are similar, but they approach healing in slightly different ways. Integrative medicine seeks to understand you as a whole person. It uses many different types of therapy to heal your mind, body and spirit. Functional medicine seeks to identify and treat the underlying cause of your condition. It centers on the idea that one condition may have many causes or one cause can have many conditions.A note from Cleveland ClinicIntegrative medicine uses a combination of therapies and lifestyle changes to treat and heal the whole person. It focuses on your complete mind, body and soul and uses an evidence-based approach to improve your health and wellness. With integrative medicine, the relationships between you and your healthcare providers are very important. Always remember, you are an equal partner in your healing process. Maintain open communication with all of your providers to help you get the most out of treatment.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/07/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.448.4325Appointments & LocationsSign Up for News & InfoFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"