"Intestinal PAD Visceral Artery Aneurysm Surgery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Intestinal PAD Visceral Artery Aneurysm SurgeryAdvertisementAdvertisementAdvertisementIntestinal PAD Visceral Artery Aneurysm SurgeryContentsArrow DownOverviewRisks / BenefitsContentsArrow DownOverviewRisks / BenefitsOverviewWhat is resection with surgical bypass for a visceral artery aneurysm?A visceral aneurysm may be treated with resection of the aneurysm and bypass from one normal segment of artery to the next. This is done with a graft that is made from a portion of one of your veins or a man-made synthetic tube.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is this procedure performed? Why do I need this procedure?The goal of treatment is to re-direct the blood flow in the artery. You may need this procedure if the visceral aneurysm has formed clots that block blood flow, or are compressing a nearby nerve or vein and causing pain, numbness or swelling, or treatment may be warranted to prevent this from happening.Each patient is evaluated, and treatment will be individualized for the patient's circumstances.Where is the procedure performed and who performs this procedure?This procedure is performed in the hospital surgical suite by a vascular surgeon.AdvertisementHow do I find out if I am a candidate for this procedure?To find out if you are a candidate for this procedure, please call the Vascular Surgery Department at 216.444.4508 or 800.223.2273 ext. 4-4508.How do I prepare for the procedure?A few days before the procedure, pre-procedure tests may be performed to ensure that it is safe to perform the surgery. You may need to discontinue certain medications before the procedure. Your health care team will provide specific instructions to help you prepare for the procedure.AdvertisementWhat happens during the procedure?The surgical bypass will be performed under general anesthesia. The surgeon makes a small opening in the diseased artery and places a graft, which is either a portion of one of your veins or a man-made synthetic tube. The surgeon will connect the graft to allow blood through a healthy artery.How long does the procedure last?The procedure itself generally takes three to five hours, but the preparation and recovery time add several hours. The surgery may require a minimum hospital seven to 10 days.What happens after the procedure?Most patients require routine admission to an intensive care unit for close monitoring for about one to two days after the surgery. Once the patient is transferred to the nursing unit, the hospital stay is about three to seven more days. Most patients will receive physical therapy during the recovery period.Your doctor will provide specific guidelines for your recovery.Are there any side effects of the treatment?As with any surgical procedure, you will feel somewhat tired for a few weeks. You will have mild pain along the incisions. Some patients will experience cramping and abdominal pain, and may have intermittent constipation and/or diarrhea for a few weeks.What are typical results of the procedure?Restoring blood flow by performing a surgical bypass usually provides good relief of symptoms.Risks / BenefitsWhat are the risks and potential complications of the procedure?Your doctor will discuss the specific risks and potential benefits of the recommended procedure with you.Bypass surgery usually has no complications, but there may be a risk of injury to the blood vessel. Another possible complication is the development of a hernia at the site of incision. In addition, the return of normal bowel function may be slow, and patients may not be able to eat for several days following the surgery. Your vascular surgeon will discuss the important risks and benefits with you.Special precautions are taken to decrease these risks, and there may be other possible risks. When you meet with your doctor, please ask questions to make sure you understand the risks of the procedure and why the procedure is recommended.Care at Cleveland ClinicPeripheral Artery Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/01/2019.Learn more about our editorial process.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPeripheral Artery Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"