"Intra-Aortic Balloon Pump (IABP)800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Intra-Aortic Balloon PumpAdvertisementAdvertisementAdvertisementIntra-Aortic Balloon PumpAn intra-aortic balloon pump (IABP) is a device that controls blood flow from your heart. It deflates when your heart pumps blood out and inflates when your heart rests between beats. You may use an IABP when you’re recovering from heart surgery or after a cardiac event. Most people only need to use the device for a few days.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is an intra-aortic balloon pump?An intra-aortic balloon pump (IABP) is a device that helps your heart pump more blood. It looks like a long, skinny balloon and inflates and deflates.An IABP stays in place for only a few days. Healthcare providers typically use the device when you’re in the hospital after a surgery or cardiac event.What does an intra-aortic balloon pump do?Typically, when your heart contracts, it sends blood out through the rest of your body. When your heart relaxes, it fills with blood. An IABP helps your heart contract and relax when it’s unable to do so on its own.How does an intra-aortic balloon pump work?An intra-aortic balloon pump deflates when your heart pumps blood out, then inflates when your heart relaxes. It connects to a machine that tells it when to deflate and inflate.Deflation helps pump blood throughout your body. The inflation helps improve circulation to your heart and to veins and arteries in your arms, legs, hands and feet.What is an intra-aortic pump used for?Your healthcare provider may recommend an IABP if your heart isn’t pumping enough blood through your circulatory system (cardiogenic shock). Cardiogenic shock may develop because of:Acute congestive heart failure.Arrhythmias.Heart attacks.Myocarditis.Coronary artery disease.Some people may need an IABP after heart procedures such as a percutaneous coronary intervention for a blocked artery.Who shouldn’t get an intra-aortic balloon pump?Some people aren’t good candidates for an IABP, including those with:Aortic aneurysms.Aortic dissection.Aortic regurgitation, a leaky aortic valve.Severe peripheral artery disease.Uncontrolled sepsis.Where is an intra-aortic balloon pump placed?Your healthcare provider places the IABP in your aorta, the large artery carrying blood from your heart to the rest of your body. Specifically, they place the device in the thoracic aorta, the part of the artery that runs through your chest.Why is helium used in intra-aortic balloon pumps?An intra-aortic balloon pump connects to a machine that tells it when to inflate and deflate. The machine sends out small bursts of helium to blow up the balloon. IABPs use helium because helium doesn’t cause complications or damage to your body if it leaks out of the pump.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before intra-aortic balloon pump placement?If you’re already in cardiac surgery when your healthcare provider places the IABP, you’ll be asleep for the procedure. Otherwise, your provider may give you numbing medicine (local anesthesia) to reduce the chance of pain during the procedure.What happens during intra-aortic balloon pump placement?During an intra-aortic balloon pump placement, your healthcare provider:Inserts a hollow tube called a catheter into an artery in your leg.Threads the balloon through the catheter.Uses X-ray imaging to guide the balloon and catheter up to your aorta.Attaches the intra-aortic balloon pump to a machine that tells the balloon when to inflate and deflate.AdvertisementWhat happens after intra-aortic balloon pump placement?You may feel some chest pain during the IABP placement. Pain should go away within a few minutes.You’ll stay in bed with your head slightly elevated while the IABP is in place. The catheter will remain in your leg. You’ll need to keep your leg straight to prevent the balloon from moving out of position.Usually, your provider gives you a medication called heparin after placing an intra-aortic balloon pump. Heparin is a blood thinner that helps prevent blood clots from forming.Care at Cleveland ClinicCardiology CareMake an AppointmentRisks / BenefitsWhat are the advantages of an intra-aortic balloon pump?An intra-aortic balloon pump may save your life. If your heart is in cardiogenic shock, an IABP can ensure that your body gets enough blood.AdvertisementWhat are the risks of an intra-aortic balloon pump?Your risks depend on multiple factors, including your age and overall health. In general, the risks of an intra-aortic balloon pump may include:Balloon rupture, which could lead to blood clots.Excessive bleeding.Incorrect balloon positioning, which could lead to a kidney injury or other problems.Infection.Injury to an artery.Recovery and OutlookWhat is the recovery time after an intra-aortic balloon pump placement?Most people stay on an intra-aortic balloon pump for a few days. Your provider may temporarily stop the pump after a few days to see how your heart responds. If your heart pumps blood well on its own, your provider may remove the pump.In severe cases, you may need to keep using the IABP until another option is available, such as a donor heart for a transplant.When to Call the DoctorWhen should I see my healthcare provider?Call your healthcare provider if you experience any signs of infection or complications after a heart procedure, including:Excessive swelling or redness around the incision site.Fever.Heart palpitations.Increased shortness of breath (dyspnea).Swelling in your ankles or hands.Weight gain of more than five pounds in one week.Additional Common QuestionsHow long can an intra-aortic balloon pump stay in?An intra-aortic balloon pump usually only stays in place for a few days. However, your provider may keep it in place for up to 30 days, or sometimes longer.A note from Cleveland ClinicAn intra-aortic balloon pump is a device that controls blood flow through your heart. Your healthcare provider may use an IABP after heart surgery or if you’re in cardiogenic shock. The pump usually stays in place for only a few days. An IABP can be a lifesaving treatment as it keeps blood flowing throughout your body.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/18/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicCardiology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"