"Intrauterine Device (IUD): Birth Control, Use & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Intrauterine Device (IUD)AdvertisementAdvertisementAdvertisementIntrauterine Device (IUD)An intrauterine device (IUD) is a form of birth control that a healthcare provider inserts into your uterus. Once it’s inserted, an IUD can prevent pregnancy for up to 10 years or more, depending on the specific type. Your provider can remove your IUD at any time if you decide to become pregnant.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewBoth copper and hormonal IUDs form a T shape inside your uterus that holds the IUD in place.What is an intrauterine device (IUD)?An intrauterine device (IUD) is a type of birth control a healthcare provider inserts into your uterus. IUDs are the most commonly used type of long-acting reversible contraception (LARC). Once an IUD is inserted, you don’t have to worry about birth control until it’s time to replace it (three to 10 years, depending on the brand). LARCs, which include IUDs and contraceptive implants, are the most effective form of birth control that doesn’t require surgery.If you do decide to become pregnant, your provider can remove your IUD.Unlike other forms of contraception, like condoms, IUDs don’t prevent sexually transmitted infections (STIs). You can use an IUD with condoms to prevent pregnancy while also reducing your risk of contracting an STI.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the different types of IUDs?There are two kinds of IUDs, copper IUDs and hormonal (levonorgestrel) IUDs. Both have plastic frames that open into the shape of a T once inside your uterus. They have strings attached at the bottom that extend into your vagina so that your provider can remove your IUD as needed.The FDA has approved five brands of IUDs: Paragard® (copper) and Mirena®, Liletta®, Kyleena® and Skyla® (hormonal).Copper IUDs: Paragard’s IUD has a thin copper wire that coils around the stem part of the “T.” The stem ends in a smooth ball that prevents your cervix from getting punctured when your provider inserts your IUD.Hormonal (levonorgestrel) IUDs: The top part of the “T” contains the progestin hormone levonorgestrel, which flows through the stem. Progestins are a synthetic version of progesterone, a hormone that occurs naturally in your body. Mirena and Liletta are slightly bigger around than Kyleena and Skyla.Both types contain elements that cause them to show up during imaging procedures. Your provider can check your IUD during wellness visits to ensure it’s positioned correctly.How commonly are IUDs used?IUDs are the second most popular form of reversible birth control after birth control pills. Globally, around 23% of women and people assigned female at birth (AFAB) who use contraception choose IUDs. In the United States, IUD use increased from 2% to 14% between 2002 and 2014.Who shouldn’t use an IUD?You shouldn’t use an IUD if:You’re pregnant.You have an active sexually transmitted infection (STI).You’re considered high-risk for contracting an STI.You have cervical cancer or uterine cancer.You have unexplained vaginal bleeding.You shouldn’t use copper IUDs if you have a copper allergy or Wilson disease, a genetic condition that causes copper to build up in your body.You shouldn’t use hormonal IUDs if you have severe liver disease or breast cancer. You shouldn’t use them if you’re considered high-risk for breast cancer.AdvertisementProcedure DetailsHow do IUDs work?All IUDs trigger an immune response. Your body recognizes an IUD as an invader and springs into action to defend itself. This process results in inflammation. Inflammation in your uterus creates an environment that’s toxic to sperm. As a result, sperm can’t reach your fallopian tubes to fertilize an egg.The specific properties of copper and hormonal IUDs also prevent sperm from leaving your uterus.Copper IUDs: Heighten the inflammatory response, causing your uterine lining (endometrium) to become inflamed. Even if sperm were to fertilize an egg, your uterine lining would make it difficult for a fertilized egg (embryo) to implant there and develop.Hormonal IUDs: Release small amounts of the progestin hormone levonorgestrel over time. Levonorgestrel thickens your cervical mucus, making it harder for sperm to swim to your fallopian tubes. It also thins your uterus lining and partially suppresses your ability to release an egg during your menstrual cycle.Not all hormonal IUDs contain the same amount of levonorgestrel or have the same release rate. For example, Mirena and Liletta release more progestin than Kyleena and Skyla. Talk with your provider about which brands work best for you.How long do IUDs last?The FDA has approved the use of IUDs based on the following timeline:Paragard: Prevents pregnancy for 10 years.Mirena: Prevents pregnancy for eight years.Liletta: Prevents pregnancy for six years.Kyleena: Prevents pregnancy for five years.Skyla: Prevents pregnancy for three years.Depending on factors like your age and your health, your healthcare provider may recommend that you can safely wear a device for longer and still receive the same amount of protection. Follow your provider’s guidance.AdvertisementHow is an intrauterine device inserted?Only a healthcare provider can insert, adjust or remove an IUD.What happens before an IUD is inserted?Your provider will ensure you’re a good candidate for an IUD based on your health and lifestyle. You may need to take a pregnancy test or get tested for STIs beforehand.Talk with your provider about pain management prior to your procedure. Many people tolerate having an IUD inserted with no problems. Others avoid getting an IUD because they’re concerned about what the experience will feel like. Your provider may recommend that you take pain medications beforehand to lessen any pain or discomfort you may feel. They may also numb the area before the procedure.Communicating openly with your provider can lessen anxiety you may feel about getting an IUD.What happens during the insertion?Inserting an IUD takes fifteen minutes or less. Your provider can perform the procedure during an office visit.You’ll be positioned on a table as if you were having a Pap smear, with your knees bent, legs opened and supported in stirrups.You may be given a numbing injection near your cervix to lessen any pain or discomfort.Your provider will use a speculum to widen your vagina. You may feel mild to intense cramping when your provider inserts the IUD.What happens after the IUD is inserted?You may not notice any side effects, or you may experience mild to intense pain. It’s a good idea to allow yourself some recovery time just in case. Take the rest of the day off work if you can.You may:Feel light-headed or dizzy.Experience cramps or backaches.Experience light bleeding or spotting.Using over-the-counter (OTC) NSAIDs and heating pads can reduce the pain. Panty liners and pads can help manage any bleeding.How soon will my IUD start working?Paragard starts working immediately. Hormonal IUDs begin preventing pregnancy depending on where you are in your cycle. If you’re on your period, they start working right away. If you’re not on your period, it may take a week for them to offer you protection. Use other forms of birth control as you wait for your IUD to take effect.Care at Cleveland ClinicSchedule Birth Control CounselingFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsHow effective are IUDs at preventing pregnancy?IUDs are 99% effective at preventing pregnancy. IUDs and contraceptive implants are the most effective kinds of nonreversible birth control available.What are the advantages of using an IUD?IUDs:Have a 99% success rate.Prevent you from having to locate contraceptives before having sex.Are cost-effective and covered by Medicaid and most private insurers.Can be removed if you decide to become pregnant or switch birth control methods.Prevent you from getting pregnant for years without any ongoing maintenance on your part.Spare you the worry of having missed a birth control pill, forgotten to get a birth control shot, etc.Some studies have suggested that some IUD brands can reduce the risk of cervical cancer, endometrial cancer, ovarian cancer and pelvic inflammatory disease (PID).Additional advantages of hormonal IUDsResearch involving Mirena and Liletta has shown that they can:Reduce heavy menstrual bleeding (Mirena is FDA-approved to treat HMB).Relieve menstrual cramps and pain from endometriosis.Additional advantages of copper IUDsParagard is an effective form of emergency contraception. Inserting Paragard within five days of having unprotected sex can keep you from getting pregnant.What are the side effects of using an IUD?An IUD can disrupt your menstrual cycle:Copper IUDs can make your menstrual cramps worse and increase your period bleeding, especially during the first several months after your IUD is inserted.Hormonal IUDs can make your periods irregular, especially during the first several months after insertion. You may miss periods (amenorrhea).The strings from the IUD may feel stiff at first, and you or your partner may notice this during intercourse. Over time, the strings should soften. Speak to your provider if your IUD is preventing you from having a healthy sex life or causing you to experience pain during sex.Most people who use IUDs continue to ovulate, or release an egg each month during their menstrual cycle. Ovulating may cause you to develop ovarian cysts, growths that are usually harmless and that resolve on their own. It’s common to have cysts depending on where you are in your menstrual cycle.What are the risks of using an IUD?IUDs are considered both safe and effective. Complications — while rare — may include:Expulsion: Your IUD may slip out of your uterus. When this happens, it usually occurs during your period, within the first few months after it’s been inserted.Perforation: The uterine wall can be pierced during insertion.High-risk pregnancy: Your chances of becoming pregnant are slim. On the off chance that you do become pregnant, your pregnancy will be considered more likely to result in pregnancy complications. Making sure that you don’t use your IUD beyond its expiration date can prevent pregnancy.Infection: Bacteria can enter your body when your IUD is inserted, causing an infection. Infections are most likely to occur within the first 20 days of insertion. Your healthcare provider will clean your cervix during IUD insertion to lower the risk.When to Call the DoctorWhat questions should I ask my provider?Would you recommend an IUD for me?What brand/s of IUD would you recommend for me?What amount of bleeding should I expect after getting an IUD?Will an IUD disrupt my menstrual cycle? How?Should I use backup contraception in addition to my IUD?Will my IUD affect the experience of intercourse for me? For my partner?A note from Cleveland ClinicIntrauterine devices (IUDs) are a safe, effective and convenient form of birth control. Once inserted, they can prevent pregnancy for several years. Weigh the pros and cons of getting an IUD with your healthcare provider. They can help you decide if an IUD is the best option for you. They can also recommend the type of IUD that’s best for you. If you do decide to use an IUD, don’t forget to use another method to prevent STIs.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/13/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Birth Control CounselingFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"