"Intrathecal Baclofen Pump For Muscle Spasticity Treatment800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Intrathecal Baclofen PumpAdvertisementAdvertisementAdvertisementIntrathecal Baclofen PumpBaclofen is a muscle relaxant medicine commonly used to decrease spasticity related to multiple sclerosis, spinal cord injuries, or other neurological diseases. An intrathecal delivery system, which provides the baclofen right to the target site in the spinal cord, is an effective way to deliver the medicine.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsAdditional DetailsOverviewWhat is spasticity?Spasticity is a movement disorder that can occur in conditions which affect the brain or the spinal cord, such as multiple sclerosis, stroke, cerebral palsy, spinal cord injury, or brain injury. Spasticity is caused by an imbalance between signals that inhibit or stimulate the spinal cord. This results in hyperexcitable stretch reflexes, increased muscle tone, and involuntary movements.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the symptoms of spasticity?Spasticity causes muscle stiffness and tightness, which interferes with voluntary movements. Spasticity can also cause muscle spasms (jerky involuntary movements) or clonus (repetitive involuntary movement). Stiffness and spasms are often bothersome and sometimes painful, and they interfere with the ability to carry out daily activities. Spasms may also disrupt sleep and increase daytime fatigue. When spasticity is severe, contractures (fixed limitations of range of motion) may develop.How can spasticity be treated?Stretching, exercise, and rehabilitation are the first line of interventions for spasticity. Oral medications are often effective, but may cause side effects such as drowsiness. When spasticity affects only a few muscles, local injections of botulinum toxin can be helpful. When spasticity is diffuse and severe, intrathecal baclofen (Lioresal®) (ITB) may be a good treatment option.AdvertisementWhat is baclofen?Baclofen is one of the medications most commonly used to treat spasticity. Baclofen acts in the spinal cord, and improves hyperactive reflexes and excessive muscle tone. Some of the side effects of baclofen are:DrowsinessDizzinessWeaknessNauseaHeadacheStopping baclofen suddenly may cause withdrawal symptoms that include seizures. You should avoid suddenly stopping this medication.How do I know that I am a good candidate for ITB?If you have severe spasticity, and oral medications are not helpful, your treating physician may refer you for a consultation to evaluate if ITB could be a good option for you. Detailed clinical assessments are performed, usually by a physician and physical/occupational therapists. These professionals provide information about ITB for discussion.A test injection is then performed to further evaluate the appropriateness of ITB. The test consists of a spinal tap, with a small dose of baclofen injected into the spinal fluid. A few hours later, the effects of the medication are evaluated. These effects are temporary, but provide very useful information that help with the decision process.AdvertisementWhat happens if the test is successful?If the test is successful, you will be referred to a neurosurgeon who will implant the baclofen pump system. After the surgery, you will stay in the hospital for a short time. In some cases, inpatient rehabilitation is needed to adjust the pump and perform functional training before returning home. In all cases, outpatient or home rehabilitation is needed to optimize the benefits of ITB.Procedure DetailsWhat is intrathecal baclofen therapy?Baclofen is usually taken by mouth several times per day. Intrathecal baclofen therapy (ITB) consists of delivering a liquid form of baclofen into the spinal fluid, using a device called a baclofen pump. ITB is approved by the FDA for the treatment of severe spasticity. ITB has been used at the Mellen Center since 1990.What is a baclofen pump?The baclofen pump system consists of a pump and a catheter that brings the medication from the pump into the spinal fluid. The pump is a round metallic disc (about 1 inch thick and 3 inches in diameter), which is surgically implanted under the skin of the abdomen.The pump contains a battery, which usually lasts between 5 and 7 years, a reservoir for the medication, and a microprocessor. The pump can be programmed with a small computer which communicates with the pump via a wand placed over the skin. The catheter is a thin flexible tube implanted under the skin. One end of the catheter is connected to the pump, and the other end is inserted into the spine at various levels.What is involved in the management of a baclofen pump?The pump needs to be refilled at regular intervals (usually every 1 to 6 months) by a trained healthcare professional who possesses the equipment needed. The pump is refilled by inserting a needle through the skin into a refill port on the pump. In some cases the refills can be done at home, but follow-up visits are needed one to two times per year to ensure that the therapy is working appropriately. The dose of baclofen can be adjusted at any time, but the adjustment must be done by a trained professional. When the battery approaches the end of its life, the pump needs to be replaced (but not the catheter). When a problem with the baclofen pump is suspected, medical attention should be sought as soon as possible.Risks / BenefitsWhat are the advantages of ITB compared to taking baclofen by mouth?ITB is usually much more effective in controlling the symptoms of spasticity, because the medication is brought directly in contact with the spinal cord.With ITB, the medication is delivered continuously, day and night, giving a more steady relief of symptoms.ITB, in most cases, causes less side effects than oral baclofen, particularly when high doses are needed to treat severe spasticity.ITB programming is very flexible, allows more precise dosing of baclofen, and gives the ability to deliver different doses at different times of the day.Compared to other surgical treatments, ITB is reversible, as the pump can be stopped and removed if needed.What are the potential risks and adverse effects of ITB?The baclofen pump system needs to be surgically implanted under anesthesia, leading to the usual risks of surgery.Complications more specific to ITB include the risk of infection around the device, and the risk of device malfunction. Baclofen withdrawal (from abrupt interruption of the delivery of baclofen via the pump) and baclofen overdose (usually as a result of human error) have also occurred with ITB. Serious complications from ITB are infrequent, and in most cases reversible as long as they are diagnosed and treated in a timely fashion. Even without complications, ITB can cause increased weakness, because it is very potent.Additional DetailsDoes insurance cover ITB therapy?Because ITB is approved by the FDA, it is often covered by healthcare insurance, including Medicare and Medicaid. However, since coverage varies greatly between individual insurance plans, we encourage you to check with your insurance ahead of time.In summary:ITB can be very effective on severe spasticity and can markedly improve quality of life.Because ITB is a surgical treatment with known risks, thorough testing and education are needed before starting this therapy.Compliance with follow-up visits, and with rehabilitation and home exercise, are essential to maximize the chances of success and to minimize the risk of adverse effects or complications.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/28/2019.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"