"IV Fluids (Intravenous Fluids): Types & Uses800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/IV FluidsAdvertisementAdvertisementAdvertisementIV FluidsIV fluids are specially formulated liquids that are injected into a vein to prevent or treat dehydration. They are used in people of all ages who are sick, injured, dehydrated from exercise or heat, or undergoing surgery. Intravenous rehydration is a simple, safe and common procedure with a low risk of complications.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat are IV fluids?IV fluids are liquids injected into a person’s veins through an IV (intravenous) tube. They prevent or treat dehydration and electrolyte imbalances.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy are intravenous fluids used?Water is essential to every cell in our bodies. In fact, our bodies are made up of about 60% water. When you don’t have enough water in your body, that’s called dehydration. A person needs IV fluids when they become dangerously dehydrated.Serious dehydration may occur when you:Are sick (vomiting and diarrhea).Exercise too much or spend too much time in the heat without drinking enough.Have a serious injury or burns.Have surgery, especially when you’re asleep for a long time or are unable to eat or drink.What are the effects of dehydration?When you are dehydrated, it can affect:Balance of important minerals (electrolytes) in the body.Cognitive (mental) performance.Energy level.Gastrointestinal function (your ability to digest food and create pee and poop).Headache frequency and intensity.Many organs, including the kidneys, heart and brain.Physical performance.Skin health.Signs of severe dehydration include:Dizziness.Dry eyes (no tears).Dry lips and tongue.Dry, wrinkly or blotchy skin.Fatigue (feeling tired).Fast breathing.Hands and feet that are cool to the touch or blotchy looking.Less pee than usual (fewer than four times per day).Pee that is dark yellow and smells strong.AdvertisementProcedure DetailsWhat are the types of IV fluids?There are different kinds of IV fluids. Your healthcare provider will decide which type is right for you, depending on why you need them.Crystalloid solutions: These are the most common types of IV fluid. They contain small dissolved molecules that pass easily from the bloodstream into tissues and cells. Examples include normal saline, which is salt in water, and D5W, which is dextrose (sugar) in water. Another example is lactated Ringer’s, which contains sodium, chloride, potassium, calcium and lactate. It’s used for aggressive fluid replacement.Colloids: These are large molecules that can’t easily pass through cell membranes and are more likely to stay in the blood vessels. Examples include albumin and hetastarch.What happens during rehydration with IV fluids?If you need IV fluids, a healthcare provider will:Decide the type of IV fluid you need.Determine the amount of fluid you need and how quickly. This is based on many factors, including your weight, age and medical conditions.Disinfect (clean) the skin where the IV will go, usually on the inside of the elbow or on top of the hand.Tie an elastic band (tourniquet) around your arm to make blood fill the veins.Examine the veins to find the exact insertion site.Slide a sterile needle into the vein, which may pinch. The needle will have a small plastic tube at the other end.Remove the tourniquet.Place a small plastic attachment onto the tube.Test the tube to make sure a little bit of fluid can go in.Tape the IV needle to your arm so that it stays in place.Attach the small tube to a longer tube, and then attach it to a bag of fluids.Hang the bag from a hook on a tall stand (called an IV stand).Turn on a machine that will pump the fluid into the IV line.Check your IV line regularly and monitor the amount of fluid entering your body.The IV also may be used to deliver medications or nutrition.AdvertisementWhat happens after IV fluids?IV fluids can make you feel better very quickly. But your healthcare providers will determine when you can stop receiving intravenous fluids.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentRisks / BenefitsWhat are the advantages and risks of this procedure?IV rehydration is a common, simple and safe procedure that can make you feel better quickly and help save your life if you are seriously ill.But rare complications can occur, including:Air embolism: An air embolism, or gas embolism, occurs when an IV pushes too much air into the vein. It’s rare but can have serious consequences, including possible death.Collapsed vein: Sometimes, the vein collapses when the needle is inserted or when an IV is in place for a long period of time. If this happens, your healthcare provider will try to find another vein to use. There are many other veins to take over for the collapsed vein.Fluid overload: If too much fluid is given too quickly, you can experience headache, high blood pressure and trouble breathing. This usually resolves quickly with an adjustment to fluid levels. But it can be dangerous.Hematoma: A hematoma occurs when blood leaks from the blood vessel into nearby tissues. It looks like a bad bruise and usually goes away in a few weeks.Infection: If the area is not clean when the needle is inserted, infection may occur. Your healthcare provider can usually treat infections with antibiotics.Infiltration: If the needle moves or gets dislodged, fluids can enter tissues around the vein. This may cause stinging and bruising, but it’s typically easy to resolve.Phlebitis: Phlebitis occurs when the vein becomes swollen because of the IV. It’s one of the more common complications, but it’s usually easily treatable by removing the IV, applying a warm compress and elevating the arm.Recovery and OutlookWhat is the recovery time after receiving IV fluids?Many people don’t need recovery time or have any restrictions after receiving IV fluids.However, you may need other treatments or additional rest depending on the reason you needed rehydration in the first place. For example, if you had vomiting or diarrhea due to infection, you might need to take medicines afterward. If you had surgery, you might have certain restrictions while you heal.Ask your healthcare provider about your recovery and restrictions.When to Call the DoctorWhen should I report something to my healthcare provider while receiving IV fluids?Tell your healthcare provider if the IV fluids seem to be flowing too slowly or too quickly.Also, tell the physician or nurse if you have any discomfort at the IV site, a loose IV needle, headache or trouble breathing.A note from Cleveland ClinicIV fluids are specially formulated liquids that are injected into a vein to prevent or treat dehydration. Intravenous rehydration is a simple and safe procedure used in people who are sick, injured, dehydrated from exercise or heat, or undergoing surgery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/03/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementQuestions 216.444.2538Appointments & LocationsRequest an AppointmentFind a Primary Care ProviderFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"