"Atherectomy: Procedure Details & Purpose800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/PAD: AtherectomyAdvertisementAdvertisementAdvertisementPAD: AtherectomyAtherectomy is a minimally invasive procedure healthcare providers use to remove plaque buildup and open narrow or blocked arteries. The procedure helps restore healthy blood flow and relieves symptoms of peripheral artery disease (PAD).ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewPeripheral Artery Disease Intervention Treatments: Jaikirshan Khatri, MDWhat is atherectomy for PAD?Peripheral artery disease (PAD) happens when plaque builds up in your arteries, causing them to become narrow and block your blood flow. This plaque build-up is atherosclerosis. In an atherectomy, healthcare providers remove plaque with a catheter with a sharp blade or laser on its end. The sharp blade or laser lets them cut out or scrape out the hard plaque. Your provider may also perform angioplasty (ballooning) or stent placement.How common are atherectomies?In the U.S., about 6.5 million people ages 40 and older have PAD. Researchers estimate that healthcare providers in the U.S. perform more than 190,000 atherectomies annually.What are the types of atherectomies?All atherectomies remove plaque buildup from your arteries. Healthcare providers may use different types of blades or use lasers to remove plaque:Excisional atherectomy: A blade cuts plaque in one direction.Laser ablation atherectomy: A laser destroys plaque.Orbital atherectomy: A spinning tool works like sandpaper to remove plaque.Rotational atherectomy: Tiny blades cut plaque in a circular motion.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before atherectomy?Your healthcare provider may recommend certain tests to see narrowing or blockages in your arteries. You may have:Angiography.Vascular ultrasound.Follow your provider’s instructions to prepare for the procedure, including whether you should:Eat or drink.Take medications (especially anticoagulants).Your provider tells you when to arrive on the day of the procedure. When you arrive, you change into a hospital gown. A provider inserts a catheter to deliver anesthesia so you won’t feel pain during atherectomy.What are the details of an atherectomy procedure?After you receive local anesthesia and mild sedation, your healthcare provider:Inserts the catheter into your artery.Moves the catheter along your artery to access the narrow or blocked area.Uses the blade or laser at the end of the catheter to scrape or cut the plaque so they can remove it.Your healthcare provider may repeat the process several times until they remove enough plaque so blood can flow through your artery.AdvertisementWhat happens after atherectomy?You need to lie flat for up to six hours after atherectomy to prevent bleeding. Healthcare providers will monitor your blood pressure, pulse and heart rate while you recover.Care at Cleveland ClinicPeripheral Artery Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of atherectomy?Atherectomy often relieves PAD symptoms without major surgery. Atherectomy is a minimally invasive procedure. Healthcare providers make just one small puncture to get to your artery. It typically takes about two hours to perform the procedure.AdvertisementAre there risks or complications of atherectomy?Sometimes a piece of plaque can break off and become lodged or stuck in a smaller downstream blood vessel as healthcare providers cut or scrape away plaque. The atherectomy procedure can also cut too deep and create a tear or hole in your blood vessel.Recovery and OutlookHow long does it take to recover from atherectomy?Most of the time, atherectomy is an outpatient procedure, meaning you can go home the same day. You may spend one day in the hospital. Your healthcare provider lets you know what to expect based on your situation. Most people are able to resume their typical activities a few days after their procedure. Everyone’s situation is different, so ask your healthcare provider when you can go back to your routine.When to Call the DoctorWhen should I call my healthcare provider after atherectomy?Tell your healthcare provider if you have any new or worsening symptoms, especially:Painful areas in your groin or leg.Swelling (edema).Redness or warmth.Coldness or numbness in the treated leg.A note from Cleveland ClinicAn atherectomy is a minimally invasive way to remove plaque from blood vessels, opening up your arteries so your blood can flow normally. Healthcare providers often use this procedure to treat peripheral artery disease (PAD). If you have this condition, an atherectomy may be one way to ease your symptoms.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/19/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPeripheral Artery Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"