"PAD Wound Care: Negative Pressure Wound Therapy800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/PAD Wound Care: Negative Pressure Wound TherapyAdvertisementAdvertisementAdvertisementPAD Wound Care: Negative Pressure Wound TherapyContentsArrow DownOverviewResourcesContentsArrow DownOverviewResourcesOverviewNegative Pressure Wound TherapyNegative pressure wound therapy (NPWT) is a type of wound care treatment that can be used for wounds on all parts of the body.Parts of NPWTSpecial foam padding is placed on or within the wound.A thin clear occlusive dressing seals over the wound.A track pad with suction tubing connects to a canister to collect the fluid drainage.A special pump is used to apply negative pressure.The NPWT systemPulls fluid from the wound, decreasing edema.Allows the wound to compress down.Encourages new healthy tissue growth and blood vessels to form.Negative Pressure Wound Therapy is one of many options for patients in the treatment of difficult to heal wounds.Your medical and surgical team will work together with you to heal your current wound and prevent future wounds from occurring.ResourcesDoctors vary in quality due to differences in training and experience; hospitals differ in the number of services available. The more complex your medical problem, the greater these differences in quality become and the more they matter.Clearly, the doctor and hospital that you choose for complex, specialized medical care will have a direct impact on how well you do. To help you make this choice, please review our Miller Family Heart and Vascular Institute Outcomes.Cleveland Clinic Heart and Vascular Institute Vascular Medicine Specialists and SurgeonsChoosing a doctor to treat your vascular disease depends on where you are in your diagnosis and treatment. The following Heart and Vascular Institute Sections and Departments treat patients with all types of vascular disease, including blood clotting disorders:Section of Vascular Medicine: for evaluation, medical management or interventional procedures to treat vascular disease. In addition, the Non-Invasive Laboratory includes state-of-the art computerized imaging equipment to assist in diagnosing vascular disease, without added discomfort to the patient. Call Vascular Medicine Appointments, toll-free 800-223-2273, extension 44420 or request an appointment online.Department of Vascular Surgery: surgery evaluation for surgical treatment of vascular disease, including aorta, peripheral artery, and venous disease. Call Vascular Surgery Appointments, toll-free 800-223-2273, extension 44508 or request an appointment online.IVC Filter Retrieval Clinic - to make an appointment, call Vascular Medicine at 216.444.4420. Ask for Dr. Bartholomew in the Filter Retrieval Clinic. Your appointment will include a consultation with Dr. Bartholomew and the physicians who will perform the IVC filter retrieval procedure.You may also use our MyConsult second opinion consultation using the Internet.The Heart and Vascular Institute also has specialized centers and clinics to treat certain populations of patients:Aorta CenterThrombosis CenterLower Extremity Wound ClinicFMD ClinicSCAD ClinicLearn more about experts who specialize in the diagnosis and treatment of vascular and arterial disease.See: About Us to learn more about the Sydell and Arnold Miller Family Heart & Vascular Institute.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyContactIf you need more information, click here to contact us, or call the Miller Family Heart and Vascular Institute Resource & Information Nurse at 216.445.9288 or toll-free at 866.289.6911. We would be happy to help you.Becoming a PatientMake an appointmentPlan Your VisitBilling & InsuranceVisitor AmenitiesAdvertisementConditionsVascular DiseasePeripheral Arterial Disease (PAD)Treatment GuidesAortic AneurysmMay Thurner SyndromeThoracic Outlet SyndromeVein and VascularAll Miller Family Heart & Vascular Institute Treatment GuidesAdvertisementDiagnostic TestsDiagnostic tests are used to diagnose your abnormal heartbeat and the most effective treatment method.Diagnostic testingWebchatsOur webchats and video chats give patients and visitors another opportunity to ask questions and interact with our physicians.Vascular Disease, Peripheral Arterial Disease & Thrombosis webchats and video chatsAll Miller Family Heart & Vascular Institute webchatsVideosVascular Disease and Treatments VideosSpreecast Video ChatsAll Miller Family Heart & Vascular Institute VideosInteractive ToolsMiller Family Heart & Vascular Institute Interactive ToolsResource LinksRecovery at homeSupport Groups and InformationVisit Health Essentials - Read articles on vascular disorders and healthy living on Health EssentialsFollow Heart & Vascular Institute webchats and news stories on TwitterSubscribe to Heart and Vascular eNewsAmerican Stroke Association *American Heart Association *Vascular Cures**A new browser window will open with this link. The inclusion of links to other websites does not imply any endorsement of the material on those websites nor any association with their operators.Why choose Cleveland Clinic for your care?Our outcomes speak for themselves. Please review our facts and figures and if you have any questions don’t hesitate to ask.Care at Cleveland ClinicPeripheral Artery Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/03/2019.Learn more about our editorial process.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPeripheral Artery Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"