"Psychological Treatment for Pain800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Pain: Psychological TreatmentAdvertisementAdvertisementAdvertisementPain: Psychological TreatmentBeing in pain might mean that you are depressed or anxious or tired. Psychological treatments offer non-drug methods of managing pain.ContentsArrow DownOverviewProcedure DetailsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsWhen to Call the DoctorOverviewWhat should I know about psychological treatment for pain problems?When you are in pain, you may have feelings of anger, sadness, hopelessness, and despair. Pain can alter your personality, disrupt your sleep, and interfere with your work and relationships. Psychological treatment provides safe, non-drug methods that can treat your pain directly by reducing high levels of physiological stress that often worsen pain. Psychological treatment also helps improve the indirect effect of pain by helping you learn how to cope with the many problems associated with pain.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is psychological treatment often recommended for a physical problem like pain?Psychological treatment often is advised because pain is a good example of a mind-body connection. When the body feels pain, one's thoughts and emotions are influenced by how much pain is felt. Depression and anxiety make pain worse, yet pain causes depression and anxiety. Stress makes pain worse, yet pain causes stress. Lack of sleep makes pain worse, yet it is very difficult to sleep when you have pain. Psychological treatment can help with managing the effects of pain.Procedure DetailsWhat are the psychological treatments for pain?A large part of psychological treatment for pain is education, helping patients to gain skills to manage a very trying problem. The most common psychological treatments are:Talk therapyRelaxation trainingStress managementPain coping skills trainingTalk therapy allows you to get the support and counseling of a psychiatrist or psychologist. Cognitive therapy takes advantage of the fact that altering information, beliefs, and attitudes can modify, for better or worse, the amount of pain you feel. This type of psychological treatment, combined with a complete pain treatment program, may be needed to help you manage your condition.Relaxation training teaches you how to enter a physiological state of deep relaxation that has been associated with healing and pain reduction.In stress management, you can learn how your thoughts affect your stress level and how to develop a healthier approach to hard situations.In pain coping skills training, you can discover how to adapt your life to the pain so that you can make plans, enjoy friends and family, and have fun again.AdvertisementWhen to Call the DoctorWhen should I seek psychological treatment for my pain problem?Psychological treatment can be considered for any intense and repeated pain problem that has not responded to initial medical and/or surgical treatment. Your health care team can help you decide which treatments may be right for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/30/2015.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"