"Pain Management: Painkillers, Chronic Pain, Pain Relief, Nerve Pain800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Pain ManagementAdvertisementAdvertisementAdvertisementPain ManagementThrough a pain management plan, healthcare providers help people manage all kinds of pain. Pain management approaches include medications, injections, therapy and exercise. Your provider may recommend one approach or a combination of several. Pain management plans help people with chronic (long-lasting) pain feel better and improve their quality of life.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is pain management?Everyone feels some kind of pain from time to time. Pain is the most common symptom of potentially thousands of injuries, diseases, disorders and conditions you can experience in your lifetime. It can also result from treatments for conditions and diseases. Pain can last a short time and go away when you heal (acute pain). Or it can also last for months or years (chronic pain).Pain management specialists help you regulate pain with medications, procedures, exercises and therapy. To reduce or relieve pain, your provider may recommend one approach or a combination of several. You may receive care in a pain clinic, provider’s office or hospital.Depending on the cause and type of pain, it may not be possible to find total relief, and the pain may not get better right away. Your provider will work with you to adjust your pain management plan so you can feel better.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs pain management?Anyone with pain can benefit from a pain management plan. A comprehensive plan can help people manage pain that lasts a few days (such as after an injury or surgery). It can also help people who have long-term pain from disease or chronic health conditions.Pain is the main symptom of a wide range of injuries, infections and diseases. Cancer pain can result from nearly every type of cancer. One of the first signs of a heart attack is often chest pain that may move to your arms, back or jaw. Some of the most common conditions that cause pain include:Arthritis and muscle and joint injuries: Several types of arthritis, including osteoarthritis and gout, cause severe pain in the joints. Orthopedic injuries (such as frozen shoulder) limit mobility and lead to pain and stiffness.Autoimmune disorders: Lupus, Crohn’s disease and other autoimmune disorders cause your immune system to attack the body.Back injuries: Herniated disks, sciatica and other back problems are common causes of pain and limited mobility.Chronic pain disorders: There are several disorders that can lead to widespread pain all over your body. These include fibromyalgia, complex regional pain syndrome (CRPS) and central pain syndrome.Endometriosis: This painful condition causes the lining of the uterus to grow outside of the uterine walls. Endometriosis causes abdominal pain and irregular periods.Facial pain: Several conditions can cause pain in your face, including trigeminal neuralgia (TN), an abscessed tooth and other dental problems.Headaches: Migraine headaches and cluster headaches cause pain in the head and neck.Kidney stones and urinary tract problems: Kidney stones can cause severe pain when they pass through your body with urine (pee). Interstitial cystitis (painful bladder syndrome) causes pelvic pain and pressure.Nerve damage (neuropathy): Damaged nerves can lead to pain, stinging and tingling. Carpal tunnel syndrome is a common type of neuropathy.What are the types of pain?Some types of pain result from a disease or accident. Other pain may linger or come back after treatment. Sometimes, pain results from treatments (such as pain after surgery). Some pain has no known cause. The types of pain include:Acute: This type of pain is sharp and often results from an injury. Acute pain gets better when providers treat the injury or disease that’s causing the pain. This type of pain can result from a bone fracture, muscle spasms, a burn or other kind of accident. Some illnesses and disorders, such as appendicitis and shingles, cause acute pain.Chronic: Providers call pain that lasts more than six months chronic pain. This type of pain can result from an untreated injury or disease. It can also result from conditions like arthritis, fibromyalgia or nerve damage (neuropathy). Low back pain is another type of chronic pain.Nociceptive: Nerve cell endings (nociceptors) send pain signals to your brain when you have an injury. Nociceptive pain happens when you break a bone, bump your head or pull a muscle. The pain can be sudden and short-lived or long-lasting. It can affect your internal organs (visceral pain) or your musculoskeletal system (somatic pain).Neuropathic: Problems with the nervous system cause neuropathic pain (nerve pain). It happens when nerves fire pain signals to the brain by mistake, even when they aren’t damaged. Diabetes, multiple sclerosis (MS) and HIV commonly cause this type of pain.AdvertisementProcedure DetailsHow do healthcare providers evaluate pain?The first step in managing pain is finding out what’s causing it. Your provider will ask you when and where you feel pain and if it gets better (or worse) with certain activities. Tell your provider if it stays in one place or moves (radiates) to other parts of your body.Your provider will also ask how the pain feels. Sometimes, providers ask you to rate your pain on a scale from 0 to 10 (pain scale). Depending on the cause, location and severity of the pain, you may describe it as:Aching, dull or nagging.Burning, stinging or pulsing (like electric shocks).Sharp or shooting.Throbbing or pounding.What are the types of pain management?There are many ways to manage different types of pain. You may have a team of pain management specialists (pain management doctors) who work together to help you manage long-term or severe pain. These specialists work in a field of medicine called algiatry.Your provider may recommend one approach or a combination of several pain management techniques. These may include:At-home remedies: You may be able to relieve pain from injuries to bones, muscles and soft tissues at home. Ask your provider about the RICE method (rest, ice, compression and elevation). While you’re resting, apply ice or a cold compress every 20 minutes or so to reduce swelling and pain.Counseling and therapy: Cognitive behavioral therapy (CBT) and biofeedback can help you manage chronic pain by changing how your mind reacts to physical discomfort. Because chronic pain can also lead to depression and anxiety, your provider may recommend other types of therapy, counseling or meditation to help you manage these emotions. Some people keep a pain diary to keep track of what makes pain better or worse. These details can help your provider plan treatment.Exercise: Your provider may recommend Pilates, yoga, tai chi, swimming or walking. These exercises can reduce chronic pain, improve posture and help your body work better overall. They also benefit your mental health and help you stay balanced.Hands-on treatments: Many people find pain relief from physical therapy, massage, acupuncture, osteopathic manipulative treatment (OMT) and chiropractic adjustments. During these hands-on treatments, your provider uses a range of techniques. They reduce pain, improve alignment and help your body work better.Injections and stimulations: Your provider may recommend transcutaneous electrical nerve stimulation (TENS) or radiofrequency ablation to relieve nerve pain. Steroid injections deliver pain relief medication directly to the painful area.Lifestyle changes: Certain lifestyle changes can relieve pain. If you carry extra weight or have obesity, your provider may recommend losing weight. People who eat a balanced diet, drink plenty of water, get enough sleep and manage stress levels may be less likely to have chronic pain.Medications: Depending on the type of pain, your provider may recommend prescription or over-the-counter medications to relieve discomfort. You may need antibiotics to treat an infection, muscle relaxers for spasms or anti-inflammatory drugs to relieve swelling. Some of these drugs (such as pain-relieving opioids) can be habit-forming. Always follow your provider’s instructions when taking medications.AdvertisementRisks / BenefitsWhat are the advantages of pain management?A comprehensive pain management plan can help you feel better physically and mentally. Although it isn’t always possible to find total relief from pain, you may be able to reduce pain or learn to respond to it in a different way. Many people with chronic pain enjoy a better quality of life with a pain management program.What are the risks or complications of pain management?Different pain management approaches have their own complications. Talk to your provider about medication side effects and the complications from injections, hands-on treatments or other procedures.Recovery and OutlookHow effective are pain management plans?Depending on cause of pain and the treatments you receive, it may take a while for you to feel better. Pain might not go away completely. Your pain management plan is more likely to be effective if you work closely with your provider and adjust the plan as your needs change.When to Call the DoctorWhen should I see my healthcare provider about pain management?See your provider if:Pain doesn’t get better, worsens or comes back after treatment.You feel anxious or depressed.You’re having trouble sleeping because of pain.Discomfort and pain are keeping you from enjoying your usual activities.A note from Cleveland ClinicLiving with pain can be extremely challenging, both physically and mentally. If you’re in pain, talk to your provider about a personalized pain management plan. Be open and honest with your provider about when you feel pain and what makes it better or worse. Tell your provider if you feel depressed or anxious. If pain doesn’t get better or comes back after treatment, talk to your provider. You may need to adjust your pain management plan to help you feel better.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/15/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7243Questions 216.444.9134Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"