"Parkinson’s Disease Medications: What They Are & Side Effects 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Parkinson’s Disease MedicationsAdvertisementAdvertisementAdvertisementParkinson’s Disease MedicationsThere are several types of medications for Parkinson’s disease that can help with symptom management. The most common is levodopa. Most people take a combination of medications.ContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat types of medications are used for Parkinson’s disease?Medications for Parkinson’s disease (PD) mainly help with symptom management. They can’t cure Parkinson’s disease.Parkinson's disease is a progressive (meaning, it gets worse with time) neurological condition that affects the way your body moves. It can also affect your sense of smell, how you sleep, how your gut works and more. It happens due to the breakdown of certain nerve cells in your brain. Many of the affected cells are in the region called the substantia nigra, which controls movement. These nerve cells die or become damaged, losing the ability to produce an important neurotransmitter (chemical) called dopamine.Most medications for PD aim to manage the levels of dopamine in your body and/or other neurotransmitters that affect these levels. Most people with PD take a combination of medications.Levodopa and carbidopaLevodopa is the go-to treatment for Parkinson’s disease. It’s a dopamine replacement agent. Levodopa crosses the blood-brain barrier (BBB) and gets converted to dopamine in your central nervous system and peripheral nervous system.Blood enzymes in your body break down most of the levodopa before it reaches your brain. So, it’s combined with another medication called carbidopa (an enzyme inhibitor). This allows more levodopa to reach your brain. It also helps reduce severe nausea and vomiting, which are common side effects of levodopa alone.For most people, levodopa reduces the symptoms of slowness (bradykinesia), stiffness and tremor. It’s especially effective for people who have a loss of spontaneous movement and muscle rigidity. Brand names for combination levodopa-carbidopa include:Sinemet®.Rytary®.Parcopa®.Dhivy®.Dopamine agonistsHealthcare providers may prescribe a dopamine agonist medication for the early stages of Parkinson’s disease and/or younger people with the condition. Dopamine agonists activate dopamine receptors in your brain. These medications may lengthen the duration of effectiveness of levodopa.Dopamine agonists providers prescribe for Parkinson’s disease include:Pramipexole (Mirapex®).Ropinirole (Requip®).Rotigotine (Neupro®).Enzyme inhibitorsEnzyme inhibitors, like MAO-B inhibitors and COMT inhibitors, slow down the enzymes that break down dopamine in your brain. This allows more dopamine to be available in your brain.The main MAO-B inhibitor medications are selegiline (Carbex®, Eldepryl®) and rasagiline (Azilect®). These slow down the activity of the enzyme that metabolizes dopamine in your brain. This delays the breakdown of naturally occurring dopamine and dopamine formed from levodopa. Providers may prescribe it alongside levodopa because it may enhance and prolong the effectiveness of levodopa.COMT inhibitors include entacapone (Comtan®) and opicapone (Ongentys®). Providers typically prescribe them to extend the duration of the effect of levodopa.AmantadineProviders may prescribe amantadine (Osmolex®, Gocovri®, Symmetrel®) to help reduce twitching or writhing movements (dyskinesia) that occur as a result of treatment with dopaminergic medications.Amantadine is actually an antiviral medication, but its antiviral components aren’t what helps with this symptom. Researchers aren’t exactly sure how the medication works to minimize dyskinesia.Amantadine also treats other movement symptoms of Parkinson’s, including abnormal muscle activations that result in dystonia.Anticholinergic medicationsAnticholinergic medications can help reduce tremors and muscle rigidity. They work by blocking acetylcholine. This neurotransmitter’s effects become more intense when dopamine levels drop.Anticholinergic medications your provider may prescribe include:Benztropine mesylate (Cogentin®).Trihexyphenidyl (Artane®).Adenosine A2A antagonistsA non-dopaminergic medication, istradefylline (Nourianz®), can improve motor symptom control, especially during lapses of symptom control between doses of dopaminergic medications. Researchers don’t know exactly how this medication works, but the result is that it enhances the effects of dopamine.Other medicationsParkinson’s disease can cause other symptoms that don’t have to do with movement issues. Your healthcare provider may recommend other medications for specific conditions or symptoms related to PD, including:Sildenafil (Viagra®) for erectile dysfunction.Modafinil (Provigil®) for daytime sleepiness (hypersomnia).Polyethylene glycol (GlycoLax®, MiraLax® and others) for constipation.Methylphenidate (Methylin®, Ritalin®) for fatigue.Cholinesterase inhibitors for dementia.SSRIs (selective serotonin reuptake inhibitors) for depression and/or anxiety.Antipsychotic medications (like pimavanserin) for psychosis-related symptoms, like hallucinations.What is the best medication for Parkinson’s disease?There’s no single “best” medication for Parkinson’s disease. You typically need to take a combination of medications to manage symptoms. However, levodopa is the main go-to medication for PD.It’s the most effective at managing slowness of movement (bradykinetic symptoms). It’s also the most effective medication to improve the quality of life in people with idiopathic (unknown cause) Parkinson’s disease.Risks / BenefitsAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the side effects of Parkinson’s disease medications?The side effects of Parkinson’s disease medications vary based on the type. Combining certain medications can also cause different side effects. Be sure to talk to your healthcare provider about side effects to look out for before starting a medication.Common side effects of Levodopa include:Nausea and vomiting.Dizziness.Headache.Daytime sleepiness.Postural hypotension (low blood pressure).The most common side effects in older people taking levodopa include:Confusion.Hallucinations.Delusions (strongly held untrue beliefs).Psychosis.Agitation.Abruptly stopping levodopa or lowering the dose increases your risk of parkinsonism hyperpyrexia syndrome, a life-threatening complication. This condition is very similar to neuroleptic malignant syndrome (NMS).Dopamine agonist side effectsSide effects of dopamine agonists may include:Hallucinations.Delusions.Confusion.Drowsiness.Nausea and vomiting.Dry mouth.Dizziness.Feeling faint upon standing.These side effects are common when starting a dopamine agonist. But they usually go away over several days. In older people, these medications are more likely than levodopa to cause confusion, hallucinations or psychosis, so providers prescribe them less often for older people.Enzyme inhibitor side effectsSide effects of COMT inhibitors include diarrhea and dyskinesia.Side effects of MAO-B inhibitors include:Heartburn.Nausea.Dry mouth.Dizziness.Less common side effects of selegiline include confusion, nightmares and hallucinations.Amantadine side effectsSide effects of amantadine may include:Difficulty concentrating.Confusion.Insomnia.Nightmares.Agitation.Hallucinations.Leg swelling.Anticholinergic medication side effectsSide effects of anticholinergic medications may include:Cognitive deficits.Dry mouth.Blurred vision.Sleepiness (sedation).Delirium.Hallucinations.Constipation.Urinary retention.Recovery and OutlookWhat can I expect when I start taking Parkinson’s disease medications?How your body responds to medications for Parkinson’s disease varies based on several factors, including:Your age.How early into the condition you received a diagnosis and started treatment.Your overall health.Most medications for Parkinson’s disease provide good symptom management for three to six years. As Parkinson’s disease worsens, your body’s response to these medications becomes weaker.Healthcare providers and researchers are developing new ways to adjust the dosing of levodopa and other medications to prolong their usefulness. Research is also underway to try to find medications that slow down the progression of PD.It’s important to follow your medication schedule carefully and take them as your provider prescribes. If you develop side effects, be sure to tell your provider. Never stop taking a medication without talking to your provider first.AdvertisementHow can I take care of myself if I have Parkinson’s disease?In addition to prescription medications, other treatments, like physical therapy, can help manage symptoms of PD.People with PD who participate in a structured physical therapy program geared to PD typically have better symptom management and improved quality of life. Physical therapy can help you:Improve balance and gait (walking pattern).Improve stability.Maintain an active life.Specific types of therapy that especially benefit people with PD include:Music therapy in physical fitness programs.Cycling.Boxing.Physical activity is very important in managing Parkinson’s disease. It’s the only intervention that’s been shown to slow down disease progression. People with PD should try to get at least 150 minutes of cardiovascular exercise per week.A chronic diagnosis like Parkinson’s disease can take a toll on your mental health. Be sure to seek help from a mental health professional, like a psychologist, if PD is causing you distress, depression and/or anxiety.When to Call the DoctorWhen should I see my healthcare provider?You should have regular appointments with your healthcare provider when taking Parkinson’s disease medications to assess how well they’re working and to address new symptoms as they occur.Talk to your provider if:You develop bothersome side effects.Your symptoms aren’t improving or they’ve gotten worse.You’re thinking of stopping the medication(s).Care at Cleveland ClinicParkinson's Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentA note from Cleveland ClinicParkinson’s disease medications are effective at managing symptoms and improving your quality of life. Like any medication, they can cause certain side effects. It’s important to have in-depth conversations with your healthcare provider before starting these medications to learn about when and how to take them and side effects to look out for. Know that your provider and pharmacist will be by your side to help you with any concerns or questions.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/09/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicParkinson's Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"