"Parotidectomy: Procedure Details, Recovery & Outlook800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/ParotidectomyAdvertisementAdvertisementAdvertisementParotidectomyParotidectomy is surgery to remove all or part of a major salivary gland in your cheek called your parotid gland. You may need this surgery if a tumor forms in your parotid gland. Most tumors are benign (noncancerous), but they can be cancerous (malignant). Removing your parotid gland can prevent the tumor from damaging tissue or harming important nearby structures like your facial nerve.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a parotidectomy?Parotidectomy (pronounced “puh-rawt-ih-DEK-tuh-mee”) is surgery to remove all or part of your parotid gland. Your parotid glands are major salivary glands. They’re located in your cheeks, in front of and below your ears. Tumors can form in your parotid glands. When this happens, your healthcare provider may perform a parotidectomy to remove the affected parts of the gland.An important nerve called the facial nerve runs through each parotid gland, dividing it into two lobes: the superficial lobe and the deep lobe. There are two types of parotidectomy, depending on which lobe contains the tumor:Superficial parotidectomy: Surgery to remove a tumor superficial to the facial nerve.Total parotidectomy: Surgery to remove a tumor only in the deep lobe or in both the deep and superficial lobes.When is a parotidectomy needed?You may need a parotidectomy if a tumor has formed in your parotid gland. Usually, these tumors are benign (noncancerous), but malignant (cancerous) tumors may also develop. Both types typically need removed.Benign tumors may need to be removed because they can grow bigger and damage surrounding tissue. Certain types of benign tumors can transform into salivary gland cancer.Malignant tumors damage surrounding tissue and can potentially spread (metastasize). When cancer metastasizes, cells break off from the original tumor and spread to other parts of your body through your bloodstream or lymphatic system. Cancer in your parotid gland may spread to nearby lymph nodes in your neck. Once cancer reaches your lymph nodes, it can travel to other body parts.You may also need a parotidectomy if you have an infection in your parotid glands or if you have salivary gland stones. Salivary gland stones are calcium deposits that can build up in your parotid glands, blocking the flow of saliva (spit) in your mouth. This can cause recurrent gland swelling and infection.Is a parotidectomy a major surgery?Yes. A parotidectomy is a major surgery that lasts from three to four hours on average. You’ll likely need to stay in the hospital overnight.Parotidectomy requires the expertise of a skilled surgeon who can identify and spare your facial nerve, which runs through your parotid gland. Your facial nerve controls the muscles that control the movement of your face. It allows you to smile, frown, wrinkle your forehead and express other emotions. Depending on your tumor’s location, it can be challenging to work around this nerve.Removing your parotid gland while preserving your facial nerve’s functioning requires expertise and care during surgery.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWho performs a parotidectomy?Surgeons, called otolaryngologists, who specialize in head and neck conditions perform parotidectomies.What happens before a parotidectomy?Your healthcare provider will gather the necessary medical information to plan your surgery. They’ll also ensure you understand what’s involved during a parotidectomy so you can prepare for your recovery.To prepare, your provider may:Review your medical history and medications: Your provider will complete a physical exam and review your past and present medical conditions. They’ll ask about any medicine you’re taking, including prescriptions, over-the-counter drugs, herbs and supplements.Perform imaging procedures: Your provider may take images of your parotid gland using a CT scan or MRI to plan for surgery. Imaging is beneficial if a tumor is close to your facial nerve. It can help your provider plan the best approach for removing your gland while protecting your facial nerve.Perform a biopsy: Your provider may take a sample of the tumor to test it for cancer cells. Fine-needle aspiration (FNA) is the most common type of biopsy used with a parotidectomy. An FNA uses a thin needle to remove a small sample of cells. Knowing whether a tumor is cancer allows your provider to plan for surgery and advise you on your prognosis.Finally, you’ll receive instructions about preparing for your parotidectomy, including what medicines you should take or stop taking, when you should stop eating or drinking before surgery, etc. You may also receive guidance on stopping smoking. Smoking increases your risk of breathing problems during surgery and can also slow your healing afterward.AdvertisementHow do I prepare for a parotidectomy?Your healthcare provider will supply you with the necessary resources to prepare for a parotidectomy. Still, the best way to prepare is to ensure you get answers to all of your questions beforehand.To prepare:Plan to have someone drive you home and care for you for at least 24 hours after surgery.Follow your provider’s guidance about which medications and supplements you can safely take.Follow your provider’s advice about when to stop eating or drinking before surgery.Follow your provider’s guidance about quitting smoking.Ask your provider about how much recovery time you should allow yourself. Depending on your situation, you may need help from a friend or family member lasting longer than 24 hours.What happens during a parotidectomy?You’ll have surgery in a hospital or a surgery center. You’ll need to stay overnight (usually one to two nights) for a parotidectomy. During the procedure:You’ll be positioned on a table and given anesthesia through an IV so you’re asleep during surgery.Your healthcare provider will make an incision that begins in front of your ear and extends back and downward into the natural crease in the upper part of your neck. The cutting pattern will help hide your incision once it heals.Your provider will pull back the skin flap to expose your parotid gland. They’ll identify your facial nerve and take care to avoid damaging it during surgery. Your provider may use a facial nerve monitoring device to ensure your facial nerve functions correctly throughout the surgery.Your provider will remove all or part of the gland. They’ll also remove the nearby lymph nodes in your neck if cancer cells have spread there.Your provider will suture the incision back together.Your provider may insert a small tube called a drain to catch any blood or fluid that may collect at the surgery site.AdvertisementWhat happens after a parotidectomy?You’ll wake up in a recovery room. A healthcare provider will monitor your vital signs, like your blood pressure, heart rate and breathing, to ensure you’re OK. You’ll receive medicine for pain.Once you’re fully conscious, your provider will test your facial nerve function. You may be asked to smile, close your eyes or make other facial movements that demonstrate your facial nerve is working correctly.You’ll receive instructions on caring for your wound and drain before being released from the hospital. The timing for follow-up care varies from person to person, but in general, expect the following timeline:One to two days after surgery: Your drain can be removed.Five to seven days after surgery: Your sutures can be removed.Four to six weeks after surgery: You’ll be rechecked to ensure you’re healing correctly.Care at Cleveland ClinicSchedule Parotid Gland SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of a parotidectomy?A parotidectomy can treat cancerous tumors and prevent cancer from spreading. It can also prevent benign tumors from becoming malignant or growing so large that they damage your facial nerve or other tissue.Parotidectomy is major surgery, but it’s also a standard, reliable treatment for eliminating tumors that can damage essential nerves and tissue in your head and neck.What are the complications of a parotidectomy?Parotidectomy isn’t considered a high-risk procedure. When complications do occur, they may include:Numbness in your ear, face or jaw: Most people with numbness regain sensation within three to four months, but it may take as long as a year for the feeling to return completely. It’s common to have temporary facial weakness after surgery lasting a few weeks to a few months, especially if extensive dissection was needed around the facial nerve. In rare cases, permanent facial paralysis is a long-term complication of parotidectomy. Long-term facial and jaw numbness is exceedingly rare and usually only results from highly complex parotidectomies. Ear numbness, on the other hand, is fairly common.Frey’s syndrome: People with Frey’s syndrome sweat heavily on the side of their face when they’re eating. The condition doesn’t usually start until several months after surgery. Antiperspirants and botulism toxin injections, commonly known by the brand-name Botox®, are potential treatments for Frey’s syndrome.First bite syndrome: First bite syndrome involves severe pain when you take your first bite of food. The pain lessens with each bite that follows. Botox injections can relax the nerve causing your pain.Other risks that apply to most surgeries, including parotidectomy, include:Allergic reaction to pain medicine.Damage to a nearby organ during surgery.Fluid collection at the surgery site (seroma or sialocele).Pooled blood at the surgery site (hematoma).Infection, bleeding or scarring.Scarring following a parotidectomy is usually minimal. Cuts are made to match the creases in your neck so they’re hard to see when scars form.Recovery and OutlookWhat are the side effects of a parotidectomy?The following symptoms are typical during recovery:Pain and swelling at the surgery site (lasting about three weeks).Discomfort in your jaw when you’re eating (can last up to two to four weeks).Numbness in your ear or near your incision site (usually improving within three to four months).What is the recovery time?Your recovery time depends on how complicated your surgery was. Recovery typically takes a few weeks. Most people will go back to normal activities after a month. Numbness and facial weakness may take a few months to a year to recover.Ask your healthcare provider how your tumor and surgery will impact your recovery timeline.Can you live without your parotid gland?Yes. A parotid gland is a major salivary gland, but it’s not the only gland that secretes saliva. Even if your healthcare provider removes an entire parotid gland, you’ll still have your other parotid gland to secrete saliva. You’ll have your other major salivary glands, including your submandibular and sublingual salivary glands. There are also minor salivary glands throughout your mouth and throat.When to Call the DoctorWhen should I see my healthcare provider?Don’t wait for a follow-up visit if you’re noticing signs of an infection or other symptoms that indicate you’re not healing as you should.Contact your provider if:Your pain isn’t manageable with medicine.Your face is feeling increasingly numb or weak.You notice pus, fluid or blood leaking from your wound.Your wound feels warm to the touch, swollen and painful.Your wound produces a foul-smelling odor.A note from Cleveland ClinicA parotidectomy is surgery to remove all or part of your parotid gland. Talk to your healthcare provider about how surgery on your parotid gland will affect everyday activities, like eating and drinking, during recovery. Most people have to make adjustments to their daily routines after surgery. You may have to choose foods that are easy to chew and swallow. You may have to be less active. Depending on your surgery, you may have to get used to feeling less sensation in your face. Usually, these changes are temporary. Ask your provider what changes you should expect and how you can plan for them before getting a parotidectomy.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/24/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Parotid Gland SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"