"Closing a Patent Foramen Ovale, Catheter-Based Procedures, PFO Closure Devices800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Patent Foramen Ovale (PFO) & Catheter-based ProceduresAdvertisementAdvertisementAdvertisementPatent Foramen Ovale (PFO) & Catheter-based ProceduresCatheter-based procedures are commonly used to diagnose and treat heart-related problems. A cardiac catheterization involves slowly moving a catheter (a long, thin, flexible, hollow tube) into the heart. The catheter is inserted into a large vein through a small incision, made usually in the inner thigh (groin area), and then is advanced into the heart. One or more tests will be done to measure the PFO and to be sure there are no other defects.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsOverviewWhat is a patent foramen ovale (PFO) closure device placement procedure?Catheter-based procedures are commonly used to diagnose and treat heart-related problems, such as clogged arteries and heart attacks. A catheter can also be used to guide the placement of a patent foramen ovale (PFO) closure device - which becomes a permanent implant - that will close the hole (prevent the flap from opening) in the heart wall.A cardiac catheterization is a procedure in which a catheter (a long, thin, flexible, hollow tube) is slowly moved into the heart. The catheter is inserted into a large vein through a small incision (cut), made usually in the inner thigh (groin area), and then is advanced into the heart. One or more tests will be done to measure the PFO and to be sure there are no other defects.An imaging test called angiography (an injection of a certain type of dye followed by an X-ray motion picture) may be used to get a better view of the heart. An ultrasound imaging technique known as an intracardiac echo (ICE) will also be used to see the defect better and also to determine the size of the closure device needed.The ultrasound imaging device is also advanced up to the heart through the vein. In addition, a special balloon on a catheter may be moved to the area of the hole and inflated to measure the size of the hole when it is gently stretched to be sure the correct device size is chosen. The ICE allows your doctor to see the heart structures and blood flow as the hole is being gently stretched by the balloon, and also as the device is being placed to close the defect.A PFO closure device is moved through the vein to the heart, and specifically to the location of the heart wall defect. Once in the correct location, the PFO closure device is formed so that it straddles each side of the hole. The device will remain in the heart permanently to stop the abnormal flow of blood between the two atrial chambers of the heart. The catheter is then removed and the procedure is complete.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow long does the PFO closure procedure take?The cardiac catheterization procedure for a PFO closure typically takes one to two hours to complete. A local anesthetic is used to numb the groin area where the catheter was inserted. Use of general anesthesia or intravenous (IV) sedation depends on the situation (doctor preference and the patient’s needs).What types of PFO closure devices are available?There is currently one device (the Amplatzer® PFO occluder) approved by the FDA specifically for PFO closure. Devices approved to close other types of holes (atrial septal defect or ventricular septal defect) can also be used to close a PFO. PFO closure devices currently being used at Cleveland Clinic include the GORE® CARDIOFORM Septal Occluder and the Amplatzer® PFO occluder.The GORE® CARDIOFORM Septal Occluder consists of a wire frame made of a nickel-titanium metal alloy covered with a thin membrane made of Gore-Tex, a material that has been used in open heart surgery for more than 20 years. Once the device is passed through the catheter, it opens up to form one circular disk that covers the hole on the left side and one disc on the right side of the septum. Your doctor will choose an occluder device that is slightly larger than the size of the defect. Over time, the patient's own tissue grows into and around the device.The Amplatzer® PFO occluder consists of two expandable discs with a connecting waist, all made of a nickel-titanium metal alloy. The discs have a polyester mesh inside to enhance elimination of flow across the hole. This is a slightly bulkier device than the GORE® CARDIOFORM Septal Occluder. Your doctor will select the device that best fits the anatomy of your hole.AdvertisementHow does the catheter-based PFO closure procedure compare with the use of medication?Three clinical trials comparing the catheter-based procedure for PFO closure with medical therapy (the blood-thinning drugs aspirin or warfarin) have been completed. Two did not show a clear difference between PFO closure and medical therapy. One trial suggested that while the rate of new strokes in both treatment groups was very low, patients who underwent PFO closure and were treated with blood-thinning drugs (most often aspirin) had a lower rate of new strokes than patients treated with blood-thinning drugs alone.A study analyzing data pooled from all three trials also suggested that PFO closure decreased the rate of recurrent (repeated) stroke in comparison to medical therapy. Other clinical trials are underway to further evaluate this question.Procedure DetailsWhat follow-up tests and home care instructions are typically given after a catheter-based procedure for PFO closure?Within 24 hours after the procedure, a chest X-ray, electrocardiogram, and echocardiogram are performed to make sure that the device is positioned correctly.The patient must rest in bed in the hospital for six hours after the device is placed. The patient may go home the evening of the procedure or possibly the following morning.There may be minor pain at the catheter incision site.The patient will be instructed not to lift anything greater than 10 pounds for one week after the procedure.Your doctor will discuss when you or your child can return to regular activity (usually within a week).Your doctor will prescribe medications that need to be taken at home. Aspirin or other blood-thinning drugs will need to be taken every day for six months or longer to prevent blood clots from forming. Antibiotics will also need to be taken one hour before certain medical procedures (for example, dental cleaning/dental surgical procedures and certain surgeries) for up to six months after the device is placed. Your doctor will provide information on which procedures will require antibiotic pre-treatment.As with all medications, take them only as directed by your doctor, never stop taking the medication without talking with your doctor first, and call your doctor if you have any unpleasant reactions or have any concerns about the medication.Finally, a few follow-up return trips to the hospital will be necessary over the next year to monitor the patient's heart and device placement. Each visit -- at one month, six months, and one year -- will include a chest X-ray, electrocardiogram, and echocardiogram.AdvertisementRisks / BenefitsHow does the body react to a permanent implant?The materials used in the closure device products have a proven long-term safety history and have been widely used in heart surgery procedures. It's not likely that the body will have a negative reaction to these devices. Within a few days, the body's own tissue will begin to grow over the device. By three to six months, the device is completely covered by heart tissue and at that point becomes a part of the wall of the patient's heart.The patient will not be able to feel the device. The implant will not be affected by airport or other security sensors, or by any household appliances, or medical imaging methods. However, the clarity of MRI or CT images may be slightly reduced because of the wire frame on the occluder devices. For this reason, be sure to inform the imaging technician that you or your child have such a device in your heart. You will receive an identification card that should be carried with you/or by your child to show to medical personnel, if necessary.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/17/2019.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"