"Penectomy: Purpose, Procedure, Results & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/PenectomyAdvertisementAdvertisementAdvertisementPenectomyPenile cancer is often treated by removing all or part of the penis. If you have a total penectomy, your urethra will be relocated to let you urinate freely. Penectomy is also done as part of gender affirmation.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a penectomy?A penectomy refers to the surgical removal of the penis. You can have a partial penectomy or a total penectomy. The surgery is the most common way to treat cancer of the penis. You can also have a penectomy as a gender affirmation surgery.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is a penectomy done?There are two main reasons for having a penectomy: treating cancer and gender affirmation.Penectomy surgery for treating cancerPenile cancer is a rare kind of cancer, affecting not quite 1 person in 100,000 in Europe and North America. Penile cancer is more common in some places in Asia, Africa and South America. Cancer of the penis is more common in people who:Smoke.Aren’t circumcised.Have HPV or AIDS.Are older than 50 years of age.Have been treated with UV light and psoralen for psoriasis.Have foreskin issues like phimosis and secretions that collect under the foreskin (smegma).Penectomy surgery for gender affirmation or gender nullificationGender affirmation surgery (also called gender confirmation surgery) helps people transition to their self-identified gender. A penectomy may be done as gender affirmation surgery for a transgender woman or a nonbinary person who no longer wants to keep their penis.The final goal for every person is unique to them. Genital (or bottom) surgery is only one procedure. It may be only a part of a series of operations in a person’s transition.Some people may choose only to have their penis removed. Others may choose to remove their scrotum and testicles. Complete removal of external genitals is called gender nullification and is one choice a person can make.Others may decide to have additional work to feminize their genitals. If this is the case, your surgeon will preserve tissue to create either a vulva or a vagina.Procedure DetailsWhat happens before a penectomy?Before a penectomy, your provider will talk with you about your options. It’s important to find a surgeon who has experience in doing these kinds of procedures. In the case of penile cancer, the extent of the surgery depends on the extent of cancer. Your surgeon will be able to treat less invasive cancers by removing less tissue.AdvertisementWhat happens during a penectomy?There are two main reasons that your surgeon may perform a penectomy. One is as a treatment for cancer. The other is part of the gender affirmation or gender nullification process.Penectomy for treating cancerIf your tumor is large, invasive and likely to recur, you’ll need a partial or total penectomy.If cancer is only at the tip, your surgeon can remove the tip (glans) in a glansectomy. The surgeon can perform a skin graft on the glans.If your surgeon performs a partial penectomy, they’ll try to leave as much of the organ as they can. They will try to make it such that you can still stand to urinate (pee).With a total penectomy, the entire penis, including the root that goes into the pelvis, is removed. In this case, the urethra (tube that allows urine to leave the body) will be rerouted to a spot in the perineum. This is the area between your scrotum and your anus. This is called a perineal urethrostomy. You’ll need to sit when you urinate.If you’re having a penectomy because of penile cancer, your surgeon may remove lymph nodes to find out if cancer has spread.Although it’s not possible in all cases, there is a chance that you might be able to have a phalloplasty or a penile reconstruction.Penectomy for gender affirmation or gender nullificationIf you’re having a penectomy as gender nullification, removing your penis is the final stage of your bottom surgery. If you’re having gender affirmation surgery, you have additional choices about the way that you want your genitals to look and function. For example:One type of feminizing procedure is a vulvoplasty. A vulvoplasy creates the parts of a vulva — the mons, the clitoris, and the outer and inner labia — out of tissue that is associated with being designated male at birth. For instance, the glans is used to create your clitoris.Another type of feminizing surgery is a vaginoplasty, a procedure that creates a vagina in the space located between your bladder and your rectum. For a vaginoplasty, the genital tissue is used to form your vaginal canal and labia. Currently, penis inversion vaginoplasty is considered the best option.For gender non-conforming people, genital nullification may be a choice. The genital area is smooth and level and is more in sync with the way these individuals feel.What happens after this procedure?Your hospital stay may depend on the reason for the surgery you’ve had. After you’ve had a penectomy, you:May be in the hospital for two to three days.Will have a urinary catheter in to drain urine for up to 14 days.May have a tube to allow blood to drain from the wound.Should be able to eat and drink as you wish.Will have swelling that may take some time to heal.Care at Cleveland ClinicPenile Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the advantages of penectomy?If the penectomy is performed as gender affirmation surgery, the advantages are clear. Your physical body now matches your gender identity.If the penectomy is performed to treat penile cancer, remember that this treatment will give you the best chance for survival.What are the risks or complications of penectomy?Every surgery comes with risks. Possible risks or complications may include:Urinary tract infection.Excessive bleeding.Infection at the site of surgery.Lymphedema in the legs. If you’ve had the surgery to treat cancer, you might also have fluid draining into the soft tissue of the scrotum.Recovery and OutlookWhat is the recovery time after a penectomy?Every person recovers at a different rate. You should discuss the time frame with your provider before you have the surgery.You may be in the hospital for two to three days.You’ll be off of work for about a month.You shouldn’t lift anything heavy for four to six weeks.You may need to wear compression stockings or take medication or do both to prevent blood clots.The swelling should get better over several weeks.Recovery after penectomy for gender affirmation surgeryIf you have vulvoplasty or vaginoplasty, you may have additional instructions. For instance, during a vaginoplasty, your surgeon will place an object called a conformer into your vagina to help it keep its shape. During your recovery, your surgeon will ask you to use a dilator to keep your vagina open.You’ll have follow-up appointments that are important to keep.How will a penectomy for cancer affect my sexuality during and after recovery?As with many other topics, your physical ability to get and maintain an erection will depend on the type of surgery you’ve had. With a glansectomy and a partial penectomy, you may be able to have an erection and use your penis to have penetrative sex after you’ve had enough time to heal.If you’ve had a total penectomy, it won’t be possible to engage in sexual activities that involve penetration. However, there are many ways that sexuality can be expressed and shared with your partner. It’s very important to be honest with each other and to talk things through.You can speak with your provider about services that may be available you in terms of counseling and support.How will a penectomy for gender affirmation affect my sexuality during and after recovery?Healing will take time and you’ll have to make sure that you don’t start sexual activities involving the surgical sites too soon. However, there are other ways of expressing intimacy that you can try during this time.If you’ve had a vaginoplasty and you’ve healed, you can have intercourse as a way to keep your vagina open instead of or in addition to dilation. How you feel about the depth and/or width of your vagina is your personal opinion. One risk is that you may not be satisfied with these qualities.There are new studies happening to increase understanding of sexual satisfaction after gender affirmation surgeries. However, the terminology used in the studies aren’t always consistent from study to study. In general, though, most studies have found the effects on sexuality after gender affirmation surgery to be positive. Many people who have had penis inversion vaginoplasty rate it as successful in both looks and function.Your healthcare team may recommend counseling after your penectomy. Topics may include changes in sexual stimulation and arousal, as well as possible desire for secondary surgeries.When to Call the DoctorWhen should I call my healthcare provider?Call your provider if you:Develop a high fever.Are bleeding excessively.Have pain that’s not relieved by prescribed painkillers.Are concerned about any new or worsening symptoms.A note from Cleveland ClinicIf you need a penectomy, seek out a surgeon who has a good reputation and experience in doing these surgeries. Get as much information as possible before you have the surgery so you know what to expect and how to prepare your home and your family and friends. Be open to the many types of post-operative services available to you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/06/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPenile Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"