"Penile Implant: Purpose, Procedure, Risks & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Penile ImplantsAdvertisementAdvertisementAdvertisementPenile ImplantsA penile implant restores your ability to get an erection. There are two types of penile implants: inflatable and non-inflatable. Risks include erosion and mechanical failure. Most people can resume sexual activity six weeks after receiving a penile implant.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewInflatable penile implants use a pump to send fluid from a reservoir into cylinders in your penis to get an erection. You deflate your penis by pressing a release valve on the pump.What is a penile implant?A penile implant is a surgically implanted device that helps you get an erection, usually if you have erectile dysfunction (ED).There are two types of penile implants:Inflatable penile implant: A pump in your scrotum (the pouch of skin behind your penis) allows you to get an erection whenever you choose.Non-inflatable penile implant: Bendable silicone rods in the erection chambers of your penis allow you to extend the rods into an erect position.Other names for a penile implant include penis implant and penile prosthesis.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow does a penile implant work?An inflatable penile implant consists of two cylinders, a reservoir and a pump that a healthcare provider surgically places in your body.The provider inserts the cylinders into your penis. Tubes connect the cylinders to a separate reservoir under your lower abdominal (stomach) muscles. The reservoir contains fluid. A pump also connects to this system. It sits under the loose skin of your scrotum, between your testicles.To inflate the implant (prosthesis), you press the pump in your scrotum. Pressing the pump doesn’t put any pressure on your testicles. The pump transfers fluid from the reservoir to the cylinders in your penis, inflating them to the level of hardness that you want. Once erect, you can maintain your erection for as long as you wish, even after an orgasm. When you want to stop being erect, pressing a valve on the pump returns the fluid to the reservoir, which deflates your penis.A non-inflatable penile implant consists of two firm, flexible silicone rods. This type of device doesn’t require pumping. To use the implant, you press on your penis to extend the rod into position. You can use the implant for as long as you wish — the hardness doesn’t change, even after an orgasm. After using the implant, you press on your penis again to push it back down.Who is a good candidate for a penis implant?Most people who are good candidates for a penis implant have ED or Peyronie’s disease. However, their condition can’t improve naturally or with other conservative medical treatments, such as medications or a vacuum constriction device (penis pump).A healthcare provider may also recommend penile implants as a component of gender affirmation surgery. A penile implant occurs after surgery to construct a penis (metoidioplasty or phalloplasty).How common are penile implants?Penile implants are becoming more common. Worldwide, healthcare providers performed over 63,000 penile implants between 2005 and 2012. About 86% of those procedures occurred in the United States.How long does a penile implant last?On average, penile implants last 20 years. When the implant wears out, it stops working. Your surgeon can revise it, usually by replacing it with a new implant.AdvertisementDo penile implants make you bigger?Penile implants can’t make your penis bigger than it is before surgery. Your erection may even seem shorter than what you remember when you were getting natural erections.It’s important to know that the head of your penis (glans) doesn’t get hard (engorged) after inflation because the implant isn’t in the head of your penis. This can make it seem like your penis isn’t as large as it was before your implant. Your healthcare provider may prescribe you a medication to help increase the blood flow to the head of your penis.Modern penile implant models have cylinders that may slightly increase your penis length, thickness and stiffness. This can occur gradually over time as you use the device.How big can a penile implant be?In most cases, the look and size of your erection after a penile implant are comparable to the size of your stretched-out penis before surgery. Your surgeon always measures the inside of your penis and places the biggest implant that’s safe to put in your body. The implant is a custom fit according to your inner measurements.Can you get hard with a penile implant?Yes, a penile implant allows you to get an erection whenever you’d like. It can take a couple of minutes to pump the inflatable penile implant to its full rigidity. The non-inflatable implant is always the same hardness.Once you have a penile implant, you’ll always need the implant to get hard. Medications will no longer work. You won’t be able to get a natural erection without the implant, especially if a surgeon removes the implant and doesn’t replace it with another.Does a penile implant feel the same?When you inflate your penis, the prosthesis makes your penis stiff and thick, like a natural erection. Most people with a penile implant report that sex feels the same or better than before the procedure. It won’t change the sensation on the skin of your penis. A penile implant also doesn’t affect your ability to ejaculate and orgasm. It may take you a few weeks or even a couple of months to adjust to the sensation of having an implant. However, many people who get penile implants report high satisfaction once they fully heal.If you feel the implant with your own hand, you’ll be able to feel the difference, especially if it isn’t erect. However, during intercourse, your partner won’t be able to tell the difference between a penile implant and a natural erection.Once you heal after surgery, the implant isn’t obvious to anyone else who might see you naked, such as in a locker room or public bathroom.Procedure DetailsWhat happens before a penis implant?Before a penis implant, you’ll meet with a healthcare provider. They’ll check your general health and take your vitals (temperature, pulse and blood pressure). They’ll also make sure that you can empty your bladder and don’t have any severe urinary issues. Once you meet with a surgeon, they’ll talk to you about which type of penile implant is right for you according to your body and your needs.Tell your healthcare provider about any prescription or over-the-counter (OTC) medications you’re taking. These include herbal supplements. Aspirin, anti-inflammatory drugs, certain herbal supplements and blood thinners can increase your risk of bleeding. Be sure to check with your healthcare provider before stopping any medications.Tell the healthcare provider about any allergies you have as well. Include all known allergies. These include medications (especially antibiotics), skin cleaners like iodine or isopropyl alcohol, latex and foods.The healthcare provider will also give you specific instructions on eating and drinking before your penis implant. You shouldn’t eat or drink anything after midnight the night before your surgery. If you must take medications, you should take them with a small sip of water.It’s a good idea to thoroughly wash your abdomen and groin the day before and the morning of your procedure to reduce the risk of infection. You don’t need to shave your abdomen or pubic hair around your penis and scrotum before your procedure. Your surgeon will do this immediately before your surgery.If you have an active skin or urinary infection before surgery, notify your surgeon. Skin and urinary infections increase the risk of infecting your implant. Always make sure that you have no active infections in your body before having implant surgery.AdvertisementWhat happens during a penis implant?A special team of healthcare providers will perform a penis implant. The team typically includes:Urologist (surgeon).Anesthesiologist.Nurses.The anesthesiologist will sedate you (put you under) with general anesthesia. You won’t be awake, won’t move and won’t feel any pain during the procedure.The urologist may insert a catheter into your bladder through your penis. A catheter is a soft, hollow tube that allows urine (pee) to flow out of your body. Your urologist will usually remove a catheter after the surgery.The urologist will inject pain medication to keep you numb even after the procedure ends. The urologist will then make an incision on your genital area and insert the implant into your corpora cavernosa. Your corpora cavernosa (singular: corpus cavernosum) are two columns or tubes of spongy tissue that fill with blood and make your penis hard. Your healthcare team will customize the size of your implant according to the size of your penis.If you get an inflatable implant, your urologist will then insert the reservoir in your abdomen and the pump inside your scrotum. They may or may not need to make additional incisions in order to place these components, but the incisions are quite small.After inserting the implant, your surgeon will close the incisions with dissolvable stitches. They may stitch small silicone tubes (surgical drains) in your incision sites. These surgical drains remove blood or fluid from inside your body. They’ll then place a bandage over the incision.How long does a penis implant take?A penis implant usually takes one to two hours to complete.What happens after a penis implant is placed?The anesthesiologist will stop putting anesthesia into your body. You’ll be conscious (awake) within a few minutes, but you’ll likely feel very groggy.You’ll then move to a recovery room. Healthcare providers will wait for you to wake up more fully and track your overall health. Once you fully wake up, your groin and abdominal area may feel sore. Providers will treat your pain and teach you pain management techniques. They may also prescribe antibiotics.In most cases, you can go home a few hours after a penile implant. However, you must have a family member or friend drive you home. It’s also a good idea to have a family member or friend help take care of you the first day or two after a penile implant.Care at Cleveland ClinicPenile Disorders TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of a penile implant?The main advantage of a penile implant is that it allows you to get and maintain an erection firm enough for sex, whenever you wish and for as long as you want. It won’t change the sensation on the skin of your penis or your ability to orgasm and ejaculate.Other advantages of a penile implant include:The procedure is relatively safe. There’s a low risk of complications or side effects.Satisfying results. Over 90% of people with a penile implant are happy with the results.Penile implants are durable. New penile implants typically last 20 years.It’s an outpatient procedure. The procedure usually takes one to two hours to complete, and most people can go home the same day.Increased self-esteem.Is a penile implant noticeable?An inflatable penile implant isn’t noticeable. You may have small scars from your incisions, but the scars usually aren’t noticeable.Non-inflatable penile implants are always semi-erect, so they may be more difficult to obscure with clothes.What are the risks or complications of a penile implant?Penile implant surgery is overall very safe. However, it’s important to know about some of the uncommon risks, including:Uncontrolled bleeding after the procedure, which may require additional surgery.Damage to your urethra, which requires surgical repair and delays placement of your implant.Infection, which requires removal of your implant.Excessive scar tissue.The implant wears away layers of skin (erosion).Pump or reservoir displacement.Mechanical failure.Perception of shorter penis length.Decreased blood flow to the head of the penis, which requires removal of your implant.Recovery and OutlookWhat is the recovery time after a penile implant?It’s important to remember that your body is unique, so healing times vary among people. In general, pain, swelling and discomfort should decrease after a week. You may have tenderness for up to six weeks.Your healthcare provider may prescribe antibiotics, pain relievers or other medications. Take them as directed.To manage pain, some people take over-the-counter nonsteroidal anti-inflammatory drugs (NSAIDs), such as aspirin (Bayer®), ibuprofen (Advil®) or naproxen (Aleve®). Not everyone can take NSAIDs, so be sure to ask your healthcare provider for other medications if needed.To help your body heal as you recover, gently clean and dry your affected areas regularly to prevent infection. Wash your hands with soap and water before changing your bandages. It’s also a good idea to wash your hands before using the restroom.To help reduce pain and swelling, apply an ice pack to your affected areas for up to 10 minutes. You may do this repeatedly throughout the day.As you recover, it’s important to avoid heavy lifting or strenuous exercises that can put pressure on your incisions.When can I have sex or masturbate after a penile implant?Your surgeon will let you know when it’s safe to resume masturbation or intercourse depending on your specific surgery. In general, avoid sexual activity for at least four weeks after a penile implant.When can I go back to work?If you work at a desk, you should take at least a week off work.If you have a more physically demanding job, you should schedule at least two to four weeks to recover before returning to work.When to Call the DoctorWhen should I see my healthcare provider?Schedule regular follow-up appointments with your healthcare provider.If you have a surgical drain, your provider will typically remove it one to three days after the procedure.You should then see a provider about four to six weeks after your procedure to learn how to use your penile implant.Call a healthcare provider right away if you have any complications after a penile implant. These may include:Heavy bleeding at your incision sites.A fever of 100 degrees Fahrenheit (38 degrees Celsius) or higher.Infection of the surgical incision.Increased pain.Additional Common QuestionsWhat questions should I ask a healthcare provider?Which type of penile implant is best for me?How long will my penile implant last?What happens if my penile implant has a mechanical failure?What’s the complete list of risks or complications?When can I start participating in normal activities and exercises again?How much does a penile implant cost?The cost of a penile implant is usually between $12,000 and $20,000. However, the price varies between surgeons and medical facilities. Talk to a healthcare provider to better understand their exact pricing.Will insurance cover the cost of a penile implant?Yes, insurance coverage for a penile implant is often applicable if a healthcare provider diagnoses you with erectile dysfunction. Many major insurance companies, Medicare and Medicaid cover the cost of surgery for people who are eligible.A note from Cleveland ClinicGetting a penile implant is a personal decision. Talk to a healthcare provider to discuss your options if you wish to restore your ability to get and maintain an erection. A penile implant can boost your self-confidence and help restore your sex life, but you should be aware that a penile implant lasts around 20 years. You may need to get a new implant later on in your life. Talk to a healthcare provider about concerns, and learn more about what’s best for you and your health.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/11/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPenile Disorders TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"