"PEG Tube, Percutaneous Endoscopic Gastrostomy800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Percutaneous Endoscopic Gastrostomy (PEG)AdvertisementAdvertisementAdvertisementPercutaneous Endoscopic Gastrostomy (PEG)A percutaneous endoscopic gastrostomy (PEG) is a surgery to place a feeding tube. Feeding tubes, or PEG tubes, allow you to receive nutrition through your stomach. You may need a PEG tube if you have difficulty swallowing or can't get all the nutrition you need by mouth.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is percutaneous endoscopic gastrostomy?A percutaneous endoscopic gastrostomy (PEG) is a procedure to place a feeding tube. These feeding tubes are often called PEG tubes or G tubes. The tube allows you to receive nutrition directly through your stomach. This type of feeding is also known as enteral feeding or enteral nutrition.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs a PEG tube?You may benefit from a PEG tube if you have difficulty swallowing (dysphagia). Causes of dysphagia may include:Brain injury.Head and neck cancer.Stroke.Chronic appetite loss due to severe illnesses like cancer.Feeding tubes may also be useful if you have a condition that interferes with how your body processes nutrition. For example, you may benefit from a PEG tube if you have cystic fibrosis or receive dialysis for kidney failure. Someone in a coma may receive a PEG tube to help keep them alive.Procedure DetailsWhat happens before percutaneous endoscopic gastrostomy?Before surgery, you’ll meet with your surgeon to discuss the procedure. You need to tell your provider if you have any heart conditions, bleeding risks or medication allergies.Depending on your health and underlying conditions, you may need to make medication adjustments. Your healthcare team may recommend changes to:Insulin dosage.Medicines that thin your blood, such as warfarin (Coumadin®).Nonsteroidal anti-inflammatory drugs, such as aspirin (Bayer®) or ibuprofen (Advil® or Motrin®).Don't eat or drink at least eight hours before the surgery. You also need to arrange a ride home after surgery.AdvertisementWhat happens during percutaneous endoscopic gastrostomy?Most healthcare providers place PEG tubes with endoscopic surgery. Endoscopic procedures use small incisions and a long, flexible instrument called an endoscope.On the day of surgery, you receive intravenous (IV) anesthesia and antibiotics. The anesthesia ensures that you remain calm and numb during the procedure. The antibiotic prevents infection.You may also receive a local anesthetic. A local anesthetic is an injection of numbing medicine. You receive this injection near where your surgeon makes the incision.During percutaneous endoscopic gastrostomy, your provider:Makes a small incision in your upper abdomen.Places the tube through the incision.Connects the tube to your stomach.The entire procedure only takes around 20 to 30 minutes. Usually, you can return home the same day or the next morning.What happens after percutaneous endoscopic gastrostomy?You’ll feel some pain after a percutaneous endoscopic gastrostomy. This pain might be from the incision. Or you might have cramping from gas buildup in your digestive system. This pain should decrease within 24 to 48 hours.You’ll have a bandage over the incision site. You may see some drainage around the incision for up to 48 hours. Usually, your surgeon will give you instructions to remove the bandage after one to two days.After the area around your feeding tube heals, you’ll meet with a dietitian. This specialist explains how to use the PEG tube and starts you on enteral nutrition.AdvertisementCan you see the PEG tube outside the body after surgery?Yes. PEG tubes are about the size of a pen or pencil. You’ll see 6 to 12 inches of the tube coming out of the incision area. Around the tube is a disc called an external bumper. This bumper prevents the tube from going further into your stomach.At the end of the feeding tube is a small cap or plug. This plug prevents stomach acid or contents from leaking onto your skin or clothes. You can open this plug to receive food, water or medications.Risks / BenefitsWhat are the advantages of PEG tubes?PEG tubes are an important treatment if you have difficulty swallowing or are unable to get adequate nutrition. After G tube placement, you receive specialized nutrition and hydration.What are the risks or complications of PEG tubes?Possible risks of percutaneous endoscopic gastrostomy include:Accidental tube dislodgement (tube moving out of place or coming out).Aspiration (accidentally inhaling your stomach contents).Bleeding and perforation (hole in the wall of your bowel or intestine).Infection near the incision.Pain near the PEG tube.Stomach leakage around the tube.Your provider will explain the symptoms of a PEG tube complication and when to seek treatment. You’ll need to clean your PEG tube daily to decrease your risk of complications.Recovery and OutlookWhat is the outlook after a G tube placement?Most people with G tubes have no problems or complications after surgery. However, your outlook depends on the underlying medical condition that led to tube placement.Can I eat and drink by mouth with a PEG tube?After tube placement, most people receive fluids and liquid nutrition through the tube. People who need PEG tubes because of swallowing problems have restrictions on eating and drinking by mouth. Some people may still eat and drink small amounts through the mouth. Talk with your provider about eating and drinking restrictions.How long do PEG tubes last?PEG tubes can last for months or years. They may clog or wear down over time. If your G tube is wearing out, you may notice:Bumps on the tube.Leaking.Pits or indentations on the tube.If you need a new PEG tube, your provider can easily replace the tube without invasive surgery or anesthesia. If you don’t need the tube anymore, your provider may remove the tube. The opening in your stomach closes on its own.When to Call the DoctorWhen should I see my healthcare provider?If your PEG tube accidentally falls out or moves, contact your healthcare provider right away. The opening in your stomach where the G tube goes can close very quickly. If the tube dislodges, it’s important to receive medical treatment within 24 hours.A note from Cleveland ClinicPEG tubes are feeding tubes. They deliver nutrition directly to your stomach. You receive a PEG tube through a short procedure called a percutaneous endoscopic gastrostomy. In this procedure most people can go home the same day. After your feeding tube is placed, you’ll be able to see the tube outside your body. You will need to clean the tube daily and keep it dry between cleanings. If a PEG tube falls out or moves, see a healthcare provider within 24 hours.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/19/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"