"Percutaneous and Endoscopic Interventions800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Percutaneous and Endoscopic InterventionsAdvertisementAdvertisementAdvertisementPercutaneous and Endoscopic InterventionsNon-surgical approachesAs cardiologists and heart surgeons search for new techniques to treat heart and vascular disease in less invasive ways, many new percutaneous (also called endovascular) procedures are evolving that will provide non-surgical treatment options for patients in the future.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyInstead of the large incision required for traditional heart or vascular surgery, percutaneous approaches use special catheters and devices to treat the problem through one or more small puncture sites through the skin.Endoscopic approaches are a subset of percutaneous approaches that use one or more small puncture sites and a thin video instrument with a small camera at the tip. This scope transmits a picture of the internal organs on a video monitor to give the surgeon a close-up view of the surgical area as he performs the procedure.For the patient, percutaneous procedures mean very small incisions and a much quicker recovery time. Even better, they may offer options for some patients who could not undergo conventional surgery due to poor heart function or additional medical problems.The following are current procedures that may be performed percutaneously at the Miller Family Heart & Vascular Institute. Some may be used in current practice. Others are being evaluated in research studies:Percutaneous valve repair and percutaneous valve replacement surgeryPercutaneous coronary artery angioplasty and stentingPercutaneous carotid artery stentingPercutaneous and endoscopic atrial fibrillation proceduresPercutaneous adult congenital heart disease treatment - ASD and PFOPercutaneous ventricular assist device placementEndovascular aortic stentingEndoscopic lead placement for defibrillator or pacemaker devicesEndoscopic radial artery and saphenous vein harvesting for bypass surgeryLearn more about minimally invasive thoracic and cardiovascular surgeryMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/07/2019.Learn more about our editorial process.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"