"Percutaneous Nephrolithotomy: Procedure, Risks & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Percutaneous NephrolithotomyAdvertisementAdvertisementAdvertisementPercutaneous NephrolithotomyPercutaneous nephrolithotomy is a surgical procedure to remove kidney stones that are too large to pass on their own or don’t respond to other treatments. The procedure takes three to four hours to complete. Risks include blood in your pee, blood clots, infection and healing problems. Recovery takes two to four weeks.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewPercutaneous Nephrolithotomy.What is percutaneous nephrolithotomy?Percutaneous nephrolithotomy (per-kew-TAY-nee-us NEF-roh-leh-THOT-oh-mee) is a surgery to remove kidney stones that are too large to pass on their own. A healthcare provider usually suggests percutaneous nephrolithotomy (PCNL) when other methods to pass a kidney stone are unsuccessful or not possible.“Percutaneous” means that the procedure occurs through the skin. “Nephrolithotomy” means the removal of a calculus (kidney stone) from a kidney.Is PCNL a major surgery?Though PCNL is a minimally invasive surgery that has fewer complications, less impact on your body and allows you to heal faster than open surgery, it’s still a major surgery.Who is the best candidate for percutaneous nephrolithotomy?Most kidney stones pass on their own and don’t require surgery. A healthcare provider may initially suggest shock wave lithotripsy or laser ureteroscopy if you have a smaller kidney stone that can’t pass on its own. The best candidate for PCNL is someone who can’t pass a kidney stone on their own, and their stone is too big to treat with shock wave lithotripsy or laser ureteroscopy.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow is percutaneous nephrolithotomy done?A urologist performs percutaneous nephrolithotomy. A urologist is a healthcare provider who specializes in surgical conditions and diseases that affect your urinary tract. They’ll make a small incision (cut) in your back or side to access your kidneys and remove the kidney stone.What is the success rate of percutaneous nephrolithotomy?Percutaneous nephrolithotomy has a success rate of approximately 75% to 98%.How often are percutaneous nephrolithotomies performed?Between 2007 and 2017, urologists performed nearly 20,000 PCNLs. Urologists who specialize in kidney stones typically perform PCNLs.Procedure DetailsWhat happens before PCNL?Before percutaneous nephrolithotomy, you’ll meet with a healthcare provider. They’ll check your general health and take your vitals (temperature, pulse and blood pressure).Tell your healthcare provider about any prescription or over-the-counter (OTC) medications you’re taking. These include herbal supplements. Aspirin, anti-inflammatory drugs, certain herbal supplements and blood thinners can increase your risk of bleeding. Be sure to check with a healthcare provider before stopping any medications.Tell your healthcare provider about any allergies you have, as well. Include all known allergies. These include medications, skin cleaners like iodine or isopropyl alcohol, latex and foods.Your healthcare provider will also give you specific directions on eating and drinking before your PCNL. You shouldn’t eat or drink anything after midnight the night before your surgery. If you must take medications, you should take them with a small sip of water.They may also order imaging tests to get a better view of the kidney stone. Before surgery, your provider may order:CT (computed tomography) scan.Ultrasound.X-ray.AdvertisementWhat happens during PCNL?A special team of healthcare providers will perform percutaneous nephrolithotomy. The team typically includes:A urologist.An anesthesiologist.Nurses.During most PCNL procedures, you’ll lie on your stomach (prone), so the urologist can access your kidney through your back. However, the urologist may position you on your back (supine) or on your back with a cushion under your flank (modified supine).The anesthesiologist will sedate you (put you under) with general anesthesia. You won’t be awake, won’t move and won’t feel any pain during the procedure.Once you’re asleep, the urologist will make a small (approximately 1 cm or smaller) incision. They’ll insert a protective sleeve (sheath) through the incision and into your kidney. They’ll then insert a small video camera (nephroscope) into the sheath to locate and remove the kidney stone. In some cases, the urologist may use a laser or shock-wave device (lithotripter) to break the stone into smaller pieces before removing it.After removing the kidney stone, the urologist may install a drainage tube or a ureteral stent. These help drain urine (pee) and promote healing. They may then use stitches to close your skin incisions.How long does PCNL take?PCNL usually takes two to four hours to perform.What happens after PCNL?After PCNL, a healthcare provider will cover your stitches with bandages.They may also send the kidney stone to a lab so technicians can determine its composition. Identifying a kidney stone’s components can help determine its cause and prevent new stones from forming.The anesthesiologist will stop putting anesthesia into your body. You’ll be conscious (awake) within a few minutes, but you’ll likely still feel groggy.You’ll then move to a recovery room. Healthcare providers will wait for you to wake up more fully and track your overall health. Once you fully wake up, providers will treat your pain. PCNL is a minimally invasive surgery, but you may still need pain medication and management techniques.You’ll typically need to stay in the hospital for one day after your surgery so your providers can monitor your recovery, make sure you’re beginning to heal and aren’t having issues with pain management.You may have a small amount of blood in your pee for one to two weeks after surgery. This is normal.Care at Cleveland ClinicKidney Stones TreatmentFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the advantages of percutaneous nephrolithotomy?The main advantage of percutaneous nephrolithotomy is that it removes kidney stones that don’t pass on their own or aren’t removable with other treatments. It’s also a minimally invasive procedure. Minimally invasive surgeries heal faster than open surgeries.What are the risks or complications of PCNL?All surgeries have risks, even minimally invasive procedures. Some risks of PCNL include:Anesthesia risks.Healing problems.Infection.Mass of clotted blood (hematoma).Blood clots.Fluid buildup at surgical sites (seroma).Kidney damage.Sepsis or a complicated urinary tract infection.Inability to remove the kidney stone.How painful is PCNL surgery?For most people, PCNL is moderately painful. Your healthcare provider may prescribe pain relievers for pain. If you have a drainage tube, your pain should decrease after its removal. Sometimes the ureteral stent is the most painful part of the procedure.Recovery and OutlookHow long is recovery from percutaneous nephrolithotomy?It’s important to remember that your body is unique, so recovery times may vary. In general, you should recover two to four weeks after PCNL.As you recover, it’s important to avoid heavy lifting or strenuous exercise. You shouldn’t lift anything heavier than a gallon of milk (about 8.5 pounds) for two weeks.When can I go back to work or school?Most people can return to work or school after a week.If you have a more physically demanding job, it’s a good idea to take at least two weeks off work.When to Call the DoctorWhen should I see my healthcare provider?Schedule a check-up with your healthcare provider four to six weeks after your percutaneous nephrolithotomy.Call your healthcare provider immediately if you have any complications after PCNL. These may include:Heavy bleeding at your incision site.Blood clots, which look like ketchup.Dark blood in your pee (hematuria).A fever of 100 degrees Fahrenheit (38 degrees Celsius) or higher.Infection.Fever.Chills.Increased pain.A note from Cleveland ClinicPercutaneous nephrolithotomy is a surgical procedure to remove a kidney stone that’s too big to pass on its own or doesn’t respond to other treatments. You may feel nervous, but it’s a relatively safe and effective procedure. Talk to your healthcare provider about your questions and concerns. They’re here to explain the procedure in more detail and discuss all possible outcomes and risks.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/19/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicKidney Stones TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"