"Peripheral Artery Bypass Surgery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Peripheral Artery BypassAdvertisementAdvertisementAdvertisementPeripheral Artery BypassA peripheral artery bypass surgery creates another way for your blood to get around a blocked artery in your leg. People with peripheral artery disease can get poor blood flow in their legs because of fat deposits that get in the way. It takes several weeks to recover from this operation, but many people have better blood flow for several years.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a peripheral artery bypass?A peripheral artery bypass is an operation to get your blood flowing again when a leg (or arm) artery has become narrow or blocked. This can happen when you have peripheral artery disease (PAD). Plaque made up of cholesterol and other fats can form an obstacle inside your artery. This makes it difficult for your blood to travel through it to deliver oxygen and nutrients to your tissues.Your healthcare provider creates another route for your blood, allowing it to avoid the blockage. This is similar to building a highway that goes around a congested area. Your blood is like a car that can use the new highway instead of trying to get through a roadway jammed with cars.When is bypass required in peripheral artery disease?People who have a bad blockage in a long, narrow section of a leg (or arm) artery may need peripheral artery bypass surgery. Your provider will consider surgery if other peripheral artery disease (PAD) treatments don’t work for you.You may need this operation if you have:Pain in your leg at night or when walking.Sores on your leg that aren’t healing.Dead tissue (gangrene).How serious is leg bypass surgery?Leg bypass surgery is the most involved and invasive treatment for peripheral artery disease. People who get a peripheral artery bypass have already tried medicines or lifestyle changes. If you’re having a peripheral artery bypass surgery, you probably have advanced peripheral artery disease.What does a peripheral artery bypass treat?A peripheral artery bypass surgery treats inadequate blood flow. Blood provides nutrients and oxygen to your body. If there’s no blood flow, there’s no fuel to the muscles and tissue in your body. People with peripheral artery disease (PAD) have this problem. When a person with PAD has a long section of blockage in a blood vessel, they may need a peripheral artery bypass.How common is a peripheral artery bypass?Peripheral artery bypass surgery is fairly common. About half of people who can’t get enough blood flow to their legs have surgery to improve it. Peripheral artery bypass surgery is one of the ways to get blood flowing again in your legs.About 6.5 million Americans have peripheral artery disease, but many of them have treatments other than peripheral artery bypass.How long does peripheral artery bypass last?Your bypass may last a shorter or longer time than someone else’s based on:Your arteries’ health.The use of your own vein or a plastic or fabric one.Your other health issues, such as having kidney failure or diabetes.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before a peripheral artery bypass surgery?Your vascular surgeon may want you to get tests, such as:An electrocardiogram (EKG).An ultrasound.Blood tests.A stress test.If you know you’re having a peripheral artery bypass, it’s important to stop using tobacco products before then. This can give you a smaller chance of complications after surgery.The day before your operation, you may need to:Stop taking certain medicines.Avoid eating or drinking after midnight.What happens during a peripheral artery bypass surgery?Your vascular surgeon will:Give you anesthesia so you’ll sleep without pain during your surgery.Make a 4-to-8-inch (in) cut above and below the artery that has a blockage.Make other cuts if they need to take one of your veins to use for the bypass.Sew in a blood vessel (graft) from somewhere else in your body. They attach it above and below the blocked part of the artery that’s causing a problem.Use staples or stitches to close your incisions.Peripheral artery bypass surgery time can be less than two hours to as long as six hours.AdvertisementWhat happens after a peripheral artery bypass?Your healthcare provider will:Keep checking your pulse, blood pressure, temperature and breathing.Make sure you have good blood flow in your legs.Give you pain medicine.Your provider may prescribe medicine for you after surgery, such as:A statin.Aspirin.Clopidogrel.Care at Cleveland ClinicPeripheral Artery Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of a peripheral artery bypass surgery?A peripheral artery bypass can get blood flowing to your leg when other treatments haven’t helped. Also, the results from this operation may last longer than results from a minimally invasive intervention such as a balloon angioplasty or stent. Five years after surgery, 60% to 85% of bypasses remain open, which means the blood is getting through.AdvertisementWhat are the risks or complications of a peripheral artery bypass?Complications of a peripheral artery bypass surgery include:Blood clots.Infection.Bleeding.Damage to peripheral nerves.Heart attack (in about 3% of surgeries).Most people don’t have major complications from a peripheral artery bypass. However, it can be fatal in 2% to 5% of people.You may be at a higher risk of complications if you’re older than 70 and/or have other health issues.Sometimes, people need to have surgery again because of a blockage in their peripheral artery bypass graft. This can happen in a short amount of time or after a number of years. Often, providers can treat this with a minimally invasive, or endovascular, procedure.Recovery and OutlookHow long does it take to recover from a leg bypass?It may take six to eight weeks to recover from a peripheral artery bypass. However, you should be able to return to work in a few weeks. You can go back to eating gradually.You should be able to go home from the hospital two to five days after surgery. After your surgery, you may have:Little interest in eating.Pain or numbness in your incisions.Swelling in your leg.Muscle pain when you walk.When to Call the DoctorWhen should I see my healthcare provider?Contact your provider if you have these problems after you go home:Fever or chills.Something coming out of your incisions.A change in how your leg looks or feels.You’ll have regular follow-up appointments with your provider after your surgery. Be sure to go to all of your appointments so your provider can make sure you have good blood flow in your legs. They’ll use ultrasound to check this.A note from Cleveland ClinicPeripheral artery bypass surgery can help you get blood flow back in your leg when other treatments haven’t worked. Avoiding the use of tobacco products before surgery can help you have a lower chance of surgical complications. It’s important to take any medicines your provider prescribed and take care of your incisions. Also, don’t miss any follow-up appointments with your provider.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/17/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPeripheral Artery Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"