"Peripherally Inserted Central Catheter (PICC)800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Peripherally Inserted Central Catheter (PICC)AdvertisementAdvertisementAdvertisementPeripherally Inserted Central Catheter (PICC)Peripherally Inserted Central Catheter (PICC)ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsAdditional DetailsOverviewWhat is a peripherally inserted central catheter (PICC)?A peripherally inserted central catheter or “PICC” is a thin, soft, flexible tube — an intravenous (IV) line. Treatments, such as IV medications, can be given though a PICC. Blood for laboratory tests can also be withdrawn from a PICC.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow is a peripherally inserted central catheter (PICC) inserted?A specially trained nurse or doctor will use an ultrasound machine to find the veins in your upper arm.Your arm will be cleaned and covered with a sterile cloth to prevent infection.Medicine is used to numb the area where the PICC will be placed. The PICC will be inserted into a vein just above the bend of your elbow and guided into a large vein in your chest. Most patients feel little or no discomfort during this procedure.Once the PICC is in place, it is held to your arm with special tape and covered with a sterile dressing.A chest x-ray is taken afterwards to make sure the PICC is in the right place.You will be able to bend your arm and use your arm just as you would without the PICC in place.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentRisks / BenefitsWhat are the benefits of using a PICC?A PICC is more comfortable compared with the many “needle sticks” that would have been needed for giving medications and drawing blood. The goal is to spare your veins from these frequent “needle sticks.”A PICC can also spare your veins and blood vessels from the irritating effects of IV medications.A PICC can be used in the hospital setting, nursing facility, or at home and can stay in place for weeks or months, if needed.A PICC can be used for many types of IV treatments.A PICC can be used to obtain most blood tests.AdvertisementWhat are the risks during and after placement of a PICC?There may be slight discomfort during the procedure.Bleeding may occur at the insertion site.It is sometimes necessary to attempt more than once and it may not be possible to insert the entire length of the PICC.During insertion of a PICC, accidental puncture of an artery, nerve, or tendon can occur near the insertion site. However, this is a rare event.A clot may form around the catheter in the vein (thrombosis), which can cause swelling and pain in the arm.Inflammation in a vein (phlebitis) can develop from the use of all types of IVs, including PICCs.An infection may occur at the insertion site or in the bloodstream.The PICC can come out, partially or completely, if not well-secured and completely covered.The PICC can move out of position in the vein and may need to be removed or repositioned.The PICC may become blocked. Medication may need to be used to clear it.Additional DetailsAre there other options for receiving IV treatments?Short IV catheters can be placed in the arm or hand. These require frequent changes and are not suitable for some solutions and medications.A central venous catheter can be inserted into a vein in the neck, upper chest or groin. This type of catheter is for short-term use (less than 2 weeks) and can only be used in the hospital.There are other permanent types of catheters (Hickman and ports) that are inserted in the operating room.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/30/2015.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementQuestions 216.444.2538Appointments & LocationsRequest an AppointmentFind a Primary Care ProviderFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"