"Perineoplasty: Surgery, Purpose, Procedure, Risks & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/PerineoplastyAdvertisementAdvertisementAdvertisementPerineoplastyPerineoplasty is a surgery that tightens the area between your anus and vagina (the perineum). It improves sexual satisfaction, restores function and helps narrow your vaginal opening after childbirth or trauma.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is perineoplasty?Perineoplasty is a surgical procedure to repair the perineum and external organs of your vagina (vulva). Your perineum is the space between your anus and vagina. Its purpose is to help support your reproductive organs and pelvic floor muscles. Childbirth, weight loss, trauma and other factors can damage this area and cause the skin around your vaginal opening to become loose and overstretched.Perineoplasty aims to strengthen and tighten the perineum, narrow your vaginal opening and repair loose, scarred or damaged skin around your vagina. This procedure can restore function and comfort and improve the appearance of your perineal area.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy do people get perineoplasty?Many people seek perineoplasty to address loose skin at their vaginal opening. This issue leads to decreased satisfaction during sex or feelings of self-consciousness. In some cases, muscle damage is enough to cause incontinence issues.Some of the reasons people choose to get perineoplasty are:Loose, bulging or gaping skin around their vagina.Excessive scar tissue after episiotomy or tearing during vaginal delivery.Loss of sensation during sex.Low self-esteem.Low libido (not wanting to have sex).Vaginal irritation, discomfort or pain.Urinary or bowel incontinence.What causes damage to the perineum?Childbirth is the leading cause of damage to the perineal area. Vaginal deliveries stretch the opening to your vagina to allow for your baby to come out. Repeated vaginal deliveries increase your chances of having a loose, overstretched vaginal opening.If you experience a large perineal tear during delivery or need an episiotomy, you’re at increased risk for scar tissue or improper healing of your vaginal muscles. Scar tissue can cause discomfort and loss of sensation.Other things that stretch or widen your vaginal opening or cause damage to the perineum are:Extreme weight loss or weight gain.Trauma or injury.Repeated straining or impact (like from horseback riding).High-impact sports or exercise.Other gynecological diseases.Genetics.Age.AdvertisementDoes perineoplasty tighten the vagina?Yes, perineoplasty helps to tighten the opening to your vagina. However, it doesn't affect your vaginal canal or the internal part of your vagina.Procedure DetailsHow do they fix a vaginal opening with perineoplasty?Surgeons fix your vaginal opening by removing access or damaged skin and repairing the muscular tissue that supports it. During the procedure, your surgeon makes a small V-shaped or diamond incision at your vaginal opening. They remove the tissue and repair any underlying muscles before stitching the area closed.Before the procedureA gynecologist performs perineoplasties. Discuss your symptoms and desires for surgery with your gynecologist. They can answer any questions you have about the procedure and help you understand the risks and benefits. You should ask them what the recovery process is like and what arrangements should be made before surgery.The procedurePerineoplasty is performed under local or general anesthesia, depending on your condition and the extent of work. Your gynecologist makes an incision at your vaginal opening. Next, they cut out excess skin or scar tissue and repair the deeper muscle layers around your vagina. Finally, the edges of the incision are closed with stitches.AdvertisementHow long is perineoplasty surgery?The procedure takes about one hour. After a short recovery in the surgical center or outpatient facility, you can go home. A hospital stay is rarely needed.What should I expect after a perineoplasty?As with most procedures, your body needs time to heal after a perineoplasty. You can expect some swelling and discomfort during the first several days. Most providers recommend ice and pain relievers to help with this pain. Sitz baths and soaking your perineal area in several inches of warm water may also be soothing in the first weeks of your recovery.Your healthcare provider may give the following post-operative instructions:Don’t insert anything into your vagina for at least six weeks. This includes tampons and refraining from sexual intercourse.Limit activities for at least four weeks. No heavy lifting or strenuous exercise during this time.Drink plenty of water and eat lots of fiber to avoid getting constipated. A stool softener may also help.Wear a sanitary pad if you experience vaginal bleeding.Keep the area clean and dry. Stitches should dissolve on their own within a few weeks.After you’ve healed from surgery, most providers will recommend pelvic floor exercises (Kegel exercises) to help strengthen the area. They may provide a list of exercises for you to do at home or ask you to visit a physical therapist for several weeks.Is perineoplasty painful?You won't feel pain during the procedure, but you may experience discomfort afterward. Anti-inflammatory medications and pain relievers can help ease your pain.Risks / BenefitsWhat does perineoplasty help with?Perineoplasty helps restore tightness and repairs damage to your perineum and vulva. Other benefits of the procedure include:Improved sexual satisfaction.Increase in self-esteem.Returns your vagina to its pre-childbirth size.Fixes scars or removes scar tissue.Treats urinary incontinence (leaking urine).Corrects deformities or other imperfections.Perineoplasty can treat other conditions like:Vaginismus (involuntary vaginal contractions during sex).Dyspareunia (painful sex).Pain during tampon use or penetration.Vaginal stenosis (narrowing of the vagina, typically from cancer treatment).Genital warts.Recurrent vaginal infection.Who shouldn’t have perineoplasty?You shouldn't have perineoplasty until you've finished having children. It also shouldn't be performed if you:Are pregnant.Have cancer.Have an active genital infection.Have an abnormal Pap smear.What are the potential complications of perineoplasty?Like most surgeries, there is a risk of complications after perineoplasty. Some of the most common are:Not achieving the desired outcome (tightness or strength).Dyspareunia (painful sex).Infection.Constipation.Bleeding from the surgical site.Recovery and OutlookWhat is the recovery time after perineoplasty?It takes between six and eight weeks to recover from perineoplasty. During your recovery, follow your healthcare provider’s instructions. You should limit your activities for at least four weeks and refrain from sex for six weeksWhen to Call the DoctorWhen should I see my healthcare provider?Talk to your healthcare provider if you’re struggling with sexual dissatisfaction, pain or lack of confidence over issues with your vagina. There may be some nonsurgical options for treatment or they may recommend perineoplasty to relieve your symptoms.Additional DetailsHow much does a perineoplasty cost?Costs for perineoplasty vary depending on where you live, who performs the surgery and how extensive the surgery is. Most health insurances don't cover cosmetic surgeries on your vagina; however, if the surgery treats a medical condition, there are exceptions.Are vaginoplasty and perineoplasty the same?No, they aren’t the same. But, there can be overlap in some instances.A vaginoplasty may be done for several reasons. For example, in some cases, the surgery is meant to tighten or repair your vaginal canal (the inside part of your vagina). For other people, it’s part of gender confirmation surgery to create a new vagina. In other cases, vaginoplasty reconstructs a damaged vagina. It’s also performed for people who were born without a vagina.Conversely, a perineoplasty only helps to restore function and tightness to the muscles at the opening of your vagina and perineum. Surgeons often perform perineoplasty and vaginoplasty together.A note from Cleveland ClinicBeing unhappy with the look of your vagina or experiencing painful or unsatisfying sex can be a problem after childbirth, trauma or other events that stretch or tear your perineal area. Perineoplasty may be an option if your vaginal opening or perineum is stretched, loose or damaged. This procedure tightens and tones the area by removing excess scar tissue and skin. It helps restore function and sensation to the area, which can lead to a better quality of life. Talk to your healthcare provider about your symptoms to see if you’re a good candidate for perineoplasty.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/06/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"