"Pericardiocentesis: Procedure, Risks and Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/PericardiocentesisAdvertisementAdvertisementAdvertisementPericardiocentesisPericardiocentesis is a procedure where a healthcare provider inserts a needle into the pericardium, a pouch that surrounds your heart. This procedure has life-saving potential when you have pericardial effusion (too much fluid in the pericardium) and cardiac tamponade (when your heart doesn’t have enough room to beat because of fluid buildup).ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewHow pericardiocentesis drains excess fluid from around the heart..What is this procedure?Pericardiocentesis (pair-ick-arr-dee-oh-sen-tee-sis) is a procedure that involves draining fluid from around your heart. It’s often an emergency treatment for cardiac tamponade, a life-threatening condition that can stop your heart.This procedure involves inserting a needle into your chest until the tip of the needle is inside your pericardium. Once there, providers can use the needle to drain fluid directly or place a drain that can remove fluid slowly over time.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy would someone need this treatment?Your heart sits inside the pericardium, a liquid-filled pouch that holds your heart in place and cushions it from outside movement. Under normal circumstances, there’s plenty of room in the pericardium. That means your heart can expand and fill up with blood between heartbeats. Pericardial effusion is when the pericardium fills up with too much fluid, which means there’s less space for your heart to expand between heartbeats.When an effusion happens slowly, your pericardium has time to stretch and accommodate the additional fluid. When one happens quickly, your pericardium doesn’t have time to stretch, and the fluid will put more and more pressure on your heart. That causes cardiac tamponade, which is when your heart’s chambers don’t have room to expand and fill up, so your heart pumps less blood. Cardiac tamponade is a medical emergency because it can make your heart stop, which will be deadly within minutes to hours.Depending on the circumstances, pericardiocentesis is a potential emergency treatment, or it can happen in non-emergency situations. In emergencies, pericardiocentesis treats either cardiac tamponade or severe pericardial effusions that will cause cardiac tamponade.Who needs to have this treatment?Common causes of pericardial effusion and cardiac tamponade that would result in your needing treatment with pericardiocentesis include:Advanced cancer.Heart attack (especially if the heart wall ruptures).Tuberculosis (more common in developing countries).Inflammation or infection of the pericardium. This includes bacterial and viral infections, including after COVID-19 infection or in people with Human Immunodeficiency Virus (HIV).Chronic immune diseases like lupus, rheumatoid arthritis and scleroderma.Heart cancer.Heart or kidney failure.Hypothyroidism (underactive thyroid gland).AdvertisementHow common is this procedure?Pericardiocentesis is a relatively common procedure. More than 25,000 of these procedures happen each year in the United States.Procedure DetailsWhat happens before this procedure?After a provider diagnoses you with either a pericardial effusion or cardiac tamponade, they'll determine how severe your condition is and the best way to treat it. Local anesthesia is part of the process and happens at the very beginning of the procedure (see the “What happens during the procedure?” heading below).The preparation for this procedure depends on whether or not it’s an emergency. In cases where it’s not an emergency — such as when you have an effusion that’s slow-growing — your healthcare provider can schedule the procedure. In most cases, except in the direst emergencies, you’ll receive local anesthesia.On the day of the procedure, you'll need to fast (not eat) starting eight hours before the procedure (you can have clear liquids up to two hours before the procedure starts).They’ll also do the following:Start an intravenous (IV) line. This is a way providers can give you medications or fluids directly through one of your veins.Prepare your skin. A provider will remove any hair you have at the spot where the clinician performing the procedure will insert the needle. The provider will also clean the same area with antiseptic to help prevent infections. In many cases, they'll prepare multiple areas, saving time if the provider needs to direct the needle at a different angle at the last minute.Set up vital sign monitoring. This involves attaching sensors to monitor your blood pressure, breathing, heart rate and blood oxygen levels. They may also attach electrodes, which are sensors that detect the electrical activity in your heart, for an electrocardiogram (ECG or EKG). Changes in your heart’s electrical activity can help providers adjust needle placement.Provide additional oxygen. People who have low blood oxygen levels or who might develop this can also receive supplemental oxygen, either through a mask or a tube that runs beneath the nose.AdvertisementWhat happens during this procedure?Pericardiocentesis is a procedure that involves several healthcare providers from different backgrounds. It will likely involve one or more doctors, nurses, imaging technicians and more.Imaging guidanceBefore inserting the needle, the healthcare provider performing this procedure will work with an imaging technician to find the safest, simplest way to reach the pericardium. The most common type of imaging is ultrasound (echocardiogram), which is safe and easy to perform at the time of the procedure. Imaging is especially important because it helps the provider insert the needle right where it needs to go.Note: A provider can do this procedure without imaging help in extreme emergencies. However, this is extremely rare and has a higher risk of complications. It's usually not an option unless there's no other choice.Needle placementUnless you are in immediate danger of your heart stopping, your provider will use a local anesthetic to numb the area just before they insert the needle. They may also use a scalpel to make a small cut on your skin to make it easier to insert the needle.Depending on where the fluid is in your pericardium, there are several places to insert the needle. The most common location is:Substernal (under your sternum, also known as your breastbone). This approach is most common and usually gives easy, direct access to your pericardium.Less common entry points are:Parasternal (above your breastbone). This is just off-center at the front of your chest. This approach lets providers access your heart by going between your ribs from your front.Apical. This approach goes between your ribs but from the side of your body. It gets its name because it aims for part of the pericardium near the apex (pointed end near the bottom) of your heart.Once they insert the needle, they'll angle it so that it enters your pericardium, but not your heart. Once the tip of the needle is in the pericardium, the provider can start drawing out the extra fluid inside.Depending on how much fluid is inside your pericardium, it may take only minutes to remove enough fluid. If there's a lot of fluid, they may insert a catheter tube to drain fluid out more slowly.Once they've drawn out enough fluid, your provider can pull the needle (or catheter) out, or they can leave a drainage catheter in place for a day or two to remove more fluid. When removing the needle or drain, they'll finish the procedure by bandaging the spot.What happens after this procedure?After the procedure, your healthcare provider may want to have the fluid taken from inside the pericardium tested. That can help figure out why you had fluid buildup in the first place. They will also repeat an ultrasound (echocardiogram) to confirm the fluid is all gone. If a drain is left in place, they will repeat an ultrasound daily to confirm the fluid is gone prior to pulling the drainage tube out.Risks / BenefitsWhat are the advantages of this procedure?Pericardiocentesis is a life-saving procedure when your heart is under pressure from fluid around it. It can also help collect fluid samples that will show why it happened in the first place, which can help healthcare providers treat the underlying problem. This procedure is also useful because it's faster and less invasive than surgery. That means it's usually a better, faster option when you have severe symptoms from cardiac tamponade and you're at risk for your heart to stop.What are the risks or complications of this procedure?Complications related to pericardiocentesis happen in about 5% to 40% of cases. The risk of complications is lowest when imaging like echocardiogram or fluoroscopy helps the provider “see” where to direct the needle. In extreme emergencies, it’s possible to do this procedure without imaging help. However, this is very rare and should only happen when there’s no other option.Even with imaging, the procedure involves inserting a needle very close to several of your vital organs and major blood vessels. That means there’s a risk of injuring any of the following:Heart. This can cause a heart attack, bleeding or disrupt your heart’s electrical system, causing an irregular heart rhythm (arrhythmia). Both can be severe — or even life-threatening — and bleeding may need emergency heart surgery to repair.Lungs. Injuries and punctures can cause lung collapse, a potentially life-threatening condition.Pericardium. This can cause fluid to leak into your chest or let the pericardium fill with air.Liver.Stomach.Major blood vessels near the heart.Any kind of medical procedure that needs to pass through your skin also creates the risk of infection. When these infections spread, it can lead to an overwhelming reaction by your immune system. That overreaction, known as sepsis, is a life-threatening medical emergency.Recovery and OutlookWhat is the recovery time?Most people will start to feel better quickly while the fluid removal happens or immediately after. The overall recovery time also depends on the severity of your case, what caused it (especially if it happened because of an injury) and any other medications or treatments you received for it. Your healthcare provider is the best person to tell you what to expect when it comes to your recovery and when you can resume your normal activities.When to Call the DoctorWhen should I see my healthcare provider?Your healthcare provider will schedule follow-up visits to ensure you don't have any complications or additional need for treatment. Some people will need more than one procedure because pericardial effusions can happen more than once. This is especially the case for certain cancers, infections like tuberculosis or other conditions.When should I go to the hospital?Several symptoms or other indications mean you need medical attention if you've recently had this procedure.Symptoms of cardiac tamponadeThe symptoms of cardiac tamponade include:Chest pain.Trouble breathing or breathing unusually fast.Fainting, dizziness or feeling lightheaded.Heart palpitations or rapid heartbeat.Symptoms of infection and sepsisYou should also go to the hospital immediately if you have any infection symptoms. These can be a sign of sepsis, a life-threatening condition that's as serious as a heart attack or stroke. The symptoms of sepsis include:Swelling or redness around the needle entry point.Skin that’s unusually warm to the touch around the needle entry point.Fever or chills.Confusion or disorientation (especially when a person isn't acting like usual).A note from Cleveland ClinicPericardiocentesis is a common medical procedure that treats severe pericardial effusion and cardiac tamponade. Thanks to advances in treatment techniques, technology, and healthcare provider education and training, this procedure usually has good outcomes. While it does have some risks, the potential for this procedure to save lives almost always outweighs any risks.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/26/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"