"Pericardiectomy: Details, Recovery and Outlook800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/PericardiectomyAdvertisementAdvertisementAdvertisementPericardiectomyA pericardiectomy is a surgical procedure to remove all or part of your pericardium, or membrane sac around your heart. A normal pericardium protects your heart, but a stiff pericardium can’t stretch enough. This leads to heart failure symptoms. A pericardiectomy can give many people years of symptom-free life.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewRemoving the membrane around your heart in a pericardiectomy.What is a pericardiectomy?A pericardiectomy, sometimes called “pericardial stripping,” is the surgical removal of part or all of your pericardium. The pericardium:Is a double-walled membrane sac that surrounds your heart.Contains a small amount of fluid that lubricates your heart during its normal pumping movements within the pericardium and prevents friction between the two.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCan you live without a pericardium?Yes. The pericardium isn’t essential for normal heart function. Removing the pericardium doesn’t cause problems as long as your lungs and diaphragm (the large muscle below your lungs) are intact.If you have pericarditis, your pericardium already has lost its lubricating ability. Removing it doesn’t make that worse.Why is a pericardiectomy done?The most common reason for performing a pericardiectomy is constrictive pericarditis, a condition in which your pericardium becomes stiff and possibly calcified.This stiffness prevents your heart from stretching as it normally does when it beats.Then:Your heart chambers fill incompletely with blood.Blood backs up from your heart into your lungs.Your heart can’t pump normally.Your legs and abdomen may swell.Symptoms of heart failure.For the most advanced cases of constrictive pericarditis, surgical treatment is the best option.Constrictive pericarditis causes include:“Idiopathic,” which means unknown cause.Previous heart surgery.Radiation to the chest.Diseases such as tuberculosis and mesothelioma.Viral or bacterial infection.Pericardiectomy also treats people with:Recurrent (symptoms that keep coming back) pericarditis.Complications of anti-inflammatory medications (including steroids) given for less severe pericardium constriction.Rarely, cardiac tamponade. This is a collection of fluid that presses on your heart.AdvertisementHow common are pericardiectomies?Pericardiectomies are rare surgeries. Even a hospital that does more pericardiectomies than most may only have 30 to 50 cases per year.About 20% of people with constrictive pericarditis in the United States end up getting a pericardiectomy.Procedure DetailsWhat happens before a pericardiectomy?Your healthcare team will make sure equipment is ready for a safe operation. Most often, your surgeon will use cardiopulmonary bypass (the heart/lung machine). This allows them to safely remove the pericardium from the sides and back of your heart.AdvertisementWhat happens during a pericardiectomy?Your surgical team will:Make an incision through your breastbone (sternum) in the middle front part of your ribs that allows them to reach your heart. This is called a median sternotomy.Remove the pericardium from your heart.Wire your breastbone and ribs back together.Close the incision with stitches.Is pericardiectomy open-heart surgery?Yes, pericardiectomy is usually open-heart surgery. -This allows your surgeon to get to your heart to remove your entire pericardium. Surgeons prefer this to a partial pericardiectomy technique.Some surgeons may use a thoracotomy approach, which means they make a cut between your ribs to get to your heart. Few use a minimally invasive approach because it limits how much of the pericardium your surgeon can reach.How long does pericardiectomy surgery take?On average, a pericardiectomy takes about two to three hours. However, some people have more than one procedure while they’re in the operating room.What happens after a pericardiectomy surgery?You will feel sore when you wake up after your surgery. You will have one or more tubes draining extra fluid from your chest.You’ll probably be able to drink liquids the day after surgery and eat food later.Most people will continue to take a diuretic after surgery, but in lower doses, than they needed before surgery.Care At Cleveland ClinicGet Pericardial Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of a pericardiectomy?Advantages of a pericardiectomy include:For many people, mild symptoms or none at all — even years later.Better chance of a complete cure than with medication.Keeps constriction from getting worse and damaging heart muscle.What are the risks or complications of a pericardiectomy?Pericardiectomy is a major cardiac surgery procedure. To minimize risks, choose a cardiac surgeon experienced in the procedure.Pericardiectomy risks include:Bleeding complications.The need for blood transfusion.Atrial fibrillation.KidneyRarely, injury to the phrenic nerve that helps with breathing.A 1% to 2% risk of death.People with prior heart surgery, major medical conditions or a history of radiation have a higher risk of pericardiectomy complications.A small number of people still have symptoms after surgery.Recovery and OutlookWhat is the recovery time?Most people who have a pericardiectomy surgery stay in the hospital for five to seven days.You can go back to your normal activities when you get home, except for lifting.Full recovery after pericardiectomy takes six to eight weeks, depending on how serious your condition was before the surgery. For the most serious cases, recovery can take longer than eight weeks.People with severe pericardial constriction who don’t have other heart or lung diseases often feel better immediately after surgery. Most people notice a significant improvement by six to eight weeks and gradually keep improving for a while.What is the long-term outlook after pericardiectomy?The long-term outlook after pericardiectomy surgery depends on the cause of your constrictive pericarditis. Studies have found that people with idiopathic (unknown cause) constrictive pericarditis had the highest long-term survival.Outcomes tend to be better in people who:Had surgery less than six months after having symptoms of constrictive pericarditis.Didn’t get constrictive pericarditis from radiation or previous surgery.Had a complete pericardiectomy instead of a partial one.Don’t have other medical issues.Is it safe for someone who had pericardiectomy surgery to have other heart surgeries at a later time?Scar tissue will form around your heart after pericardiectomy and may form between your heart and surrounding structures such as your lungs and diaphragm. This makes future heart surgeries somewhat challenging — but not impossible — for experienced cardiac surgeons.What is the survival rate of pericarditis?Without treatment, the survival rate of constrictive pericarditis is low. After a pericardiectomy, 78% of people can live five years and 57% live another 10 years.How long do you live after a pericardiectomy?It depends on several factors, including:The cause of your constrictive pericarditis.How sick you were.Whether you had a complete or partial pericardiectomy.Other health problems.Age.About 80% of people who had a pericardiectomy after constrictive pericarditis with an unknown cause were alive five to seven years after the surgery. However, for people who got constrictive pericarditis from chest irradiation and had a pericardiectomy, up to 30% survived five to 10 years.When to Call the DoctorWhen should I see my healthcare provider?Contact your provider if you have:Chest pain.Fever.More fluid draining from your wound than usual.You should see your cardiologist one or two weeks after you leave the hospital. You also should have an echocardiogram six weeks after surgery and then as often as your provider recommends. An echocardiogram is an ultrasound of your heart that allows your cardiologist to see how well your heart is pumping.Additional Common QuestionsWhat’s the difference between pericardiectomy and pericardiocentesis?Pericardiectomy is a surgery that removes part or all of your pericardium.Pericardiocentesis uses a needle to drain extra fluid from your pericardium.Pericardiectomy vs. pericardiotomyBoth are surgeries. Pericardiectomy removes your pericardium. Pericardiotomy just makes a cut in your pericardium to drain fluid.A note from Cleveland ClinicIt may feel scary to know you need to have a pericardiectomy but talk with your healthcare provider about any concerns you have. Before you leave the hospital, make sure you understand what you’re supposed to do at home. Don’t be afraid to ask questions if you need more information. Your healthcare provider may give you medicines to take, exercises to do or limits on what you eat. Following these instructions will help your recovery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/12/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare At Cleveland ClinicGet Pericardial Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"