"Radioactive Seed Implants (Brachytherapy for Prostate Cancer)800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Permanent Radioactive Seed ImplantsAdvertisementAdvertisementAdvertisementPermanent Radioactive Seed ImplantsImplanting permanent radioactive seeds in the prostate is a method of treating cancer. The procedure allows a concentrated dose of radiation to be delivered directly to the prostate cancer, limiting damage to other tissue.ContentsArrow DownOverviewProcedure DetailsRecovery and OutlookAdditional DetailsContentsArrow DownOverviewProcedure DetailsRecovery and OutlookAdditional DetailsOverviewWhat is the radioactive seed implant procedure?Permanent radioactive seed implants are a form of radiation therapy for prostate cancer. The terms \"brachytherapy\" or \"internal radiation therapy\" might also be used to describe this procedure.During the procedure, radioactive (iodine-125 or I-125) seeds are implanted into the prostate gland using ultrasound guidance. The number of seeds and where they’re placed is determined by a computer-generated treatment plan tailored for each patient. About 100 seeds are commonly implanted.The implants remain in place permanently, and become biologically inert (inactive) after about 10 months. This technique allows a high dose of radiation to be delivered to the prostate with limited damage to surrounding tissues.Radioactive seed implants are an outpatient procedure. Compared to external radiation — which requires up to seven to seven-and-a-half weeks of daily treatments — convenience is a major advantage of this treatment option.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho’s eligible for this procedure?Permanent implants are relatively low-energy sources, and therefore have limited tissue penetration. A well-done implant treats the prostate and the surrounding few millimeters of adjacent tissue.The best candidates for this procedure are patients with a cancer within or near the prostate. Patients with prostate cancer that’s invading nearby structures like the bladder or rectum aren’t appropriate for this technique.Procedure DetailsWhat happens during the radioactive seed implant procedure?The entire procedure takes about 90 minutes. Most patients go home the same day.A radiation oncologist and urologist perform the procedure. Both doctors are actively involved in all aspects of the implantation, from the planning to the post-operative care. During the procedure, the urologist provides ultrasound guidance and the radiation oncologist places the radioactive seeds. The prostate ultrasound and treatment planning are both done at the same time as implantation of the radioactive seeds.The procedureAfter general or spinal anesthesia, the legs are elevated and padded very carefully.The ultrasound probe is inserted into the rectum and is used to take pictures of the prostate. The probe remains in place throughout the procedure.The ultrasound images are used to generate an individualized treatment plan. Then the radioactive seeds are loaded into the designated number of needles.In a specific order, each needle is inserted through the skin in the perineum (the area between the base of the scrotum and the anus) and into the prostate using continuous ultrasound guidance. Once accurate needle placement is confirmed, the seeds in that needle are released. This process is continued until all of the radioactive seeds have been implanted. No surgical incision or cutting is necessary.If there is some blood in the urine, a catheter might be placed into the bladder for a short period of time to ensure proper drainage. All patients are taught how to catheterize themselves at home to drain urine from the bladder should that be necessary.Care at Cleveland ClinicProstate Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentAdvertisementRecovery and OutlookWhat are the results of radioactive seed implant procedures?The success rate depends on the risk category of the prostate cancer and the type of success that’s being measured. The most common measurement is related to prostate-specific antigen (PSA) assessments after treatment. Grading is done with a system called the Gleason score. Using this method, the five-year success rates for the various risk groups are:Low-risk (PSA < 10 ng/mL and a Gleason score < 7) = 95%.Intermediate-risk (PSA < 10 ng/mL and a Gleason score of 7, or PSA 10 ng/mL to 20 ng/ml and a Gleason score of 6) = 90%.High-risk (PSA > 20 ng/mL or Gleason score > 7 and any PSA) = 74%.It is important to know that these numbers are heavily dependent on how frequently the PSA test is drawn after therapy. PSA tests should be done every six months after therapy. In reports of similar rates from other sources, one must make sure that the PSA tests are being drawn at least this frequently or a comparison can’t be made.What are the side effects?Urinary symptoms are the most common side effects of the procedure. These symptoms include frequent urination and a need to get to the bathroom quickly. There might also be burning with urination and, in a few cases, an inability to empty the bladder completely. These symptoms can usually be managed with medicine, and improve over time. Temporary self-catheterization might be necessary to help drain the bladder if it can’t be emptied adequately, but only about 5% of patients require it.Urinary incontinence is rare in general. The risk might be somewhat increased in patients who have undergone a previous surgical procedure to remove a part of the prostate called a transurethral resection of the prostate (TURP). This risk can be minimized by performing a careful prostate ultrasound before the procedure to determine how much prostate tissue is still present to implant.Rectal bleeding occurs in less than 1% of patients. Diarrhea is rare.The impotence rate for those fully potent prior to the procedure at five years after the procedure is approximately 25% using brachytherapy alone. If hormone therapy is added, the impotence rate rises to 50%.AdvertisementAdditional DetailsWhat other details about the radioactive seed implant procedure are important?Close, prolonged contact (sitting in the lap) with young children should be limited to 20 minutes per hour for the first two months after the procedure. It’s safe to sleep in the same bed if your partner/spouse is NOT pregnant. If your partner/spouse is pregnant, separate sleeping arrangements will be necessary for two months. If you have other questions, please call your radiation oncologist or urologist.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/30/2020.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicProstate Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"