"Pacemaker (for the Heart): Surgery, Types & What It Is800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Permanent PacemakerAdvertisementAdvertisementAdvertisementPermanent PacemakerPacemakers are devices that can be placed in your body, usually by surgery, to support the electrical system in your heart. They can stabilize abnormal heart rhythms and prevent problems that can disrupt or endanger your life.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewPermanent pacemaker type and placement examples.What are pacemakers?Pacemakers are devices that can be placed in your body, usually by surgery, to support the electrical system in your heart. They can stabilize abnormal heart rhythms and prevent problems that can disrupt or endanger your life.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow do pacemakers work?Your heart has its own electrical system, which tells your heart’s chambers when it’s their turn to squeeze. When your heart’s electrical system malfunctions, your heart’s chambers may squeeze in the wrong order or squeeze too weakly to provide enough blood to your body. Pacemakers use electrical impulses to correct these kinds of malfunctions.What conditions do pacemakers treat?Conditions that are treatable with a pacemaker include (but aren’t limited to):Certain heart arrhythmias (malfunctions of your heart’s normal beating process).Disruptions of your heart’s electrical system (such as heart blocks).Heart failure.History of heart attack.AdvertisementWhat are the signs you need a pacemaker?Talking to your healthcare provider about your concerns or symptoms is the first step to determining if you have health problems that can be treated with a pacemaker. Some of the symptoms you should tell your healthcare provider about include:Chest pain (also known as angina).Tachycardia (pronounced “tacky-cardia”): This is an unusually fast heartbeat (more than 100 beats per minute).Bradycardia (pronounced braid-y-cardia): This is an unusually slow heartbeat (fewer than 60 beats per minute).Irregular heartbeat (arrhythmia): A heartbeat that skips beats or adds in extra beats.Heart palpitations: This happens when you can feel your heartbeat in a way that’s unpleasant (it might feel like your heart is “flip-flopping” or pounding in your chest).Shortness of breath, especially when you’re more active.Unexplained dizziness or lightheadedness, nausea or fainting.Unexplained confusion.Swelling in your ankles, legs and abdomen.Needing to urinate multiple times at night.What are the different types of pacemakers?Depending on the heart problem, a specific type of pacemaker — with anywhere from one to three wires (called leads) — may be used. Types of pacemakers include:Leadless pacemaker:A small pacemaker (about the size of a large pill) inserted using a catheter-based procedure. This device is attached to an inner wall of your heart, which means it doesn’t need to use any wires.Single-chamber pacemaker: Uses a single wire attached to one chamber of your heart.Dual-chamber pacemaker: Uses two wires attached to two chambers of your heart.Biventricular pacemaker: Uses three wires, two of which attach to the lower chambers (called ventricles) of your heart, and a third connected to the right upper chamber (the right atrium). This is also known as cardiac resynchronization therapy (CRT).Your healthcare provider may recommend a similar device called an implantable cardioverter defibrillator (ICD). Though it isn’t a pacemaker, these are often used with related heart conditions like ventricular tachycardia and ventricular fibrillation.AdvertisementWhat’s the difference between a pacemaker and an ICD?A pacemaker delivers electrical impulses to control the rhythm of your heart, but it can’t deliver a shock to correct an arrhythmia.Most new implantable cardioverter defibrillators (ICDs) can do the same job as a pacemaker, as well as detect dangerous heart rhythms. Once these are detected, the ICD can deliver a shock to restore your heart back to its normal rhythm.Procedure DetailsDoes it require major surgery?Depending on the type of pacemaker used, you’ll undergo a catheter-based, vein-based or surgical-based approach. Advances in surgical knowledge mean these procedures have been refined (improved). The goal is to help you feel less pain, recover faster and get back to your life sooner.Catheter-based approach: This method is used with leadless pacemakers, which only treat conditions involving a single chamber of your heart. A specialist inserts a catheter (a tube-like device) into an artery (usually near your groin) and threads it up to your heart. Once inside, it’s attached to the wall of your heart.Transvenous (through a vein) approach:This method is frequently used in adults. During this procedure, a specialist makes a small incision to access a vein near your heart. This is usually a vein that runs underneath your collarbone, to your arm or to your neck. Using fluoroscopy (a type of X-ray), the specialist threads the lead(s) (wires) through the vein and attaches them to a point on your heart. The lead(s) will then be attached to the pacemaker device itself, which is placed into a small “pocket” under the skin of your upper chest.Surgical-based (epicardial) approach:A surgeon creates a small incision in your chest and inserts the lead(s) through that incision, and then attaches the lead(s) to your heart. The surgeon then connects the lead(s) to the pacemaker. The pacemaker is inserted into a “pocket” under the skin of your abdomen.Catheter-based procedures take about an hour or less. The transvenous and surgical-based approaches take between two and five hours. Your healthcare provider will explain which is best for you.Care at Cleveland ClinicArrhythmia TreatmentsFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the possible benefits?Pacemakers are meant to improve your quality of life and prevent disruptions caused by heart problems. Benefits include:Alleviating many of the symptoms caused by heart rhythm problems, including chest pain, confusion, palpitations, nausea, confusion and more.Preventing unpleasant symptoms like fainting that are caused by arrhythmias.Saving your life by preventing your heart from stopping.What are the possible complications or side effects of having a pacemaker?Pacemaker procedures tend to have few complications, which you can discuss with your healthcare provider. In general, the following complications are possible:Allergic reactions: These may happen because of a medication you’re given or you may be allergic to one of the materials used in the pacemaker itself.Blood clots: Your healthcare provider may prescribe blood-thinning medications to reduce the risk of developing a blood clot.Malfunctions of the pacemaker or its leads: In some cases, a pacemaker lead may get jostled out of position or might break free. Your healthcare provider will recommend limiting your activity for a while after your procedure to avoid this.Malfunctions caused by sources outside of your body: Your healthcare provider will give you instructions on devices or machines to avoid so you don’t have pacemaker problems caused by outside electrical interference. Fortunately, advancements in pacemaker technology mean these situations aren’t common.Unexpected heart rhythm problems: Some people develop heart rhythm problems — in rare instances — because of the pacemaker. Your healthcare provider can talk to you about these risks and help you avoid them.Recovery and OutlookHow long do pacemaker batteries last?While it depends on the specific model of pacemaker and how often it has to assist your heart, pacemakers are now available that can last as long as 10 or 15 years. Your healthcare provider can tell you the average lifespan of the device you’ll receive, and will also schedule follow-up appointments to check your pacemaker’s battery level. It’s also usually a simpler process to replace a pacemaker battery than it was to implant the device in the first place.What is the life expectancy of a person with a pacemaker?The life expectancy of a person who has a pacemaker depends on several factors, especially a person’s age when they have a pacemaker implanted and their health conditions. People who have fewer or less-severe health concerns tend to live longer and are more likely to have a normal or near-normal life expectancy.When to Call the DoctorIf you have a pacemaker implanted, it’s best to manage your health and be aware of how you feel.Take your medication. Your healthcare provider may prescribe medicines that are meant to work in addition to your pacemaker. Be sure you understand how you’re supposed to take your medications and for how long. If you don’t understand, be sure to ask questions! Your healthcare provider is there to make sure you have the best possible outcome and they know that’s more likely when you have the answers to all your questions.See your healthcare provider as recommended. Your healthcare provider will schedule follow-up visits to check your overall health and make sure your pacemaker is working correctly.Pay attention to your body. It’s normal for your pulse to vary outside the recommendations occasionally and for short periods. But if your pulse is too fast or too slow more often (based on the range your healthcare provider tells you), you should call your healthcare provider.Call your healthcare provider if you have any of the following: If you have any trouble breathing.If you unexpectedly gain weight or you have swelling in your ankles and lower legs.If you have dizziness, fainting or bouts of confusion.If you notice symptoms like you had before your pacemaker was implanted.A note from Cleveland ClinicHeart problems that result in needing a pacemaker can cause you to feel stressed, anxious or scared. Your healthcare provider can help you understand your situation and talk you through it so you can feel better about what’s happening. Your healthcare provider can also recommend resources that can help you cope with any questions or concerns you might have.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/28/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicArrhythmia TreatmentsFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"