"Phalloplasty: What is it, Risks, Benefits, Recovery & Outlook800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/PhalloplastyAdvertisementAdvertisementAdvertisementPhalloplastyPhalloplasty is surgery to repair the penis after a serious injury or to fix a congenital condition. In transgender men, the procedure constructs a functional penis. It is a complex surgery that typically requires multiple procedures.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is phalloplasty?Phalloplasty is a type of penis surgery. For some people, it involves constructing a new penis (neopenis).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs phalloplasty?People with gender dysphoria undergoing female-to-male (FTM) gender confirmation surgery. It’s also for those who have:Congenital (present at birth) conditions, such as:Ambiguous genitalia.Aphalia, which occurs when a person is born without a penis.Epispadias, a rare condition in which urine exits the body from the top of the penis instead of the tip.Hypospadias.Micropenis.Experienced trauma affecting their penis, including:Burns.Car accidents.Circumcision complications.Explosions.Penile fracture due to sudden bending during an erection.Procedure DetailsWhat happens during phalloplasty?During phalloplasty, surgeons take a large section of skin and tissue (flap) from another area of your body. After rolling it to form a shaft, they attach it to the groin.Treatment may include additional procedures to:Remove female genitals for patients undergoing FTM transgender surgery.Extend the urethra (a tube through which urine leaves the body), so you can urinate while standing.Construct a scrotum or head of the penis (glans).Implant a device to enable erections.Insert artificial testicles into the scrotum.AdvertisementWhere will the tissue for the neopenis come from?Tissue flaps may come from your:Forearm: Radial forearm free flap.Thigh: Anterolateral thigh free flap.Back: Latissimus dorsi myocutaneous flap.How do I prepare for penis surgery?Before surgery, you'll undergo assessments and testing. These may include:Physical exam to assess your health and learn more about your medical history.Genital hair removal, which starts months before surgery.Patient education about risks, benefits and postsurgical care requirements.Mental health evaluation to ensure your understanding of the procedure. Healthcare providers also explain its impact on your life.Recommendations, including quitting smoking and losing weight, which lower your risk of complications.AdvertisementIn FTM phalloplasty, what happens to the female genitals?Before phalloplasty, you might undergo a separate FTM bottom surgery. This surgery may combine multiple procedures, such as:Hysterectomy, which removes the uterus.Oophorectomy to remove the ovaries.Vaginectomy or vaginal mucosal ablation to remove all or part of the vagina and seal the opening.Some individuals might choose to keep parts of the female genitalia.What other transgender surgery options are available?In addition to FTM bottom surgery, individuals may wish to pursue FTM top surgery. This procedure removes breast tissue to create a more masculine-looking chest.Care at Cleveland ClinicSchedule Gender Affirming SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of phalloplasty?One of the main benefits of phalloplasty is relief from physical and emotional challenges. Results include a natural-looking penis that may be capable of erections. When part of transgender surgery, phalloplasty helps you achieve your desired gender identity.Other benefits depend on which options you choose:Radial forearm free flaps provide excellent cosmetic results and better sensation.Anterolateral thigh free flaps give you more penis length options. And the scars on your thigh from removing the flap are easier to hide.Latissimus dorsi flaps (from your back) cause less scarring. They offer the best potential for an erection without a device.Urethra lengthening enables you to urinate while standing.What’s the risk of complications?Phalloplasty is a complex penis surgery. Many people experience complications. But going to an experienced surgeon lowers this risk. Complications are less likely to affect your long-term results when caught early.What are the potential complications of phalloplasty?Complications of genital reconstruction and FtM bottom surgery may include:Infection: The skin near the incision and the urethra are common areas for infection.Partial phallic loss: If the neopenis does not maintain adequate blood flow, it cannot survive.Urethral stricture: Inadequate blood flow can cause scar tissue to form. This may slow or block the release of urine.Urinary fistula: An abnormal connection may form between the urinary tract and a nearby organ, like the bowel, or the outside world.Recovery and OutlookWhat is recovery from phalloplasty like?After surgery, you’ll need to take it easy. Recovery includes:Limiting physical activity, like exercise, work and household chores.Eliminating urine through a thin tube inserted into the penis (Foley catheter) or through the skin of the lower abdomen (suprapubic catheter).Keeping incisions clean and dry.Reapplying dressings over surgical wounds in the early stages of recovery.Taking medications to ease pain, prevent infection and relieve constipation.How long will it take to achieve a functioning penis?Achieving the full function of your penis takes time — in some cases, a year or more. It may require multiple surgeries. The length of your recovery depends in part on whether surgery involves:Repairing or constructing a penis.Removing female genitals.Taking a flap from the arm, leg or back.Constructing a scrotum or glans.Implanting a device to create erections.When to Call the DoctorWhen should I contact my healthcare provider after having phalloplasty?Your care should include follow-up appointments to track your recovery. Contact your healthcare provider immediately if you experience:Blood-soaked dressings, which can be a sign of excessive bleeding.Infections that cause a fever or yellowish discharge from the incision.Pain that does not respond to medications.Signs of blood clots, such as abnormal swelling in your groin or lower leg.Vomiting and not being able to keep fluids down.If the neopenis appears discolored or if there are skin changes.A note from Cleveland ClinicPhalloplasty is a type of surgery to repair or construct a penis. A person may wish to pursue this type of penis surgery for many reasons. These include trauma, congenital conditions and gender confirmation. If phalloplasty is right for you, work with your surgeon to learn about your options. You may need more than one procedure to achieve your desired results. You should also be aware that complications are common. Seeing an experienced surgeon lowers this risk.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/10/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Gender Affirming SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"