"PRK (Photorefractive Keratectomy): Treatment, Side Effects & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Photorefractive Keratectomy (PRK) Eye SurgeryAdvertisementAdvertisementAdvertisementPhotorefractive Keratectomy (PRK) Eye SurgeryYour eyesight is vital for your best quality of life. Poor vision can be helped by a PRK (photorefractive keratectomy), which is a type of outpatient, refractive laser eye surgery that helps with nearsightedness, farsightedness and astigmatism. About 80% of patients see improved vision one month after surgery and 95% after three months.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is photorefractive keratectomy (PRK) eye surgery?Photorefractive keratectomy (PRK) is a laser eye surgery — specifically a type of refractive surgery. A refractive problem is where your eyes don’t bend light properly, which keeps you from seeing your best. There’s a chance that after your PRK you might not need your glasses or contact lenses anymore, or at least only for certain activities like reading or driving at night.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is photorefractive keratectomy (PRK) performed?A photorefractive keratectomy is performed to treat refractive errors in your eyes. By using a laser to change the shape of your cornea, this procedure improves the way rays of light are focused on your retina. You may need a PRK if you’ve been diagnosed with the following eye issues:Myopia (nearsightedness).Hyperopia (farsightedness).Astigmatism (the shape of your eye causes blurry vision).Who can have a photorefractive keratectomy (PRK)?You have to meet certain requirements in order to have a PRK. In addition to having a conversation with your ophthalmologist (eye doctor) about what to expect, you need to:Have healthy corneas.Have healthy eyes in general.Have realistic expectations about the PRK. Your surgeon will discuss what to expect and not expect.Be 18 years old, or older.Have an eye prescription that hasn’t changed in the previous year.You’re not likely to qualify for a PRK if you:Have advanced glaucoma.Are pregnant.Are breastfeeding.Have cataracts.Have an eye infection, dry eye syndrome or blepharitis.Have scars in your eyes.Have a refractive error that keeps changing.Have cornea injuries or diseases.Have a disease that affects healing, an allergy or uncontrolled diabetes.AdvertisementIs a photorefractive keratectomy (PRK) an outpatient or inpatient surgery?Your photorefractive keratectomy will take place in an outpatient eye surgery center.What kind of healthcare provider performs a photorefractive keratectomy (PRK)?You may work with a whole team for your photorefractive keratectomy:Ophthalmologists (who study and treat eye diseases).Ophthalmic surgeons.Nurses.Optometrists (healthcare providers who specialize in the eyes in general).Technicians.AdvertisementWhat’s the difference between a PRK and LASIK?LASIK (situ keratomileusis) is also a type of laser eye surgery that works on your cornea. Unlike LASIK, a PRK doesn’t involve cutting a flap in your cornea. It’s best to have a PRK if you have dry eyes, thin corneas or if you have a very active lifestyle. The corneal flap could move from the activity.All laser vision correction surgeries work by reshaping the cornea, or clear front part of your eye, so that light traveling through it is properly focused onto the retina located in the back of your eye. During PRK, an eye surgeon uses a laser to reshape your cornea. This laser, which delivers a pulsing beam of ultraviolet light, is used on the surface of the cornea, not underneath a corneal flap as in LASIK.LASIK has a shorter recovery period and less pain after the procedure. If you have a PRK you’re more likely to have hazy eyesight for a short time. Usually, the quality of vision long-term from a PRK is as good as LASIK.You might choose a PRK over LASIK for the following reasons:LASIK is a newer procedure compared to a PRK. Your ophthalmologist may be more familiar with a photorefractive keratectomy. Talk to your eye surgeon about their experience.LASIK comes with a risk of the flap getting moved or dislocated. Because a PRK doesn’t include a flap, which can be moved by physical activity, it may be preferred by pilots and athletes and anyone who does a lot of physical activity.Procedure DetailsHow do I prepare for photorefractive keratectomy (PRK) surgery?Before your PRK surgery, you will meet with a healthcare provider who will discuss what you should expect before, during and after your surgery. During this session, your medical history will be evaluated and you’ll have your eyes tested to measure the following:Your pupil size.The refractive error.Your cornea.The general health of your eyes.Your eye surgeon will answer any further questions you may have. Afterwards, you can schedule an appointment for the PRK procedure.If you wear rigid gas permeable contact lenses, you should stop wearing them at least three weeks before the date of your screening visit. Other types of contact lenses shouldn't be worn for at least three days prior to evaluation. Be sure to bring your current glasses so your prescription can be reviewed.On the day of your surgery, eat a light meal before coming and take all of your usual prescribed medications. Don’t wear eye makeup or have any bulky accessories in your hair that will interfere with positioning your head under the laser. If you’re not feeling well that morning, call your ophthalmologist’s office to determine if the procedure needs to be postponed.What should I bring to the photorefractive keratectomy (PRK)?It’s not necessary to bring anything to your procedure, although you might want to wear glasses instead of contact lenses, just for the convenience.What happens during the photorefractive keratectomy (PRK) procedure?Your PRK will happen in six steps:Your surgeon will numb your eyes using eye drops.They’ll put a holder in your eye to stop you from blinking.Your epithelium — the outer layer of your cornea — will be removed using a brush, blade, laser or an alcohol solution.The ophthalmologist will then use a laser to reshape your cornea.Next, the surgeon will give you nonsteroidal anti-inflammatory eye drops, antibiotic drops and steroid drops.A clear contact lens is usually placed at the end of surgery to reduce irritation during the healing process. It works like a bandage.How long does the photorefractive keratectomy (PRK) procedure last?The PRK procedure only takes about 10 to 15 minutes.Will I be asleep during the procedure?You will be awake during the PRK procedure. Your surgeon will use drops to numb your eyes.When will I be able to go home after the PRK procedure?You’ll be able to go home right away after the PRK. However, you should have someone drive you.What should I expect after the photorefractive keratectomy (PRK) procedure?After the PRK, you should:Get some rest.Avoid physical activity for as long as your surgeon recommends.Take a few days off of work, if necessary.You may have some eye pain for two or three days, so take an over-the-counter pain reliever or get a prescription for eye drop pain relievers. You may also be prescribed other medications. Be sure to wear sunglasses outside (for as long as you’re instructed) to prevent scarring on your corneas.Your vision will improve after three to five days, but meanwhile, it may be blurry. It may take a month of more before you see big improvements with your vision.Care at Cleveland ClinicLaser Vision CorrectionFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of a photorefractive keratectomy (PRK)?Talk with your healthcare providers about the risks and benefits of a PRK (photorefractive eye surgery) before your procedure. Advantages include:PRK can accurately correct nearsightedness. Approximately 90% of PRK patients have 20/20 vision without glasses or contact lenses one year after the surgery. Over 95% have 20/40 or better (without glasses or contacts).PRK may be preferable to LASIK in certain patients with thinner corneas or with corneal surface irregularity since PRK disrupts less corneal tissue than a comparable LASIK surgery.PRK is technically simpler than LASIK and utilizes the same modern laser treatment systems. For this reason, some refractive surgeons prefer PRK to LASIK.What are the disadvantages, risks and possible side effects of the photorefractive keratectomy (PRK) procedure?All surgeries include risks, and a photorefractive keratectomy is no different. After the procedure you may have:Scars on your cornea.Corneal haze, which is a cloudiness on your cornea.An infection.A glare and halo when you’re around lights, especially at night.Eye pain, irritation and/or watering.Sensitivity to light.Hazy vision. A medicine called mitomycin C is sometimes used during surgery to minimize the risk of haze after a PRK.Regression, which means that the treatment becomes less effective.Delayed healing.Very, very rarely, patients have experienced worse vision or even blindness.The outcome is not completely predictable due to variations in individual wound healing, and a small number of patients may still require glasses or additional surgery to achieve their best vision.Recovery and OutlookWhat’s the prognosis (outlook) for people who have a photorefractive keratectomy (PRK)?The prognosis is very positive after PRK. Typically, vision is about 80% improved at one month after surgery and about 95% by three months after surgery.Is photorefractive keratectomy (PRK) painful?No. Your eyes will be numbed so that you don’t feel anything. After the procedure you may feel some pain for a few days.What can I eat and drink after the photorefractive keratectomy (PRK)?There are no restrictions on what you can eat or drink after a photorefractive keratectomy.Do I have to go to any follow-up appointments after the photorefractive keratectomy (PRK)?The bandage contact lens is usually worn for the first several days to allow the surface of your eye to heal. You should expect to visit your ophthalmologist two or three times during the first three months after surgery, with the first visit being one to three days after surgery. Once the surface of your eye is healed, the bandage contact lens is removed.Will I still need reading glasses to correct presbyopia after I have had photorefractive keratectomy (PRK)?Presbyopia (loss of focus on nearby objects) eventually affects all patients over the age of 40 and can be managed with reading glasses or with a blended approach to laser refractive surgery called monovision. Monovision can be simulated before surgery by using a pair of trial glasses or contact lenses. In monovision, the non-dominant eye is corrected for computer or reading distances (slightly nearsighted) and the dominant eye is corrected for distance.Presbyopia is not actually reversed by monovision PRK, but your dependence on reading glasses can be reduced by incorporating monovision into the treatment plan. An in-office trial of monovision during your screening exam can help you assess the benefits and compromises associated with a monovision approach.When can I go back to work/school?Some people take a few days off work/school while others take a whole week. Don’t return until you feel comfortable with your vision.When to Call the DoctorWhen should I contact my surgeon after photorefractive keratectomy (PRK)?Contact your surgeon if the pain doesn’t go away after a few days.When should I see my healthcare provider?See your optometrist or ophthalmologist for a follow-up appointments as recommended. Let them know if you have any more concerns about your vision.Additional DetailsDoes insurance cover a photorefractive keratectomy?This depends on the type of insurance you have and how much they cover. Contact your insurance company before the procedure to find out the details.A note from Cleveland ClinicA photorefractive keratectomy (PRK) is a short procedure with a short recovery time. It can improve your nearsightedness, farsightedness or astigmatism. Remember to have appropriate expectations for your PRK. You may still need your glasses or contact lenses after the surgery. Talk to your optometrist and ophthalmologist about your concerns and options as soon as you notice problems with your eyes.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/07/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicLaser Vision CorrectionFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2020Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"