"Photodynamic Therapy (PDT): Procedure, Uses & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Photodynamic Therapy (PDT)AdvertisementAdvertisementAdvertisementPhotodynamic Therapy (PDT)Photodynamic therapy (PDT) uses a combination of light energy and photosensitizing medications to treat certain types of cancer and other health conditions such as psoriasis, acne and infections.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is photodynamic therapy (PDT)?Photodynamic therapy (PDT) destroys harmful cells, including cancer cells, using drugs called photosensitizers. Light activates these drugs and creates a chemical reaction that destroys the harmful cells.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat conditions are treated with PDT?Healthcare providers use PDT to treat a wide range of medical issues, including skin conditions, many types of cancer and some noncancerous conditions.Photodynamic therapy for skin conditionsHealthcare providers may recommend photodynamic therapy for:Psoriasis.Actinic keratosis.Vitiligo.Photodynamic therapy for cancerPDT is also used to treat many different types of cancer. Your healthcare provider may recommend photodynamic therapy for:Skin cancer.Lung cancer.Esophageal cancer, including Barrett’s esophagus, where cells at the base of your esophagus are damaged.Bladder cancer.Pancreatic cancer.Bile duct cancer.Head and neck cancer.Brain cancer.Photodynamic therapy for noncancerous conditionsIn some cases, PDT can treat noncancerous conditions, such as:Urinary tract infections.Acute sinusitis.Gastritis.Corneal infections.Gum disease.Procedure DetailsWhat happens during photodynamic therapy?During treatment, your healthcare provider gives you a photosensitizer. Depending on where the target area is located in your body, this medication might be given in pill form, through your vein (intravenously) or applied directly to your skin. The photosensitizing drugs concentrate in cancer cells and other unhealthy cells to make those cells more sensitive to light.After administering the photosensitizer, your healthcare provider shines a special light on the treatment area. Depending on the type of photosensitizer used, your healthcare provider may use low-power red laser light, blue light or natural sunlight. If the treatment area is in your throat, airways or lungs, your healthcare provider will use an endoscope (a thin, flexible tube) to shine light on the cells inside of your body. Under the light, the photosensitizing agent reacts with oxygen, causing a chemical reaction that destroys unhealthy cells.You may receive repeat phototherapy treatments as needed. Your healthcare provider will determine if and when you receive further PDT.AdvertisementHow long does PDT take?In most cases, PDT treatment sessions take anywhere from 15 to 90 minutes. Treatment time depends on the size of the targeted area.How long until I see results from photodynamic therapy?It depends on your unique situation. All the cells in your body absorb the photosensitizing agent, but these drugs stay longer in abnormal cells than in healthy cells. Some photosensitizing agents start collecting in unhealthy cells immediately. Others take hours or days to build up in large enough amounts for effective treatment. Your treatment timeline, including how many treatments you receive and how often you receive them, depends on the photosensitizing agent your healthcare provider prescribes.Care at Cleveland ClinicSchedule Gamma Knife SurgeryFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the benefits of photodynamic therapy?PDT offers many benefits compared to other medical treatments:There are no known long-term side effects when administered properly.It’s usually performed as an outpatient procedure over a short time.PDT can be repeated if necessary.It’s less invasive and more precise compared to other treatments like surgery.There’s minimal scarring.What are the side effects of photodynamic therapy?Like any medical procedure, PDT carries the risk of side effects. Photosensitizing agents affect both unhealthy and healthy cells, making you more sensitive to light even after your treatment is complete. Your skin and eyes may be more sensitive to light for as long as three months after your procedure.Other possible side effects of PDT include:Swelling at or near the area of skin treated.Discoloration of your skin.Scales, crusts or blisters on your skin receiving treatment.Itching, stinging or burning.Skin infections.If you have PDT to your esophagus, your side effects may include:Hiccups.Difficulty swallowing.Nausea and vomiting.Dehydration.Fever.Narrowing or scarring of your esophagus.Risks of PDT for people living with non-small cell lung cancer include:Shortness of breath.Fever.Infections like pneumonia or bronchitis.Coughing up blood.Are there limitations to PDT?Photodynamic therapy can only treat areas of your body where light can reach. It’s effective when treating skin problems or the lining of organs that can be reached with a light source. But it can’t treat large cancers or cancers that have grown deep into your skin.Recovery and OutlookHow long does it take to recover from photodynamic therapy?It usually takes about two to six weeks to fully heal after PDT, depending on the area of your body that’s being treated.What is the outlook for people receiving photodynamic therapy?Most people return to their daily activities immediately following PDT. Some people need to take extra steps to protect their skin and help the treatment area heal.Your healthcare provider may recommend covering the treatment area to help protect your skin. You may need to make lifestyle changes for short periods of time, depending on the photosensitizer your healthcare provider uses. These lifestyle changes may include:Staying indoors.Avoiding direct, bright or strong indoor lights.Wearing protective clothing and hats to avoid natural sunlight.Staying away from environments where light may be reflected, like beaches.Not using helmet-type hair dryers.Not using strong reading or examination lamps.Is photodynamic therapy permanent?When treating skin conditions, PDT results are usually semi-permanent, lasting several months. When treating cancer, research shows that PDT can be just as successful as chemotherapy or radiation in certain cases. Whether you need repeat sessions depends on several factors, including the type of cancer you have, where it’s located and how well you respond to treatment.When to Call the DoctorWhen should I call my healthcare provider concerning photodynamic therapy?If you’re diagnosed with skin cancer or another medical condition that may benefit from PDT, ask your healthcare provider if this treatment could be a good option for you.A note from Cleveland ClinicPhotodynamic therapy can treat a number of health conditions, including many types of cancer. It minimizes damage to healthy cells, has no known long-term side effects and can often be performed as an outpatient procedure. To find out of photodynamic therapy is right for you, schedule an appointment with your healthcare provider.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/25/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Gamma Knife SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"