"Plastic Surgery: Types, Benefits & Potential Complications800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Plastic SurgeryAdvertisementAdvertisementAdvertisementPlastic SurgeryPlastic surgery alters certain areas of your body to treat medical issues or enhance appearance. Surgeons might perform procedures on your face, neck, breasts, stomach, arms and legs. Reconstructive surgery repairs defects or injuries and restores function. Cosmetic surgery enhances appearance for nonmedical reasons.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is plastic surgery?Plastic surgery takes its name from the Greek word “plastikos,” which means to “form” or “mold.” It includes a group of procedures that alter certain areas of your body. These include your face, neck, breasts, stomach, arms and legs. The terms “reconstructive plastic surgery” and “cosmetic surgery” may seem similar, but they represent different types of procedures.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is reconstructive surgery?Reconstructive surgery repairs defects or injuries from trauma. It also restores function and a natural-looking appearance.You may need this type of surgery if you have:Birth defects, such as webbed fingers, cleft lip and palate.Burns.Certain medical conditions, like head and neck cancer or breast cancer.Scars that prevent natural movement.Severe injuries, like cuts or tears over large areas of skin.What is cosmetic surgery?Cosmetic surgery enhances appearance for nonmedical reasons. This group of procedures addresses physical features that make you self-conscious. Cosmetic surgery can bring you closer to your ideal body image. This type of surgery changes features such as:Shape.Size.Symmetry (creating more of a mirror image between two similar body parts, such as breasts).AdvertisementWho performs plastic and reconstructive surgery?Plastic surgeons perform plastic and reconstructive surgery. Surgeons from many fields perform cosmetic procedures. You may receive cosmetic surgery from a plastic surgeon, dermatologist, otolaryngologist (ear, nose and throat surgeon) or others.Selecting your healthcare provider is important. You’re more likely to experience improved outcomes from surgeons with specialized training and experience in the procedure you need. Board-certified surgeons are an ideal choice. They must pass rigorous training and examinations demonstrating their knowledge of safety and quality practices.Procedure DetailsWhat are the different types of reconstructive plastic surgery?Common types of reconstructive plastic surgery include:Birth defect repairCleft lip and palate.Congenital hand differences.Craniosynostosis.Hypospadias.Microtia.Breast surgeryBreast augmentation.Breast lift (mastopexy), makes breasts firmer and raises them.Breast reduction.Face and neck proceduresBrow lift.Cheek lift.Facelift.Double chin surgery.Rhinoplasty.Fat reduction and body liftsAbdominoplasty (tummy tuck).Body contouring.Eyelid surgery (blepharoplasty).Liposuction.Gender affirmation proceduresFacial feminization surgery.Facial masculinization surgery.Female-to-male top surgery.Feminizing genitoplasty.Phalloplasty.Reconstructive plastic surgeryBone grafting.Breast reconstruction.Facial reconstruction.Jaw reconstruction (orthognathic surgery).Limb salvage.AdvertisementRisks / BenefitsWhat are the risks of plastic surgery?All surgical procedures come with risks. Plastic and reconstructive surgery procedures are often complex. They may alter sensitive structures near major organs or delicate tissue. Cosmetic procedures can make significant changes to areas of your body that are otherwise healthy.The likelihood of complications depends on various factors. They include surgery type, your health history and lifestyle factors such as smoking.Some complications may occur during surgery, while others can develop after your recovery.One of the main risks is that you might not achieve the result that you were expecting.Other potential risks of plastic surgery include:Abnormal scarring.Blood clots.Blood loss.Complications of anesthesia, such as respiratory issues during your procedure.Fluid build-up (edema).Infection.Nerve damage, leading to neuropathy.Scarring that prevents natural movement.Slow-healing wounds and incisions that take longer than expected to heal.What are the benefits of plastic surgery?For most people, the benefits of cosmetic or reconstructive surgery outweigh the risks. There’s a lot you can gain from pursuing these procedures, including:Better quality of life.Enhanced body image and self-esteem.Improved safety, such as seeing better after removing extra eyelid skin.More natural appearance.Pain relief and greater independence after correcting defects that make it difficult to move.Restored functioning, like eating solid food after recovering from jaw surgery.Recovery and OutlookWhat is recovery from plastic surgery like?After you wake up and the anesthesia wears off, you may be able to go home. If you need to stay in the hospital, it’s typically just a night or two. Before going home, you’ll receive home-care instructions. Following them closely can lower your risk of complications.Your home recovery may include:Lots of rest, not lifting anything heavy or spending limited time on your feet.Changing surgical dressings regularly.Eating a specific kind of diet, such as only soft foods.Elevating the area where you had surgery to reduce swelling.Staying home from work or school until your recovery is further along.Taking stool softeners to ease constipation due to the analgesic medications.Waiting a few days to take a shower or bath.What are the recovery expectations for people who have had plastic surgery?Depending on the procedure, you may feel well enough to resume regular activities in a few days. Other procedures, like a tummy tuck, can take several weeks to months to recover. Some people realize the full benefits of their procedure and are pain-free within a few weeks. For advanced procedures, such as facial feminization surgery, it can take up to a year for swelling to go down.In some cases, additional treatments may be part of your recovery. You may need:Physical therapy to help you regain range of motion or ease stiffness.Speech and swallow therapy to push past challenges with speaking and swallowing.Occupational therapy to help you relearn how to perform daily activities, like getting dressed.When to Call the DoctorWhen should I contact my healthcare provider after plastic surgery?You should contact your healthcare provider if you experience signs of complications. These include:Blood-soaked dressings, which can be a sign of excessive bleeding.Infections, which can cause a fever or yellowish discharge from the incision.Pain that doesn’t respond to medications.Signs of blood clots, such as abnormal swelling in your groin or lower leg.Vomiting and not being able to keep fluids down.A note from Cleveland ClinicPlastic surgery alters certain areas of your body to treat medical issues or enhance appearance. There are different types of plastic surgery, including reconstructive surgery, birth defect repair, cosmetic surgery and more. These are complex procedures with risks of complications. Receiving services from an experienced surgeon and following home-care instructions can help you have a safe experience. You’ll also be more likely to achieve the results you’re looking for.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/17/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"