"Platelet-Rich Plasma (PRP): Uses & Procedure Details800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Platelet-Rich PlasmaAdvertisementAdvertisementAdvertisementPlatelet-Rich PlasmaPlatelets are a part of the blood that allow your body to clot.  Platelet-rich plasma (PRP) is produced by spinning blood in a centrifuge so that it separates. In addition to PRP, the process can produce other items such as platelet-poor plasma (PPP) and platelet lysate (PL). PRP can be used to treat conditions like knee osteoarthritis, sports injuries and hair loss.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsAdditional DetailsOverviewWhat is platelet-rich plasma (PRP)?Platelet-rich plasma (PRP) relies on platelets (cell fragments found in blood) to improve tissue function. Other names for some of these products include platelet-rich growth factors (GFs), platelet-rich fibrin (PRF) and platelet concentrates (PCs).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat does platelet-rich plasma (PRP) do?Different types of PRP products are usually given as injections (shots) to heal and repair injuries. The job of platelets in the body is to help blood clot when there is an injury. The cytokines and growth factors that are in platelets can help repair injuries and encourage healing.Studies have indicated that PRP is or may be useful to treat:Tennis elbow (lateral epicondylitis).Knee osteoarthritis (PRP is being combined with other options to lessen pain, improve function and possibly help repair cartilage. A certain type of PRP called leukocyte-poor PRP or LP-PRP has been suggested as the most useful for knee osteoarthritis.)Sports injuries such as pulled muscles, joint sprains or ligament tears.Wounds.Hair loss.Procedure DetailsWhat can I expect during the procedure?Blood is removed from the arm using a needle into the vein. Then the blood is processed in a centrifuge, equipment that separates blood components into different parts according to their density. The platelets are separated into blood serum (plasma), while some of the white and red blood cells may be removed. Therefore, by spinning the blood, the equipment concentrates the platelets and produces what is called platelet-rich plasma (PRP).However, depending on the protocol used to prepare PRP, there are multiple different products that can result from putting blood into the centrifuge. Therefore, different PRP preparations have different number on platelets, white blood cells, and red blood cells. For example, a product called platelet-poor plasma (PPP) can be formed when most of the platelets are removed from the serum. The serum that is left contains cytokines, proteins and growth factors. Cytokines are emitted by immune system cells.If the platelet cell membranes have been lysed, or destroyed, a product called platelet lysate (PL), or human platelet lysate (hPL) can be formed. PL often is made by freezing and thawing the plasma. PL has a higher number of some growth factors and cytokines than PPP.AdvertisementRisks / BenefitsWhat are the risks of platelet-rich plasma (PRP)?As with any type of injection, there are small risks of bleeding, pain and infection. When the platelets are from the patient who will be using them, the product is not expected to create allergies or have risks of cross infection. One of the main limitations with PRP products is that every preparation in every patient can be different. No two preparations are the same. Understanding the composition of these therapies required measuring numerous complex and different factors. This variation limits our understanding of when and how these therapies may succeed and fail, and the matter of current research endeavors.Additional DetailsDoes insurance cover platelet-rich plasma (PRP)?No. Most insurers do not cover this type of therapy.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/06/2019.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2606Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"