"Prescription Skin Care 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Prescription  Skin CareAdvertisementAdvertisementAdvertisementPrescription  Skin CarePrescription skin care can improve the overall look of your skin. You can also use prescription products to treat specific conditions, such as eczema or psoriasis. Prescription skin care products often contain the same ingredients as over-the-counter products, but in stronger dosages.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is prescription skin care?Prescription skin care can improve the overall look of your skin. Prescription products often contain the same ingredients as over-the-counter products. But dosage strengths are higher in prescription skin care.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs prescription skin care?Anyone can ask a dermatologist (skin care doctor) about prescription skin care. A dermatologist may recommend prescription skin care when over-the-counter products haven’t helped.What does prescription skin care treat?A healthcare provider may prescribe medications to treat certain skin conditions, such as:Acne.Eczema.Melasma.Psoriasis.Rosacea.Some skin cancers, such as actinic keratosis or basal cell carcinoma.You can also use prescription skin care to:Brighten the appearance of your skin.Reduce acne scars.Remove unwanted facial hair.Restore hair growth on your scalp.Smooth fine lines and wrinkles.Slow down signs of agingAdvertisementWhat are the types of prescription skin care?Your healthcare provider may prescribe a medicated cream called imiquimod to treat early skin cancer. Corticosteroid creams can treat eczema or psoriasis.Some prescription products have ingredients that brighten skin and reduce acne. Your healthcare provider may prescribe:Beta-hydroxy acid (salicylic acid).Hydroquinone.Isotretinoin (Accutane®).Tretinoin (Retin-A® and Renova®).If you need products that affect hair growth, your healthcare provider may prescribe:Eflornithine cream (Vaniqa®), which slows the growth of facial hair.Finasteride (Propecia®) to treat male-pattern hair loss.Procedure DetailsHow do you use prescription skin care?Many prescription skin care products are creams or gels that you apply directly to your skin. Usually, you use these creams a few times a week. Other medications are pills that you swallow one or more times a day.Care at Cleveland ClinicGet Dermatology CareMake an AppointmentAdvertisementRisks / BenefitsWhat are the advantages of prescription skin care?The primary advantage of prescription skin care is its strength and effectiveness. Prescription-grade products can work their way past the surface layers of skin into the dermis (deeper skin layer).When your skin care products reach these deeper layers of skin, they work better. The dermis contains collagen, elastin and new skin. These types of skin cells make your complexion appear brighter, firmer and more youthful.If you have male-pattern hair loss, prescription products are some of the only proven treatments. For example, finasteride is one of only a few FDA-approved products to grow hair in men. Some prescription products, such as Rogaine® (minoxidil), eventually become available over-the-counter.What are the risks or complications of prescription skin care?Because prescription skin care products are such strong formulations, they can cause side effects. While using prescription skin care, you might experience:Dryness.Increased sensitivity to ultraviolet (UV) rays.Peeling.Skin “purging,” or periods of increased breakouts.Stinging.Swelling.Tightness.Is prescription skin care safe when you are pregnant?Many prescription skin care products are not safe to use while you are pregnant or nursing. Be sure to tell your healthcare provider if there is a possibility that you are pregnant.Can I combine nonprescription and prescription skin care?Usually, a dermatologist prescribes one prescription skin care product to treat a specific condition, like acne. You can incorporate this product into a skin care routine with nonprescription cleansers and moisturizers.Because many prescription products can cause dryness, choose a gentle cleanser and moisturizing cream. Avoid combining prescription and over-the-counter products designed to treat the same condition. For example, if your dermatologist prescribed an acne cream, avoid also using an over-the-counter cleanser that targets acne.Recovery and OutlookHow long does it take for prescription skin care to work?In general, you will start to see results from oral medications in 2 to 3 weeks. Topical prescription skin care can take up to six weeks to show results.When to Call the DoctorWhen should I see my healthcare provider?You should call your healthcare provider if any skin care products cause:Extreme swelling, especially of the tongue or lips.Hives.Severe rash.A note from Cleveland ClinicPrescription skin care products can improve the look of your skin. They can also treat specific conditions such as eczema or hair loss. Many people experience excellent results from prescription skin care. For most people, these products have no significant side effects. But many prescription products are not safe to use during pregnancy. If you have tried over-the-counter skin care products without success, speak with a healthcare provider about prescription options.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/24/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Dermatology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"