"Proctocolectomy: Definition, Types & Procedure800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/ProctocolectomyAdvertisementAdvertisementAdvertisementProctocolectomyA proctocolectomy is a surgical procedure to remove your colon and your rectum. These two parts make up the majority of your large intestine. Without these parts, your surgeon will have to create a new pathway for your poop to come out. You may need a colostomy, and ileostomy or an internal ileal pouch (J-pouch).ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a proctocolectomy?A proctocolectomy is a surgical procedure to remove part or all of your colon and your rectum. Your colon and rectum are sections of your large intestine or large bowel. Your large intestine includes your colon, rectum and anus. The colon is the biggest part of it, which is why people sometimes use the word “colon” to mean the large intestine.Your colon is where food waste is slowly solidified into poop. Your rectum is a short section that follows your colon and holds your poop before it's released through your anus. It’s all one continuous tube.If you have a problem in your large intestine that requires surgery, it could be in any part of this continuum or throughout. Different kinds of bowel resection surgery remove different parts. Colectomy surgery removes part or all of your colon. “Procto” means rectum, so a proctocolectomy includes your rectum with your colon. A proctectomy, on the other hand, removes only the rectum.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is a proctocolectomy done?Like other types of bowel resection surgery, a proctocolectomy removes a section of your bowel when that section is too diseased to function well, or when the disease is life-threatening.Conditions most commonly treated with proctocolectomy include:Inflammatory bowel diseases (such as ulcerative colitis & Crohn’s disease).Colorectal cancer and precancerous conditions (such as familial adenomatous polyposis).Other possible reasons include:Tissue death due to ischemia (loss of blood flow).Complicated diverticulitis.Traumatic injury.Severe constipation.How do you poop after a proctocolectomy?A proctocolectomy interrupts your poop’s normal pathway through your intestines and out of your anus. So how do you poop without your colon and rectum? The answer to this will depend on the type of proctocolectomy you have. The type you have will depend on your condition and the reason why you need a proctocolectomy.What are the different types of proctocolectomy?Total proctocolectomy: Healthcare providers sometimes use the term “total proctocolectomy” to describe the complete removal of the colon and rectum. This simply means that no part was left behind. If you have a total proctocolectomy, there is no intestine left between your small intestine and your anus. Your surgeon will have to build a new pathway for your poop to travel through.Proctocolectomy with ileostomy: One possibility is an ileostomy, an operation that redirects the last part of your small intestine, called the ileum, out of a new opening in your abdomen. Some people may need a permanent ileostomy (also called an end ileostomy) and some may only need one temporarily while they are healing. The ileum may be able to be connected to your anus at a later time.Restorative proctocolectomy with ileal-anal pouch: If your ileum and anus are in good health, either at the time of your proctocolectomy or later, you may be a candidate for an internal ileal pouch. This means that your surgeon will form your ileum into a pouch that can serve as a reservoir for poop in the same way your rectum once did. (The J-pouch is the most common type of ileoanal pouch used today.) Your surgeon will then reconnect the pouch to your anus (ileoanal anastomosis), so that your poop can come out in the old-fashioned way.Subtotal proctocolectomy: A subtotal proctocolectomy leaves part of your colon or rectum behind — most likely the colon, since there is much more of it. Hartmann’s procedure is a type of subtotal proctocolectomy (also called a proctosigmoidectomy). It removes only the last section of the colon, called the sigmoid colon, along with all or part of the rectum.When you have a subtotal proctocolectomy, there may be enough healthy colon left to safely reconnect your colon to your remaining rectum or anus. Rejoining the large intestine (anastomosis) is possible when your overall condition allows.You may need to have a temporary colostomy to redirect your colon to a new opening in your abdomen while you are healing from your proctocolectomy. If you heal well enough, you may be able to close the colostomy in a second surgery. In other cases, you might need a permanent colostomy.AdvertisementProcedure DetailsWhat happens before a proctocolectomy?Several weeks prior: If it’s not an emergency surgery, you’ll have time to discuss your proctocolectomy with your healthcare provider in advance, including the different types of proctocolectomy you might be a candidate for and the risks and benefits of the procedures.Two weeks prior: During the two weeks before surgery, you'll be asked to reduce or stop any blood-thinning medications you may be taking. You’ll also be advised to keep your intestines in as good health as you can by eating lots of dietary fiber and drinking lots of water.24 hours prior: On the day before surgery, your health provider may prescribe a bowel prep to help clear out your intestines. They will prescribe a clear liquid diet for these 24 hours. They may also prescribe preventative antibiotics to protect against infection after surgery.What happens during a proctocolectomy?Preparation for surgery: When you arrive at the hospital, you’ll change into a hospital gown. Your healthcare team will place an intravenous (IV) catheter into one of your veins to give you continuous fluids and medications. They will then wheel you into the operating room on a gurney. Your anesthesiologist, who is working with your surgeon, will put you to sleep under general anesthesia. You’ll be put on a ventilator to help you breathe during the operation.Open surgery vs. Laparoscopic surgery: Many proctocolectomies are now performed through minimally invasive laparoscopic or robotic surgery. This means that instead of opening up your abdomen, as in classic open surgery, the surgeon is able to operate through a few small incisions, using the aid of a tiny camera called a laparoscope. Laparoscopic surgery is associated with faster recovery times and better patient outcomes. But not everyone is a candidate. More complicated or emergency conditions may require open surgery.Resection: When your surgeon has accessed your bowel, they will carefully remove the affected portion of your colon and rectum. If your anus is not affected, they will leave your anus and anal sphincter intact. Having a functioning anal sphincter will be important if you hope to be able to poop through your anus again in the future.Ileostomy/Colostomy: Whether it is temporary or permanent, most people will need to have an ileostomy or colostomy created during their proctocolectomy surgery. An ostomy redirects the course of your ileum or remaining colon to a new opening in your abdominal wall. Your surgeon will attach a bag to the outside opening of the intestine (your stoma). This is where your poop will come out.Anastomosis: If you have enough healthy colon left to reconnect with your anus, and if your condition doesn’t require healing time before the ends can be safely rejoined, you may have an anastomosis during the same surgery. In this case, your surgeon will stitch the healthy ends of your large intestine together and then close you up. You won’t need an ostomy.AdvertisementWhat happens after a proctocolectomy?Recovery: You’ll spend up to a week recovering in the hospital. You’ll spend this time gradually resuming solid foods and regular bowel movements. If you have an ostomy, a wound ostomy continence nurse (WOCN) will work with you during this time to teach you about living with an ostomy bag and caring for your stoma. Even if it’s a temporary ostomy, it will be several months before you can begin discussing the next step with your surgeon — a reversal, or an internal ileal pouch.Risks / BenefitsWhat are the possible complications of proctocolectomy surgery?Intestinal obstruction. Scar tissue from the surgery can build up in your abdomen, causing an intestinal blockage. Your healthcare provider will help you relieve it.Nerve damage. Surgery in the rectum and anus can sometimes damage nerves connected with sexual or urinary function. This may cause difficulty with urination. It may also cause sensitivity and pain during sex for women, or erectile dysfunction in men. These complications typically ease over time.Standard surgery risks. All surgeries carry a low risk of certain complications, including reactions to the anesthesia, injury to nearby organs, internal bleeding and infection.What are the possible complications of an ileostomy or colostomy?Skin irritation. The skin around your stoma can become irritated by contact with stool. The stool of the ileum and upper colon is full of acidic digestive juices. A better-fitting ostomy bag can help prevent stool leakage.Stoma retraction or prolapse. A retracted stoma sinks back below the skin surface level. A prolapsed stoma sticks out too far. Both of these situations can make it difficult to fit your ostomy bag securely to your stoma. If you can’t find a bag that fits, your surgeon may have to re-site or revise your stoma.Phantom rectum. You may experience phantom bowel movement urges after your rectum has been removed, similar to phantom limb syndrome in people who have had limbs removed. Some people find it helps to sit on the toilet when this occurs. It usually subsides over time.What are the possible complications of an internal ileal pouch?Pouchitis. Pouchitis is irritation and inflammation of the ileal pouch. It occurs in about half of ileal pouch recipients. The causes are not entirely clear, but they often seem to be related to the original disease that may have caused you to seek a proctocolectomy, such as colitis or polyposis. Pouchitis is treated with antibiotics or anti-inflammatory medications.Anastomotic leak. When your surgeon reconnects your intestinal channel in an anastomosis, rarely the new connection may leak inside your body. This can cause serious infection. Your surgeon will be on the lookout for any signs of leakage while you are in the hospital and during your follow-up visits after surgery. They will treat it as an emergency, with antibiotics and potentially an immediate repair.Temporary fecal incontinence. Your anal muscles will be weak at first, and your bowel movements will be frequent. They may take you by surprise sometimes, and you may not be able to control them in time to avoid an accident. Most people will regain control as their anal muscles strengthen and their ileal pouch expands over time. If not, medications can help.Recovery and OutlookIs proctocolectomy surgery painful?You won’t feel anything during the surgery, and you’ll have strong pain medications afterward. Your healthcare team will help adjust your medication to your comfort levels during your stay. You will also be given a short-term prescription to take home with you.While full recovery can take several months, you’ll be okay if you take it easy and follow the guidance of your healthcare provider. You may feel sore in your seat when you sit. You may also feel a tug on your incision when you cough or sneeze. Pressing a pillow over it can help.What’s involved in proctocolectomy aftercare?Wound care: Your healthcare provider will instruct you on how to clean and change your dressing daily.Ostomy care: You’ll learn how to empty your ostomy bag several times a day, and how to clean the skin around your stoma to prevent irritation.Diet: In the hospital, you progressed slowly from a clear liquid diet to a soft diet. At home, you’ll continue to add harder foods gradually back into your diet. Notice if certain foods cause you gastrointestinal symptoms, and back off of those until later. Eat smaller meals more frequently, and chew well to help your digestion as your bowels are recovering.Hydration: It’s important to stay hydrated after a proctocolectomy. Since much of your large intestine was removed, you won’t absorb as much water through your large intestine as you used to. The poop of the ileum and upper colon is very loose, and you’ll lose more water and electrolytes with it. You might want to supplement your water intake with electrolyte drinks.What’s the outlook for people who have proctocolectomies?Most people recover fully from the surgery and are able to resume all their normal activities after a couple of months. Most side effects of the surgery are temporary.Living with an ostomy is an adjustment, but modern ostomy bags are discreet and many specialty products are available to help “ostomates” live as normally as possible.Health permitting, some people will return to surgery after several months to complete the next steps of their procedures. They may have their ostomies closed and their intestines reconnected.If you are having an internal ileal pouch constructed, this may require one or two more surgeries, depending on your condition. Sometimes the new pouch needs time to heal before it can be reconnected.Additional surgeries may mean a longer process, but in the end, you’ll be able to poop as you did before. You and your healthcare provider will decide together when and if you are fit for additional surgeries.When to Call the DoctorWhen should I seek medical care following my proctocolectomy?Call your healthcare provider immediately if you experience:Symptoms of an intestinal blockage, such as constipation, cramping, bloating and nausea.Symptoms of internal or external infection, such as abdominal pain, swelling, drainage and fever.A note from Cleveland ClinicA proctocolectomy is a major surgery that removes most of a major organ. It’s natural to feel overwhelmed by what this might mean for you. In addition to healing from surgery, you’ll have to learn new processes for everyday functions, such as how you eat and how you have bowel movements. On the other hand, you may be relieved to no longer suffer from the discomforts and inconveniences of the disease that has brought you here.The ultimate goal of a proctocolectomy is not only to save lives but to maximize the quality of life for people with chronic and progressive diseases. Fortunately, people who are considering proctocolectomies today have a few options to choose from. You and your healthcare provider will work together to select the type of operation that will work best for you and your condition. Once you've adjusted, you will be back to your life, hopefully in better health and comfort than before.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/24/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"