"Progressive Lenses: What They Are & How They Work 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Progressive LensesAdvertisementAdvertisementAdvertisementProgressive LensesAdults with presbyopia or children with myopia may prefer progressive lenses to bifocals or trifocals. Progressive lenses, also called multifocal lenses, give you three zones of vision — near, middle vision and far — in one lens without lines. You may need time to get used to seeing out of them.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewProgressive lenses help you see different distances better through certain areas of the lens.What are progressive lenses?Progressive lenses are multifocal lenses that correct your vision. “Multifocal” means they have more than one area of focus so you can see clearly at varying distances. They can help you see up-close tasks like reading, middle-distance tasks like watching TV and far-distance tasks like driving, all while wearing the same pair of glasses.Multifocal lenses and progressive lenses are the same thing. Another name for these is progressive addition lenses (PALs). Progressive lenses work in the same way as bifocals and trifocals, but there are no lines in the lenses to mark the place where the prescription power changes. You can have progressive lenses if you have contact lenses or eyeglasses.How common are progressive lenses?Progressive lenses treat many vision problems, including difficulties reading up close (presbyopia), which happens to almost everyone after the age of 40.Are there types of progressive lenses?Types of progressive lenses include:Computer progressive lenses. Another name is “near variable focus lenses.” These may be useful for people who spend more than four hours daily using a computer indoors.Premium progressive lenses. These lenses are custom-made for you and take into account which eye is dominant.Ground-view progressive lenses. People who look down at the ground a lot, like golfers, may prefer these.Standard progressive lenses. These lenses aren’t customized. Your provider won’t measure the distance between your eyes, and the glasses aren’t made to fit your face.Short corridor progressive lenses. If you want a smaller frame, you’ll need this type of progressive lens. The viewing areas are smaller, which can pose problems with sight.Transition progressive lenses. Transition lenses darken automatically when exposed to ultraviolet (UV) rays in sunlight.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens when you get progressive lenses?You’ll need an eye exam to determine how well you can see. The eye care specialist will also ask you questions about your medical history and any symptoms you might have.During the exam, the provider will ask you to determine when you can see the most clearly. They’ll ask you to choose the lens prescriptions that allow you to see best for distance and for reading.Risks / BenefitsWhat are the potential benefits of progressive lenses?Potential benefits of progressive lenses include:Needing only one pair of glasses to see at multiple distances.Needing to keep track of only one pair of glasses, instead of reading glasses, driving glasses and glasses for using the computer.Providing cosmetic benefits. No one can tell you have progressive lenses. This might be an important factor for children and younger people who feel embarrassed to wear bifocals or trifocals.Reducing eye strain. No image jumps. Image jumps happen abruptly when your vision crosses the lines in bifocals and trifocals.AdvertisementWhat are the risks or complications of progressive lenses?Progressive lenses don’t really have risks or complications, but they may have some disadvantages, including:Expense. Progressive lenses can cost more than bifocals and trifocals. But progressive lenses may cost less than buying three different pairs of glasses.Fewer choices in lens shapes and sizes. Progressive lenses need to have the prescriptions in very small and accurate spaces.Blurred peripheral vision. Peripheral vision refers to everything you can see that’s not straight ahead.Recovery and OutlookHow long will it take for me to get used to progressive lenses?The time it takes to get used to progressive lenses varies with each person. Some people may need only a week or so to become comfortable with these lenses. Other people may need much longer — up to a couple of months. Some people may choose to use bifocals and trifocals again.You may need to remind yourself to look through the top part of your lenses to see far away, the middle part to see middle distances and the bottom to see near things.AdvertisementWhen to Call the DoctorWhen should I call my healthcare provider?It’s important for both adults and children to have regular eye exams, often on a schedule of every one to two years. Call an eye care provider if you or your child has any changes in vision. Make sure you get a proper fitting from an ophthalmologist, optometrist or optician.With younger kids, you can look for things that indicate problems seeing, like squinting or moving things closer to see them.Ask the provider about progressive lenses if you’re interested in having them.A note from Cleveland ClinicImproving eyesight has never been easier than it is now. If you’re older than 40, you may have presbyopia. (Presbyopia is the Greek word for “old eyes.”) If you don’t want to look like you’re old enough to have old eyes, you may want progressive lenses. These lenses let you shift between focus areas without the telltale lines of bifocals or trifocals. Progressive lenses may also be useful for children who are nearsighted.Progressive lenses need correct fitting to provide the best vision. It’s important to get regular eye exams and to have professional eye specialists fit your corrective lenses.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/02/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2020Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"