"Progestin: Birth Control, How It Works & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/ProgestinAdvertisementAdvertisementAdvertisementProgestinProgestin is the synthetic (human-made) form of progesterone. Progesterone is a hormone that occurs naturally in your body. Some people need treatment with progestin to treat symptoms or conditions. Your healthcare provider prescribes progestin based on your needs and health history.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional DetailsOverviewWhat is progestin?Progestin is a synthetic (human-made) form of progesterone that helps treat certain conditions. Progesterone is a reproductive hormone your body makes in varying amounts. Everyone has progesterone regardless of assigned sex at birth. Sometimes, your body produces too little progesterone or needs more progesterone. For this reason, scientists created progestin in a lab to mimic the effects of progesterone in your body.People may need to take progestin as medication for various reasons, including treatment for issues with menstruation, symptoms of menopause and many others. Your healthcare provider prescribes progestin based on your needs and health history.What are the different forms of progestin?There are several different “families” of progestins. They’re classified into groups based on their chemical structure. Their structure affects what hormone receptors they bind to and how they work in your body. Each family causes slightly different side effects and treats different conditions and symptoms.Progestin can come in the form of a pill, injection, gel, suppository, cream or patch depending on the dosage and use.Your healthcare provider will talk to you about what type of progestin is best based on your health history and why you need to take it.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy would you need to take progestin?There are many reasons why your provider may want to treat your condition or symptom with progestin. Progestin works in a lot of the same ways as progesterone. The chemical makeup of progestin is slightly different from progesterone, but it has a similar effect on your body. While your body naturally produces fluctuating levels of progesterone, you may need more. It’s more common for women and people AFAB to need additional progestin. However, men and people AMAB can also benefit from progestin in certain situations.Regulate your menstrual cycleProgesterone is one of the main reproductive hormones responsible for your menstrual cycle. Progestin supplements, in turn, can help normalize a person’s menstrual cycle. This could include treating symptoms like irregular periods, heavy periods or not getting a period (amenorrhea). Progestin can also be a form of birth control (the minipill).Maintain a pregnancyProgestin is also a key hormone for maintaining a pregnancy. Progestin may be taken as a supplement if you’re not making enough progesterone naturally. It can also help people undergoing fertility treatments.Treat symptoms of menopauseProgestin is used in combination hormone replacement therapy to treat menopause symptoms like hot flashes and vaginal dryness. In combination therapy, estrogen and progestin work together to boost hormone levels and reduce uncomfortable symptoms of menopause.Treat conditions that affect your reproductive systemHealthcare providers may use progestin to treat conditions such as:Endometriosis.Endometrial hyperplasia.PCOS (polycystic ovary syndrome).Irregular uterine bleeding.For cancer treatmentProgestin can help treat certain forms of cancer, such as kidney cancer, breast cancer or uterine cancer. With these types of cancer, progestin can affect how cancer cells react to chemicals and proteins that cause tumor growth. This means progestin can stop tumors from growing.Other medical conditionsHealthcare providers may use progestin to treat people with acquired immunodeficiency syndrome (AIDS) or cancer who have a loss of appetite or severe weight and muscle loss.Men and people AMAB may need progestin for sperm development and to balance testosterone levels. While progestin is made in lower quantities, it’s still necessary to regulate these body functions and others.What is progestin-only birth control?Progestin-only birth control is a type of birth control that contains just progestin. Other forms of birth control contain both progestin and estrogen (also called combination birth control). Progestin-only birth control is available in a pill (minipill), injection or IUD.When you use it for birth control, progestin works by preventing ovulation (when your ovaries release an egg) and changing your cervical mucus to make it harder for sperm to reach an egg.AdvertisementProcedure DetailsHow do you take progestin?Progestin is available in many different forms. The type you take and the dosage amount varies depending on why you need it. Your healthcare provider is the best person to talk to about taking progestin. Be sure to discuss your complete health history, including known allergies and medications you’re currently taking. Certain medications may interact with progestin. It’s important to follow your provider’s instructions when taking progestin and to attend all your follow-up appointments.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentRisks / BenefitsWhat are the benefits of progestin?It depends on why you’re taking progestin. The benefits of using progestin may be as simple as finding relief from unpleasant symptoms. In the case of pregnancy, treatment with progestin is essential to maintaining the pregnancy.Healthcare providers use it as a treatment based on your symptoms and a diagnosis. They do this after careful consideration of the risks versus the benefits.AdvertisementWhat are the side effects of taking progestin?Like most treatments, there are side effects to taking progestin. The specific side effects vary depending on the form of progestin you’re using. Some of the most common side effects come from your body adjusting to the medication. In other cases, a side effect could happen because you now have too much progestin in your body.Some of the most common side effects include:Changes to your menstrual cycle (periods). This could include bleeding between periods, bleeding less or not getting your period at all.Low blood sugar.High blood pressure.Changes in mood.Headaches.Bloating or weight gain.Cramping or abdominal pain.Some of the rarer, but serious side effects of progestin include:Blood clots.Heart attack.Stroke.Liver problems.Eye problems such as blurred vision or loss of vision.When to Call the DoctorWhen should I call my healthcare provider?Contact your healthcare provider if you have any unpleasant side effects of progestin treatment. Talk to them about what you can expect and what warning signs you should watch for. It may be necessary for your provider to alter the dose and type of progestin you need to find a solution that works for you.Additional DetailsWhat happens if you take progestin?It depends on why they’re taking it. In women and people AFAB, progestin can help with:Menstruation.Pregnancy or fertility.Birth control or preventing pregnancy.Symptoms of menopause.Only your healthcare provider can prescribe progestin as treatment for a condition or symptom.Is progestin the same as progesterone?Progestin is made by humans in a lab to mimic progesterone, which your body makes naturally. While they have very similar effects on your body, they’re slightly different in composition. Scientists initially produced progestin when they noticed the human body wasn’t absorbing progesterone well enough.Is progestin better than estrogen?It isn’t better or worse than estrogen, it’s just different. You need both in your body. However, progestin and estrogen work in different ways. Sometimes people benefit from treatment that involves a combination of progestin and estrogen. Other times, people benefit from just one or the other. It depends on the condition and your situation.A note from Cleveland ClinicProgestin is a human-made version of progesterone. It works similarly to progesterone, which is naturally occurring in your body. Sometimes, healthcare providers prescribe progestin to treat certain conditions or symptoms. The type of progestin you take and how much of it depends on your needs and health history.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/21/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"