"Prosthodontics: Definition, Uses & Types800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/ProsthodonticsAdvertisementAdvertisementAdvertisementProsthodonticsProsthodontics is a branch of dentistry dedicated to making replacements for missing or damaged teeth. Common prosthodontic treatments include dentures, dental implants, crowns and bridges. After graduating from dental school, a prosthodontist receives three additional years of training in their chosen field.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat’s the definition of prosthodontics?Prosthodontics is a specialized branch of dentistry dedicated to making dental prosthetics (artificial teeth) for damaged or missing teeth. The word “prosthodontics” comes from the words “prostho,” meaning replacement, and “dontist,” meaning teeth.A prosthodontist (a type of dental specialist) receives extended training in the fabrication of crowns, bridges, dentures and other restorative treatments. They also routinely treat TMJ disorders.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs prosthodontics?Prosthodontics can treat a wide range of issues. Your general dentist might refer you to a prosthodontist if you have:Missing teeth.Severely damaged teeth.TMJ pain or dysfunction.Mouth or facial pain.Cosmetic concerns.Obstructive sleep apnea.What is a prosthodontic appliance?There are many types of fixed and removable prosthodontic appliances, including:Full and partial dentures.Crowns and bridges.Oral splints.Night guards for TMJ disorder and sleep apnea.AdvertisementWhat is the difference between a dentist and a prosthodontist?A general dentist is a primary dental care provider. They offer routine dental check-ups and cleanings, in addition to basic restorative treatments, including fillings, crowns and bridges.A prosthodontist is a dental specialist. After graduating from dental school, they receive three additional years of residency training. They specialize in making teeth replacements, such as crowns, bridges, dentures and more.General dentists often refer to prosthodontists when dealing with complex cases or cases that are outside the scope of their practice.What is the difference between orthodontics and prosthodontics?Orthodontics is the branch of dentistry dedicated to straightening teeth. An orthodontist specializes in braces, retainers and clear aligners.Prosthodontics is the branch of dentistry focused on making dental prostheses. A prosthodontist specializes in making dentures, crowns, bridges and other custom-made oral appliances.AdvertisementIs prosthodontics the same as dentures and implants?No. Prosthodontics refers to the branch of dentistry itself. But dentures and implants are two common prosthodontic procedures. Keep in mind, though, both general dentists and prosthodontists may place implants and dentures, depending on their areas of focus.Procedure DetailsWhat are some examples of prosthodontic treatments?Many dental treatments are prosthodontic in nature. Your general dentist may offer many of these procedures. But they’ll likely refer you to a prosthodontist if your case is complex or if they need to coordinate treatment.Dental crownsA dental crown — sometimes called a “cap” — is a restoration that covers a badly damaged tooth. You might need a crown if you have extensive decay or a cracked tooth, or if you’ve recently had a root canal.Dental bridgesA dental bridge replaces one or more missing teeth in a row. This dental prosthetic consists of two crowns on either side with artificial teeth (pontics) in between them. Once placed, your natural teeth anchor the crowns, and the pontics fill the gap in your smile.DenturesThere are two main types of dentures: partial and full. Partial dentures replace several sporadically missing teeth. Full dentures replace a full arch of missing teeth. These removable appliances help restore the function and appearance of your smile.Inlays and onlaysIf a tooth is too damaged for a filling but not damaged enough to warrant a crown, then you might need an inlay or onlay. These custom restorations fit into your tooth structure like tiny puzzle pieces.Dental implantsDental implants are tiny threaded posts used to replace missing teeth roots. They’re made from surgical-grade titanium or ceramic. Your dental provider places them into your jawbone. Once your implants heal, a prosthodontist can restore them with crowns, bridges or dentures.If you’re missing most or all of your teeth, there are several removable and nonremovable implant-supported options. Talk to your dentist or prosthodontist to find out which treatment is best for you.Care at Cleveland ClinicGet Dental CareFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of prosthodontics?Prosthodontic treatments can:Repair badly damaged teeth.Replace missing teeth.Improve your bite (the way your teeth fit together).Correct TMJ issues.What are the risks of prosthodontics?Risks are minimal when it comes to undergoing prosthodontic procedures. Like any dental procedure, there’s always a small risk of infection or nerve damage.If you notice any warning signs, such as fever or drainage near the treatment site, contact your dentist or prosthodontist right away.Recovery and OutlookWhat is the recovery time?Recovery time depends on many factors, including the type of procedure and the number of teeth that need treatment. Generally, someone who receives a single crown can resume normal activity almost immediately. However, someone who needs full dentures on both arches may need to take a few days off work to allow for healing.Depending on the type of treatment you need, it could take several coordinated visits and many months to complete. Ask your dentist or prosthodontist what kind of timeline to expect.When to Call the DoctorWhen should I see my healthcare provider?If you have damaged or missing teeth that interfere with your quality of life, make an appointment with a dentist. They can discuss your treatment options with you and tell you whether you need to see a prosthodontist.If you’ve recently undergone prosthodontic treatment, be sure to call your provider if you notice signs of infection, such as fever, drainage, pain or swelling that doesn’t go away with medication.A note from Cleveland ClinicProsthodontics is one of the main branches of dentistry. It focuses on making replacements for damaged or missing teeth. Prosthodontists treat people of all ages with many different conditions. Whether you’re missing teeth, have a bite that feels “off” or need relief from TMJ pain, a prosthodontist can help. Talk to your provider to find out which treatments best suit your needs.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/27/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Dental CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"