"Prostate Cancer: Focal Therapy800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Prostate Cancer: Focal TherapyAdvertisementAdvertisementAdvertisementProstate Cancer: Focal TherapyFocal therapy offers a middle ground therapy for men with localized prostate cancer. It uses ablation, or tissue destruction, to target the area that contains the index lesion. Men who have focal therapy will continue to be monitored after treatment.ContentsArrow DownOverviewRecovery and OutlookContentsArrow DownOverviewRecovery and OutlookOverviewFocal One® High-Intensity Focused Ultrasound.What is focal therapy for localized prostate cancer?Focal therapy is a treatment for prostate cancer of low to intermediate aggressiveness that is completely contained (localized) within the prostate.For many years there have been two main approaches to managing localized prostate cancer. The first is active surveillance or “watchful waiting.” In cases of older men or low-risk patients, regular medical tests are conducted to make sure the cancer isn’t spreading. No other action is taken because the cancer is stable or growing so slowly it won’t cause problems right away. If tests show the cancer is spreading, treatments can begin. Of those men assigned to active surveillance, about one-third will eventually need to have surgery or radiation.The second approach to treating localized prostate cancer has been the use of radiation or surgery. This is effective for removing any tumors present but is typically associated with side effects in the urinary, sexual, and bowel function. Two common side effects include loss of control over urinary functions (incontinence) and erectile dysfunctionFocal therapy offers a middle-ground treatment. The idea behind focal therapy is to preserve these functions while still treating the cancer effectively. Focal therapy concentrates on treating “the index lesion,” which is usually defined as a tumor visible on MRI of low or favorable intermediate grade Even though many cases of prostate cancer have more than one tumor site, some researchers believe that the index lesion is what drives and predicts how any particular cancer will progress. If growth of the index lesion can be controlled with focal therapy, the thought is that the cancer as a whole can be managed safely while minimizing side effects.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat treatments are used in focal therapy for localized prostate cancer?Focal therapy uses ablation, which is the use of extreme temperatures to destroy tissue. In focal ablation, the area of the prostate that contains the index lesion is targeted, rather than treating the entire prostate gland. Focal ablation techniques include:Cryotherapy: The use of very cold gases passed through needles to freeze and destroy cancer tissue.HIFU (High Intensity Focused Ultrasound): The use of high-frequency sound waves directed at the tumor through an ultrasound probe inserted into the rectum. The high intensity waves cause the diseased tissue to heat up and die.Photodynamic therapy: A drug called a photosensitizer is injected into the bloodstream. This drug then absorbs light rays directed at the tumor, and produces an active form of oxygen that destroys cancer cells.Laser ablation: The use of laser radiation energy pinpointed to a very small area to burn away cancerous tissue. Some laser ablation has the advantage of being able to be performed at the same time as magnetic resonance imaging (MRI), allowing very specific targeting and also real-time views of results.Who are good candidates for focal therapy?When focal therapy for prostate cancer first began to be used in about 2007, it was only as an alternative to active surveillance in very low-risk patients. Since then, the use of focal therapy has expanded to include those with favorable intermediate risk disease (as defined by the NCCN guidelines). The best candidates have a prostate gland of about 40cc in size or a tumor in the lower half of a larger gland, a single visible tumor on MRI, and the absence of cancer elsewhere in the gland (as proven by biopsies).In each case, the doctor will consider the patient’s general health and mental outlook, the size and location of the tumors present, and their chances of spreading more. Use of tests such as MRI, ultrasound, and biopsy (tissue samples examined in the laboratory) can help decide if a patient will benefit more from focal therapy or from traditional treatments.AdvertisementRecovery and OutlookWhat can be expected after treatment using focal therapy?Patients treated with focal therapy still need to be actively monitored afterwards. This includes watching for disease that may have gone undetected, has returned, is spreading, or is appearing for the first time. If follow-up tests show that some of the treated cancer still remains, additional ablation, surgery, or radiation may be needed.What is the outlook for patients who receive focal therapy?While the use of focal therapy for localized prostate cancer appears to be a promising development in a number of ways, it is still considered investigational and not yet part of standard therapy. There are a number of reasons for this, as follows:The criteria (standards) for selecting ideal candidates haven’t been fully agreed on. This is an important question because mistakenly using focal therapy in place of a more traditional treatment could allow a cancer to go under-treated.The criteria for defining an index lesion still need to be agreed on.The idea that the index lesion determines how the cancer will develop hasn’t yet been proven.The factors that define treatment success or failure, and the triggers for re-treatment still need to be determined.The long-term effectiveness of focal therapy is unknown.It isn’t clear that all side effects are eliminated by using focal therapy.Focal therapy doesn’t allow for firsthand pathologic and biologic study of cancerous tissue, as can be done when using surgical treatment.Focal therapy sometimes leaves behind untreated cancer, which could possibly raise the risk of more serious problems in the future.The overall cost to the healthcare system may be greater for focal therapy than for standard treatments.Care at Cleveland ClinicProstate Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/26/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicProstate Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"