"Prostatic urethral lift800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Prostatic Urethral LiftAdvertisementAdvertisementAdvertisementProstatic Urethral LiftA prostatic urethral lift is an outpatient medical procedure to relieve the symptoms of benign prostatic hyperplasia, or enlarged prostate. The details of the procedure are discussed.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewMale urinary system, including the prostate.What is a prostatic urethral lift?A prostatic urethral lift (PUL) is a medical procedure to relieve the symptoms of benign prostatic hyperplasia (BPH), or enlarged prostate.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is the prostate?The prostate is a muscular, walnut-sized gland in men that surrounds part of the urethra, the tube that carries urine and sperm out of the body. The prostate produces fluid for semen, the milky liquid in which sperm swims. Sperm is produced in the testicles, which also make the main male hormone testosterone. During puberty (the physical changes leading to adulthood), testosterone stimulates the growth and function of the prostate, and helps with the production of fluid for semen.What is benign prostatic hyperplasia (BPH)?BPH, a noncancerous enlargement (growth) of the prostate, is the most common prostate problem in men. Almost all men will develop some enlargement of the prostate as they age.The symptoms of BPH include:Slow or dribbling urine streamDifficulty starting to urinateFrequent urination (having to go to the bathroom often)Feeling of urgency (sudden need to urinate)Need to get up at night to urinateAs BPH symptoms get worse, a man may develop:Bladder stonesBladder infectionBlood in the urineDamage to the kidneys from back pressure caused by retaining large amounts of extra urine in the bladderSudden blockage of the urethra, making it impossible to urinateAdvertisementProcedure DetailsHow is a prostatic urethral lift procedure used to treat benign prostatic hyperplasia (BPH)?The PUL procedure works by separating the enlarged prostate lobes to make the urethra wider, so that it is easier to urinate. The procedure is performed by a urologist, a doctor who specializes in diseases of the urinary system.In a PUL procedure, the urologist inserts an instrument into the urethra and moves it forward. When the device reaches the lateral (side) wall of the prostate, it ejects small, thin implants into both sides of the prostate, pulling the urethra and prostate to open the channel.Depending on the size of the prostate, the urologist will place from 2 to 6 implants. Separating the lobes of the prostate in this manner creates an easier pathway for urination, and helps relieve the symptoms of BPH.Care at Cleveland ClinicBenign Enlarged Prostate TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of the prostatic urethral lift for treating benign prostatic hyperplasia (BPH)?For the treatment of BPH, the PUL offers the following advantages:The procedure can be done on an outpatient basis (the patient goes home the same day).The patient may not need a catheter (a thin, hollow tube inserted into the bladder) to urinate after the procedure, as is often the case with other procedures for BPH.It reduces the risk of retrograde ejaculation (semen flowing backwards into the bladder instead of forward).It preserves sexual function (the man can continue to have sex after the procedure).AdvertisementWhat are the disadvantages of the prostatic urethral lift for treating benign prostatic hyperplasia (BPH)?The PUL procedure cannot be performed on men who have:Very large prostates.A median (middle, or third) prostate lobe.Problems with urinary retention (are unable to empty the bladder completely).In addition, the PUL procedure is difficult to perform on men who have a long urethra.In studies, up to 11 percent of patients who had the PUL had to have another procedure to relieve BPH—either another PUL, or surgery—within two years.What are the side effects of the prostatic urethral lift procedure?The main side effects of the PUL procedure are pain in the pelvis and painful urination.Recovery and OutlookWhat is the prognosis (outlook) for patients who have the prostatic urethral lift procedure?In the short- and medium-term studies, patients’ ability to urinate and their overall quality of life improved significantly after the PUL procedure.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/10/2019.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicBenign Enlarged Prostate TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"