"Proton Therapy for Cancer800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Proton TherapyAdvertisementAdvertisementAdvertisementProton TherapyProton therapy is a type of radiation therapy. It targets cancerous tumors with high-energy particles (protons) that concentrate radiation on tumors without damaging nearby healthy tissue. Proton therapy is done by radiation oncologists, healthcare providers with specialized training in radiation treatment for cancer.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is proton therapy for cancer?Proton therapy is a type of radiation therapy. It targets cancerous tumors with high-energy particles (protons) that concentrate radiation on tumors while sparing nearby healthy tissue. Radiation oncologists, healthcare providers with specialized training in radiation treatment for cancer, provide proton therapy.What types of cancer can be treated with proton therapy?Proton therapy treats many types of cancer. Some specific types of cancer treated with proton therapy include:Central nervous system cancers, such as chordomas, chondrosarcomas and malignant meningioma.Eye cancers, including uveal melanoma or choroidal melanoma.Head and neck cancers, including nasal cavity and paranasal sinus cancer and some nasopharyngeal cancers.Liver cancer.Prostate cancer.Spinal and pelvic sarcomas, which are cancers that occur in the soft tissues and bone in your spine and pelvis.Benign (noncancerous) brain tumors.Who is a candidate for this kind of treatment?In general, radiation oncologists use proton therapy for tumors located near important areas of your body, such as areas of your brain or spinal cord. They use proton therapy for tumors that haven’t spread (metastasized.) Radiation oncologists may use proton therapy to treat children with cancer.How common is this treatment?Healthcare providers are using proton therapy more frequently, but traditional radiation therapy is used more often than proton therapy.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat’s involved in proton therapy?Proton therapy is a complicated process that takes time to plan and complete. If you’re having proton therapy, your radiation oncology team will explain all the steps. In general, here’s what you can expect before, during and after treatment.Before treatment beginsYour radiation oncology team begins treatment with radiation planning sessions. These sessions involve imaging tests to determine the tumor(s) specific size, dimensions and locations. Here’s what you may expect from the planning sessions:Your radiation oncology team will schedule imaging tests such as computed tomography (CT) scans or magnetic resonance imaging (MRI) scans.These sessions may take some time, so please ask your team for a general idea of how long the process could take, if you should wear specific kinds of clothes or if you can plan on bathroom breaks during the planning session.The radiation planning sessions begin with your radiation oncology team helping you lie down on a treatment table or sit in a chair, just as you will during treatment.You’ll need to stay very still during treatment, so your team can fit you with an immobilizing device to help you stay in place.The type of device used depends on the tumor’s location in your body. For example, if you’re receiving proton therapy for a tumor in your eye, you may need to wear a tight-fitting mask.Your team will want you to be as comfortable as possible during treatment. Let your team know if you’re uncomfortable. If you’re feeling anxious, your radiation oncologist may give you medication to help you stay relaxed.Once you’re situated and comfortable, the team will begin doing scans to obtain images that they’ll use to plan your treatment.They may make tiny marks on your body or on the immobilizing device.Once your radiation oncology team has finished imaging tests, they’ll help you out of the immobilizing device and off the treatment table or out of the chair.Before you leave, take a minute to ask the team any additional questions about the treatment process. That way, you’ll feel confident you know what to expect during treatment.During treatmentYou’ll receive your proton therapy in a special treatment room. Your radiation oncology team will help you get in position on the treatment table and/or chair. Here’s what you may expect:They’ll help you with any immobilizing devices and make sure you’re as comfortable as possible.Your radiation oncology team will confirm you’re in the correct position for treatment. They may do this by using a laser to center on the marks made during the radiation planning.Before treatment, the team will take additional images such as X-rays or CT scans. That way they’ll be sure to place you in the correct position for every treatment session.Once you’re in position, your team will leave the treatment area and go to another room that contains the delivery controls. Although they’re not in the same room as you, there will be a video screen in the treatment room so the team can hear you and see you.Using the delivery controls, the team will deliver the proton treatment.The protons come out of a nozzle on a machine called a gantry, which rotates around the treatment table so the machine is in position to deliver treatment from the best possible angles.You may notice the gantry swinging into place but you won’t feel anything during treatment.In general, proton therapy only takes a few minutes to complete.After proton therapyYour team will let you know when treatment is complete. They’ll come back into the treatment room so they can help you out of the immobilizing device. They’ll help you off the treatment table or out of the treatment chair.Some people have immediate reactions to proton therapy, such as skin that feels sensitive or swollen. You may feel very tired after treatment.Care at Cleveland ClinicGet Cancer CareMake an AppointmentRisks / BenefitsWhat are the potential benefits of proton therapy?Proton therapy may treat cancerous tumors while sparing nearby healthy tissue from radiation doses.What is the success rate of proton therapy?Research suggests that proton therapy and traditional radiation therapy have about the same success rate. In certain special situations, such as cancer in children or brain/spinal cord cancers, proton therapy may be a better option than traditional radiation. Your radiation oncologist will review which technique is best given your specific situation.AdvertisementWhat are proton therapy side effects?Proton therapy side effects vary depending on the location of the cancer being treated. In general, people who have proton therapy may experience some side effects during their treatment. Later on, they may have other side effects such as fatigue or skin issues. Your radiation oncologist will review the possible short- and long-term side effects that you may experience.Early side effects of proton therapyYou may experience some of these side effects during your treatment. Keep in mind that possible side effects depend on where you’re being treated:Fatigue.Skin irritation (dryness, sensitivity).Hair loss.Nausea and vomiting.Difficulty swallowing (dysphagia), discomfort with swallowing.Diarrhea.Needing to pee more often or feeling as if you need to pee more often.Headaches.Late side effects of proton therapyLate side effects from cancer treatment are side effects that develop months or years after you’ve finished treatment. These side effects can cause long-term issues. Depending on the area treated, late side effects may include:Infertility.Lymphedema.Brain and spinal cord changes.Recovery and OutlookHow long does it take to recover from proton therapy?Most people are able to go about their day after their daily treatment. Depending on your situation, it may be a few weeks after finishing treatment before you feel completely recovered.AdvertisementWhen to Call the DoctorWhen should I call my healthcare provider?Contact your radiation oncology team if you have side effects that are more severe than you expected.Additional DetailsWhat’s the difference between traditional radiation therapy and proton therapy?Both treatments target cancer with radiation delivered from outside of your body. Traditional radiation delivers waves of photons (X-ray photons) into your body. Proton therapy (particle beam radiation therapy) delivers concentrated streams of high-energy particles into your body, enabling radiation oncologists to deliver more focused doses of radiation.A note from Cleveland ClinicProton therapy uses high-energy particles to destroy cancerous tumors while limiting the amount of radiation to nearby healthy tissue. If you have a small tumor close to your brain and spine, your healthcare provider may recommend proton therapy. Proton therapy doesn’t hurt but the process can be a bit intimidating. (You need to stay completely still during treatment, and you may need to wear an immobilizing device during treatment.) If your provider recommends proton therapy, don’t hesitate to ask what you can expect. They’ll be glad to walk you through the process so you feel confident you know what will happen during treatment.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/31/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Cancer CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"