"Pulmonary Thromboendarterectomy (PTE)800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Pulmonary Thromboendarterectomy (PTE)AdvertisementAdvertisementAdvertisementPulmonary Thromboendarterectomy (PTE)Pulmonary thromboendarterectomy (PTE) is a complex surgery to remove long-term blood clots from arteries in your lungs that can’t be treated with medication. These blockages occur due to chronic thromboembolic pulmonary hypertension (CTEPH), a rare complication in people who’ve had blood clots in their lungs. In most cases, treatment is successful.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is pulmonary thromboendarterectomy?Pulmonary thromboendarterectomy (PTE) is a complex surgery to remove chronic blood clots from arteries in your lungs when medication isn’t successful. In many cases, with early diagnosis, PTE can successfully cure the condition.Pulmonary thromboendarterectomy is also called pulmonary endarterectomy (PEA).What condition does pulmonary thromboendarterectomy (PTE) treat?Surgeons use pulmonary thromboendarterectomy (pronounced “thrombow-end-arter-ectomee”) to treat blockages in people with chronic thromboembolic pulmonary hypertension (CTEPH). This condition is a rare but potentially life-threatening complication that may occur in people who have had pulmonary embolisms (PEs, blood clots in their lungs).With CTEPH, one or more old blood clots get caught in the walls of your pulmonary arteries (arteries in your lungs), blocking the blood flow. In most cases, these blockages respond to blood-thinning medication.But if the clots don’t respond to medication, it can lead to scar tissue, which causes increased blood pressure in your lungs and makes breathing difficult. CTEPH can also cause small vessels in your lungs to become narrow and stiff.PTE is the only treatment that can potentially cure CTEPH. Left untreated, CTEPH can lead to heart failure, lung damage and even death.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho might need PTE?If you have CTEPH, you may be eligible for pulmonary thromboendarterectomy depending on:The severity of the condition and symptoms.The location, degree and extent of artery blockage.Your age, health and how well your heart and lungs work.If the clots can be safely removed, healthcare providers consider PTE the treatment of choice. But about 40% of people (4 out of 10) aren’t good candidates for PTE.Many people aren’t eligible for PTE because of the complexity of the surgery. During the procedure, your surgical team uses cardiopulmonary bypass machine, which takes over the job of your heart and lungs and provides your body with oxygen.PTE also involves periods of cooling your body to stop brain function, which then allows the stoppage of all blood circulation (deep hypothermic circulatory arrests). This process removes blood from the surgical site, giving your surgeon visibility (ability to see) into the arteries of your lungs so they can remove the scar tissue. The cooling protects your brain from neurological damage during the procedure.What happens if I’m not eligible for PTE?If you're not eligible for PTE, your healthcare provider may recommend another treatment to open your pulmonary arteries, including:Oral medication.Interventional procedure (balloon pulmonary angioplasty, or BPA).AdvertisementHow common is CTEPH?Researchers don’t know the exact number of people with CTEPH. Around 2% to 4% of people with a history of pulmonary embolus will go on to develop CTEPH. They believe CTEPH is significantly underdiagnosed, and people end up with severe symptoms before receiving treatment.How common is pulmonary thromboendarterectomy?Healthcare providers perform an estimated 400 PTEs each year in the United States.AdvertisementProcedure DetailsHow should I prepare for pulmonary thromboendarterectomy?Your healthcare provider will let you know how to prepare for your procedure, including whether you need to fast or stop taking any medications.Follow your healthcare provider’s guidelines for:Medications:People often stop taking blood thinners (aspirin, warfarin or other medicines that prevent blood clots and strokes) and nonsteroidal anti-inflammatory drugs (NSAIDs). These drugs can increase bleeding risk.Food and drink: Your healthcare team may ask you to fast (not eat or drink) before your surgery. Anesthesia is safer when your stomach is empty.Smoking and alcohol:Cut back on alcohol and quit smoking. Both can slow healing after surgery and increase the risk of complications.What happens during PTE?You receive anesthesia for the procedure, which generally starts early in the morning and lasts for about six hours.During PTE, your surgical team:Inserts an endotracheal tube (ETT) through your mouth or nose to your airways and connects it to an oxygen machine (ventilator) so you can breathe.Makes an incision in your sternum (breastbone) to reach your heart and lungs.Connects you to a cardiopulmonary bypass machine, which acts as your heart and lungs during the procedure.Gradually cools your body to 65 degrees Fahrenheit (18 degrees Celsius).Uses special tools to remove clots and scar tissue from your arteries.Warms your body to your regular temperature and takes you off the bypass machine, leaving you connected to the ventilator.Closes your chest, leaving tubes to drain excess fluid from your body.What happens after pulmonary thromboendarterectomy?After PTE, you’ll go to the intensive care unit (ICU), where you’ll remain overnight. The next morning, your medical team will give you a breathing test. If you’re able to breathe on your own, they’ll remove the ventilator.You typically stay in the hospital for about seven to 10 days. You start your recovery in the ICU and move to an intermediate level of care as soon as possible, often the day after surgery.Recovery is similar to recovery from open heart surgery. You may start walking within a few days and slowly start doing more. You’ll also have some tests, including a test to find out how much oxygen you’ll need after you go home.Risks / BenefitsWhat are the advantages of pulmonary thromboendarterectomy?PTE is the only way to cure chronic thromboembolic pulmonary hypertension (CTEPH). The surgery is successful in most cases, leading to improved breathing, lung function and ability to be active. Most people who were on oxygen before surgery can come off after surgery, and damage to their right heart from the disease is often reversed. Long-term survival is excellent after surgery.What are the risks or complications of PTE?The risk of PTE has decreased dramatically over the last year, and the risk of not surviving the surgery is now as low as 1% in most people. The risk of stroke is 1% to 2%.After PTE, some people will still have some degree of pulmonary hypertension, or PH that recurs, and may require medications.In some cases, pericardial effusion (fluid buildup around your heart) develops after surgery. You may experience:Chest pain.Fainting.Sudden shortness of breath or difficulty breathing.If you experience these symptoms, call 911 or go to the nearest emergency room. Talk to your healthcare provider about any other symptoms you experience after PTE.Recovery and OutlookWhat is the recovery time after PTE?You can get back to your regular activities over time. But you can’t drive, work or lift anything heavier than 10 pounds for at least six weeks after surgery. From week seven to week 12, you can lift up to 25 pounds. After 12 weeks, there aren’t any restrictions.In most cases, you can return to your routine within three months of surgery. Your breathing and ability to exercise typically improve and may continue to improve for up to four years after surgery.How will my provider monitor my condition after PTE?You need to have follow-up visits and tests to check your lungs. These tests are usually six weeks and three to six months after surgery. You also need to take anticoagulants (blood thinners) to prevent clots for the rest of your life.When to Call the DoctorWhen should I see my healthcare provider?Call your healthcare provider if you have:Extreme pain, or pain that gets worse after having gotten better.Fast or irregular heartbeat.Signs of infection such as fever, redness, swelling or drainage at your incision site.A note from Cleveland ClinicPulmonary thromboendarterectomy (PTE) is surgery to remove blood clots and scar tissue from the arteries in your lungs. It can cure chronic thromboembolic pulmonary hypertension (CTEPH) — and potentially save your life. It’s a complex procedure that involves a recovery process similar to open heart surgery. But PTE often offers a chance to breathe better, live longer and enjoy the activities you love.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/15/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"