"Pulmonary Vein Isolation (PVI) Ablation800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Pulmonary Vein IsolationAdvertisementAdvertisementAdvertisementPulmonary Vein IsolationPulmonary vein isolation ablation is a minimally invasive procedure to treat atrial fibrillation (Afib). Ablation therapy uses hot or cold substances to create scar tissue. The scars disrupt abnormal electrical signals that cause atrial fibrillation. This procedure may be right for you if other arrhythmia treatments aren’t successful.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is pulmonary vein isolation?Pulmonary vein isolation is a procedure to treat atrial fibrillation (Afib). Atrial fibrillation is an abnormal heart rhythm (arrhythmia) that begins in your heart’s upper chambers (your atria). If left untreated, atrial fibrillation can lead to stroke.Pulmonary vein isolation treats Afib by targeting your pulmonary veins. These are the veins that bring oxygen-rich blood back to your heart’s left atrium. Your pulmonary veins are where the abnormal electrical signals that cause Afib usually begin.The treatment is a type of heart ablation. That means it uses very hot or cold temperatures to create small scars. Scar tissue inside your pulmonary veins disrupts the electrical signals that cause Afib, preventing them from reaching your atria.Who should have pulmonary vein isolation ablation?Pulmonary vein isolation may be the best treatment option for patients who:Still have atrial fibrillation symptoms, even after treatment with medications.Can’t tolerate antiarrhythmic drugs or have had complications from these drugs.Is this procedure an option for people who haven’t tried antiarrhythmic drugs?Researchers are exploring whether some patients might benefit from pulmonary vein isolation as an initial (first-line) treatment.Studies show higher survival rates with first-line pulmonary vein isolation ablation than with antiarrhythmic drugs. However, more research is necessary to determine whether this should become the standard of care.Is pulmonary vein isolation right for me?You’ll need a thorough evaluation to determine whether you’re a good candidate for this treatment. Healthcare providers start by taking your medical history and performing a physical exam. You may also need heart tests, such as:Echocardiogram.Electrocardiogram (EKG).Holter monitor.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsPulmonary vein ablation procedure: Energy is delivered through the tip of the catheter to tissue that's targeted for ablation. The energy is applied in a circle around the connection of the left upper and lower pulmonary veins to the left atrium. Image © Cleveland Clinic Journal of Medicine, 2009. 76(9):545. Used with permission.What type of ablation therapy does pulmonary vein isolation use?Pulmonary vein isolation is a type of catheter ablation, which means it delivers ablation therapy through a long tube inserted into a vein.There are two methods of creating scar tissue. They include:Radiofrequency ablation: This option is more common. It uses heat from radio waves to destroy targeted tissue areas.Cryoablation: This method uses extreme cold to momentarily freeze and permanently destroy the targeted tissue area.Is one method better than the other?Each option has risks and benefits. Research has demonstrated that radiofrequency and cryoablation produce similar outcomes with no significant difference in safety. Your healthcare provider will explain the risks and benefits of each method before the procedure.How will I feel during the procedure?Healthcare providers commonly place people under general anesthesia during pulmonary vein isolation. You’ll become relaxed and drift off to sleep. In some cases, your healthcare provider might use only a local anesthetic. They’ll tell you what to expect in your situation.AdvertisementWhat happens during the procedure?Here’s what to expect during pulmonary vein isolation ablation:A healthcare provider places you under general anesthesia or injects medication to numb your skin near the incision sites. These may be on both sides of your groin or neck.Your provider inserts two catheters (tubes) into the incisions and advances them through a blood vessel to your left atrium.One catheter detects abnormal impulses in your pulmonary veins.The other catheter delivers radiofrequency or cold energy to targeted areas.When the procedure is complete, your healthcare provider removes the catheters and closes the incisions.How will they monitor my heart during the procedure?Your healthcare provider will apply several types of monitors to your body to keep track of your heart rhythms during the procedure. You’ll have:Cardioverter: This device allows the doctor and nurse to pace your heart rate if it’s too slow or deliver energy to your heart if the rate is too fast. Wires connect the cardioverter to one sticky patch on the center of your back and one on your chest.Electrocardiogram (EKG): An EKG provides a picture on the monitors of the electrical impulses traveling through the heart. Your provider will attach several sticky electrode patches to your chest.Blood pressure monitor: This monitor checks your blood pressure throughout the procedure. Your provider will connect it to a blood pressure cuff on your arm.Oximeter monitor: An oximeter keeps track of your blood oxygen levels. Your provider will attach it to your finger with a small clip.Fluoroscopy: A fluoroscopy is a large X-ray machine positioned above you which helps your providers see your pulmonary veins on a screen during the procedure. Your provider may inject a contrast dye into your veins through the catheters to make them show up better in X-rays.Intracardiac echocardiography: Your healthcare provider will insert a tiny ultrasound transducer through one of the catheters leading to your heart. It helps them see the structures inside your heart and where the catheters contact your heart lining.How long does the procedure last?The pulmonary vein ablation procedure may last four to six hours. Please let your family know that the preparation and recovery take several hours. They should plan to be at the hospital all day. You’ll stay in the hospital overnight.AdvertisementWhat happens after the procedure?After the procedure, your doctor will discuss the results with you and your family. You’ll stay in bed for four to eight hours after the procedure. Nurses will monitor your heart rate and rhythm overnight. Most patients go home the next morning. Your nurses will remove your catheters and bandage the incisions before you go.Care at Cleveland ClinicArrhythmia TreatmentsFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the possible risks of the procedure?Pulmonary vein isolation ablation is generally safe. As with any heart procedure, it comes with a low risk of certain complications, such as:Allergic reaction to the contrast dye used in fluoroscopy.Incision site complications, such as infection.Phrenic nerve injury (more common with cryoablation).Perforation of your heart (1% risk).Pulmonary vein damage (1% risk).Stroke (0.5% risk).Damage to your esophagus (0.25% risk).Recovery and OutlookWhat is the recovery like from pulmonary vein isolation?You may feel general soreness, fatigue or chest discomfort during the first 48 hours after the procedure. You can return to daily activities after that. However, you’ll need to wait a few weeks before resuming anything strenuous, like exercising.It takes several weeks for the scarring from ablation to form and improve your condition. You’ll likely continue to have atrial arrhythmia for up to 10 weeks after the procedure. In rare cases, it may get worse before it gets better.What kind of follow-up care will I need?You’ll need to take certain medications for a few months, including:Antiarrhythmic drugs to control abnormal heart rhythms (until the ablation takes effect).Anticoagulants (blood thinners) to reduce your risk of stroke.You’ll also need to take periodic blood tests to reevaluate the dosage of anticoagulant medication you should be taking.Your first follow-up appointment will be three to four months after your pulmonary vein isolation procedure. You’ll have another follow-up after a year. During your follow-up appointments, your healthcare team may use several tests to check on your heart, including:Spiral cardiac CT scan.Echocardiogram.Electrocardiogram.What is the outlook for people who have had pulmonary vein isolation ablation?Pulmonary vein isolation helps many people achieve lasting symptom relief. Sometimes, multiple ablation procedures are necessary. People with hypertrophic cardiomyopathy might not achieve the same outcomes as people without it.This treatment reduces the impact of arrhythmias on daily life but doesn’t cure them. You’ll still need to take blood-thinning medication. Even if you feel better, you still face an increased stroke risk. Ongoing monitoring is necessary to detect arrhythmias that return after treatment.When to Call the DoctorWhen should I contact my healthcare provider after pulmonary vein isolation?Contact your healthcare provider if you start experiencing signs of complications, such as:Chest pain.Shortness of breath.Nausea and vomiting.Pain or difficulty swallowing.Dizziness or loss of consciousness.A note from Cleveland ClinicPulmonary vein isolation disrupts an abnormal heartbeat. As a minimally invasive procedure, it’s gentle on your body, allowing you to recover quickly. You’ll get long-term relief from atrial fibrillation symptoms and an alternative to antiarrhythmic drugs. Ongoing care from your cardiologist can help you stay as healthy as possible.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/29/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicArrhythmia TreatmentsFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"