"Pursed Lip Breathing: Technique, Purpose & Benefits800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Pursed Lip BreathingAdvertisementAdvertisementAdvertisementPursed Lip BreathingPursed lip breathing is a breathing exercise that helps you slow your breathing and inhale and exhale more air. You slowly inhale through your nose and gently exhale through pursed lips. Pursed lip breathing makes it easier to perform physical activities and reduces stress.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is pursed lip breathing?Pursed lip breathing is one of the simplest ways to control shortness of breath. It provides a quick and easy way to slow your breathing pace, making each breath more effective. It also helps you get more oxygen into your lungs.What are the types of breathing?There are many different types of breathing, including:Eupnea. Eupnea is normal breathing. It happens naturally and doesn’t require any effort.Hyperpnea. Hyperpnea is intensive, deep breathing. Hyperpneic breathing may occur before, during or after an exercise or when your body doesn’t have enough oxygen. Examples of hyperpneic breathing include when you take a deep breath before you lift a lot of weight or when you take a deep breath at a higher elevation with thinner air.Diaphragmatic breathing. Diaphragmatic breathing is a type of breathing in which you consciously use your diaphragm to help you take deep breaths.Costal. Costal breathing is a type of shallow breathing in which you use your intercostal muscles. Your intercostal muscles are muscles that surround and fill the space in between your ribs.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho is the best candidate to use pursed lip breathing?Anyone can benefit from learning how to control their breath. However, pursed lip breathing is very beneficial if you have a pulmonary (lung) condition that affects how well you breathe. These conditions include:Asthma.Chronic obstructive pulmonary disease (COPD).Pulmonary fibrosis.Why is pursed lip breathing done?Pursed lip breathing:Improves ventilation.Releases trapped air in your lungs.Keeps your airways open longer and decreases your effort to breathe.Prolongs breathing out to slow your breathing rate.Improves breathing patterns by moving old air out of your lungs and allowing new air to enter.Relieves shortness of breath.Causes general relaxation.Why does pursed lip breathing help COPD?Pursed lip breathing helps bring more oxygen into your lungs and take more carbon dioxide out of your lungs. Your airways stay open longer, which helps clear out stale air from your lungs and airways. Your breath rate should slow down as you start to relax.AdvertisementWhen should I use pursed lip breathing?Use pursed lip breathing during the difficult part of any physical activity. These activities may include:Bending.Lifting.Walking.Climbing stairs.Exercising.However, it’s also a good idea to practice pursed lip breathing at rest or during stress-free moments until the act becomes natural. These situations may include:Reading.Sitting at a desk.Watching television.Waiting in line.Procedure DetailsWhat happens before pursed lip breathing?When you breathe normally, the muscles around your airways relax, and your airways are clear. Open, relaxed airways allow air to move in and out of your lungs easily and quietly.If you have a lung condition that affects your breathing, your muscles may constrict (tighten), your airways may become swollen, mucus may clog your airways and you may have shortness of breath or wheezing.AdvertisementHow do I perform pursed lip breathing?The following steps will help you perform pursed lip breathing:Relax your neck and shoulder muscles.Breathe in (inhale) slowly through your nose for two seconds with your mouth closed. You don’t need to take a deep breath; a normal breath is OK. It may be helpful to count to yourself. You should feel your stomach slowly get larger as you inhale. Some find it helpful to put their hands on their stomach.Purse (pucker) your lips as though you’re going to whistle or gently blow on a hot drink.Breathe out (exhale) slowly and gently through your pursed lips for four or more seconds. It may be helpful to count to yourself. You should feel your stomach slowly shrink as you exhale.Pursed lip breathing may feel awkward or uncomfortable at first. However, with regular practice, the technique will become easier. The following tips will help pursed lip breathing become more natural for you:Don’t force the air out of your lungs.Always breathe out longer than you breathe in.Breathe slowly and easily — in and out — until you’re in complete control of your breathing.How long should you do pursed lip breathing?Pursed lip breathing may take a little while before it feels natural. It’s a good idea to practice four to five times every day for at least five to 10 minutes. Once the breathing pattern becomes natural, you can perform pursed lip breathing only when necessary.What happens after you do it?After pursed lip breathing, you’ll relieve your shortness of breath, have greater control over your breathing and increase your ability to relax.Risks / BenefitsWhat are the advantages of pursed lip breathing?The advantages of pursed lip breathing include:Slowing your breathing.Making breathing more comfortable.Clearing out air from your lungs.Making it easier to exercise or perform other physical activities.Reducing stress.Improving your quality of life.What are the risks of pursed lip breathing?There are few risks associated with pursed lip breathing. However, it’s a good idea to reach out to a healthcare provider to ensure your lungs are healthy enough to attempt pursed lip breathing.If you feel dizzy, light-headed or tired while performing pursed lip breathing, take a break.Pursed lip breathing also won’t treat your lung condition. It only helps temporarily alleviate some of your symptoms.Recovery and OutlookWhat is the recovery time?Your breathing should become more comfortable within 10 minutes. If you still have difficulty breathing after 10 minutes, call 911.When to Call the DoctorWhen should I see a healthcare provider?Call a healthcare provider if it becomes harder to breathe or you develop new symptoms.Additional Common QuestionsWhat is the difference between belly breathing and pursed lip breathing?Belly breathing is another name for diaphragmatic breathing. Your diaphragm is a large, dome-shaped muscle at the base of your lungs. It does most of the work when you breathe. If you have a lung condition, your diaphragm doesn’t work as well. As a result, your body uses muscles in your neck, shoulders and back to compensate. These muscles aren’t as good at moving air in and out of your lungs. Belly breathing retrains your diaphragm to do most of the breathing work again.Pursed lip breathing is easier to perform than belly breathing. It’s a simple technique that slows your breathing pace and makes each breath more effective in bringing new oxygen into your lungs and getting stale air out. You don’t need to retrain any muscles to perform pursed lip breathing.Is pursed lip breathing good for anxiety?Yes, research suggests that pursed lip breathing is beneficial for reducing anxiety and increasing relaxation.A note from Cleveland ClinicPursed lip breathing is an easy exercise that helps you slow your breathing and maximize the amount of oxygen that goes in and out of your lungs. It won’t cure your lung condition, but it helps control your breathing and eases anxiety. You may need to practice repeatedly throughout the day until the exercise becomes comfortable. It’s a good idea to practice when you’re not out of breath.Take a break if you feel dizzy or tired during pursed lip breathing. If you can’t catch your breath even after pursed lip breathing, call 911.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/06/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6503Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"