"Pyeloplasty: Definition, Repair & Recovery 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/PyeloplastyAdvertisementAdvertisementAdvertisementPyeloplastyPeloplasty is a type of surgery that repairs your ureter – a tube that attaches your kidney and bladder. This inpatient procedure, performed by a general surgeon or urologist, corrects ureteropelvic junction (UPJ) obstruction. You’ll likely remain in the hospital for two days.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is pyeloplasty?Pyeloplasty is surgery to correct a condition called ureteropelvic junction (UPJ) obstruction. “Pyelo” refers to the kidney (renal pelvis). “Plasty” is the term for a surgical procedure that repairs, restores or replaces something.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs pyeloplasty?Adults and children may need a pyeloplasty. One baby out of every 1500 is born with a UPJ obstruction. Twice as many males than females have it.For infants, if the condition doesn’t improve within 18 months, they will likely need pyeloplasty.Older children, teenagers and adults can also get a UPJ obstruction and may need a pyeloplasty if their kidney is obstructed.Procedure DetailsHow invasive is a pyeloplasty?Babies or infants go through an open pyeloplasty. An open surgery means that, when the skin and tissues are cut, the surgeon is able to see all the organs they’re accessing directly with their vision, rather than with a camera (as in laparoscopy). For babies, this open surgery is safer than the laparoscopic (keyhole) surgery performed on adults with UPJ obstruction.In older children and adults, the surgeon only makes a small incision through which they can operate with the help of a camera (laparoscopy). A robot may also be used.AdvertisementIs a pyeloplasty an outpatient or inpatient surgery?Inpatient. You or your child may be in the hospital for one to two days.Who performs pyeloplasty?A general surgeon or urologist.AdvertisementHow long does pyeloplasty last?About three hours.Will I be asleep during the pyeloplasty?Yes. You or your infant will be under general anesthesia and completely asleep.How do I prepare myself or my child for a pyeloplasty?The day before the procedure you or your child won’t be allowed to eat or drink for a specific time assigned by your healthcare provider. If you don’t follow their instructions, the pyeloplasty could be postponed. Before your surgery you’ll have to sign a consent form, go over the procedure with the anesthesiologist and follow any other instructions your hospital requires.How does pyeloplasty work?Babies/infants: During an open pyeloplasty, a two to three inch cut is made just below your baby’s ribs and the obstructed segment of ureter is removed. The normal caliber ureter is then reattached to their renal pelvis. A stent (a tiny silicone tube) is placed to drain urine from their kidney. After they heal, the stent will be removed.Older children/adults: The surgeon will cut multiple small incisions – each between eight and 10 millimeters. The robot that assists your surgeon has three to four robotic arms. Two to three use instruments and one holds a camera. The instruments have a similar range of movement as the human hand, and are able to fix the UPJ obstruction by cutting out the narrow/scarred part and reconnecting the normal tissue.Risks / BenefitsWhat are the advantages of a pyeloplasty?It has the highest success rate compared to other surgical options for UPJ obstruction.What are the risks or complications of a pyeloplasty?As with any operation, there are many risks including extra bleeding, damage to surrounding organs and conversion from laparoscopic to open surgery. There are risks of getting anesthesia, which will be reviewed by your anesthesiologist. After the operation, risks include scarring, infection, hernia, blood clots and need for additional operations if your obstruction returns. You or your child might also experience urine leaking from the place where your kidney joins your ureter.Rarely, there may be an injury to your:Major blood vessels.Small intestine.Large intestine.Stomach.Liver, spleen, or pancreasOvary.Fallopian tube.Bladder.Is a pyeloplasty painful?You or your child may feel some pain after pyeloplasty. The pain may go away after a week and you or your child will be given medications to help minimize this pain.Recovery and OutlookWhat happens after pyeloplasty?Pyeloplasty should hopefully prevent your kidney function from getting worse by helping them drain. Directly after you or your child’s procedure, while in the hospital, you or your child will experience the following:You’ll stay in the hospital for a day or two after surgery. Recovery is usually quick and you’ll be able to eat and drink just a few hours after the operation.You should try to get up and move around after surgery, but don’t do anything too difficult.You’ll be given intravenous antibiotics (antibiotics through a tube that goes into your arm). You might be sent home with oral antibiotics.Your urinary or Foley catheter will be tended to.You may have a double-J (JJ) catheter or a percutaneous nephrostomy (PCN) tube. This tube sits inside your urinary system, placed from either inside your stomach (JJ) or out the back (PCN). These tubes do your ureter’s work to give it time to heal. The PCN tube will be removed soon after your surgery.Sometimes you’ll have a drain attached to your abdomen, near the incision, to move any extra fluid. It should be removed before you go home.Your ureter may be swollen. You may have some pain for a few days after surgery. Your healthcare providers will give you pain medication either orally (by mouth), through your intravenous tube or an injection.Another source of pain is a bladder spasm. You may feel your bladder suddenly tighten. This is because catheters and other tubes may irritate it. There is a drug that will help it relax and help reduce your pain.Kidney drainage may be poor at first. This often gets better over time as the area heals.Take very good care of yourself after the surgery. It’s best to have a caregiver with you at least some of the time. While you recover, you or your child should:Drink plenty of fluids.Keep the dressings (bandages) on your abdomen for as long as your healthcare provider recommends (typically 24 to 48 hours).Take showers. Avoid baths, which might cause an infection.Return to your healthcare provider to get your stitches removed, if they’re not dissolvable.Several weeks after surgery, the stent will be removed during a short procedure with topical anesthesia, and your healthcare provider may use an ultrasound to check for swollen kidneys.What is the prognosis (outlook) after having a pyeloplasty?Pyeloplasty has good long-term success. But, as with any surgery, there is a risk of the scar tissue returning and causing a repeat obstruction of the kidney. Your healthcare provider will continue to monitor for this for several months after surgeryHow effective is a pyeloplasty?A pyeloplasty is effective 85% to 100% of the time.How soon can I get back to normal life?Listen to your healthcare provider’s instructions regarding getting back to “normal.” Try short walks right after your surgery. After four to six weeks you can lift heavy things and resume working out again. Meanwhile, you can take a shower as long as you pat yourself dry afterwards. Start driving only when you feel comfortable with it, if you’re able to make an emergency stop and if you’re not taking any narcotic pain medications.When to Call the DoctorWhen should I contact my surgeon or other healthcare provider?Be sure to attend all follow-up appointments. Contact your surgeon or other healthcare provider earlier if you or your child experience any of the following:Nausea or vomiting.Signs of infection such as a fever, warm skin around the incision, redness around the incision, pus or drainage.Severe pain that pain medications don’t relieve.Increased swelling around the incisions.Severe bleeding in your urine (it’s as thick and red as ketchup).Chest pain, shortness of breath or passing out.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/08/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"