"Wisdom Teeth Removal: Procedure & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Wisdom Teeth RemovalAdvertisementAdvertisementAdvertisementWisdom Teeth RemovalYou might need wisdom teeth removal if your wisdom teeth cause pain, grow in crooked or result in other oral health issues. Sometimes dentists recommend removing wisdom teeth preventively, before issues have a chance to develop. This common oral surgery procedure takes about an hour to complete. Full recovery takes about two weeks.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is wisdom teeth removal?Wisdom tooth removal — or wisdom tooth extraction — is a common oral surgery procedure. Dentists may recommend this treatment to preserve your oral health and protect your other teeth from possible issues in the future.Your wisdom teeth — also called third molars — are in the very back of your mouth. Typically, they erupt (grow in) sometime between the ages of 17 and 25.Scientists believe wisdom teeth are vestigial structures (parts of the human body that are no longer necessary). Our ancestors needed these teeth to crush and chew raw leaves, nuts, roots and meat. Today, we eat more cooked food and use forks and knives to cut our food up into smaller pieces. As a result, we don’t really need wisdom teeth anymore.Some people have all four wisdom teeth (one in each quadrant — the upper left, lower left, upper right and lower right). Others may have one, two, three or none at all. No matter how many wisdom teeth you do (or don’t) have, it doesn’t mean there’s something wrong. It’s just a variation of normal and a sign of the ever-changing evolutionary process.Why is this done?You might need wisdom teeth removed if you:Have one or more impacted wisdom teeth. (“Impacted” means partially or fully trapped in your gums or jawbone.)Have wisdom teeth that grew in crooked or sideways.Develop pain near the back of your mouth.Trap food and debris around your wisdom teeth.Develop gum disease, particularly around your molars.Have tooth decay (cavities) in a partially erupted wisdom tooth.Develop a cyst (fluid-filled sac) around one or more wisdom teeth.Have damage to nearby teeth or surrounding bone.In many cases, dentists recommend wisdom teeth extraction as a preventive measure. As a result, your dentist may suggest removing your wisdom teeth even if you don’t have any symptoms. This can help reduce your risk for future problems, including infection and tooth decay.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow should I prepare for wisdom teeth removal?During a consultation with an oral surgeon, they’ll check the health of your wisdom teeth and take dental X-rays to determine their exact location. This is a good time to tell your surgeon about any medications, vitamins or supplements you’re currently taking.Your surgeon will also discuss sedation dentistry options with you during this appointment. Depending on your needs and preferences, they may recommend local anesthesia, nitrous oxide (laughing gas), IV (intravenous, or through your vein) sedation or general anesthesia.If you choose IV sedation or general anesthesia, your surgeon will give you detailed instructions on how to prepare for your appointment. This may include fasting after midnight the night before your surgery and stopping certain medications a few days prior. (Don’t stop taking medication before discussing it with your surgeon.)What happens during wisdom tooth extraction?The day of your procedure, your surgeon will:Give you anesthesia to numb your teeth and gums and keep you comfortable. (If you choose sedation, they’ll give you sedative medications, as well.)Make incisions (cuts) in your gums, if necessary, to expose teeth trapped in your gums or jawbone.Carefully loosen your wisdom tooth and lift it from its socket. (They may need to divide your tooth into sections for easier removal.)Clean the area to make sure there’s no infection.Place stitches to close the surgical site, if necessary.Place gauze over the sockets to slow bleeding.How long does this procedure take?Wisdom tooth extraction usually takes an hour or less. Complex cases may take longer.AdvertisementWhat happens after wisdom teeth removal?After wisdom teeth removal, you can expect mild discomfort, slight bleeding and swelling. Your oral surgeon will give you instructions for wisdom teeth management to ease these side effects. Once your sedation wears off enough, a trusted friend or family member will drive you home.Dos and don’ts after wisdom tooth extractionYour surgeon will give you postoperative guidelines specific for your situation. Following these instructions will help you manage bleeding, swelling and pain after your procedure.In the meantime, here are some general “dos and don’ts” after wisdom teeth removal:DO:Leave gauze in place for about 30 minutes after your surgery. Replace with clean gauze if necessary. Your surgeon can tell you when to stop using gauze after wisdom tooth extraction. But in general, you can take it out when the bleeding slows. It’s normal to have some oozing, but you shouldn’t have excessive bleeding.Rest as much as you can. You should stay at home and recover for at least three to five days. If you have a physically demanding job, you might need to wait longer before returning to work.Use an ice pack to help reduce swelling. Wrap the ice pack in a clean towel and place it on your face. Leave it on for 20 minutes, and then take it off for 20 minutes. Repeat several times a day.Keep extraction sites clean. Gently soak the surgical areas with alcohol-free antibacterial mouthwash. Don’t swish. Swishing can dislodge blood clots and cause dry sockets, a painful condition that exposes the bone at your extraction site. Instead, lean your head to each side and let the mouthwash soak the areas.Brush and floss the rest of your teeth every day. While you don’t want to brush over the extraction sites, you’ll still need to keep your other teeth clean during recovery. This reduces your risk for infection.Take all medications as prescribed. Your surgeon will give you medications to keep you comfortable and reduce your risk of infection. Don’t stop taking these medications until your surgeon says it’s OK.DON’T:Drink through a straw. This dislodges blood clots and causes dry sockets.Exercise until your surgeon says it’s OK. Getting your heart rate up increases your risk for pain, bleeding and swelling. Most people can resume their fitness routines in about 48 to 72 hours.Lift heavy things. Heavy lifting also increases your risk for postoperative complications like pain, bleeding and swelling.Eat hard, crunchy or chewy foods. These can damage your healing gums and cause pain.Drink carbonated beverages or beverages containing alcohol. These beverages can dislodge blood clots and cause dry sockets. Skip these drinks for at least five days.Care at Cleveland ClinicWisdom Teeth RemovalFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of removing wisdom teeth?Wisdom tooth removal can reduce your risk for future oral health problems, like:Gum disease.Tooth decay.Damage to neighboring teeth.Bone loss.Jaw damage.If you’ve already developed pain because of your wisdom teeth, then extraction can often ease discomfort almost immediately and get you back on track to better oral health.AdvertisementWhat are the risks or complications of extraction?Wisdom teeth removal usually doesn’t result in long-term complications. In rare instances, people may develop:Infection (pus coming out of your socket or incisions).Dry sockets (loss of blood clot resulting in exposed bone).Damage to other oral structures, including your jawbone, nerves, sinuses or nearby teeth.Recovery and OutlookHow long does it take to recover after wisdom teeth removal?Wisdom teeth removal recovery time takes one to two weeks on average. But most people can resume school, work and other routines in about three to five days. Your surgeon will give you detailed postoperative instructions to help keep you comfortable while you heal.What’s the worst day of pain after wisdom tooth extraction?Postoperative pain varies from person to person. But many people have more pain and swelling on the third or fourth day. In general, once pain and swelling peaks, you should notice a steady decrease in these side effects.If pain, bleeding or swelling gets worse again after four days, tell your surgeon. It might mean you have an infection. They can give you antibiotics to help.How long after wisdom teeth removal can I eat?You can eat as soon as you leave your appointment, as long as you’re feeling up to it. Stick to a soft food diet for the first three to five days, then add more solid foods as your comfort level allows.If you get a milkshake or smoothie, use a spoon instead of a straw. Drinking through a straw can dislodge blood clots and cause dry sockets.What to eat after wisdom teeth removalIn general, eat a soft food diet for the first three to five days. Avoid hard, crunchy or chewy foods, as these can cause pain and interfere with healing.Your surgeon will give you a list of things you can eat after wisdom tooth extraction. Some of these foods include:Yogurt.Smoothies.Pudding.Soups.Macaroni and cheese.Scrambled eggs.Applesauce.Mashed potatoes.Cottage cheese.Pureed fruit.Cooked vegetables.When can I go back to work or school?You’ll need to rest at home for three to five days after wisdom tooth removal. Most people can resume work, school and other routines at this point.If you have a job that requires physical labor, you may need to take a few extra days off. Anything that raises your heart rate can increase postoperative pain, bleeding and swelling.When to Call the DoctorWhen should I call my oral surgeon?Call your dentist or oral surgeon if you develop:A fever higher than 102 degrees Fahrenheit (38.8 degrees Celsius).Excessive bleeding.Severe pain that doesn’t get better with medication.Difficulty breathing or swallowing.Swelling that gets worse after three days.An infection (pus) coming from your surgical site.Additional DetailsDo you have to get your wisdom teeth removed?Dentists recommend preventive wisdom teeth removal in many cases. But not everyone needs their wisdom teeth extracted. Some people have healthy wisdom teeth that grow in normally and don’t cause any issues. Others have impacted wisdom teeth that increase their risk for decay, gum disease and other oral health consequences.The best way to find out if you need wisdom tooth removal is to talk to your dentist. They can take X-rays to determine the position of your wisdom teeth and tell you whether you need treatment.What’s the average wisdom teeth removal age?As long as you’re old enough to have wisdom teeth, you’re old enough for wisdom teeth extraction. There’s also no upper age limit. Many dentists recommend wisdom teeth removal in your late teens or early 20s. At this age, your wisdom teeth are still developing, so they may be easier to extract.A note from Cleveland ClinicWisdom teeth removal is a rite of passage for many teens and young adults. Dentists often recommend it preventively to avoid future oral health issues like decay and gum disease. While wisdom teeth extraction probably isn’t number one on your bucket list, it can save you a lot of time, worry and money in the future — especially if your wisdom teeth have a negative impact on your oral health. If you’re wondering whether you need wisdom teeth removal, talk to your dentist. They can help you make a decision that’s right for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/22/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicWisdom Teeth RemovalFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"