"Calcium Channel Blockers: Types, Uses and Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Calcium Channel BlockersAdvertisementAdvertisementAdvertisementCalcium Channel BlockersCalcium channel blockers are a group of medications that limit how your body uses calcium. By slowing down how your cells use calcium, these medications can lower your blood pressure, prevent heart rhythm problems and more.ContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat are calcium channel blockers?Calcium channel blockers are a group of medications that limit how your body uses the essential mineral calcium. Because your heart and circulatory system need calcium to function, these medications treat high blood pressure, heart rhythm problems and more.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow do they work?Calcium is an electrolyte, which means it has a positive charge when it’s dissolved in water. Your body uses ions (atoms with an electrical charge) in electrolytes to transport things into and out of your cells. Your body is always working to balance things out. That means when calcium ions enter a cell, sodium ions leave, and vice versa.Those ions enter and exit your cells using channels, which act just like doorways to the inside of your cells. Those channels also have a type of security feature, which only allows ions that have the right type of charge (either positive or negative) and the right size to enter and exit.Calcium channel blockers take advantage of the fact that certain types of calcium channels tend to exist only in certain parts of the body. This allows targeting of medications depending on which channels they affect.There are many calcium channels on each of the cells in question. At the right dosage, calcium channel blockers (sometimes calcium channel antagonists) only block some — but not all — of them. That slows down those cells’ use of calcium because there are fewer ways to bring it inside.What conditions are treated by this class of medication?Calcium channel blockers' main uses are to treat heart and circulatory conditions. In the United States, they’ve been previously approved to treat the following:High blood pressure (hypertension).Arrhythmias (irregular heartbeat rhythms).Chest pain (angina).Coronary artery spasm.Hypertrophic cardiomyopathy (enlarged heart).Pulmonary hypertension.Subarachnoid hemorrhage (bleeding into the space between the brain and the skull).In addition to the officially approved uses, calcium-channel blockers are also frequently prescribed off-label. This means while the medications aren’t officially approved to treat a condition, there’s evidence that they can still safely do so. Off-label prescribing is a legal practice, and it’s medically acceptable so long as healthcare providers do so safely and responsibly.Off-label uses of calcium-channel blockers include:Raynaud’s phenomenon.Prevention of migraines.Anal fissures.High-altitude pulmonary edema, a type of altitude sickness.Studies are also looking at calcium channel blockers because they may help delay or prevent diseases that will be more severe if you have high blood pressure earlier in life. Those diseases include dementia, Parkinson’s disease and Alzheimer’s disease.AdvertisementAre calcium channel blockers commonly prescribed?Calcium channel blockers are very commonly prescribed, especially for high blood pressure. Millions of adults in the United States receive a prescription for a calcium channel blocker each year.Are there different types of calcium channel blockers?Calcium channel blockers come in two main types.Dihydropyridines (pronounced dy-hy-dro-py-rid-eens). These target blood vessels and cause them to relax, which is why they’re so effective in treating high blood pressure (the exception is nimodipine, which treats subarachnoid hemorrhage).Non-dihydropyridines. There are two calcium channel blockers approved in the U.S. that aren’t dihydropyridines. These medications target heart muscle as well as blood vessels, and they are effective at treating heart rhythm problems.DihydropyridinesNondihydropyridinesAmlodipineDiltiazem (benzothiazepine)Clevidipine (in-hospital use only)Verapamil (phenylalkamine)FelodipineIsradipineNicardipineNifedipineNimodipineNisoldipineDihydropyridinesDihydropyridinesAmlodipineNondihydropyridinesDiltiazem (benzothiazepine)Clevidipine (in-hospital use only)NondihydropyridinesVerapamil (phenylalkamine)FelodipineNondihydropyridinesIsradipineNondihydropyridinesNicardipineNondihydropyridinesNifedipineNondihydropyridinesNimodipineNondihydropyridinesNisoldipineNondihydropyridinesAdvertisementRisks / BenefitsWhat are the advantages of calcium channel blockers?Calcium channel blockers have several advantages that make them commonly prescribed.They’re effective. Calcium channel blockers are effective in people of all ages and races and can treat many related heart and circulatory problems.They can target certain conditions. Depending on the type of medication used, different effects are more likely to happen.They can be a better option. Many medications can help control blood pressure, but some aren't a good choice for certain people. That can happen because of other health conditions, medications they're already taking, life circumstances and more. In those cases, a calcium channel blocker are a better choice for treatment.They can work alongside other medications. Certain medications combine calcium channel blockers with other medications, especially drugs that treat conditions like high cholesterol. Combined therapy makes it easier for people to take their medications and treats multiple problems at once.What are the possible side effects and complication risks of these medications?In general, the following side effects are possible with calcium channel blockers:Dihydropyridines:The most common side effects are:Feeling lightheaded or dizzy.Feeling flushed.Headaches.Swelling in your limbs.Non-dihydropyridinesThese medications are more likely to cause:Constipation.Slow heartbeat (bradycardia).Reduction in your heart’s blood pumping ability.Many calcium channel blockers can cause gingival hyperplasia, which is when your gums grow too much around your teeth. They may also cause an increase in symptoms of gastroesophageal reflux disease (GERD) or heartburn.What should I do if I take one of these medications and miss a dose?The dosing of calcium channel blockers is very important for them to be effective and safe. Because of that, if you miss a dose of one of these medications, you should never try to “catch up” by taking an extra dose, as even doubling your dose may be dangerous. This is especially true with verapamil, which strongly affects the timing and strength of your heartbeat, meaning it can be deadly if you take too much.What are the reasons I should not take these medications?In general, patients who have certain types of heart problems or low blood pressure may not be able to take calcium channel blockers. Other reasons why you may not be able to take some of these medications include pregnancy, heart problems, liver problems, or certain types of irregular heart rhythms.Do calcium channel blockers interact with any other medications?Calcium channel blockers can interact with many medications. This is especially true of any medication that lowers your blood pressure or affects your heart rate. You may also want to avoid taking calcium channel blockers with grapefruit (either the fruit or the juice) because it can affect how your body absorbs these medications.In general, your healthcare provider or pharmacist is the best source of information on medication interactions. You shouldn’t hesitate to ask them if you have any questions about interactions.Recovery and OutlookHow long can I stay on calcium channel blockers?In general, calcium channel blockers taken by mouth are safe for long-term use. In many cases, you can take them indefinitely. However, you should never stop taking them suddenly without talking to your healthcare provider.Can I ever stop taking these medications?In some cases — depending on why you take these medications — you may be able to improve your health to a point where you don’t need to take them any longer. One example of this is lowering your blood pressure through diet and exercise.In those cases, you would need to talk to your healthcare provider and they can help plan a way to wean you off of calcium channel blockers. You should never stop these medications suddenly.However, there are some conditions, such as arrhythmias or enlarged heart, where you would need to remain on calcium channel blockers (or another medication for that condition) indefinitely.When to Call the DoctorWhen should I see my healthcare provider?Your healthcare provider can advise you on when to call or schedule an appointment related to taking calcium channel blockers. In general, you should call or schedule an appointment if you have a sudden change in symptoms, especially ones related to your heart and circulatory system.You should seek immediate medical care if you have any of the following symptoms:Shortness of breath.Chest pain, especially sudden changes in intensity or frequency of the pain.Irregular heart rhythms (arrhythmias) or heart palpitations (where you can feel your heartbeat racing, pounding or skipping beats).Fainting unexpectedly or repeated instances where you feel lightheaded or dizzy.You should also seek care immediately if you have any symptoms related to allergic reactions, including:Unexplained moderate to severe rash or skin irritation.Swelling in your face, especially your eyes, lips or tongue or in your arms or legs.Care at Cleveland ClinicCardiology CareMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/07/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicCardiology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"