"Epley Maneuver (Canalith Repositioning Procedure)800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Canalith Repositioning ProcedureAdvertisementAdvertisementAdvertisementCanalith Repositioning ProcedureVertigo is often caused by the displacement of small calcium carbonate crystals, or canaliths, within your inner ear. The Epley maneuver — also known as the canalith repositioning procedure (CRP) — is a method to remove these crystals trapped in your ear’s semicircular canal.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewWhat is a canalith repositioning procedure?A canalith repositioning procedure (CRP) is a treatment for benign paroxysmal positional vertigo (BPPV), the most common cause of vertigo. The most well-known and performed CRP is the called the Epley maneuver. It involves a series of head movements that aim to relieve vertigo symptoms.With BPPV, tiny calcium carbonate crystals, called otoconia (also known as canaliths), detach from the utricle in your inner ear and move into the semicircular canals instead. When this happens, changes in your head position can trigger episodes of vertigo.The Epley maneuver focuses on moving the canaliths out of your semicircular canals. It helps reduce BPPV symptoms, but it doesn’t work on other types of vertigo.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsThe Epley maneuver helps move canaliths (calcium crystals) out of your utricle and back into your semicircular canals where they belong.How is the Epley maneuver done?Your healthcare provider will:Tilt your head to whichever side is causing vertigo.Have you quickly lie flat on your back with your head slightly off the edge of the examination table in the same position. (Your vertigo symptoms may worsen during this portion of the procedure.)Gradually move your head to the opposite side.Rotate the rest of your body so it’s in alignment with your head.Ask you to remain on your side for a few moments.Sit you upright.It’s important to keep your head down and not lift it up during any portion of the CRP. The canalith repositioning procedure takes about five to 10 minutes to complete.Can I do the Epley maneuver myself?Yes. You can perform the Epley maneuver at home on yourself. Sit on the edge of your bed and follow the steps outlined in the section above. For best results, you may need to perform the maneuver three times.It’s a good idea to ask your healthcare provider to demonstrate the Epley maneuver before you try it at home to ensure you’re doing it properly. You should also ask them to confirm which ear is causing BPPV symptoms.When do you do the Epley maneuver?While you can do the Epley maneuver anytime, many people prefer to do it just before they go to sleep. That way, if you have lingering vertigo symptoms after performing the procedure, you can sleep through them.You should consult a healthcare provider before incorporating any new therapy into your routine.AdvertisementHow long does the Epley maneuver take to work?Most people report relief from BPPV symptoms immediately following a canalith repositioning procedure. However, sometimes, you might have to repeat maneuvers in order to reduce your symptoms.What should I do after a canalith repositioning maneuver?There are no post-treatment instructions following canalith repositioning maneuvers. But it’s good to avoid sudden head movements and don’t bend over for the rest of the day.AdvertisementHow successful are canalith repositioning maneuvers?Over the decades, researchers have conducted numerous studies on the effectiveness of canalith repositioning maneuvers. This type of treatment is quite successful, with an average success rate of 80%.Many healthcare providers recommend the Epley maneuver as the first line of treatment for BPPV.Care at Cleveland ClinicVertigo and Balance Disorders TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of the Epley maneuver?The main benefit of the Epley maneuver is that it’s relatively safe. A healthcare provider can perform this noninvasive procedure in their office, and they can show you how to perform it on yourself at home.What are the risks or complications of the Epley maneuver?Following the Epley maneuver, some people may experience:Nausea.Intense vertigo.Vomiting.Canalith repositioning maneuvers are generally safe. But you should talk to your healthcare provider if you have certain health conditions, including retinal detachment, vascular disease or neck or back injuries.Can the Epley maneuver make you worse?If the Epley maneuver isn’t performed correctly, it can lead to negative consequences, including neck injuries and an increase in vertigo symptoms. To reduce your risk of these complications, ask your healthcare provider to demonstrate the proper technique before trying it at home.When to Call the DoctorWhen should I see my healthcare provider?If you develop lingering BPPV symptoms like vertigo, dizziness or loss of balance, schedule an appointment with a healthcare provider. Canalith repositioning procedures only work for BPPV — not other types of vertigo. So, it’s important to see a provider so they can find out what caused your symptoms, give you a proper diagnosis and recommend appropriate treatment.If you’ve already tried the Epley maneuver and still have symptoms, call your healthcare provider for further instructions. They may want to perform tests to rule out other conditions, such as ear infections and migraines. In some cases, they may also prescribe nausea or motion sickness medications to ease your symptoms.A note from Cleveland ClinicThe Epley maneuver is a simple, noninvasive approach to treating benign paroxysmal positional vertigo (BPPV), a specific type of vertigo. This maneuver involves a series of head movements that help relocate calcium carbonate crystals from your utricle back to your semicircular canals, where they belong. You can even perform the Epley maneuver at home. Just be sure you ask your healthcare provider to demonstrate the proper technique before you try it on your own.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/29/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicVertigo and Balance Disorders TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"