"Canthoplasty: How To Prepare Before Surgery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/CanthoplastyAdvertisementAdvertisementAdvertisementCanthoplastyCanthoplasty is a surgical procedure that reduces droopy or sagging eyelids. A surgeon will tighten your muscles, ligaments and connective tissues at the corner of your eye to change the shape of your eye. This can also improve your field of vision. This procedure is safe, effective and permanent.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is canthoplasty?Canthoplasty is a cosmetic surgical procedure that reconstructs your eyelid. This procedure tightens the muscles, tendons, ligaments and connective tissue in your eyelid. You may choose to get this procedure to:Tighten a sagging eyelid.Reduce an eyelid tilt.Adjust uneven eyelids.Change the shape of your eye.Increase your field of vision.Manage or treat a condition that affects your eyelid.The term canthoplasty refers to a procedure that reshapes the canthus. This is the corner part of your eye where your upper and lower eyelids meet. Another term for canthoplasty is inferior retinacular suspension or the almond eye procedure.Who performs a canthoplasty?An oculoplastic surgeon will perform a canthoplasty procedure. They’re a highly-trained ophthalmologist and plastic surgeon who specializes in procedures around your eyes.What are the types of canthoplasty?There are two types of canthoplasty surgeries:Lateral canthoplasty: A procedure that reconstructs the outer canthus, or the corner of your eye opposite of your nasal bridge that points toward your ear.Epi-canthoplasty: A procedure to reconstruct the inner canthus, or the corner of your eye near your nasal bridge.What does canthoplasty treat or manage?A healthcare provider may recommend canthoplasty to treat or manage the following conditions that affect the function and appearance of your eye and eyelid:Cornea damage (keratopathy).Ectropion.Entropion.Lagophthalmos.Trauma.As you age, your skin naturally loses elasticity. This can cause wrinkles or features on your skin that you might not find appealing. The skin that makes up your eyelid can also start to droop or sag. You might choose to get this procedure to cosmetically adjust these natural changes around the corner of your eye.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow do I prepare for canthoplasty surgery?Before your canthoplasty surgery, you’ll meet with a surgeon who will examine your eyes, talk to you about your goals for the surgery and let you know what to expect after surgery. You’ll also schedule your surgery during this consultation appointment. If you have any questions about the procedure, this is the time to ask.Your surgeon will give you instructions so you can prepare for surgery. Your instructions might include the following:Get lab testing done.Make changes to medications and supplements you currently take or take additional medications.Stop smoking.Wear glasses instead of contacts.You should also make arrangements to have someone drive you home after your procedure. You may need someone to help you at home for a couple of days after surgery until you’re comfortable.What happens during canthoplasty?On the day of your surgery, you’ll receive anesthesia, depending on your procedure. Once you’re under anesthesia, your surgeon will make a small cut (incision) near your eyelid. They’ll then tighten your eyelid tendon and muscle by pulling it into position. This will reduce sagging or droopy eyelids. Your surgeon will close up the incision with stitches.Is canthoplasty surgery painful?A canthoplasty procedure isn’t painful because you’ll be under an anesthetic, which makes it so you won’t feel pain while your surgeon is working. The anesthetic that you receive could be general anesthesia that puts you to sleep during the procedure. You may only get local anesthesia that eliminates the feeling around the area where your surgeon will be working. You’ll be awake with local anesthesia.You may experience mild pain or soreness as you heal after surgery. Your surgeon will let you know what kind of pain relievers are safe for you to take during your recovery. Contact your surgeon if you experience severe pain and swelling after your surgery.How long does canthoplasty surgery take?A canthoplasty procedure can take between 30 minutes to three hours. The length of time varies based on the type of canthoplasty procedure you choose. Your surgeon will let you know their approximate time estimate before your surgery.AdvertisementWhat happens after canthoplasty?Your surgeon will give you instructions after your surgery so you can take care of your surgical site as your eyelid heals. Their instructions may include the following:Avoid strenuous exercise or activities for a few weeks.Take your medications as prescribed. You may receive topical or oral antibiotics, a steroid and artificial tears eye drops.Don’t rub your eye after surgery.Avoid putting water, soap or skincare products close to your surgical site until it heals completely.Don’t swim in a pool or go in a sauna for three weeks after surgery.Keep your head elevated with pillows when you’re sleeping.Use ice for 15-minute intervals to reduce swelling.Your surgeon will also want to see you the week after your surgery to monitor your healing progress.Risks / BenefitsWhat are the benefits of canthoplasty?The benefits of canthoplasty surgery include:Changing the appearance of your eye.Adjusting droopy or sagging eyelids.Canthoplasty surgery is safe and effective when performed by a highly trained and experienced surgeon.Is canthoplasty permanent?Yes, the results of a canthoplasty surgery are permanent. Although rare, you may need minor repeat surgery to adjust the natural changes that your body goes through as you age to maintain your results.AdvertisementWhat are the risks or complications of canthoplasty?All surgical procedures come with possible risks. Your surgeon will explain these risks before your procedure. Possible complications of canthoplasty include:Scars.Bleeding.Swelling and bruising.Pain.Dry eyes.Difficulty closing your eyes.An infection.Recovery and OutlookWhat is the recovery time for canthoplasty surgery?It could take between two to four weeks to recover completely after canthoplasty surgery. You may experience some discomfort, mild swelling and bruising for the first couple of weeks that will go away. It’s normal for your eyes to be different sizes or look uneven as your body heals. This will resolve when the swelling reduces. You may also see incision lines on your skin for two to three months after your surgery that will fade.If your swelling gets worse, or if you experience severe pain or a fever, contact a healthcare provider.When can I go back to work or school after surgery?Your healthcare provider will let you know when it’s safe to get back to your routine, like working or attending school. They may recommend resting for a week after surgery before you go back to work or school.When to Call the DoctorWhen should I call my healthcare provider?Visit a healthcare provider if:Your swelling gets worse instead of better.You have severe pain at your surgical site.Your surgical site isn’t healing.You develop a fever and/or purulent (pus-containing) discharge from the surgical siteAdditional DetailsWhat’s the difference between canthoplasty, canthopexy and blepharoplasty?There are several surgical procedures that can change the appearance of your eyes and eyelids, including:Canthoplasty: This is an eyelid surgery that reconstructs and lifts the corners of your eyes and eyelids. A surgeon will tighten your muscles, tendons and ligaments to achieve results.Canthopexy: This type of surgery tightens the outer corner of your lower eyelid. This procedure doesn’t interfere with the existing tendon or muscles.Blepharoplasty: This is a type of surgery that removes excess skin, muscle and fatty tissue from your eyelids.A note from Cleveland ClinicYou may be interested in canthoplasty surgery if you have sagging eyelids and want to change the appearance of your eyes to meet your goals. This surgery can also treat conditions that affect your eyelid. Before your surgery, you’ll meet with your surgeon, and they’ll explain how you can prepare and what to expect after surgery. If you have any questions about this procedure, reach out to your surgeon.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/11/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2020Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"