"CAR T-Cell Therapy: Procedure, Prognosis & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/CAR T-Cell TherapyAdvertisementAdvertisementAdvertisementCAR T-Cell TherapyChimeric antigen receptor (CAR) T-cell therapy treats certain cancers by turning your T-lymphocytes or T-cells into more efficient cancer-fighting machines. While researchers are still collecting long-term data, CAR T-cell therapy is proving to be a very effective way of treating certain blood cancers.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewMan seated in chair for CAR T-cell cancer treatment.What is CAR T-cell therapy?Chimeric antigen receptor (CAR) T-cell therapy treats certain cancers by turning your T-lymphocytes or T-cells into more efficient cancer-fighting machines. While researchers are still collecting long-term data, CAR T-cell therapy is proving to be a very effective way of treating certain blood cancers.Your T-cells are white blood cells in your immune system. Your immune system monitors your body for intruders, including cancer (and also infected or other abnormal cells), by tracking proteins called antigens. Antigens are located on intruder cells’ surfaces. Your T-cells have their own proteins called receptors. Receptors are like the anti-virus software on your computer. When your T-cell security team senses intruder antigens, they use their receptors to catch and block the intruders. More than that, your T-cells can kill the intruder cells.But intruder antigens have their own form of protection. They can disguise themselves to hide from your T-cells. CAR T-cell therapy ensures your T-cells can get past intruder antigen disguises or defenses.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat cancers are treated with CAR T-cell therapy?The U.S. Food and Drug Administration (FDA) has approved several CAR T-cell therapies for people who have certain blood cancers that don’t respond to chemotherapy and other treatments. This therapy is also used to treat people who have blood cancer that returns after other successful treatments.CAR T-cell therapy is offered through special programs called risk evaluation and mitigation strategies (REMS). REMS ensure healthcare providers are certified to provide the therapy and have the know-how to manage any serious side effects.Here is information on the cancers now treated with CAR T-cell therapy:B-cell acute lymphoblastic leukemia (ALL)This cancer affects the immature B lymphocytes or white blood cells when they’re growing in your bone marrow. Providers typically treat it with chemotherapy and bone marrow transplant.FDA-approved CAR-T cell therapies include:Tisagenlecleucel (pronounced TIH-suh-jen-LEK-loo-sel). Brand name: Kymriah®. This drug is used to treat children and young adults who have ALL.Brexucabtagene autoleucel.B-cell non-Hodgkin lymphomaTypes of B-cell non-Hodgkin lymphoma include diffuse large B-cell lymphoma (DLBCL), follicular lymphoma with DLBCL and high-grade B-cell lymphoma. Providers usually treat these conditions with chemotherapy, monoclonal antibodies and stem cell transplantation.FDA-approved CAR-T cell therapies include:Tisagenlecleucel.Axicabtagene Ciloleucel (pronounced AK-see-KAB-tuh-jeen sy-lo-LOO-sel). Brand name: Yescarta®.Lisocabtagene maraleucel, (pronounced LIS-so-KAB-tuh-jeen MAH-ra-LOO-sell). Brand name: Breyanzi®.Primary mediastinal large B-cell lymphoma.FDA-approved CAR-T cell therapies include:Axicabtagene ciloleucel.Mantle cell lymphomaThis is a type of non-Hodgkin lymphoma that starts in your B lymphocytes. Providers typically treat it with chemotherapy and stem cell transplantation.FDA-approved CAR-T cell therapies include:Brexucabtagene autoleucel (Tecartus®).Multiple myelomaThis is a cancer of plasma cells, the antibody-producing cells. Healthcare providers treat this condition with chemotherapy, targeted therapy or stem cell transplantation.FDA-approved CAR-T cell therapies include:Idecabtagene vicleucel (pronounced ide-KAB-tuh-jeen vi-LOO-sell). Brand name: Abecma®.Ciltacabtagene autoleucel.Researchers are investigating whether CAR T-cell therapy can help people who have other cancers like breast cancer, brain cancer and lung cancer.How often is CAR T-cell therapy used to treat cancer?CAR T-cell therapy is a relatively new treatment. As of 2019, 130 U.S.-based medical centers were authorized to provide it. All told, those centers had treated fewer than 2,000 people with CAR T-cell therapy.AdvertisementProcedure DetailsWhat is the CAR T-cell process?The CAR T-cell process starts with collecting your white blood cells. Here’s a step-by-step explanation:Your healthcare provider places a catheter in a vein in your neck or under your collarbone.They connect the catheter to a machine that’ll process your blood, extracting your white blood cells and then returning your red blood cells and plasma back to you. This process is called leukapheresis.Next, your healthcare provider inserts an inactive virus that delivers new genetic instructions to your T-cells.Armed with new genetic instructions, your T-cells start producing chimeric antigen receptors (CAR) and molecules.The receptors end up on your T-cells’ surface. The molecules are inside of your T-cells, where they deliver signals that keep your T-cells active.Providers take the small batch of CAR T-cells and induce them to grow and multiply until there are enough CAR T-cells to effectively target cancer cells in your body. Your new cells are frozen and stored until you’re ready to receive them.Before you receive your new cells, you’ll need some chemotherapy so your immune system doesn’t reject them. You’ll receive your new cells after your chemotherapy via infusion. You’ll probably need to stay in the hospital for this part of your treatment. But you may be able to receive your new cells without a hospital stay. If that’s your situation, your healthcare team will closely monitor your progress and the process.Once in your bloodstream, your CAR T-cells’ receptors will identify the cancer cells and latch on to the antigens (protein) in cancer cells. Then, your cells kill the cancer cells.Your CAR T-cells keep multiplying and can continue monitoring for any new cell with the target antigen.What happens after I receive CAR T-cells?Most people need to stay in the hospital for a week to 10 days so their healthcare providers can monitor their response to the treatment and treat any side effects. You may be able to receive your CAR T-cells without staying in the hospital. If that’s your situation, your healthcare providers will still monitor your progress and the process. If you have side effects, you may need to return to the hospital to complete your treatment.Risks / BenefitsIs CAR T-cell therapy successful?Healthcare providers and regulatory agencies evaluate CAR T-cell therapy on a case-by-case basis. Generally speaking, the U.S. Food and Drug Administration (FDA) approves these therapies after clinical trials show significant success in treating specific cancers compared to older treatments.Why would CAR T-cell therapy fail?CAR T-cell therapy isn’t perfect. Sometimes, CAR T-cell therapy doesn’t kill cancer cells as expected. Sometimes, the treatment works, but the cancer comes back. Some reasons why CAR T-cell therapy may not work include:CAR T-cells are T-cells with new genetic instructions, so they make chimeric antigen receptors (CAR) and molecules. The new receptors need to activate or start up for T-cells to find and kill cancers. When that doesn’t happen, CAR T-cells can’t work.Once they’re in your body, CAR T-cells are supposed to multiply. When they don’t, they might not find and kill enough cancer cells to keep the cancer cells from spreading.Sometimes, CAR T-cells simply stop killing cancer cells. When this happens, it’s called T-cell exhaustion. Researchers believe T-cell exhaustion may be linked to proteins called transcription factors that can help turn genes on and off.Cancer cells can change or mutate, losing the antigen the CAR T-cells were created to find.AdvertisementWhat are common CAR T-cell therapy side effects?Like most cancer treatments, CAR T-cell therapy has side effects that can, at times, cause serious life-threatening problems. The two most common side effects are cytokine release syndrome and neurological problems.What is cytokine release syndrome?Cytokine release syndrome (CRS) can happen after you’ve received your CAR T-cells and they start multiplying and attacking cancer cells. Cytokines are chemicals that trigger your immune system. When your CAR T-cells start to work, your immune system may respond by releasing large amounts of cytokines into your bloodstream. Most of the time, CRS happens in the first week or two after treatment.What are cytokine release syndrome symptoms?If you have this syndrome, you may feel as if you have the flu. CRS symptoms include:Headaches.High fever and chills.Nausea, vomiting and diarrhea.Dizziness.Feeling very tired.Fast heart rate.What kind of neurological problems happen with CAR T-cell therapy?CAR T-cell therapy can affect your nervous system, causing symptoms that happen in the first few weeks after your treatment. Some symptoms can affect your ability to drive or operate machinery, so you should plan to avoid those activities for eight weeks after your treatment. Neurological symptoms include:Headache.Feeling confused or agitated.Having difficulty speaking.Seizures.Tremors or twitching.Balance problems.Recovery and OutlookHow long does it take to recover from CAR T-cell therapy?CAR T-cell therapy can cause significant or life-threatening side effects. That’s why healthcare providers usually require people who have this treatment to stay in the hospital for several days so healthcare providers can monitor and manage any side effects.For the first month after treatment, you should plan on having someone with you 24 hours a day. You should also plan on staying within driving distance of your treatment location. And you should plan on having someone drive you where you need to go for two months after treatment.What is the prognosis or expected outlook for CAR T-cell therapy?It’s still early days for CAR T-cell therapy, but studies continue showing positive results. For example, a 2020 study tracked children who had acute lymphoblastic leukemia (ALL). More than 85% of the children with ALL had complete remission right after treatment and 60% of those children remained free of cancer 12 months after treatment.And, researchers are aggressively pursuing new insight into CAR T-cell therapy. As of March 2020, CAR T-cell was the focus of more than 800 studies. Examples of current research include:Investigating how CAR T-cell therapy might treat solid tumor cancers like breast cancer and lung cancer.Finding ways to reduce therapy side effects.Investigating ways to extend the length of time that CAR T-cells contain cancer.Looking for ways to speed up CAR T-cell production so people can receive treatment earlier.When to Call the DoctorWhen should I see my healthcare provider?CAR T-cell therapy has significant side effects. Once you’re home from the hospital, you should monitor changes in your body and contact your healthcare provider if you develop side effects.Additional DetailsWhat is the cost of CAR T-cell therapy?CAR T-cell therapy is expensive. It can cost healthcare providers up to $1 million to treat one person. The amount you may need to pay for treatment depends on your individual circumstance, such as your insurance coverage and whether you qualify for Medicare. If your healthcare provider recommends CAR T-cell therapy, they’ll probably suggest that you work with hospital financial advocates to understand your specific situation.A note from Cleveland ClinicCAR T-cell therapy is breaking new ground and bringing new hope for some people who have certain blood cancers that don’t respond to chemotherapy or other initial treatments. It’s also used for people whose blood cancer has come back. But CAR T-cell therapy has potentially life-threatening side effects. And while it helps many people, it’s too soon to say if CAR T-cell therapy can cure the blood cancers that it targets. If you have blood cancer, ask your healthcare provider if your cancer might be treated with CAR T-cell therapy.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/19/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"