"Cardiac Devices for Patients with Heart Failure800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Cardiac Devices for Patients with Heart FailureAdvertisementAdvertisementAdvertisementCardiac Devices for Patients with Heart FailureWhat is a cardiac device?A cardiac device is used to keep your heart beating with a normal rhythm. There are several types of devices available. If you have heart failure with reduced ejection fraction (HF-rEF) and need a device, your doctor will let you know and talk with you about the best type to meet your needs. Please let your doctor or nurse know about any questions or concerns you have about this type of treatment.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyImplantable Cardiac Defibrillator (ICD)An implantable cardiac defibrillator (ICD) is an electronic device that is placed inside the body. An ICD constantly keeps track of your heart rhythm and sends a small shock to the heart muscle if the rhythm becomes abnormal (arrhythmia). If a shock is needed, it can be very uncomfortable, but it is over very quickly. Some ICDs use a pacing system instead of a shock. This type of ICD sends a fast impulse to the heart muscle to get it back into a normal rhythm. An ICD can help reduce your risk of sudden cardiac arrest (SCA).What is Sudden Cardiac Arrest (SCA)?Sudden cardiac arrest (SCA) is a sudden death that happens when the heart stops working because of an abnormal heart rhythm. The lower chambers of the heart (ventricles) can flutter or quiver (ventricular fibrillation) or the heart can beat very quickly (ventricular tachycardia). Changes in heart rhythm keep the heart from sending blood to the rest of the body. The condition causes the person to pass out and then die.Some people who have SCA may feel their heart “racing” or they may feel dizzy because their heart isn’t beating normally. However, more than half of all people who have SCA have no warning symptoms.Patients with heart failure are about 6 to 9 times more likely than the general population to have ventricular arrhythmias that can lead to SCA. About 30% of patients with mild-to-moderate heart failure die from SCA. Your family should understand your condition and this increased risk of SCA. Those close to you should learn how to perform cardiopulmonary resuscitation (CPR). If you have symptoms of SCA, it is important for you to get emergency care right away (start CPR and call 911). Although more than 90% of people who have SCA die, survival is possible with immediate emergency care. The risk of dying increases about 10% every minute that goes by without treatment (CPR and defibrillation, which is essentially an emergency shock to get your heart back into rhythm).AdvertisementCardiac Resynchronization Therapy (Biventricular Pacing)Cardiac resynchronization therapy (CRT) helps the ventricles contract normally. This treatment, also known as biventricular pacing, can be helpful for some patients with HF-rEF.About 30% of patients with heart failure have electrical problems in the ventricles that create delays when they contract/pump. When the ventricles don’t pump together, there is less oxygen-rich blood sent to your organs and muscles. Pumping delays cause heart failure to get worse and can increase your risk of death from heart failure.Treatment with CRT involves implanting a pacemaker in your body. Three wires (leads) are attached to the pacemaker and keep the ventricles pumping together by sending small electrical impulses to the heart muscle. These impulses are not painful.A CRT-D is a device that combines CRT and an ICD. It keeps the ventricles beating together. If they get out of synch because of ventricular tachycardia or fibrillation, the CRT-D sends a shock to restore a normal rhythm. About 75% of patients who do not get relief from symptoms with medication and have CRT, with or without an ICD, have improvement in their symptoms.Cardiac resynchronization therapy helps improve survival, quality of life, heart function and your ability to exercise, and can lower your risk of hospitalization.Keeping Track of Your InformationMany ICD and CRT devices have built-in features that let your doctor or nurse keep track of your heart rhythm, heart function, and your activity level. You may need to send information to your healthcare provider using a phone or device called a personal digital assistant (PDA). If you need to send information, your doctor or nurse will teach you how.A newer internal monitoring device (CardioMEMS) is the size of a small paper clip. It is placed in a blood vessel near your heart to keep track of pressure in the blood vessel and the left ventricle. The information is sent to a computer server.Your healthcare provider uses the information sent from the device to make sure you are getting the best treatment possible for your condition and to see if you need any changes in your medication, diet or activity level.AdvertisementVentricular Assist Devices (VADs)A ventricular assist device (VAD) is a pump attached to your heart to help the weakened ventricle pump blood throughout the body. A VAD may be used in patients with advanced HF-rEF as a final treatment option or as a “bridge to heart transplant,” which means the device is in place until you can have a heart transplant. There are different types of VADs. Only one type is illustrated here.This information is not intended to replace the medical advice of your doctor or healthcare provider. Please consult your healthcare provider for advice about a specific medical condition.Care at Cleveland ClinicHeart Failure TreatmentsFind a Doctor and SpecialistsMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/12/2019.Learn more about our editorial process.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicHeart Failure TreatmentsFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"