"Cardiac Resynchronization Therapy (CRT)800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Cardiac Resynchronization TherapyAdvertisementAdvertisementAdvertisementCardiac Resynchronization TherapyCardiac resynchronization therapy, also known as CRT or biventricular pacing, is a procedure for implanting a special type of pacemaker. A biventricular pacemaker helps most people who have this procedure get both of their heart ventricles contracting at the same time. This can help people with heart failure have a better quality of life.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewCardiac resynchronization therapy makes both ventricles contract together.What is cardiac resynchronization therapy?Cardiac resynchronization therapy (CRT or biventricular pacing) is a procedure for implanting a permanent biventricular pacemaker. This makes your ventricles (lower chambers in your heart) contract together instead of at different times.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow does cardiac resynchronization therapy work?Unlike other pacemakers that have one or two wires or leads, a CRT, or biventricular pacemaker, has three. One lead goes to each of your ventricles. The third goes to your right atrium, one of your heart’s upper chambers. (Your heart has two ventricles and two atria.)These leads watch for abnormal heart rhythms and send an electrical signal to correct them and make your heart chambers work together.Cardiac resynchronization therapy vs. ICDCardiac resynchronization therapy uses a biventricular pacemaker to get your ventricles working together.An implantable cardioverter-defibrillator (ICD) gets a fast rhythm back to normal. It helps people who have ventricular tachycardia and ventricular fibrillation.Many people may need a biventricular pacemaker with an ICD to correct all of these issues.Cardiac resynchronization therapy indications (who needs it?)People who have an arrhythmia, or abnormal heart rhythm, may need cardiac resynchronization therapy or another type of pacemaker. Causes of arrhythmia or a weak heart include:Heart failure.Heart attack.Advanced age.Something that’s damaged your heart.Medicine.A heart problem you inherited from your parents and/or have had since birth (congenital).An issue with your heart’s ability to get an electrical signal to your heart’s chambers, such as a bundle branch block.AdvertisementWhy is cardiac resynchronization therapy done?About 20% to 30% of people who have heart failure have left and right ventricles that don’t contract together. This makes it even harder for their hearts to pump blood.CRT is the next treatment option after trying medication and lifestyle changes.How common is cardiac resynchronization therapy?Cardiac resynchronization therapy is fairly common. More than 311,000 people received CRT between 2006 and 2012 in the United States.AdvertisementProcedure DetailsWhat happens before cardiac resynchronization therapy?Your healthcare provider will:Order imaging, such as a heart MRI or transthoracic echocardiogram (TTE). This may happen days before your procedure.Give you an anesthetic so you won’t feel pain. Depending on the type of anesthesia, it may make you sleep so you won’t be aware of anything that’s happening.What happens during a cardiac resynchronization therapy procedure?Your healthcare provider will:Insert three wires through your veins in your upper body or thigh. Then they’ll thread them through your veins to your heart.Make an incision for the CRT device below your collarbone or in your abdomen.Connect the wires to your CRT device and make sure it works.Implant the CRT device underneath your skin.Stitch up your incision.What happens after cardiac resynchronization therapy?After receiving CRT:You may need to stay a few hours or overnight in the hospital.You’ll need someone to drive you home because you received anesthesia.You’ll need to keep your left arm still for about 12 hours after CRT to help leads stay in place.You’ll get a card to keep with you that has information about the device you have.Your healthcare provider might take an X-ray to check your leads or an electrocardiogram (EKG) to check your heart rhythm.They may test your device to see if it can send information.Care at Cleveland ClinicHeart Failure TreatmentsFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of cardiac resynchronization therapy?CRT can provide these benefits:Help your heart pump more blood out to your body.Make your heart more efficient.Help improve symptoms like shortness of breath.Cut down your risk of abnormal heart rhythms in your ventricles.Improve your life expectancy.Improve mitral regurgitation, or blood going the wrong way in your heart’s mitral valve.Improve your ability to exercise.What are the risks or complications of cardiac resynchronization therapy?Possible complications of cardiac resynchronization therapy include:Wires breaking or moving out of place, possibly causing damage.Infection.Blood clots.Allergic reaction to something from the procedure.Heart attack or another heart issue.Recovery and OutlookWhat is the recovery time?You may need to stay overnight (or just a few hours) in the hospital after cardiac resynchronization therapy. You can go back to your normal activities in a few days. You shouldn’t drive or lift anything heavy for a week or so.Your biventricular pacemaker should last for several years. It should improve your quality of life.Does cardiac resynchronization therapy work?Researchers have found that CRT didn’t help one-third of the people who received it.When to Call the DoctorWhen should I see my healthcare provider?Contact your healthcare provider if you get a fever weeks or even months after getting CRT. It could mean you have an infection where your biventricular pacemaker is located.You’ll have a follow-up appointment a month after your cardiac resynchronization therapy procedure, and then once or twice a year.A note from Cleveland ClinicCardiac resynchronization therapy (CRT or biventricular pacing) is the implantation of a permanent biventricular pacemaker. Talk with your healthcare provider about electronic or magnetic objects that may keep your pacemaker from working right. Although your healthcare provider will check your pacemaker electronically from their office, they’ll still need to see you regularly after cardiac resynchronization therapy. They need to be sure your device, battery and wires are in good shape. Be sure to follow all instructions your healthcare provider gives you about your device so you can gain the greatest benefit from it.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/01/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicHeart Failure TreatmentsFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"