"How To Perform CPR800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Cardiopulmonary Resuscitation (CPR)AdvertisementAdvertisementAdvertisementCardiopulmonary Resuscitation (CPR)CPR, or cardiopulmonary resuscitation, can help someone survive cardiac arrest. Even if you don’t know CPR, you can help someone by using “hands-only” CPR. To give the person the best odds of survival, you need to take immediate action. Start CPR while someone else calls 911 and looks for an AED (automated external defibrillator).ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewCPR keeps blood moving after cardiac arrest.What is CPR?Cardiopulmonary resuscitation (CPR) is a way to save the life of someone who’s in cardiac arrest (when someone’s heart is no longer able to pump blood) by attempting to restart their heart. It’s a fairly simple technique that anyone can learn. The key part of CPR is chest compressions, which keep blood flowing to vital organs until a regular heartbeat returns. Breaths of oxygen bring more oxygen into the person with cardiac arrest.When is CPR used?A person of any age needs CPR if they:Collapse.Don’t respond.Aren’t breathing.Don’t have a pulse.More than half of all people who have cardiac arrest outside of a hospital don’t get help right away. If you receive CPR right after you go into cardiac arrest, your chance of survival can double or even triple.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before CPR?Before starting CPR, follow these steps:After ensuring a safe scene, loudly ask the person if they’re OK.Call 911 if you see someone collapse. The 911 dispatcher can guide you through the steps to take until paramedics arrive.Ask someone nearby to get an automated external defibrillator (AED).Tilt the person’s head back while they’re lying on their back.Listen for 10 seconds to see if you hear the person breathing.Check to see if the person is breathing or to see if their chest is going up and down.Check for a pulse by feeling the side of their neck.Perform CPR if you don’t feel a pulse.How to do CPRIf the person isn’t breathing, put one of your hands over the other and place them in the middle of the person’s chest (right under their nipples).Putting the force of your body weight behind it, push your hands down hard in the middle of the person’s chest. Use the heel of your hand, or the part just before your wrist. Keep your arms straight.Keep pushing on the person’s chest (called doing compressions) 100 to 120 times per minute, pushing down 2 inches each time. Make sure you allow their chest to come all the way back up between compressions.People who have CPR training can pause compressions to give the person two mouth-to-mouth rescue breaths for every 30 compressions (about 20 seconds or so).Keep doing chest compressions and giving rescue breaths in a cycle until the person revives or more help arrives.Perform the rescue breath as follows:Pinch the person’s nose closed while tilting their head back a little and their chin up.Close your mouth over theirs and blow a breath into it so their chest goes up. If the person’s chest doesn’t come up, check to see if there’s something in their mouth.Give a total of two breaths and go back to doing compressions.While you’re doing CPR, someone should be bringing an AED to use for help with resuscitating the person.You can do CPR even if you don’t have training in how to perform CPR. If a teen or adult is in cardiac arrest, call 911 and do chest compressions until emergency help arrives. This is called “hands-only CPR.” By distributing oxygen currently in the person’s body, it can help someone in cardiac arrest until someone with CPR training arrives.It can be easier to remember the CPR compression rate if you follow the beat of these songs:“Stayin’ Alive” by the Bee Gees.“Walk the Line” by Johnny Cash.“Crazy in Love” by Beyoncé and Jay-Z.“Hips Don’t Lie” by Shakira.If you’re doing CPR on an infant as a single rescuer, put one hand on their forehead to keep their head slightly back to provide proper rescue breaths. Use two fingers of your other hand to do compressions that go a third or half the depth of their chest. The number of compressions and breaths is the same as for adults.If you’re a two-person rescue team, while one person provides rescue breaths, the other person should use a two-hand method. Place both thumbs in the center of the chest (below the nipple) with the remaining fingers wrapped around the sides of the infant. Deliver compressions with the two thumbs. Use the same number of compressions and breaths as for adults.AdvertisementWhat happens after CPR?After first responders take over caring for the person receiving CPR, they’ll get them to a hospital as soon as possible. If the person survives, healthcare providers will look to see if there’s any organ damage from a lack of oxygen. They’ll also determine the cause of cardiac arrest and provide whatever treatment the person needs. Many people who survive cardiac arrest stay in a coma, but about half wake up.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentRisks / BenefitsWhat are the advantages of this procedure?By keeping blood moving through a person’s body, CPR prevents organ damage in someone who’s in cardiac arrest.AdvertisementWhat are the risks or complications of CPR?CPR comes with risks because of how hard chest compressions have to be to keep blood circulating. It’s possible to break ribs and injure organs within the chest during CPR.Recovery and OutlookWhat is the recovery time?It can take several months for mild issues with memory, learning and concentration to get better in people who survive cardiac arrest and awaken from a comatose state.When to Call the DoctorWhen should I see my healthcare provider?If you see someone having a cardiac arrest, call 911 immediately.After surviving cardiac arrest, you’ll need follow-up appointments with your healthcare provider. The timing of the appointments will vary depending on your condition. Be sure to contact your provider if you aren’t getting better or if you have new symptoms during your recovery.Additional Common QuestionsWill CPR break ribs?Yes, it’s possible that CPR can break a person’s rib. This is possible because you have to push down hard in order to pump blood from the heart throughout a person’s body.What is CPR without mouth to mouth?“Hands-only” CPR, described above, doesn’t involve mouth-to-mouth resuscitation. It’s still a valuable form of CPR that can help a person’s blood flow until professional emergency help arrives.AED vs. CPRMany public places have an automated external defibrillator (AED) that people can use in emergency situations. Anyone can use an AED, which delivers a life-saving shock to a person in cardiac arrest. When you use it in the right way, the shock restores a normal heart rhythm. Most AEDs have easy-to-use instructions on them, but a 911 dispatcher can also help you use the AED. You should use AEDs alongside CPR, not instead of CPR.You should start CPR and ask someone to call 911 and look for an AED.A note from Cleveland ClinicMost cardiac arrests that happen outside a hospital happen at home, so you could be helping a relative or friend if you know CPR. Even “hands-only” CPR can help a person stay alive until first responders arrive. CPR increases a person’s chance of surviving cardiac arrest, but it’s important to act quickly.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/13/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"