"Cardiac Rehab: Phases & Exercises To Help Your Heart800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Cardiac RehabAdvertisementAdvertisementAdvertisementCardiac RehabCardiac rehab strengthens your heart. It may start with walking down the hallway in the hospital and progress to riding a stationary bike several times a week. But exercise is only one part of a cardiac rehab program. It also includes stress management, nutrition counseling and help managing your chronic conditions.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is cardiac rehab?Cardiac rehab (cardiac rehabilitation) is a complete program you can do after you’ve had cardiac surgery or treatment for a heart issue, such as a heart attack. Cardiac rehab helps you recover and get stronger.Multiple healthcare providers, including exercise and nutrition experts, offer guidance during your personal cardiac rehab program. It typically takes at least three months. Cardiac rehab can help you regardless of your age, sex or whether your heart issue was minor or major.What are the five main components of cardiac rehab?A cardiac rehab program combines:Exercise training.Cardiac risk factor changes.Heart health education.Diet and nutrition counseling.Emotional support.What are the three phases of cardiac rehab?Cardiac rehab may begin before the hospital discharges you and should continue long-term. Cardiac rehab phases are:Phase 1: Inpatient (starting while you’re in the hospital).Phase 2: Outpatient (going to appointments and then going home afterward).Phase 3: On your own (keeping up exercises on your own and at your own expense).Can I do cardiac rehabilitation at home?You may be able to do cardiac rehab at home, but check with your insurance company to see if they cover it.The first phase of your cardiac rehab will happen during your hospital stay. In most cases, your healthcare provider will tell you to start cardiac rehab shortly after you leave the hospital. In addition to hospitals, other medical centers offer cardiac rehab programs.What conditions are treated/managed with cardiac rehab?Cardiac rehab is important for people who’ve had some kind of heart or blood vessel issue, such as:Heart attack.Heart failure.Use of a ventricular assist device.Stable angina.Heart or heart-lung transplant.Heart valve repair or replacement.Coronary artery bypass grafting (CABG).Coronary artery angioplasty with or without a stent.Peripheral artery disease.Your healthcare provider can give you a referral to a cardiac rehab program.How common is cardiac rehab?Cardiac rehab isn’t as common as it should be. Each year, about 800,000 Americans have a heart attack. For 25% of them, it’s not their first one. Cardiac rehab can help prevent a second heart attack and decrease the risk of death over one to three years after taking part in the program. However, only 20% to 30% of those eligible each year enroll in a cardiac rehab program.The American Heart Association and the American College of Cardiology endorse cardiac rehab for people with the heart conditions listed above.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before cardiac rehab?Before creating a program for you, staff at the cardiac rehab center will give you a brief physical exam and get your medical history. They may also ask you to have basic testing, which may include:Cardiac imaging.Electrocardiogram (EKG).Tests to check your blood sugar and cholesterol.Exercise stress test with a treadmill or stationary bike.Your cardiac rehab staff will work with you and your provider to:Review and assess your risk factors for heart and blood vessel disease.Develop a treatment plan to guide you through your program.Identify safe and effective target training zones for your exercise training.Set heart-healthy goals for you to reach while in the program and in the long term.What happens during cardiac rehab?In a group setting, the cardiac rehab staff will supervise you as you exercise. You’ll start out slowly according to their instructions.As you complete more sessions, you’ll gain confidence and endurance. Gradually, you’ll increase the intensity and/or duration of your exercise according to your fitness level and medical history. Cardiac rehab staff will check your heart rate and blood pressure regularly to make sure you’re safe while exercising.What exercises do you do at cardiac rehab?Cardiac rehab exercises can vary depending on the fitness level and risk factors you started with. Exercises may include:Aerobic exercises, like walking, riding a stationary bike or using an elliptical or step trainer.Activities to strengthen your muscles, like lifting free weights or using cable machines and resistance bands.What does cardiac rehab consist of?In addition to exercise, cardiac rehab helps you with:Eating heart-healthy.Learning how to manage stress.Getting to and staying at a healthy weight.Stopping the use of tobacco products and/or other substances.Taking and managing your medicines.Managing your blood pressure, cholesterol and blood sugar levels.How long is cardiac rehab?Most insurance companies (and Medicare) cover a 12-week cardiac rehab program with a total of 36 sessions. That works out to three one-hour sessions a week.Care at Cleveland ClinicCardiac rehab servicesFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the potential benefits of cardiac rehab?Completing a cardiac rehab program can add up to five years to your life expectancy, according to studies. Cardiac rehab is good for you in many ways. It can:Help you recover and get stronger after a heart attack, heart surgery or another heart issue.Get your body moving so your everyday activities are easier.Improve your daily quality of life.Help lower your risk of having another heart attack.Decrease your risk of becoming very ill or dying from heart disease in the coming years.Help you manage mental health and possible feelings of depression and anxiety after a heart attack.Show you ways to ease stress.Help you manage your weight.Teach you healthier lifestyle habits, such as heart-healthy eating, not using tobacco products, sitting less and exercising more.Help with your chest pain and shortness of breath.Cardiac rehab helps people who’ve had a heart attack or other heart problems recover. It creates a personal plan for safely improving physical health and managing other risk factors.Having a heart attack or other heart issue can also be scary and make you feel depressed. Cardiac rehabilitation stresses the importance of mental health and quality of life. It provides holistic support for every part of rehab so you’re not alone in reaching your goals.How successful is cardiac rehab?Several studies have found cardiac rehab helps people in various ways.Researchers found cardiac rehab reduced:Cardiovascular death risk by 58%.Heart attack risk by 30%.The risk of stroke by 60%.Depression symptoms by 63%.What are the risks or complications of cardiac rehab?In very rare cases, exercise during cardiac rehab can cause an injury or a dangerous heart rhythm. If this happens, the cardiac rehab staff will have you stop exercising so they can treat you right away. If needed, the cardiac rehab staff will also talk with your cardiologist or primary healthcare provider. They may want to examine you or order more testing before you return to cardiac rehab.AdvertisementRecovery and OutlookIs there anything I can do to make cardiac rehab easier on me?Yes. Follow the advice and instructions of the cardiac rehab staff. They have experience working with people like you every day. Exercising after a heart attack or other heart issue can be scary, but healthcare providers will supervise you during your cardiac rehab program.When to Call the DoctorWhen should I call my healthcare provider?You can bring up concerns with the supervising provider in your cardiac rehab program. But you may also contact your primary healthcare provider if you’re having trouble doing what the program asks.In addition to regularly attending cardiac rehab, be sure to keep all of your follow-up appointments with the other providers in your care team.Additional Common QuestionsHow do I choose a cardiac rehab program?When looking into cardiac rehabilitation programs, ask if they:Are in your insurance company’s network, especially if you have private insurance. (You’ll need a referral from your provider for insurance to cover it.)Are in a location that’s convenient for you.Will communicate with your provider.Have hours that work for your schedule.Have the services you need.Are a center that’s up to date and in good standing with their certification through the American Association of Cardiovascular and Pulmonary Rehabilitation (AACVPR).Have a trained and certified staff supervising your cardiac rehab. This includes an onsite doctor who’ll approve and oversee your program.Require you to perform an exercise stress test as part of the enrollment process to check if exercise is safe and help you develop your exercise training plan.Have a staff who’s certified to perform basic and advanced life support, if needed.What happens after cardiac rehab?After you complete your last cardiac rehab session, the staff may ask you to perform another exercise stress test in order to:Check to make sure that exercise is still safe for you.Measure how much your cardiorespiratory fitness improved compared to your first exercise stress test.Update your exercise training recommendations to reflect your improved physical functioning.Even though you “graduated” from center-based cardiac rehab, you should feel confident in continuing to exercise. You’ll also improve the heart-healthy benefits of regular exercise if you continue to use everything you learned about:Controlling your cardiovascular risk factors.Managing stress.Cooking heart-healthy meals.Avoiding tobacco products.These can help you for the rest of your life.A note from Cleveland ClinicTaking part in a cardiac rehab program puts a whole team of people on your side to help you recover from a heart attack or other heart issue. According to studies, cardiac rehab gives people many benefits, including more years of life and improved quality of life. With medical professionals monitoring you at every step, you can get stronger in just a few months and learn skills to improve your everyday life.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/28/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicCardiac rehab servicesFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"