"Cardiac Implantable Electronic Device Replacement800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Cardiac Implantable Electronic Device ReplacementAdvertisementAdvertisementAdvertisementCardiac Implantable Electronic Device ReplacementCardiac implantable electronic device (CIED) replacement is surgery to replace a pacemaker or implantable cardioverter defibrillator (ICD). Most people need the procedure when the device’s battery runs low, about every six to 10 years.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is cardiac implantable electronic device replacement?Cardiac implantable electronic device (CIED) replacement is surgery to replace a device that helps control your heart rhythm. The procedure may replace an implantable cardioverter defibrillator (ICD) or a pacemaker. In most cases, it’s a simple outpatient procedure that doesn’t require overnight hospitalization.Who needs CIED replacement?The most common reason for CIED replacement is because the battery reaches the end of its lifespan, has a low charge or can’t hold a charge. The batteries typically last six to 10 years, so you may have multiple replacements in your lifetime. Your healthcare provider checks your generator at appointments, so they will know when your generator’s battery nears the end of its lifespan.Other reasons for device replacement may include:Your healthcare provider recommends a newer version of the device or one that has additional capabilities.Your implantable device malfunctions or stops working entirely.You develop an infection that requires device removal (rare).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWho performs CIED replacement?A physician, such as a heart surgeon, cardiologist or electrophysiologist (healthcare provider specializing in the heart's electrical impulses), performs CIED replacement.What happens before CIED replacement?Your healthcare provider will provide detailed instructions about how to prepare for your ICD or pacemaker replacement surgery. They may:Ask you to stop taking certain medications such as anti-inflammatory drugs or aspirin.Do cardiac testing such as an electrocardiogram (EKG) or echocardiogram.Perform blood tests to make sure you’re healthy enough for surgery.AdvertisementWhat happens during CIED replacement?Most types of CIED replacement only involve replacing the battery-powered generator under your skin. That means a healthcare provider doesn’t need to perform major surgery to remove the leads attached to your heart. But in some cases, your healthcare provider needs to remove or replace the entire device, including the leads. This is a more complex procedure.If you have a leadless pacemaker, your healthcare provider either turns off the existing device and implants a new device (the old device stays in place), or they use a catheter (a thin, flexible tube-like device) to remove the old device through a vein. Retrieving these devices through a vein is possible because leadless pacemakers are much smaller than traditional pacemakers.During the procedure to replace the generator, your healthcare provider:Gives you intravenous (IV) sedation through a vein in your arm.Makes an incision (cut) in your skin over the implanted device.Detaches the generator from the leads and removes the generator.Implants the new generator and connects it to the leads.Closes the incision with stitches or glue.What happens after CIED replacement?You stay in the hospital or outpatient surgery center for several hours after your device replacement surgery. Your health care team monitors you as you recover from sedation. Most people can go home the same day as the procedure.Care at Cleveland ClinicHeart Failure TreatmentsFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the benefits of CIED replacement?CIED replacement helps your implantable device function at its best. Having a device that works well is essential for your heart health. It can prevent dangerous abnormal heart rhythms or even death.What are the risks of CIED replacement?CIED replacement is typically a safe, low-risk procedure. Potential complications can include:Allergic reaction to sedation.Excessive bleeding or blood clots.Infection of your incision or around the leads (if you need them replaced).Recovery and OutlookWhat is recovery like after CIED replacement?You should take it easy the day of your procedure and avoid strenuous exercise or heavy lifting for several days after the procedure. You might notice some swelling or soreness around your incision for a few days. Your healthcare provider can give you medication for mild to moderate pain.Your healthcare provider will also give you instructions about:Cleaning and caring for your incision as it heals.Monitoring your new device.Resuming regular activities.When to Call the DoctorWhen should I call the doctor?You should call your healthcare provider if you experience:Chest pain.Fever or other flu-like symptoms.Shortness of breath (dyspnea).Signs of infection in the incision site, such as pus or foul-smelling drainage.You should also call your provider if you notice signs that your device may not be working correctly, which may include:Dizziness.Fainting.Fast or slow heartbeat.Hiccups.A note from Cleveland ClinicCardiac implantable electronic device (CIED) replacement is surgery to replace a pacemaker or an implantable cardioverter defibrillator (ICD). Both devices control abnormal heart rhythms. In most cases, replacement is necessary when the device’s battery runs low (about every six to 10 years). Your healthcare provider removes the battery and replaces it with a new one during an outpatient procedure. The procedure is more complex if the entire device needs removal or replacement.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/29/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicHeart Failure TreatmentsFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"