"What is Cardiopulmonary Bypass?800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Cardiopulmonary BypassAdvertisementAdvertisementAdvertisementCardiopulmonary BypassCardiopulmonary bypass is a procedure that supports many surgeries, including CABG. Another name for it is being “on the pump,\" which means a heart-lung machine takes over for your heart and lungs during your surgery. The machine adds oxygen to your blood before pumping it back out to nourish your body.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is cardiopulmonary bypass?Cardiopulmonary bypass is a procedure that diverts blood circulation away from your heart and lungs. It’s a routine part of many heart surgeries. “Cardio” refers to your heart, and “pulmonary” refers to your lungs. “Bypass” means to avoid something by going around it. So, cardiopulmonary bypass allows your blood to avoid your heart and lungs during your surgery.Instead of flowing through your heart and lungs, your blood drains into a machine outside your body. This machine is a cardiopulmonary bypass machine, or a heart-lung machine. This machine takes over the jobs of your heart and lungs. These jobs include adding oxygen to your blood, removing carbon dioxide from your blood and then pumping this refreshed blood back into your body.Another name for cardiopulmonary bypass is being “on the pump.” Usually, if you’re on the pump, your surgeon will also use medication (cardioplegia solution) to stop your heart from beating. Cardiopulmonary bypass with cardioplegia allows your surgeon to perform surgery on a still (non-beating) heart. This procedure also allows the rest of your body to receive the oxygen-rich blood it needs to survive.Is cardiopulmonary bypass the same as CABG?No, they’re not the same. But they often occur together. And they both involve a “bypass,” or a detour around something.CABG stands for coronary artery bypass grafting. This surgery creates a detour around one or more blockages in your coronary arteries. It helps people who have plaque buildup due to coronary artery disease. Your surgeon creates a new path for blood to flow to your heart.Cardiopulmonary bypass is a procedure that often supports CABG. So, healthcare providers perform the procedures at the same time. Cardiopulmonary bypass creates a detour for blood to flow away from your heart and lungs. This helps your surgeon perform CABG more easily and safely.Who needs cardiopulmonary bypass?People who have the following surgeries may need cardiopulmonary bypass:Coronary artery bypass grafting (CABG).Aneurysm surgery.Heart transplant.Heart valve surgery.Lung transplant.Is cardiopulmonary bypass used during open-heart surgery?Typically, open-heart surgery requires cardiopulmonary bypass. But some people who need coronary artery bypass grafting (CABG) may benefit from off-pump bypass surgery. This type of open-heart surgery doesn’t use a heart-lung machine. Instead, your surgeon uses a device to stabilize your heart during the surgery. So, your heart still beats during the surgery. That’s why another name for off-pump surgery is “beating heart” surgery.Talk with your provider about the method that’s better for you.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow does cardiopulmonary bypass work?Cardiopulmonary bypass creates a circuit for blood to flow outside your body, avoiding your heart and lungs. The heart-lung machine takes over the functions of your heart and lungs throughout your surgery. Its key responsibilities include:Draining blood from your heart.Adding oxygen to your blood and removing carbon dioxide.Managing your blood’s temperature and electrolyte levels.Pumping oxygen-rich blood back into your body.Delivering medication that temporarily stops your heart.Protecting your heart throughout the surgery.Suctioning away and saving blood that’s lost during the surgery.Parts of a cardiopulmonary bypass machineThe cardiopulmonary bypass (heart-lung) machine consists of many parts, including:Tubes that connect your blood vessels to the machine. These tubes (called cannulas) drain oxygen-poor blood from your body into the machine. They also send oxygen-rich blood from the machine back into your body.Reservoir. This is a container that holds oxygen-poor blood that drains from your body.Oxygenator. The oxygenator acts as your lungs. It adds oxygen to your blood. Your body needs this oxygen to survive.Pump. The pump acts as your heart. It sends oxygen-rich blood from the machine back to your body through your aorta.Additional tubes connect the parts together. All of these parts form a circuit that replaces the usual work of your heart and lungs. So, to understand how the heart-lung machine works, it’s helpful to know how your heart and lungs normally manage blood flow.Normal blood flow through your heart and lungsEach time your heart beats, blood flows through your heart and lungs to gain oxygen. Oxygen-poor blood from your body enters your heart through large veins called your superior and inferior vena cava. These veins drain blood into the top right chamber of your heart (right atrium). From there, your blood flows through the right side of your heart and into your lungs.In your lungs, your blood gains oxygen before returning to the left side of your heart. The bottom left chamber of your heart (left ventricle) pumps this blood out to your body through your aorta.So, when this circuit is complete, your blood has traveled through both sides of your heart and your lungs. It now has oxygen and is ready to nourish your body.During some surgeries, your surgeon needs to access your heart without blood flowing through it. So, the normal circuit needs to pause. But your body still needs the oxygen-rich blood that the circuit provides. That’s where the heart-lung machine steps in.How the heart-lung machine worksThe heart-lung machine creates a detour outside your body for your blood to receive oxygen. The detour begins at the right side of your heart and works like this:Blood from your superior and inferior vena cava drains into tubes that connect to the machine’s reservoir.The blood passes into the oxygenator, where it gains oxygen.The machine pumps the blood back into your body through a tube connected to your aorta. The aorta is where your blood would normally enter after finishing its journey through your heart and lungs.Your surgical care team manages the heart-lung machine throughout your surgery. Your care team includes your surgeon, anesthesiologist and perfusionist. Perfusionists are medical professionals who have special training in managing cardiopulmonary bypasses.What happens during cardiopulmonary bypass?Your care team connects you to the heart-lung machine and monitors you throughout the surgery. After your surgery, your care team slowly weans you from the heart-lung machine so that your heart and lungs can begin working on their own again.To conduct cardiopulmonary bypass, your care team must perform the following steps:Remove air from the heart-lung machine by filling its tubes with priming solution or compatible blood. This prepares the machine to manage your blood flow and prevents complications. If there’s air in the tubes, an air embolism (bubble of air) could form as a dangerous complication.Give you a blood-thinning medication called heparin to lower your risk of blood clots. Normally, your blood flows through your blood vessels. Endothelial cells line your blood vessels. These cells release substances that prevent abnormal clotting. But when you’re on the pump, your blood flows through tubing that doesn’t contain these cells. It’s an artificial surface. So, you need blood-thinning medication while you’re on the pump to lower your risk of blood clots.Connect you to the heart-lung machine.Another name for this is going “on bypass.” At this point, your heart and lungs are also still working. Your team inserts tubes into your blood vessels to begin sending your blood into the machine. Your team checks to make sure everything is working as it should before stopping your heart and lungs.Stop your heart and lungs. Your team gives you cardioplegia, which is a medication that temporarily stops your heart from beating. They also turn off the ventilator that connects to your lungs. So, the heart-lung machine fully takes over for your heart and lungs.Monitor you during your surgery. You stay on the pump while your surgeon completes your surgery. The length of time varies depending on the surgery you need. Your team monitors your blood temperature and other numbers throughout.Wean you off the machine. After your surgery, your care team slowly weans you from cardiopulmonary bypass. They begin by restarting your heart and lungs. Then they ease you off the machine so your heart and lungs can fully take over.When you’re off the pump, your care team continues to monitor your levels before transferring you to the intensive care unit (ICU) for recovery.Care at Cleveland ClinicGet Heart SurgeryFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the advantages of cardiopulmonary bypass?Cardiopulmonary bypass allows your body to receive oxygen-rich blood during your surgery. It takes over the work of your heart and lungs so your surgeon can work in a still and bloodless space.Is cardiopulmonary bypass safe?As with any procedure involving your heart, cardiopulmonary bypass carries risks. Talk with your healthcare provider about the risks and how your surgical care team will manage them. In general, the risk of complications increases the longer you need to be on the pump. Your risk also depends on your health before the surgery.Possible complications include:Air embolism.Bleeding.Blood clots.Brain injury.Inflammation throughout your body.Lung injury.Kidney injury or kidney failure.Multi-organ failure.Pancreatitis.Pleural effusion.Stroke.AdvertisementHow long can a patient be on cardiopulmonary bypass?Surgeons try to keep people on cardiopulmonary bypass for the shortest time possible. Generally, your risk of complications is lower if you’re on the pump for under three hours.Recovery and OutlookWhat can I expect as I recover?Your healthcare provider is the best person to ask about your recovery. It varies based on the type of procedure you had, your medical history, your age and how long you were on the pump. Talk with your provider about what you can expect after your surgery.When to Call the DoctorWhen should I see my healthcare provider?Your provider will tell you when you need to come in for follow-up appointments. Be sure to keep all of your appointments and follow your provider’s instructions closely. Call your provider any time you have questions or concerns about your recovery.Call 911 or your local emergency number if you have symptoms of a stroke. These include:Loss of balance or trouble walking.Numbness or weakness on one side of your body.Slurred speech.Sudden confusion.Trouble seeing clearly.Trouble understanding others’ speech.A note from Cleveland ClinicCardiopulmonary bypass helps surgeons perform life-saving operations every day. It’s an essential part of medical practice. But even though it’s common, you might still feel nervous about a machine taking over for your heart and lungs. Share any questions and concerns with your provider. The more you learn about your surgery and the role of cardiopulmonary bypass, the more comfortable you may feel on the day of your surgery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/31/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Heart SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"