"Carotid Endarterectomy: Treating Carotid Artery Disease800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Carotid EndarterectomyAdvertisementAdvertisementAdvertisementCarotid EndarterectomyA carotid endarterectomy removes plaque (fat and cholesterol) buildup from inside your carotid artery, improving blood flow to your brain. This can help prevent another stroke in someone who’s already had one. Even with treatment, you’ll still need to improve your diet, start exercising and reduce your stress level to prevent future plaque buildup.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a carotid endarterectomy?A carotid endarterectomy is the surgical removal of plaque (fat and cholesterol buildup) from inside your carotid artery, which supplies blood to your brain and your face. There’s one carotid artery on either side of your neck. Blood flow inside your carotid arteries can slow down or stop when plaque collects in your artery walls. If enough blood can’t reach your brain, you can have a stroke.If you have a stroke, it’s important to get to an emergency room to get prompt medical treatment within three to six hours.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs to have a carotid endarterectomy?To see if a carotid endarterectomy is a treatment that makes sense for you, a vascular surgeon will:Evaluate you.Review your medical history.Perform diagnostic tests.You and your healthcare provider will decide whether to proceed with surgical therapy. A vascular surgeon performs this procedure in a hospital surgical suite.Your healthcare provider may recommend a carotid endarterectomy if you:Have carotid artery disease.Had a transient ischemic attack (TIA) or a mild stroke due to significant carotid artery disease.Have severe narrowing or blockage (usually at least 80%) in your carotid artery but have not had symptoms related to this disease.If a carotid endarterectomy surgery isn’t the right treatment for you, your provider may want to check your carotid artery once a year. You may need to improve your diet to bring your cholesterol level down and start taking blood thinners like aspirin or clopidogrel to prevent a stroke. Your provider could also perform an angioplasty (which pushes plaque against your carotid artery walls for better blood flow) and put in a stent (mesh tube) to keep your carotid artery open.Why is carotid endarterectomy done?Your provider may have seen a lot of plaque buildup in an ultrasound of your carotid artery or you may be having issues with poor blood flow in that area. A carotid endarterectomy clears plaque from your carotid artery so you can get better blood flow to your brain. This helps prevent a stroke, which is the fifth leading cause of death in the U.S.AdvertisementWhat does this procedure treat?Carotid endarterectomy is a surgery that’s a carotid artery disease treatment.How common is this procedure?Carotid endarterectomy is the most commonly performed surgical treatment for carotid artery disease.AdvertisementProcedure DetailsRemoving plaque from inside your carotid artery.What happens before a carotid endarterectomy?In addition to a physical exam, you may have tests a few days before your procedure to ensure it’s safe to perform the surgery. Your surgeon may order a cerebral angiogram to better define your brain’s anatomy. A cerebral angiogram is an invasive diagnostic test that produces X-ray pictures of the inside of blood vessels in your head.In many instances now, however, your healthcare provider may get this information from either a CT angiography or MR angiography. These are noninvasive methods to obtain information about your carotid arteries and your brain, and these can be performed without risk of stroke.You may need to stop taking certain medications before your carotid endarterectomy, so be sure to tell your healthcare provider about everything you're taking (including nonprescription drugs, herbs and supplements). Your healthcare team will give you specific instructions to help you prepare for your procedure. Most people will remain on aspirin through the procedure. It’s important to check with your healthcare provider before stopping aspirin or clopidogrel if you’re on these medications.You should also stop using tobacco products before your surgery.What happens during carotid endarterectomy?A carotid endarterectomy normally takes approximately two hours.Your healthcare provider will give you general anesthesia (like being asleep) or regional anesthesia, which means you’re awake but the area to be operated on is numbed. If you get regional anesthesia, you’ll also receive medicine to help you relax.The surgeon takes these carotid endarterectomy steps:Makes an approximately 4-inch incision in your neck at the site of the blockage.May use a tiny tube to temporarily reroute blood flow around the blockage or narrowing and isolates the area.Makes an incision along the portion of the artery containing the plaque.Removes the plaque and stitches the opening closed, typically using a patch of material to widen the artery and prevent narrowing from happening again.Restores blood flow to the brain through its normal path.What happens after carotid endarterectomy?Most people stay overnight in the hospital to watch for problems after their procedure.You may have a temporary drain in your neck to remove fluid where your provider made an incision. This drain will usually only stay in for one day.Your healthcare provider will discuss the results of your procedure with you. For most people, this procedure helps prevent further brain damage and reduces the risk of stroke. However, unless you adopt a healthier lifestyle, plaque buildup, clot formation and other problems in the carotid arteries can return.Care at Cleveland ClinicCarotid Artery Stenosis TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of carotid endarterectomy?A carotid endarterectomy can be highly beneficial in preventing future strokes if you've already had one, possibly cutting your risk by one-third in the three years after surgery. Most people tolerate the procedure well.Even with a successful procedure, your healthcare provider might recommend:Improving your diet.Starting to exercise (if it’s safe).Not using tobacco products.Cutting down your stress level.Taking medicine to lower your cholesterol level.These steps can help keep plaque from building up again.What are the risks or complications of carotid endarterectomy?As with any surgery, there is a risk of complications, including:Bleeding.Infection.Blood clots.Nerve damage.Seizures.Brain damage.Future artery blockage.Stroke. (This happens in 5% to 7% of people who already had a stroke or mini-stroke and 2% to 3% of those who did not.)Heart attack.However, with an experienced surgeon, there's minimal risk.The risks of a carotid endarterectomy vary, depending on:The severity of your carotid artery disease.The location of the blockage.Whether you've had a previous stroke.The presence of other coexisting medical conditions, such as diabetes or kidney disease.Your age. (Older people are at a higher risk.)Your gender. (People assigned female at birth may have a higher risk of complications.)If your healthcare provider recommends this surgery as a treatment option for you, talk with them about why they recommend the procedure, the benefits and risks, and the hospital's surgical outcomes.While the operation can result in some neck pain for about two weeks afterward, you can take standard, over-the-counter pain medications to relieve it.Recovery and OutlookWhat is the recovery time?Recovery from a carotid endarterectomy is rapid. Most people go home the day after the procedure. After you get home, it’s OK to shower. Just don’t scrub the surgical glue or let the stream of water hit it.Check your incision daily and avoid putting any lotions on it. Avoid wearing clothes that rub against your incision.You can go back to most of your normal activities in three or four weeks. You can drive after your incision heals and it doesn’t feel uncomfortable to turn your head. The area near your jawline and earlobe may feel numb for six months to a year.When to Call the DoctorWhen should I see my healthcare provider?Contact your healthcare provider if you have:Chills or fever.Blood or yellow or green mucus when you cough.Trouble swallowing.Chest pain.Swollen legs.A hard time being able to see.Dizziness.Weakness or numbness in your body.Shortness of breath.Redness on your incision or green or yellow discharge coming out of it.A headache, confusion or difficulty speaking or understanding others’ words.A note from Cleveland ClinicIf you’ve had a stroke or have carotid artery disease, a carotid endarterectomy can improve your blood flow and help prevent a future stroke. You and your healthcare provider can decide if this surgery is right for you. Even if it is, you’ll have more success at managing carotid artery disease if you improve your diet, exercise more and bring down your stress level. Be sure to go to your follow-up appointments and keep taking your prescribed medicines, too.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/22/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicCarotid Artery Stenosis TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"