"Carotid Artery Disease: Carotid Stenting800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Carotid Artery Disease: Carotid StentingAdvertisementAdvertisementAdvertisementCarotid Artery Disease: Carotid StentingContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookAdditional DetailsOverviewShazam Hussain, MD, describes the process of carotid stenting procedure, recovery time, and risk factors.What is carotid artery disease?Like the blood vessels of the heart (coronary arteries), the carotid arteries also develop atherosclerosis, the build-up of fat and cholesterol deposits, called plaque, on the inside of the arteries. Over time, the build-up narrows the artery, decreases blood flow to the brain and can lead to a stroke.Read more about carotid artery disease.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is carotid angiography?Carotid angiography, also called carotid angio or an arteriogram, is an invasive X-ray imaging procedure used to detect the presence of narrowing or blockage (atherosclerosis) in the carotid arteries and determine your risk for future stroke.Carotid angiography may be performed when carotid artery disease is suspected, based on the results of other tests, such as a carotid duplex ultrasound, computed tomography angiogram (CTA) or magnetic resonance angiogram (MRA).What is carotid angioplasty and stenting?Carotid angioplasty is a non-surgical procedure performed after the diagnostic angiogram. The carotid angioplasty procedure can be performed the same day as the diagnostic angiogram or days or weeks after the angiogram.During angioplasty, a balloon catheter is guided to the area of the blockage or narrowing. When the balloon is inflated, the fatty plaque or blockage is compressed against the artery walls to improve blood flow.During the angioplasty procedure, a carotid stent (a small, metal mesh tube) is placed inside the carotid artery at the site of the blockage and provides support to keep the artery open.For patients who meet certain eligibility criteria, carotid stenting offers a less invasive approach than carotid endarterectomy, the traditional surgical treatment for carotid artery blockages. Carotid stenting can be performed while the patient is awake, reducing recovery time.AdvertisementProcedure DetailsWhat happens during the carotid angiography procedure?A medication such as heparin may be given during the procedure to reduce the risk of blood clots. You also may need to take aspirin and/or Plavix (clopidogrel bisulfate) for three to five days before the procedure and for four to six weeks after the procedure. Your doctor or nurse will give you specific instructions about what you can and cannot eat or drink prior to the procedure.First, the doctor anesthetizes or numbs the area where the introducer sheath will be inserted. The sheath is a thin, hollow tube that is inserted into a blood vessel in the leg (femoral approach) or arm (brachial approach).A long, narrow tube called a catheter is inserted through the sheath, and is guided through the aorta to the carotid artery with the aid of a special X-ray machine.Some patients may have a second sheath placed in the leg or arm vein where a temporary pacemaker wire is placed in the heart to regulate the heart rhythm during the procedure.Contrast material is injected through the catheter and X-ray movies are created as the contrast material moves through the carotid arteries (vessels that provide circulation to your brain). The digital photographs of the contrast material are used to identify the site of the narrowing or blockage.If the diagnostic tests show severe narrowing or a blockage in the carotid artery, the carotid angioplasty and stenting procedure may be performed to open the artery, or surgery may be recommended.What happens during the carotid angioplasty and stenting procedure?A specially designed guide wire with a filter is placed beyond the site of the narrowing or blockage in the carotid artery. Once the filter is in place, a small balloon catheter is guided to the area of the blockage. When the balloon is inflated, the fatty plaque or blockage is compressed against the artery walls and the diameter of the blood vessel is widened (dilated) to increase blood flow. The balloon is removed and the stent is placed inside the artery to widen the opening and support the artery wall.Endotex Carotid StentSMART Nitinol StentG__uidant ACCULINK Carotid Stent SystemAfter the stent is placed, an angiogram is performed to confirm that the stent has completely expanded and the narrowing or blockage has been corrected. Often, a second balloon catheter is inflated to ensure the stent is maximally opened. The stent stays in place permanently and acts as a scaffold to support the artery and keep it open. After several weeks, the artery heals around the stent.In clinical trials at Cleveland Clinic, several types of carotid stents have been used along with a device called the embolic protection device (EPD). The EPD looks like an umbrella or wind sock and contains a basket to catch plaque particles dislodged during the stenting procedure. Catching these particles prevents them from traveling in the blood to the brain and reduces the risk of a blood clot or stroke.AdvertisementWhat happens after the carotid stenting procedure?The sheath may remain in place or a vascular plug or suture may be used to achieve hemostasis.You will be required to lay flat (without bending your legs) after the sheath is removed. This is necessary to prevent bleeding. You may receive medication to reduce discomfort. Your doctor will determine how long you will have to lay flat, which could be from two to six hours.Plan on staying overnight in the hospital after the procedure. You will be evaluated by your doctor, have a neurological exam, and have other tests, such as a carotid ultrasound, to evaluate the results of the procedure. Your doctor will discuss the results of the procedure with you and your family.Before you go home, you will be given instructions about your medications, diet, activity, and when to call your doctor.Your doctor will prescribe aspirin and Plavix (clopidogrel bisulfate) to take for one month after the procedure. These medications help prevent blood clots from forming at the site where the stent was placed. Follow your doctor’s instructions about how and when to take these medications. Do not stop taking these medications without first talking to your doctor.You will need to take it easy for a few days after the procedure. You may climb stairs, but use a slower pace. Do not strain during bowel movements. Gradually increase your activities until you reach your normal activity level by the end of the week.Care at Cleveland ClinicCarotid Artery Stenosis TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the risks of the procedure?Your doctor will discuss the specific risks and potential benefits of the procedure with you. The risks vary, depending on the severity of your disease, location of the blockage, whether you’ve had a previous stroke and the presence of other medical conditions.Some of the possible risks include:Bleeding at the catheter insertion siteStroke or deathThere may be other possible risks. When you meet with your doctor, please ask questions to make sure you understand why the procedure is recommended and what the potential risks are.Recovery and OutlookWhat is restenosis?Restenosis is a return of a blockage or a re-narrowing in the treated carotid artery. It is more likely to occur in the first six to 12 months after treatment, so keeping your follow-up appointments is important. Restenosis is caused by the accumulation of scar tissue at the treatment site. The rate of restenosis, as reported in current clinical research, is one percent per year.If you have symptoms similar to what you experienced before the procedure, call your doctor as soon as the symptoms occur.Does the carotid stenting procedure cure carotid disease?For most people, the carotid angioplasty and stenting procedure increases blood flow to the brain and decreases the risk of a stroke. Although the carotid stenting procedure opens up a blocked carotid artery, it does not CURE carotid artery disease. You will still need to focus on reducing your risk factors and making certain lifestyle changes to prevent future disease development or progression.To achieve the best results, you must be committed to living a healthy lifestyle that includes quitting smoking, taking medications as prescribed, taking and recording your blood pressure, following a heart-healthy diet, managing high blood pressure, cholesterol and diabetes and following up as recommended with your healthcare team.Additional DetailsHow long has the carotid stenting procedure been performed?The stenting procedure has been performed in clinical trials at Cleveland Clinic since the procedure was introduced in 1994 as an investigational treatment for carotid artery disease.In 2004, the carotid stenting procedure was approved by the FDA as a treatment option for select patients who have carotid artery stenosis and meet certain criteria. The procedure is approved for patients who are experiencing symptoms, have a carotid artery that is blocked 70 percent or more, and for whom surgery would be highly risky.Research is still ongoing to compare the results of the carotid stenting procedure with that of the carotid endarterectomy surgery. Most recently, a large randomized trial called the CREST trial compared the two treatment options and found that there were no significant differences in major risks of the two treatments.Common Questions About the Carotid Stenting ProcedureHow can I find out if I am eligible for the procedure?If the carotid stenting procedure is recommended as a treatment option, you will be evaluated to determine if you meet the eligibility requirement for this procedure. Some carotid stenting procedures are performed as research procedures. You may also ask your doctor if you meet the criteria to participate in a research protocol or clinical trial.If you are an eligible candidate for the carotid angioplasty and stenting procedure, your doctor and nurse will give you more information about what to expect before, during and after the procedure.Will my insurance cover the costs of the procedure?Some carotid stenting procedures are covered by Medicare and private insurance companies, but not all stenting procedures are covered. It is best to check with your insurance provider about your specific policy coverage.Will I be awake during the procedure?Yes. You will awake and conscious during the entire procedure. The doctor will use a local anesthetic to numb the catheter insertion site.Where is the procedure performed?Carotid angiography, angioplasty and stenting are performed in a special laboratory procedure room.Who performs the procedure?The procedure is performed by a specially-trained interventional cardiologist, vascular invasive physician, or vascular surgeon.How long does the procedure last?The procedure usually lasts about two hours, but the preparation and recovery time add several hours. Please plan to stay at Cleveland Clinic all day for the procedure, and remain in the hospital overnight.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/18/2019.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicCarotid Artery Stenosis TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"