"Catheter Ablation: Purpose, Procedure, Risk and Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Catheter AblationAdvertisementAdvertisementAdvertisementCatheter AblationHeart arrhythmias (irregular heartbeats) that can’t be controlled with medication may benefit from catheter ablation. This minimally invasive procedure stops the electrical impulses that cause irregular heart rhythms.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is catheter ablation?Catheter ablation is a minimally invasive treatment for fast heartbeats. A catheter is a thin tube inserted through a blood vessel to your heart. Catheter ablation is one type of heart ablation procedure used to treat abnormal heart rhythms (arrhythmias). Ablation is a technique used to strategically destroy abnormal tissue and restore proper function to your heart.A cardiologist (a doctor who specializes in treating heart conditions) performs catheter ablation. The procedure uses hot or cold energy to create scars in your heart tissue where the arrhythmia is occurring. The scars help block abnormal electrical impulses and prevent abnormal rhythms.The scars only destroy tissue involved with faulty heart patterns. They don’t cause any residual pain or create problems with your heart’s function.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat conditions does catheter ablation treat?Catheter ablation treats all types of fast heart arrhythmias. Your cardiologist may suggest catheter ablation if you have an abnormal heart rhythm that medication can’t treat.Types of arrhythmias treated with catheter ablation include:Atrial fibrillation (AFib) and atrial flutter: AFib and atrial flutter cause the upper chambers of your heart (called the atria) to beat irregularly and ineffectively. The atria quiver instead of contracting. This lack of contraction prevents blood from pumping through your heart properly. AFib can cause clots that increase your risk of stroke because the blood becomes stagnant in your left atrium.Supraventricular tachycardia (SVT): People with SVT experience episodes of fast, irregular heartbeats (up to 300 beats per minute). Your heart can still pump blood normally, but repeated, or long-lasting, bouts of SVT can damage your heart.Ventricular tachycardia (VT): The lower chambers, called ventricles, can start to beat rapidly and independently, which is a potentially very dangerous arrhythmia that many times leads to cardiac arrest.Healthcare providers may also recommend catheter ablation if you are at high risk of:Ventricular fibrillation (V-Fib): An ineffective and irregular heartbeat originating in the ventricles (lower heart chambers).Sudden cardiac arrest: When your heart stops without warning.Who is a candidate for catheter ablation?Catheter ablation is not usually the first line of treatment for people with arrhythmias, such as AFib. But if you have tried at least one medication to control your arrhythmia, without success, your cardiologist may recommend catheter ablation.AdvertisementHow common is catheter ablation?Catheter ablation is an increasingly common procedure for those with heart arrhythmias.Procedure DetailsWhat are the types of catheter ablation procedures?Catheter ablation uses either hot or cold energy to scar heart tissue. Your provider will choose the method they are most comfortable with and that is most appropriate for your condition. You’ll receive sedation or possibly general anesthesia during the procedure and won’t feel any extremes of hot or cold.The types of catheter ablation include:Radiofrequency ablation: Radiofrequency delivers heat energy to heart tissue.Cryoablation: Cryoablation uses cold energy to freeze and scar heart tissue.AdvertisementWhat happens before catheter ablation?Your provider will thoroughly evaluate your heart and overall health to choose the best procedure to treat the arrhythmia that affects you.In preparation for the procedure, your provider will give you specific instructions. You may need to:Stop blood-thinning medications (like aspirin or warfarin). Follow your provider’s guidance and stop these medications only as directed.Not eat or drink for several hours before your procedure. Your provider will give you exact instructions.Wear comfortable clothing and leave jewelry and valuables at home.Arrange for someone to pick you up and take you home after the procedure.What happens during catheter ablation?A cardiologist performs catheter ablation in the hospital. You will need to stay at the hospital for six to eight hours after the procedure. Depending on your condition, you may go home that day or spend the night at the hospital.A nurse will help get you ready for the procedure by inserting an intravenous (IV) line into your arm. You can receive medicine through the IV line, including anesthesia. You may be awake during the procedure but you’ll at least receive sedation as you might in a colonoscopy. You may be placed under general anesthesia depending on the type of procedure you’re undergoing. Your doctor will discuss this with you and will schedule this appropriately.Your cardiologist:Inserts a small tube (called a sheath) through the skin and into a vein to create an opening. Usually, providers use a vein or an artery in your groin. Sometimes they go through veins in your arm or neck.They then insert the electrode catheters (thin tubes with wires) into the sheath. They thread the catheters through your vein or artery and up to your heart (using X-rays to guide them).Uses the catheter to deliver hot or cold energy to the areas of your heart causing irregular rhythms. The catheter destroys the abnormal heart tissue to block those irregular rhythms.Removes the catheter and sheath from your vein or artery.Where is the catheter inserted for cardiac ablation?In most cases, your provider inserts the catheter into a large vein or artery in your groin. Sometimes, providers choose to use a vein in your arm or neck instead. Your provider will decide on the best location based on your anatomy and condition.Does catheter ablation hurt?Catheter ablation generally is associated with very transient and mild discomfort. Many ablations are associated with little or no discomfort from the ablation at all. The site where the catheter went into your vein may be sore and have a bruise. The puncture is very small and should heal quickly.As your heart tissue heals and recovers, you may continue to feel irregular heart rhythms for a few weeks. This is normal. You should alert your doctor if you have any questions or concerns about anything you’re feeling after an ablation procedure.What happens after catheter ablation?Catheter ablation can take two to four hours to complete. After the procedure, you move to a recovery room and stay there for several hours. A nurse monitors your condition while you recover.When it’s time to go home, you’ll receive detailed instructions about at-home care. Your provider may prescribe aspirin or other blood-thinning medication to help prevent blood clots. You may take this medicine for several months or longer after the procedure, depending upon your unique history.Care at Cleveland ClinicArrhythmia TreatmentsFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of catheter ablation?Catheter ablation is a minimally invasive procedure that usually doesn’t require a prolonged hospital stay. It can offer success beyond medical therapy for many people. If you have an arrhythmia that isn’t controlled with medications, catheter ablation can restore normal heart function and can even be lifesaving in some cases.What are the risks of catheter ablation?The risks of catheter ablation are low. Complications after catheter ablation are rare. Possible risks include:Blood clots.Damage to the vein from the sheath or catheter.Damage to heart tissue or heart valves.Infection or bleeding.Stroke.The need for a permanent pacemaker.You do receive some radiation during radiofrequency catheter ablation. If you are pregnant, consult with your provider about whether you can safely wait to have the procedure after your baby is born.Recovery and OutlookWhat is the recovery time after catheter ablation?It can take several weeks to heal completely. You may continue to experience arrhythmias while your heart tissue heals.When can I go back to work and resume other activities?Unless your job involves heavy lifting or other physical labor, you will likely feel ready to return to work five to seven days after your procedure.You should avoid heavy lifting and strenuous exercise for at least a week. Consult with your provider about when it’s safe to return to physical activity.When to Call the DoctorWhen should I call the doctor?You should call your healthcare provider if you experience:Bleeding at the puncture site where your healthcare provider inserted the sheath and catheter.Chest pain.Dizziness or lightheadedness.Nausea or vomiting.Numbness or tingling in your leg (if the puncture site is in your groin).Racing heart rate.Swelling or pain at the puncture site.A note from Cleveland ClinicCatheter ablation uses hot or cold energy to destroy areas of heart tissue. The scarred tissue can no longer create abnormal heart rhythms. The procedure generally has low risk, except in very sick individuals, and works well for many people. This minimally invasive procedure can be lifesaving for people with arrhythmias.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/05/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicArrhythmia TreatmentsFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"