"Caudal Injection: Steroid Injection, Epidural Injection & Back Pain Relief 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Caudal InjectionAdvertisementAdvertisementAdvertisementCaudal InjectionCaudal injections are a type of epidural injection administered to your low back. The shot contains a steroid that reduces pain and inflammation. Caudal injections are outpatient procedures, meaning you can go home the same day. Most patients have minimal downtime and experience back pain relief within a few days.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a caudal injection?A caudal injection is a steroid injection into your low back. The shot goes into the lower part of your epidural space (sleeve-like area that surrounds your nerve roots). The injection contains a steroid medication that reduces inflammation and decreases low back pain.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is a caudal epidural injection done?Your spinal nerves run through the epidural space to connect with your legs. If these nerves become inflamed, you may experience leg or back pain. Injecting medicine into the epidural space can decrease this nerve pain.What conditions does a caudal injection treat?A caudal injection treats nerve pain and inflammation. Causes of nerve pain and inflammation may include:Spinal canal stenosis.Failed back syndrome or postlaminectomy syndrome.Herniated disks.Degenerative disk disease.Sciatica or RadiculopathyAdvertisementProcedure DetailsWhat happens before a caudal injection?Before a caudal injection, your provider will ask for a complete health history and medication list. It’s important to share all your current medications and supplements. Some medications or supplements thin your blood, which increases bleeding risks. You will likely need to stop taking these medications a few days before the injection.You will also need a ride home from your injection appointment. You should not drive for at least 24 hours after a caudal injection.What happens during a caudal injection?During a caudal injection:You lie face-down on an X-ray table. You may use a pillow under your abdomen for increased comfort.A pain management specialist applies a topical anesthetic (numbing medication) to your lower back. You won’t feel anything during the procedure.The specialist uses a needle to inject dye into the epidural space.Your provider uses an X-ray to view the dye and see exactly where the medicine should go.Using a needle, your provider injects steroid medication into your epidural space.AdvertisementWhat happens after a caudal injection?A caudal injection is an outpatient procedure, meaning you can go home the same day. The entire process usually takes only 15 to 30 minutes.Typically, you need to avoid strenuous activity and driving for the first 24 hours after the injection. You may notice some soreness near the injection site. Many people experience back pain relief within two to three days.Risks / BenefitsWhat are the advantages of a caudal epidural injection?Caudal injections are an effective pain management treatment for many people. These types of steroid injections can help you increase function while avoiding surgery. By decreasing pain, caudal injections may make it possible for you to take part in other treatments, such as physical therapy.What are the risks or complications of a caudal injection?Caudal injections are generally very safe. There are small risks which include:Bleeding around the injection site.Headache.Infection around the injection site.Recovery and OutlookWhat is the recovery time after a caudal injection?You can resume your usual activities 24 hours after a caudal injection. For many people, pain relief goes away after only a few days. But it may take up to 10 days for you to notice a difference.How often do I need a caudal injection?Some people experience significant pain relief after only one cortisone shot. If you still have pain, your provider may order up to two more injections to increase the effects. These injections may occur two to four weeks apart.For some people, a caudal injection provides permanent pain relief. Others may need steroid injections a few times a year. Your healthcare provider can tell you how periodic steroid injections may fit into your pain management plan.When to Call the DoctorWhen should I see my healthcare provider?If the back pain hasn’t improved after two weeks, speak with your healthcare provider. A different type of steroid or medication may be more helpful.Your healthcare provider may also recommend other options for managing pain, such as:Hot and cold therapy.Massage therapy.Muscle relaxants.Nonsteroidal anti-inflammatory drugs (NSAIDs).Physical therapy.Surgery such as spinal decompression surgery or laminectomy.A note from Cleveland ClinicCaudal injections are steroid shots administered to the low back. They can relieve nerve pain and inflammation. Caudal injections are quick, outpatient procedures. They typically only require 24 hours of downtime. Many people experience pain relief within a few days. Some people may experience total pain relief from one injection. Others may need injections from time to time. If you still have low back pain after a caudal injection, speak with your healthcare provider about alternate treatment options.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/09/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7243Questions 216.444.9134Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"