"Celiac Plexus Block: What It Is, Risks & Benefits800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Celiac Plexus BlockAdvertisementAdvertisementAdvertisementCeliac Plexus BlockA celiac plexus block relieves severe abdominal pain caused by pancreatic cancer. It’s a type of nerve destruction that stops the celiac plexus nerves in the abdomen from sending pain signals to the brain. Some varieties of celiac plexus block provide temporary pain relief, while others offer long-term relief.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a celiac plexus block?A celiac plexus block is a pain relief treatment delivered by injection. The treatment prevents celiac plexus nerves from sending pain messages to the brain. It’s a type of nerve block.Healthcare providers use celiac plexus blocks to treat people who have pancreatic cancer or chronic pancreatitis. These conditions can cause severe abdominal pain.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is the celiac plexus?The celiac plexus is part of the nervous system. This bundle of nerves in the upper abdomen sits behind the pancreas close to the aorta, the body’s largest blood vessel.Celiac plexus nerves send signals to the brain and spinal cord from digestive system organs, including the:Gallbladder.Intestines.Liver.Pancreas.Stomach.What does a celiac plexus block treat?Healthcare providers use a celiac plexus block to ease severe abdominal pain caused by pancreatic cancer. Cancerous tumors can put pressure on the celiac plexus, causing pain.People with chronic pancreatitis may also need a celiac plexus block to alleviate severe upper abdominal pain or back pain. Inflammation (swelling) of the pancreas causes pancreatitis.AdvertisementWhat’s the difference between a celiac plexus block and a neurolytic celiac plexus block (neurolysis)?With a celiac plexus block, a healthcare provider injects steroids or an anesthetic into the nerves. The medication provides temporary pain relief. When pain returns, you may need more treatments. Your provider may recommend this treatment if you have pancreatitis.A neurolytic celiac plexus block, or neurolysis, permanently damages the celiac plexus nerves. Your provider injects an alcohol substance, such as ethanol or phenol, into the celiac plexus. The alcohol destroys the nerves, making them unable to send pain signals to the brain or spinal cord. Your provider may recommend this treatment if you have pancreatic cancer.Procedure DetailsWhen will I have a celiac plexus block?For many people, a celiac plexus block is an outpatient procedure to relieve pain. You may have it at any point during treatment for pancreatic cancer.Your provider may also perform a celiac plexus block during surgery or during an endoscopic ultrasound.AdvertisementHow should I prepare for a celiac plexus block?You should follow your healthcare provider’s recommendations about what to do before the procedure. You may need to:Stop taking certain medicines like blood thinners.Fast (not eat or drink) before the procedure. Anesthesia is safer on an empty stomach.Cut back on alcohol and quit smoking. These substances increase the risk of complications.What happens during a celiac plexus block?A nerve block procedure can take up to one hour, although the actual injections are often over in a few minutes. Celiac plexus block is an outpatient procedure, so you go home the same day. Someone will need to drive you home and should stay with you during the day.The procedure typically takes place while you lie prone on your stomach with a bolster (pillow) underneath your hips. If it hurts too much to be on your stomach, you may be on your back (supine position). You will receive an intravenous medication (a sedative) to relax you.Your healthcare provider will use imaging scans from fluoroscopy X-rays, a CT scan or endoscopic ultrasound to guide the procedure.Your provider:Sterilizes the treatment area with an antiseptic and numbs it with a local anesthetic.Inserts a needle into the back and confirms correct needle placement by injecting a small amount of contrast dye, which shows up on the imaging scan. You may have some discomfort and feel a slight pinch.Withdraws the needle and uses a different needle to inject a pain medicine (anesthetic) or steroid into the treatment area to numb the nerves.Uses a different needle to inject alcohol into the celiac plexus (for a neurolytic procedure). The injection damages the nerves, preventing pain signals from traveling to the brain.What happens after a celiac plexus block?Most people get pain relief within 15 to 30 minutes after getting a nerve block. You’ll need to stay at the office for 1 to 2 hours to make sure you don’t have any complications.Potential side effects may include:Bruising, swelling or soreness.Infection at the treatment site.Diarrhea.Low blood pressure.Muscle spasms.Risks / BenefitsWhat are the potential risks or complications of a celiac plexus block?A celiac plexus block rarely causes problems. When serious complications occur, they may include:Allergic reaction to anesthesia or the contrast dye.Decreased blood flow to the spinal cord.Delayed emptying of stomach contents (gastroparesis).Kidney damage or other organ damage.Nerve damage.Paralysis due to a spinal cord injury.Seizures.What are the benefits of a celiac plexus block?People who have pancreatic cancer or pancreatitis may need a celiac plexus block to manage extreme abdominal pain. About 3 out of 4 people have significant abdominal pain at the time they receive a pancreatic cancer diagnosis. Eventually, this pain affects 9 out of 10 people.Healthcare providers typically prescribe strong pain medicines to manage this pain. But these medications can cause uncomfortable side effects like confusion, constipation and nausea. With a celiac plexus block, you may be able to reduce the medication dose or amount.Even with medicine, more than half of people still have pain. Periods of intense pain, called breakthrough pain, can occur. A celiac plexus block can decrease the frequency of breakthrough pain.Recovery and OutlookWhat is recovery like after a celiac plexus block?Most people resume normal activities within 24 to 48 hours after the procedure. You shouldn’t drive or do any strenuous exercise or lifting for the first 24 hours.How long does a celiac plexus block provide pain relief?Pain relief from a nerve block varies by individual. Most people get 3 to 6 months of pain relief from a celiac plexus block. If pain returns, you can get another nerve block.A neurolytic celiac plexus block damages the nerves to provide long-term pain relief. You generally won’t need another treatment.When to Call the DoctorWhen should I call the doctor?You should call your healthcare provider if you experience:Dizziness, fainting, unusual thirst (dehydration) or other signs of low blood pressure.Shortness of breath.Signs of infection, such as fever or oozing and redness at the treatment site.Tingling, numbness or loss of feeling in the legs.A note from Cleveland ClinicPancreatic cancer can cause severe, chronic abdominal pain that can affect your quality of life. If pain medicines don’t provide adequate symptom relief or you have medication side effects, a celiac plexus block can help. The treatment damages the nerves, stopping them from sending pain signals to your brain. Your healthcare provider can discuss the pros and cons of this nerve block treatment with you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/03/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7243Questions 216.444.9134Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"