"Cervical Artificial Disc Replacement Surgery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Cervical Artificial Disk ReplacementAdvertisementAdvertisementAdvertisementCervical Artificial Disk ReplacementWhat is Artificial Disk Replacement?The goal of artificial disk replacement is to reduce pain and improve mobility in patients with cervical disk disease. This procedure is an option for certain people with cervical radiculopathy and/or myelopathy that have minimal degeneration of the disk.Spinal disks are located between the bones or vertebrae of the spine and act as cushions or shock absorbers for the vertebrae. The discs also contribute to the flexibility and motion of the spinal column. The discs consist of two parts:The inner portion: soft materialThe outer portion: a stronger, fibrous materialDuring the aging process, disks can weaken and develop tears or cracks in the outer portion, resulting in degenerative disc disease. Additionally, the inner portion may bulge out and press against the outer portion, resulting in pain. The purpose of artificial disk replacement is to replace the worn out disk while also preserving the spine’s motion.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the risks of treatment? Is the treatment safe?The Food and Drug Administration (FDA) has recently approved several devices for use in the United States. Several long-term follow-up studies have shown cervical artificial disks to be equivalent to fusion surgery and some studies have reported a decrease in problems at at adjacent disks.Risks of surgery are dependent on the individual, please discuss your risk level with your surgeon, prior to surgery.How do I prepare for surgery?Quit smoking if you smoke, exercise on a regular basis to improve your recovery rate, stop taking any non-essential medications and any herbal remedies which may react with anesthetics or other medications and ask your surgeon all the questions you may have.AdvertisementWhat should I do the night before surgery?There are no special requirements before this type of surgery other than not having anything to eat or drink after midnight. Some physicians require patients to undergo a bowel preparation. Be sure to ask your surgeon for any specific requirements before surgery.Are there exercises I can start now prior to surgery?Any activity that increases your level of fitness will make recovery easier. Walking, swimming, and cycling are great options.AdvertisementWhat happens during surgery?During surgery, a small incision is made on the front of the neck and the spine is easily exposed. The degenerated disk is removed, pressure is taken away from the nerves and the device is then implanted.What happens after surgery?Most patients are out of bed and walking on the evening of surgery. Hospital stay is one to two days. There are some activity restrictions for the first month and then patients can return to normal activities. Be sure to ask your surgeon for a complete list of activity restrictions.How long is the recovery period after surgery?Most patients have returned to regular activities between two to three weeks after surgery.What is the rehab after surgery?For most patients, a self-directed walking and stretching program is all the rehabilitation they need during the first weeks after surgery. Return to full activities (excluding contact sports) can be expected for most people by four to six weeks after surgery.How can I manage at home during recovery from the procedure?Most patients are able to return to activities of daily living by the second day after surgery.How frequently should I schedule follow up appointments with my doctor following surgery?Typically, patients are seen at four to six weeks, three months, six months, one year and once a year after the first year. Disk replacement patients will need to be seen every year or two for the life of the disk replacement, similar to patients with hip or knee replacements.What are the CCF physician credentials?All doctors at the Cleveland Clinic Center for Spine Health are fellowship-trained and board-certified or board-eligible in orthopaedic surgery, medical spine or neurosurgery. In addition, our surgeons have subspecialty training and years of experience in spine surgery. All surgeons performing artificial disk replacements have completed an additional training course.All Cleveland Clinic staff radiologists are board-certified or board-eligible in radiology or have the international equivalent.All Cleveland Clinic staff rehabilitation specialists are board-certified or board-eligible in physical medicine and rehabilitation, or have the international equivalent.How do I make an appointment?Call 216.636.5860 or toll free 1.866.588.2264.Are there other resources that I can go to for more information on the procedure?Patients can go to the following resources for more information on this procedure:Cleveland Clinic Health Information CenterAmerican Academy of Orthopaedic SurgeonsNorth American Spine SocietySpine Universe WebsiteWhy should I seek a second opinion regarding treatment for this procedure?As modern medical care grows more complex, patients can feel overwhelmed. The opportunity to consult a recognized authority about a particular diagnosis and treatment can bring peace of mind at an emotionally difficult time. A second opinion may be beneficial when:You are uncertain about having surgery.You still have questions or concerns about your current treatment.A controversial or experimental treatment is recommended.You have multiple medical problems.You have choices to make about treatment.A convenient way to obtain a second opinion is e-Cleveland Clinic, a contemporary adaptation of Cleveland Clinic’s 80-year tradition as a nationally designated referral center. An easy-to-use, secure, from-home second opinion service, e-Cleveland Clinic utilizes sophisticated Internet technology to make the skills of some of our specialists available to patients and their physicians, anytime, anywhere.With e-Cleveland Clinic’s personalized access, no patient need ever to feel unsure or uninformed when faced with what could potentially be one of the most important decisions of their life.Learn more about e-Cleveland Clinic.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/02/2019.Learn more about our editorial process.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"