"Cervical Ripening: Overview, Methods, Benefits & Risks800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Cervical RipeningAdvertisementAdvertisementAdvertisementCervical RipeningCervical ripening is the process of preparing the cervix for labor and delivery. A healthcare provider may recommend medication, mechanical dilators or other procedures to help soften and open the cervix.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is cervical ripening?Cervical ripening is a normal process of softening and opening the cervix before labor starts. The cervix is stiff and closed through most of pregnancy to hold your baby inside your uterus. But during labor, cervical dilation (widening) allows your baby to pass through your birth canal. Cervical ripening often happens on its own, naturally. Some women may benefit from assisted cervical ripening. This may come in the form of medicines, devices or procedures to ripen the cervix before labor begins.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs cervical ripening?People who have labor induced often benefit from cervical ripening. Induction (through medicine or procedures) trigger contractions to start labor. You might need labor induction and/or cervical ripening if you:Have an overdue pregnancy (pregnancy that lasts longer than 41 weeks).Have health risks that threaten your health or the health of the fetus. These may include preeclampsia, gestational diabetes or growth restriction.Live far from a hospital and need to plan your labor at a closer location.How does my healthcare provider know if I need cervical ripening?Healthcare providers use a scale called the Bishop score to determine the degree of cervical ripening. When your provider examines your cervix they can determine your Bishop score that can range from 0 to 13. They check to see if the cervix is softening, thinning and dilating as well as its position.A Bishop score of less than six means that your cervix isn’t very ripe. So, cervical ripening might be necessary. A Bishop score of more than eight means you’re body is getting prepared for labor to start. And you probably won’t need cervical ripening if your labor is induced.AdvertisementAt what stage of labor does cervical ripening happen?Cervical ripening usually begins before labor starts. During the first stage of labor your cervix will both thin and dilate. The second stage usually begins when your cervix is fully dilated and will allow your baby's head to pass by, which usually is 10 centimeters.Procedure DetailsHow is cervical ripening performed?There are a variety of ways to perform cervical ripening, including:Nonpharmacological methods (natural techniques not using medication).Medication.Special devices.Membrane stripping.AdvertisementAre there natural ways to ripen the cervix?Some women choose to ripen the cervix naturally in the weeks leading up to childbirth. It’s important to note that these techniques don’t have support from evidence-based research. So, you should talk to your healthcare provider before trying them. Nonpharmacological ripening methods may work by stimulating the release of hormone-like chemicals in your body. Natural ripening methods include:Acupuncture.Breast stimulation.Castor oil.Enemas (injection of water or liquid into the rectum to clear the colon).Herbal supplements.Hot baths.Sexual intercourse.Transcutaneous electrical nerve stimulation (TENS).How does medication ripen the cervix?Your healthcare provider may recommend synthetic (artificial) prostaglandins to ripen your cervix. Prostaglandins are naturally occurring chemicals in your body that have hormone-like properties. Synthetic and natural prostaglandins work to soften the cervix and relax cervical muscles, which helps with dilation.You may receive prostaglandins as a gel, pessary (vaginal insert) or pill. To apply gel, your provider inserts a catheter (thin, flexible tube) containing the gel into your cervix. You might need multiple applications (up to three doses in 24 hours).You may also receive prostaglandins as a pessary. A pessary is a device that fits into your vagina that contains prostaglandins. Your vagina absorbs the medicine as its released from the pessary. You might keep the pessary in for up to 12 hours, or until active labor starts.Other medications that can ripen the cervix include:Dinoprostone.Mifepristone.Misoprostol.Oxytocin.How do devices ripen the cervix?Dilators widen the cervix and exert pressure. These actions stimulate the release of natural prostaglandins. Your provider may insert an inflatable balloon into your cervix through a catheter. Then, they fill the balloon with saline or sterile water.How does surgery ripen the cervix?Procedures to ripen the cervix include:Amniotomy: Your provider uses a small hook to rupture the membranes around the amniotic sac. Breaking the sac can help release prostaglandins to enable cervical ripening.Stripping the membranes: Your provider inserts a gloved finger into your cervix. Then, they rub or separate the membranes connecting your uterus and amniotic sac. This technique releases prostaglandins and helps ripen the cervix.Risks / BenefitsWhat are the risks of cervical ripening?The different cervical ripening techniques each carry their own set of risks. The risks of medication are typically mild, but may include:Diarrhea.Fever.Nausea and vomiting.Too many contractions (hyperstimulation).Uterine hyperstimulation is a rare but serious side effect of some labor-inducing medications. They can cause prolonged or too frequent contractions and can threaten the health of the fetus.Risks of procedures for cervical ripening may include:Bleeding.Drops in fetal heart rate.Fetal injury or death.Infections in the mother or fetus.Umbilical cord prolapse (cord drops into the cervix) or compression (cord stretches or gets pressed, so it doesn’t deliver enough blood to the fetus).What are the benefits of cervical ripening?Cervical ripening helps shorten the length of labor.Recovery and OutlookWhat are the long-term effects of cervical ripening?Cervical ripening can help shorten the time to delivery and isn’t known to have any long-term impacts on your uterus. The reason why you need cervical ripening may increase your risks for c-section. Having a c-section may increase health risks for you or the fetus in future pregnancies.When to Call the DoctorWhen should I see my healthcare provider?Talk to your healthcare provider if you have questions about labor induction or cervical ripening. Never try to induce labor at home.Contact your provider if you experience any signs of premature labor or:Bleeding.Nausea or vomiting.Pain.Uterine contractions.A note from Cleveland ClinicCervical ripening is the process of softening and widening the cervix in preparation for childbirth. People who need labor induction are the most likely to need cervical ripening. There are several cervical-ripening techniques. They range from natural methods and cervical-ripening drugs to mechanical dilators and other procedures. Never try to induce labor or ripen the cervix at home.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/18/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"