"Cheek Filler: Benefits, Risks & What To Expect800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Cheek FillerAdvertisementAdvertisementAdvertisementCheek FillerCheek fillers increase cheek volume and define your cheekbones. Healthcare providers inject filler into and around your cheeks. The procedure takes from 15 minutes to two hours. You often see results immediately and recover quickly, though side effects may occur.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is cheek filler?Cheek filler is a nonsurgical cosmetic procedure that gives your cheeks a fuller, more defined look. A healthcare provider injects safe substances called dermal fillers around and above your cheekbones.Healthcare providers offer many kinds of cheek fillers. Your provider will discuss the best option for you based on your treatment goals.Cheek fillers usually take less than half an hour to inject. Depending on the type of filler you use, results can last a year or more. As with other cosmetic procedures, cheek filler injections have risks, including bleeding and bruising.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is cheek filler used?You may want cheek filler to:Define and enhance your cheekbones.Increase volume of your cheeks.Look more youthful.Plump up wrinkles.Smooth lines.What are the types of cheek filler?Different types of dermal fillers can enhance the appearance of your cheekbones. How the cheek fillers work depends on the type of filler your provider uses:Hyaluronic acid (HA): This is the most common filler. It’s a naturally occurring substance that exists in your skin. Skin loses HA levels as you age, resulting in wrinkles and loss of volume. Providers use HA injections to increase volume and to keep your skin hydrated. Results from HA fillers usually last about one year. HA injections include JUVÉDERM® and Restylane®.Calcium hydroxylapatite (CaHA): This is a naturally occurring substance that exists in your bones. Providers use CaHA injections to add fullness to your cheekbones and to smooth deeper lines and wrinkles. Results from CaHA fillers usually last about 15 months. Radiesse® is one brand that uses CaHA fillers.Poly-L-lactic acid (PLLA): This is a synthetic substance that helps your body make its own collagen. Providers usually use PLLA to treat deep wrinkles on your cheeks. Results from PLLA fillers usually last two years or more. One brand of poly-L-lactic fillers is Sculptra®.Polymethylmethacrylate (PMMA): These tiny collagen beads help your cheeks look firm and full. Providers use PMMA to bring firmness and structure to your cheeks. Results from PMMA can last for years, but your provider may need to inject them more than once. Bellafill® is a brand that uses PMMA.AdvertisementHow common is cheek filler?Cheek filler is very common. More than 3 million people opt for dermal fillers every year in the U.S.Who shouldn’t get cheek filler?You shouldn’t get cheek filler if you are pregnant or breastfeeding (chestfeeding), or if you have:Allergies to synthetic substances found in some dermal fillers.A bleeding disorder such as hemophilia or thalassemia.Certain autoimmune conditions.Certain infections such as an abscessed tooth, ear, nose or throat infections, or stomach flu (gastroenteritis).Certain skin diseases.Tuberculosis.AdvertisementProcedure DetailsWhat happens before a cheek filler procedure?Before you get cheek fillers, you’ll have a consultation. You may want to see a dermatologist or plastic surgeon who specializes in dermal filler injections.During the consultation, your provider will look at your face and ask about your treatment goals. They’ll suggest the most suitable cheek filler for you. They may suggest other cosmetic procedures to supplement cheek fillers.Your provider will ask about your medical history. You should tell them about:Allergies: You may need to avoid cheek fillers if you have certain allergies.Autoimmune conditions: Cheek fillers may cause complications if you have certain autoimmune conditions, including dermatomyositis, lupus and rheumatoid arthritis.Gastrointestinal conditions: Rarely, cases of lumpy swelling may occur in people with Crohn’s disease or ulcerative colitis.Medications and supplements: Nonsteroidal anti-inflammatory drugs (NSAIDs), blood thinners (anticoagulants) and some supplements can raise your risk of bleeding and bruising.Other cosmetic procedures: Previous fillers and injections can impact the amount and type of cheek filler your provider will use.Skin conditions: You may need to avoid cheek fillers if you have certain skin diseases or if your skin is extra sensitive.Smoking: You may heal slower if you smoke.Transplants: You may have an increased risk of infections if you’ve had a bone marrow transplant or organ transplant.Vaccinations: You may have swelling associated with some vaccinations.Your provider will discuss possible side effects and recovery time with you. They may mark your face to show where they’ll do the injections. They may also take pictures of your face to record before-and-after results.What happens during a cheek filler procedure?During a cheek filler procedure, your healthcare provider will clean your skin. Then, they may apply a lotion, cream, spray or cold packs to numb it. Some fillers already include a numbing agent.Your provider uses a thin needle to inject small amounts of filler beneath your skin. They may inject filler in several areas of your cheek. You may feel a small pinch or sting, but the cheek filler procedure doesn’t usually cause pain.A cheek filler procedure usually takes about 15 to 30 minutes.What happens after a cheek filler procedure?Your provider may apply cool packs to the areas of injection immediately after the cheek filler procedure. For a few days after cheek filler injections, you may have:Bruises.Discomfort.Swelling.With most types of cheek filler, you’ll usually see some results immediately after the procedure. But it often takes several days and sometimes several months to see full results. PLLA results can take up to two to three weeks.If you have a PMMA filler, you’ll need to massage the treated areas for about 5 minutes several times a day for one to two weeks.Care at Cleveland ClinicPlastic Surgery CareMake an AppointmentRisks / BenefitsWhat are the advantages of cheek filler?Compared to more invasive cosmetic surgeries, the advantages of cheek filler include:Immediate or near-immediate results.Less expense.Low risk of complications.Non-permanent results, so changes are possible.Quick procedure and recovery with little or no downtime afterward.What are the risks or complications of cheek filler?Cheek filler is a low-risk procedure, but complications may include:Bleeding.Bruising.Bumps that look like acne.Hives.Itchiness.Redness.Nodules.Swelling and tenderness.These complications are usually temporary and go away within a week or two.Cheek filler may also move to another part of your face. This can cause your face to look lopsided (asymmetrical) or lumpy. If this happens, your provider can often use another type of injection to dissolve the filler.More serious complications may include:Allergic reaction to the filler.Infections.Leakage of the filler.Numbness.Severe swelling (edema).Skin damage or scars.Skin discoloration.Very rarely, accidentally injecting filler into a blood vessel may cause permanent damage such as:Injury to arteries or veins.Tissue death.Vision loss.Recovery and OutlookWhat is the recovery time after getting cheek filler?Any bruising or swelling from cheek filler should go away in a few days. To improve recovery time and results, your provider may suggest the following for several days:Avoid putting on makeup or lotions for several hours.Avoid touching the injection areas.Quit smoking.Sleep on your back to avoid disrupting the cheek filler.Stay out of the sun.When can I go back to work or school, drive or eat?Your healthcare provider may suggest avoiding strenuous exercise for 24 to 48 hours after the procedure. Otherwise, you can usually return to your day-to-day activities immediately.When to Call the DoctorWhen should I see my healthcare provider about cheek filler?You should call your healthcare provider if you experience:Asymmetrical appearance that lasts for more than a week.Bruising, redness or swelling that lasts for more than a week.Signs of infection, such as fever or chills.Call 911 if you have symptoms of an allergic reaction or anaphylaxis, such as shortness of breath (dyspnea), to get help immediately.Additional Common QuestionsWhat’s the difference: Cheek filler vs. fat grafting?Your provider may offer a surgical procedure known as “facial fat grafting,” also known as “autologous fat injections,” as an alternative to the cheek fillers listed above. In this procedure, your provider injects fat taken from another part of your body to restore volume to your cheeks. Results from facial fat grafting can be permanent because the fat is actually transplanted from one area of your body to another.A note from Cleveland ClinicCheek fillers make your cheeks look fuller and more defined without surgery. Healthcare providers inject dermal filler into your cheeks. There are many types of dermal fillers. Your provider will determine the best one for you. Most cheek filler procedures take about 15 to 30 minutes; facial fat grafting takes one to two hours. Risks include bleeding, bruising and swelling. You often see results immediately and recover quickly after the procedure.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/01/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPlastic Surgery CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"