"What Is a Chemo Port?800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Chemo PortAdvertisementAdvertisementAdvertisementChemo PortA chemo port is a small, implantable device that attaches to a vein (usually in your upper chest area). It allows healthcare providers to draw blood and give treatments — including chemotherapy drugs — without a needle stick. A port can remain in place for weeks, months or even years.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewChemo ports can go in your arm or chest. But in most instances, your healthcare provider will place it in your upper chest and will choose the appropriate side for your situation.What is a chemo port?A chemo port (chemotherapy port) is a small, implantable device — about the size of a U.S. quarter. It goes under your skin (in your upper chest, arm or abdomen), and a thin silicone tube connects the device to a vein.Lots of people need ports for medical care, especially those undergoing cancer treatments. These devices reduce the number of needle sticks necessary for blood draws, infusions and injections. A port can help make chemotherapy safer and just a little more comfortable.Another name for an implanted port is “port-a-cath.”What do chemo ports look like?Chemo ports can be circular, triangular or oval-shaped, depending on the brand of port your surgeon places. There are three main parts to a chemo port:Port: The main part of the device, where healthcare providers inject fluids.Septum: The center part of the port, made from a self-sealing rubber material.Catheter: A thin, flexible tube that connects your port to your vein.There are also two types of chemo ports:Single lumen port: This chemo port has one access point. It’s the most common type.Double lumen port: This port has two access points. Healthcare providers can place a needle in each one.How does a chemo port work?Once your chemo port is in place, healthcare providers can use it to draw blood or deliver fluids and medications. To do this, they’ll insert a needle through your skin and into your port’s septum (the rubbery center).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens during chemo port placement?Chemo port placement requires surgery. The procedure usually takes about an hour. You’ll be able to go home on the same day. But you should have a trusted friend or family member drive you to and from your appointment.During the procedure, your medical team will:Give you anesthesia to numb the area and make you more comfortable.Make a small incision (cut) in your neck to access your vein (usually your jugular vein, subclavian vein or superior vena cava).Create a small opening in your vein for the catheter.Make another small incision and create a pouch under the bottom (subcutaneous) layer of skin (in your chest, arm or abdomen).Place the chemo port in the newly created pouch.Thread the catheter from the chemo port to your vein.Close the incisions with stitches.Your surgeon will use continuous X-ray imaging (fluoroscopy) to guide the procedure. They’ll also take a chest X-ray to ensure your chemo port is in the correct spot.Care at Cleveland ClinicGet Cancer CareMake an AppointmentRisks / BenefitsWhat are the benefits of a chemo port?A chemo port has many advantages, including:Improved comfort. You’ll probably feel pressure — but little to no pain — when your provider inserts a needle into your chemo port.Reduced risk of tissue damage. A chemo port delivers fluids directly to a large vein. This reduces your risk for extravasation (when fluids like chemotherapy drugs leak from a vein into the tissues around it).Convenience. Once healed, your chemo port will be completely covered by your skin. You’ll be able to swim and bathe without an increased risk of infection.AdvertisementWhat are the risks or complications of chemotherapy ports?Because chemo port placement is a surgical procedure, there are certain risks, including:Thrombosis: This can occur when blood clots block the catheter in your chemo port.Movement limitations: Excessive movements may cause displacement of your chemo port. Your surgeon may recommend avoiding strenuous activity while your chemotherapy port is in place.Mechanical issues: Some things can keep your chemo port from working properly (like if the catheter moves out of place).Scarring: Chemo port surgery will likely leave a small scar.Infection: Though it’s rare, infection is a risk of chemo port placement. It occurs in about 2% of cases. If this happens, you might need to replace your port. (Signs of infection include fever, pain and inflammation.)Recovery and OutlookWhat can I expect after chemo port placement?After chemo port placement, most people have mild pain or soreness around their incisions for the first couple of days.You can resume most normal activities right away. But ask your provider before hitting the gym. Too much strenuous activity can displace your chemo port.AdvertisementHow long can a chemo port stay in?A chemo port can stay in as long as you need it — even several years. Your surgeon can remove your port when you don’t need it anymore.Chemo port removalChemo port removal involves making a small incision over the port. Your surgeon will free the port from any surrounding tissue and remove the entire device at once. Then, they’ll close the incision with stitches.You may develop mild discomfort, swelling and bruising after chemo port removal. These side effects are normal and should fade in a few days.When to Call the DoctorWhen should I call my healthcare provider?You should call your healthcare provider right away if you have a chemo port and develop:Severe pain, swelling or bruising around your port.Redness or skin discoloration around your port.Drainage coming out of your port.Additional DetailsHow can I sleep with a chemo port?If you have a chemo port, the most ideal sleeping position is on your back. Sleeping on your back places minimal pressure on your port. Avoid sleeping on your stomach, especially during the recovery period. This could put pressure on your port and lead to increased soreness.You can also sleep on your side. If your chemo port is on the right side of your chest, try sleeping on your left side — or vice versa.There’s really no sleep position that’s dangerous for someone with a chemo port. But you should avoid positions that could place unnecessary pressure on your port — like sleeping with your arms raised above your head.How soon can you start chemo after port placement?You can begin chemotherapy as soon as your port is in place.Is chemo port placement major surgery?No, chemo port placement isn’t a major surgery. The necessary incision is usually about an inch long. In most cases, chemo port placement is an outpatient procedure, which means you can go home on the same day.Is it painful to use a chemo port?You might feel pressure or a slight pinch when your provider places a needle in your chemo port. But having a chemo port makes blood draws, infusions and injections much more tolerable compared to cancer treatment through a traditional intravenous (IV) line.Can you shower with a chemo port?Yes, as long as your healthcare provider says it’s OK, you can shower 24 to 48 hours after your chemo port procedure. You’ll need to cover the surgical site with plastic wrap so it doesn’t get wet.Once you’ve healed from your procedure, you can shower, bathe or even swim with your chemo port.A note from Cleveland ClinicA chemotherapy port, or chemo port, is a small, implantable device. It delivers chemotherapy drugs directly to your bloodstream through a vein in your chest, arm or abdomen. Healthcare providers can also use your port to draw blood and give you fluids. Having a chemo port can greatly reduce the number of needle sticks required at your oncology appointments — and in many cases, it can make cancer treatments safer. Talk to your oncologist to find out if a chemo port is right for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/31/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Cancer CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"