"Chemical Castration: Treatment, Procedure & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Chemical CastrationAdvertisementAdvertisementAdvertisementChemical CastrationChemical castration is also called medical castration or hormone therapy. It is used to treat some prostate and breast cancers. It is reversible.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is chemical castration?Chemical castration, sometimes called medical castration, refers to the use of chemicals or drugs to stop sex hormone production. While many people know about this process as a way to stop sex offenders, medical castration is used as a treatment for tumors that feed on sex hormones. The treatment, also called hormone therapy, may be used to treat breast cancer and prostate cancer.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before chemical castration?Before your healthcare provider suggests chemical castration, they’ll need to know if the type of cancer you have is the type that might respond to hormone therapy.If lowering testosterone is the goal, you and your provider might discuss orchiectomy, a surgical procedure that will permanently reduce the level of testosterone in your body. The surgery removes one or both testicles. There is a version that removes only the tissue that makes testosterone. This is called subcapsular orchiectomy. Unlike chemical castration, these procedures can’t be reversed.What happens during chemical castration for prostate cancer?Male sex hormones are called androgens. They include testosterone and dihydrotestosterone (DHT). One of their jobs is to make the prostate gland grow and function. Hormone therapy for prostate cancer is designed to cut down on how many androgens are made and to prevent them from fueling the growth of cancer. You might also hear it be called androgen deprivation therapy.Hormone therapy to fight prostate cancer can work in one of these ways:Decreasing the production of androgens by the testicles.Preventing androgens from being able to work in the body.Stopping any other part of the body from producing androgens.AdvertisementWhat drugs are used in chemical castration for prostate cancer?Here are the categories of medications used for chemical castration to treat prostate cancer:Gonadotrophin-releasing hormone (GnRH) agonists or GnRH analogs — also called luteinizing-hormone releasing hormone (LHRH) agonists or LHRH analogs:These medications stop the pituitary gland from releasing luteinizing hormone that tells the testicles to make testosterone. First, however, they cause a high level of hormone that’s eventually ignored. At that point, you may have what’s called a testosterone flare. You may need to have another type of medication (antiandrogen therapy) at the same time as you start GnRH agonist treatment to help with side effects. You’ll receive these drugs as injections or as implants under your skin. Drugs in this category available in the U.S. include:Goserelin (Zoladex®).Histrelin (Vantas®).Leuoprolide (Lupron®).Triptorelin (Trelstar®).GnRH antagonists or LHRH antagonistsThese medications prevent testosterone production but without causing a testosterone flare. In the U.S., these drugs are available to treat advanced prostate cancer:Degarelix (Firmagon®), an injection.Relugolix (Orgovyx®), a pill.Antiandrogen treatmentsThese drugs stop your body from using androgens. This therapy is called complete androgen blockage. The drugs are commonly used when androgen deprivation therapy (ADT) is no longer working well. They aren’t used on their own but they might be combined with ADT. They include:Flutamide.Bicalutamide (Casodex®).Apalutamide (Erleada®).Nilutamide (Nilandron®).Enzalutamide (Xtandi®).Darolutamide (Nubeqa®).Androgen synthesis inhibitorsThese drugs stop androgens from being produced anywhere in the body by stopping an enzyme called CYP17 that is necessary for any tissue, including the prostate cancer tissue, to make testosterone. In the U.S., these are the androgen synthesis inhibitors (all pills) that are used:Aminoglutethimide.Ketoconazole.Abiraterone (Yonsa®, Zytiga®).Note: At one time, the female sex hormone estrogen was once used to treat prostate cancer. However, because of the side effects, it’s not often used now.What happens during chemical castration to treat breast cancer?You might wonder if there’s such a thing as chemical castration when it comes to treating women. Blocking hormones is a strategy for people who have breast cancer tumors that feed on estrogen and/or progesterone. This is called hormone therapy or endocrine therapy. These strategies are not permanent, which is not true for oophorectomy, the name for surgery to remove your ovaries.Treatments that affect estrogen production or useMedications include:Selective estrogen receptor modulators such as tamoxifen and toremifine (Fareston®). These are in pill form.Selective estrogen receptor degraders such as fulvestrant (Faslodex®). Fulvestrant is an injection.Aromatase inhibitors such as anastrozole (Arimidex®), exemestane (Aromasin®) and letrozole (Femara®). These are in pill form.Treatments that suppress the ovariesThese treatments include medications and surgery.Luteinizing hormone-releasing LHRH analogs, including goserelin (Zoladex) and leuprolide (Lupron). These cause temporary menopause.Chemotherapy medications that may be permanent since they damage ovaries.Care at Cleveland ClinicUrology CareMake an AppointmentAdvertisementRisks / BenefitsWhat are the benefits of chemical castration?Some benefits of chemical castration include:It’s not permanent.It’s been effective in managing certain types of cancer.What are the risks or complications of chemical castration?There are side effects to medications for hormone therapy for both prostate and breast cancer therapy. Each medication has its own side effect profile. In general, long-term use may result in one or more of these effects:Osteoporosis.Heart disease.Problems metabolizing fats and sugar.Depression.Hot flashes.Anemia.Decreased libido (sexual desire).Recovery and OutlookWhat is the recovery time?There’s really no recovery time. You should be able to go back to work or school immediately. You can eat and drink what you like. That’s not to say that you might not have uncomfortable side effects.When to Call the DoctorWhen should I see my healthcare provider?Call your healthcare provider if you have any signs or symptoms that worry you, including existing symptoms that get worse or new symptoms that appear. In most cases, your provider will give you specific things to look out for, but it’s always a good idea to reach out if you have any questions or issues.Additional DetailsIs chemical castration legal in the US?Yes, it’s a medical treatment. Chemical castration is used to treat certain forms of cancer. If you’re thinking about chemical castration as a legal option or a criminal consequence, the laws vary by state.Is a vasectomy a form of castration?No,vasectomy isn’t a form of castration. Vasectomy is considered sterilization, but you can still have an erection. It doesn’t affect sexual performance or desire.Is chemical castration reversible?Yes, chemical castration is reversible generally. There may be rare cases when it’s permanent.How long does it take for chemical castration to work?The drugs start working when you begin taking them and keep working as long as you take them.A note from Cleveland ClinicWhen you have cancer, your healthcare provider will work with you to find the best treatment options. One major advantage of chemical castration as a cancer treatment is that it’s not permanent. The side effects usually are reversible, too. You and your provider may decide to use these medications or a combination of treatments. In addition to actual medical therapy, there are many services to help you with your journey, including counseling.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/26/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicUrology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"