"How Chemical Cardioversion Works800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Chemical CardioversionAdvertisementAdvertisementAdvertisementChemical CardioversionChemical cardioversion, or pharmacologic cardioversion, uses drugs to change a fast or irregular heartbeat to normal. Healthcare providers can use this to treat atrial fibrillation or other types of abnormal heart rhythms. They often do this in a hospital setting where they can monitor you.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewWhat is chemical cardioversion?Chemical cardioversion is the use of medicines to change your heart rhythm from an abnormal one to a normal one. How well this procedure works depends on what caused your abnormal rhythm and how long it lasted, as well as the medication your healthcare provider chooses.This type of cardioversion is also called pharmacologic cardioversion.Chemical cardioversion drugs can:Make your blood vesselsRelax your heart muscle.Make your heart’s workload easier.Slow down the electrical signals that tell your heart to beat.Usually, your sinoatrial node starts your heartbeat. From there, electrical impulses go through your right atrium and atrioventricular node. Lastly, they get to your lower chambers (ventricles). When something goes wrong with this organized process of sending a signal through the parts of your heart, you can have an abnormal heart rhythm.When your heart rhythm isn’t normal, your heart may not do a good job of sending blood to the rest of your body. All your cells, especially your brain cells, need a constant supply of the oxygen your blood carries. Inadequate blood flow can lead to dizziness, low energy, difficulty breathing, chest pain, general malaise and fatigue.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is chemical cardioversion used?If your heart rhythm is too fast or isn’t regular, you may need chemical cardioversion.Your heart can get into an abnormal rhythm for a number of reasons, including:Medicines you’re taking.Infections.Heart attack.Changes in your heart’s structure.Pulmonary embolism.Congestive heart failure.Lung diseases, such as COPD or emphysema.What does chemical cardioversion treat?Chemical cardioversion treats these abnormal heart rhythms:Supraventricular tachycardia.Ventricular tachycardia.Ventricular fibrillation.Atrial fibrillation (Afib).Atrial tachycardia.Atrial flutter.AdvertisementHow common is chemical cardioversion?Healthcare providers use chemical cardioversion often. They use it for a number of different kinds of abnormal heart rhythms. Atrial fibrillation is the most common of all abnormal heart rhythms. An estimated 12 million Americans will have atrial fibrillation by 2030.Procedure DetailsWhat happens before chemical cardioversion?Your healthcare provider will decide which type of cardioversion is best for you. If your blood pressure is too low, your healthcare provider may opt for an electrical cardioversion instead.If you have good blood flow, you could have electrical or chemical cardioversion.Vagal maneuvers may be a third option for people with certain types of supraventricular tachycardia. These maneuvers don’t involve any drugs or electricity. However, they don’t always work.You need to avoid eating or drinking anything for eight hours before a chemical cardioversion.If you have an atrial arrhythmia, you may need to have a transesophageal echocardiogram (TEE). Your provider uses this to check for blood clots, which may be dislodged when performing a cardioversion.Your provider will want to know about all the medicines you take. This includes the ones you buy without a prescription, as they can interact with medications given for a chemical cardioversion.Chemical vs. electrical cardioversionResearchers studied people who came to the emergency department for atrial fibrillation treatment. They found that both chemical and electrical cardioversion worked for low-risk people. However, those who got electrical cardioversion went home sooner.Only 32% of those receiving chemical cardioversion left the emergency department within four hours. But 67% of those who got electrical cardioversion went home within four hours.AdvertisementWhat medication is given before cardioversion?If you keep having atrial arrhythmias for longer than two days, you should take anticoagulants (blood thinners) for three weeks before chemical cardioversion. This lowers your risk of blood clots. You’ll need to keep taking anticoagulants for another four weeks after your chemical cardioversion to prevent blood clots which can lead to strokes.What happens during chemical cardioversion?Because of the risk of other abnormal heart rhythms happening, you’ll be in an intensive care unit or other hospital room. You may be admitted to the hospital or go home the same day as your chemical cardioversion.Your healthcare provider will want to track your blood pressure and electrocardiogram (EKG) readings. Also, your cardiologist will have a defibrillator and advanced cardiovascular life support equipment ready if they need it.You’ll either take medicine by swallowing it or by receiving it through an IV in your arm or hand. You may need more than one dose of a drug if the first one doesn’t work.What drugs are used for chemical cardioversion?The medicine your healthcare provider uses will depend on the type of abnormal heart rhythm you have. Some of the medicines providers use for chemical cardioversion also treat high blood pressure and congestive heart failure.Chemical cardioversion drugs may include:Adenosine (Adenocard® or Adenoscan®).Quinidine.Ibutilide.Diltiazem (Cardizem® or Tiazac®) or another calcium channel blocker.Flecainide.Metoprolol (Lopressor® or Toprol®XL) or another beta-blocker.Procainamide.Sotalol (Betapace® or Sorine®).Amiodarone (Cordarone® or Pacerone®).Digoxin (Lanoxin® or Digitek®).Dronedarone.Propafenone (Rythmol® or Rythmol®SR).What happens after chemical cardioversion?Your healthcare provider will keep checking on you for 24 to 48 hours after your chemical cardioversion procedure.What does chemical cardioversion feel like?Many people with atrial fibrillation say the drugs used in chemical cardioversion make them feel tired or unwell.Care at Cleveland ClinicArrhythmia TreatmentsFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of a chemical cardioversion procedure?Chemical cardioversion can:Get your heart back into a normal rhythm again.Improve your symptoms.Give you an alternative to electrical cardioversion.What are the risks or complications of chemical cardioversion?Risks of chemical cardioversion include:A new arrhythmia could start or the one you have could get worse.You could have a blood clot that causes you to have a stroke.You could have side effects, such as feeling sick to your stomach or tired.It can take months for some drugs to work.If it doesn’t work, you may need electrical cardioversion or catheter ablation.Medications don’t work for everyone and may only be 50% effective in the long run.When to Call the DoctorWhen should I see my healthcare provider?Call 911 if you have unusual side effects of chemical cardioversion, such as:Heart palpitations.Dizziness.Lightheadedness.Weakness.Sweatiness.An allergic reaction.Chest pain.Difficulty breathing.A note from Cleveland ClinicAs you prepare for and go through a chemical cardioversion, be sure to keep taking all of your prescribed medicines. Ask questions if you aren’t sure about your medication dosing or schedule. If you’re taking a blood thinner, you may need regular appointments to make sure you’re taking the right dose.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/23/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicArrhythmia TreatmentsFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"