"Chemotherapy for Breast Cancer: Types & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Chemotherapy for Breast CancerAdvertisementAdvertisementAdvertisementChemotherapy for Breast CancerChemotherapy for breast cancer is one of the ways that healthcare providers treat the condition. If you’re having breast cancer surgery, you may receive chemotherapy before and after your surgery. You may receive more than one kind of chemotherapy drug. These drugs cause side effects, and your oncologist will help you to manage them.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is chemotherapy for breast cancer?Chemotherapy is a common treatment for breast cancer. It works by killing the cancerous cells in your breast or that have spread from your breast. Oncologists often use chemotherapy before and/or after breast cancer surgery. Your oncologist may use one kind of chemotherapy drug, combine drugs or use chemotherapy with other treatments. Chemotherapy for breast cancer causes side effects, some of which may not develop until long after you’ve finished treatment. Your oncologist will have treatments and recommendations to help you manage immediate and short-term side effects. They’ll also share information about possible long-term side effects.When is chemotherapy used in breast cancer treatment?You may receive chemotherapy:Before surgery (neoadjuvant chemotherapy): Chemotherapy before surgery shrinks breast cancer tumors so your surgeon can remove the tumor without removing healthy breast tissue. It also gives oncologists early feedback on whether specific chemotherapy drugs are effective. After surgery (adjuvant chemotherapy): Breast cancer surgery may not remove all cancerous cells because some cells may be microscopic and too small for tests to detect. Post-surgery chemotherapy helps kill any remaining cancerous cells. It also helps reduce the risk of breast cancer coming back.As treatment for metastatic breast cancer: Chemotherapy may be the main treatment if you have breast cancer that’s spread from your breast to other areas of your body.To treat inflammatory breast cancer (IBC): This cancer type doesn’t cause tumors that surgeons can remove, so healthcare providers often use chemotherapy as initial IBC treatment.To treat triple-negative breast cancer (TNBC): Oncologists may treat TNBC with a combination of chemotherapy and immunotherapy.To treat HER2+ breast cancer that’s likely to come back: Treatment may be a combination of chemotherapy and targeted therapy.What are common types of chemotherapy for breast cancer?There are many types of chemotherapy drugs. Your oncologist may use one or more medications, depending on your situation.For example, if you have adjuvant and neoadjuvant breast cancer chemotherapy, your provider may use one or more of the following types of chemotherapy:Anthracyclines, such as doxorubicin (Adriamycin®) and epirubicin (Ellence®).Taxanes, like paclitaxel (Taxol®) and docetaxel (Taxotere®).5-fluorouracil (5-FU®) or capecitabine (Xeloda®).Cyclophosphamide (Cytoxan®).Carboplatin (Paraplatin®).If you have metastatic breast cancer, your provider may use one or more of the following drugs:Taxanes, like paclitaxel (Taxol), docetaxel (Taxotere) and albumin-bound paclitaxel (Abraxane®).Ixabepilone (Ixempra®).Eribulin (Halaven®).Anthracyclines, such as doxorubicin (Adriamycin), liposomal doxorubicin (Doxil®) and epirubicin (Ellence).Platinum agents (Cisplatin®, carboplatin).Vinorelbine (Navelbine®).Capecitabine (Xeloda®).Gemcitabine (Gemzar®).Antibody drug conjugates, like ado-trastuzumab emtansine (Kadcyla®), fam-trastuzumab deruxtecan (Enhertu®) and sacituzumab govitecan (Trodelvy®).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are side effects of chemotherapy for breast cancer?Side effects vary based on what kind of drugs you take and how long you need to take them. Most go away once you finish treatment, but some persist weeks or months after treatment. The most common side effects are:Chemotherapy brain fog: You may have this side effect for six months to a year after treatment.Fatigue: You may feel very tired during treatment and for three to six months after completing treatment.Nausea and vomiting: This side effect may start during treatment and continue for two to three weeks after treatment.Other side effects may include:Gastrointestinal issues: Constipation and diarrhea are common side effects.Hair changes: You may lose hair during treatment, and hair may grow back a different color after treatment.Loss of appetite: Most people regain their appetite after finishing treatment.Nail and skin changes: Your skin may be dry and itchy and your nails may become brittle.Peripheral neuropathy: Numbness and tingling in your hands and feet that typically go away once you finish treatment.Procedure DetailsHow is chemotherapy given for breast cancer?You can take chemotherapy by mouth as a pill or as an injection or intravenous (IV) infusion that puts the drug into your veins. You may receive treatment at a hospital or infusion center. Often, healthcare providers use central venous catheters (CVCs) to deliver chemotherapy directly into your bloodstream. There are different CVC types:Central line: This is a long plastic tube inserted near your heart, neck vein or arm vein.Peripherally inserted central catheter (PICC): Providers insert PICCs into a vein in your arm.Chemo port: This small implantable device attaches to a vein so providers can deliver chemotherapy directly to your bloodstream without a needle stick.How long do treatments take?That depends on your treatment plan. In general, chemotherapy for breast cancer lasts three to six months, but it can last up to a year. Here’s what you may expect:Typically, you’ll receive chemotherapy in cycles. Often, people have several treatment cycles.Cycles usually involve two to three treatments. Treatment cycles could happen once a week, every two weeks or even every three to four weeks.You’ll have a rest period after each cycle so your body can recover from treatment.AdvertisementWhat happens before chemotherapy for breast cancer?Oncologists and pharmacists tailor chemotherapy to your situation. They consider breast cancer type and stage, test results and your body mass index (BMI) to decide the dosage amount. They’ll explain what chemotherapy they’ll use, and why, and discuss potential side effects.This is a good time to ask your oncologist what you can do to get ready for treatment. If you’re like most people, you’ll have chemotherapy for several months. Many people can keep up with daily activities during treatment. Some people are exhausted and struggle with significant side effects. Everyone is different, so knowing what you can expect will help you plan for what’s ahead.For example, your chemotherapy treatments may take a few hours during treatment days. You may want to:Arrange for extra help at home for a day or so after treatment.Arrange for someone to bring you to treatment, keep you company and take you home.Pick out comfortable clothes so you can relax as much as possible during treatment sessions. Likewise, consider bringing a pillow or blanket.Bring something to read or games to play. If you use a tablet, remember your headset so you can listen to podcasts, watch shows or listen to music without bothering other people who may be receiving treatment at the same time you are.Plan on drinking extra water the day before your treatment because chemotherapy can be dehydrating.Ask your oncologist about palliative care. Palliative care helps people manage cancer symptoms and treatment side effects. But more than that, it offers support and programs that you can tap as you go through chemotherapy for breast cancer and after you finish treatment.What happens during treatment?When you arrive, a healthcare provider will show you where you’ll receive chemotherapy. That may be in a small cubicle or in a large room where other people are receiving treatment. Your provider will:Access your CVC or start an IV.Check on you during treatment. Rarely, chemotherapy drugs may leak from the IV (extravasation). Healthcare providers have special training to manage extravasation and will move quickly to take care of the situation.After treatment, your provider will flush the IV line or CVC with a saline solution. They’ll remove the IV from your arm or the CVC.You’ll stay put for about 30 minutes so your provider can confirm you aren’t having an unusual reaction.AdvertisementWhat happens after chemotherapy for breast cancer?After you complete chemotherapy, your oncologist will order imaging tests, like CT scans or MRIs, to check on the tumor and decide next steps.For example, if you had neoadjuvant chemotherapy, next steps may be surgery to remove the tumor and chemotherapy to kill any remaining cancerous cells. If surgery and post-surgery chemotherapy eliminated cancer symptoms and signs, your oncologist may schedule regular follow-up examinations and screening tests.Care at Cleveland ClinicBreast Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of chemotherapy for breast cancer?Chemotherapy, along with surgery, helps people with breast cancer live longer than people who don’t have chemotherapy. One analysis showed chemotherapy for breast cancer reduced recurrent breast cancer.People with metastatic breast cancer may benefit from chemotherapy that eases their symptoms and helps them live longer. What are complications?Certain chemotherapy drugs may cause second or new cancers. Unlike metastatic breast cancer, second cancers are different cancers that can develop years after people complete chemotherapy. Second cancers linked to chemotherapy for breast cancer include:Acute myeloid leukemia.Myelodysplastic syndromes.Recovery and OutlookWhat is the recovery timeline for this treatment?Healthcare providers typically structure chemotherapy so your body has time to recover between treatments. While there are common chemotherapy side effects, you may find you recover more quickly or slower than you would expect. Talk to your oncologist about any side effects. They may recommend switching to different chemotherapy drugs.How can I take care of myself?Eat well. Chemotherapy can affect your appetite. But eating protein and other nutrients can help fight cancer fatigue, so it’s important that you do your best to eat well. Consider eating several small meals a day instead of three large ones. Ask to speak with a nutritionist for meal ideas. Keep moving. Cancer is stressful, including cancer treatments. Regular light exercise, like walking or doing yoga, can help reduce stress and chemotherapy-related fatigue.Share your feelings. You may have lots of different emotions about needing chemotherapy, from anxiety about side effects to feeling frustrated because treatments are disrupting your daily life. Talking to someone you trust or joining a support group may give you an outlet for your emotions.When to Call the DoctorWhen should I see my healthcare provider?You’ll see your oncologist regularly during treatment. Contact them or go to the emergency room if you have:Fever above 100.4 degrees Fahrenheit (38 degrees Celsius).Chest pain or shortness of breath.Chills.Delirium (sudden confusion).Severe headache and neck stiffness.Questions to ask your oncologistWhy do I need chemotherapy?What is the treatment goal?What are the benefits of different types of chemotherapy?What types of chemotherapy will I get?Will I take pills or have IV chemotherapy?What are the risks of chemotherapy?How many cycles of treatment will I get?How long between treatments?How will you help me manage side effects?A note from Cleveland ClinicIf you have breast cancer, one of your first questions may be, “Will I need chemotherapy?” Likely, the answer will be yes. Chemotherapy is a powerful anticancer treatment that kills cancerous cells and reduces the risk that breast cancer will come back. Powerful treatments can have challenging side effects. Chemotherapy for breast cancer is no exception. As you prepare for chemotherapy, try to remember no one expects you to power through treatment. If you’re feeling anxious, talk to your oncologist. They’ll be glad to explain steps they’ll take to ease side effects. They’ll also have suggestions for things you can do to make your treatment as easy as possible.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/18/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicBreast Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"