"Chickenpox Vaccine (Varicella Vaccine): Schedule & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Chickenpox VaccineAdvertisementAdvertisementAdvertisementChickenpox VaccineThe chickenpox (varicella) vaccine can prevent you or your child from getting chickenpox. The varicella vaccine is given in two doses. Side effects are usually mild and can include pain, redness and swelling at the injection site. Serious reactions are rare. All children ages 12 months and older and most adults should get the chickenpox vaccine.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is the chickenpox vaccine?The chickenpox vaccine can protect you or your child from chickenpox. Chickenpox is a contagious disease that causes an itchy rash. The rash starts on your chest, back and face, and then spreads over your entire body. The chickenpox vaccine is called the varicella vaccine because the varicella-zoster virus (VZV) causes the disease.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat does the chickenpox vaccine do?The chickenpox vaccine can prevent chickenpox. Every year, the chickenpox vaccine prevents more than 3.5 million cases of chickenpox, 9,000 hospitalizations and 100 deaths in the U.S.When did the chickenpox vaccine come out?Healthcare providers started giving the chickenpox vaccine in 1995. Chickenpox used to be a very common childhood disease. Before the chickenpox vaccine became available, about 4 million people got chickenpox each year. Between 10,500 and 13,000 people were hospitalized, and 100 to 150 people died each year from chickenpox.AdvertisementWho should get the chickenpox vaccine?All children ages 12 months and older — as well as adults who haven’t had chickenpox — should receive the chickenpox vaccine. This is especially important for adults who are:Healthcare professionals.Teachers.Daycare workers.Nursing home staff and residents.College students.Correctional institution staff and inmates.Military personnel.International travelers.Not pregnant but of child-bearing age.Who should not get the chickenpox vaccine?Some people shouldn’t get the chickenpox vaccine. These people include:People who’ve had a severe allergic reaction to the varicella vaccine in the past.People who have an acute illness. You should wait until your illness has passed before receiving the chickenpox vaccine.People who are pregnant. You should wait until after you’ve given birth before receiving the chickenpox vaccine.Ask your healthcare provider if you should receive the chickenpox vaccine if you:Have an immunologic disorder or are taking medications that weaken your immune system.Are taking high doses of steroids such as prednisone.Are receiving treatment for cancer.Have recently received a blood transfusion.AdvertisementProcedure DetailsAt what age do kids get the chickenpox vaccine?The chickenpox vaccine is part of the childhood immunization schedule. Healthcare providers give the chickenpox vaccine in two doses. Your child should receive their first dose between the ages of 12 months and 15 months. They should receive their second dose between the ages of 4 and 6 years old.Your child’s healthcare provider may give your child the varicella vaccine at the same time as other vaccines. Children between the ages of 12 months and 12 years can receive the varicella vaccine together with the MMR (measles, mumps and rubella) vaccine. At 12 to 15 months, the chickenpox vaccine and MMR vaccine are usually given separately. At 4 to 6 years old, these two vaccines are often given as a single shot known as MMRV.Are there different types of chickenpox vaccines?In the United States, there are two varicella vaccines authorized for use:Varivax®: contains only varicella vaccine. It can be used in children ages 12 months and up, as well as in older children and adults.ProQuad®: contains a combination of measles, mumps, rubella and varicella vaccines. This is sometimes called MMRV. This is usually only used in children ages 4 through 6.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentRisks / BenefitsWhat are the advantages of getting the chickenpox vaccine?The chickenpox vaccine reduces your risk of getting chickenpox. Chickenpox causes an itchy, blister-like rash that lasts about a week. It can also cause fever, fatigue, loss of appetite and headache.While usually mild, chickenpox can be serious in babies, pregnant women and people with weakened immune systems. Chickenpox can cause skin infections, pneumonia, blood vessel inflammation, brain and/or spinal cord covering swelling, and infections in your bloodstream, bones or joints.What side effects can the chickenpox vaccine cause?The most common side effects of the chickenpox vaccine include:Pain or soreness at the injection site.Redness or rash at the injection site.Swelling at the injection site.Fever.Severe reactions to the chickenpox vaccine are very rare. If you or your child develops any of the following signs of an allergic reaction, call 911 or go to your nearest emergency room:Hives.Swelling of their face and throat.Difficulty breathing.Rapid heartbeat.Dizziness.Weakness.Fainting.What are the risks of getting the chickenpox vaccine?Serious reactions to the chickenpox vaccine are extremely rare. Reactions that can occur include:Seizures due to fever.Pneumonia.Severe allergic reaction.Brain and/or spinal cord covering infections.Recovery and OutlookHow effective is the chickenpox vaccine in preventing chickenpox?The chickenpox vaccine is very effective. More than 90% of people who receive the chickenpox vaccine won’t get chickenpox.Can you get chickenpox after you’ve had the vaccine?While the chickenpox vaccine is highly effective, some people can still get chickenpox. However, people who do get chickenpox after getting the chickenpox vaccine usually don’t get as sick and usually have very few skin lesions.Is the chickenpox vaccine for life?Most children and adults who receive two doses of the chickenpox vaccine will have protection from chickenpox for life.Can you get shingles if you had the chickenpox vaccine?Some people get shingles years after they received the chickenpox vaccine. Shingles (also called herpes zoster) causes a painful rash. However, it's much less common to get shingles after receiving the chickenpox vaccine than after having chickenpox.When to Call the DoctorWhat questions should I ask my healthcare provider?It’s normal to have questions before you or your child gets a vaccine. Some common questions you may want to discuss with your healthcare provider include:When should my child or I get the chickenpox vaccine?What side effects should I expect?How does the chickenpox vaccine work?When should I schedule each dose of the chickenpox vaccine?How effective is the chickenpox vaccine?Is there any reason my child or I shouldn’t get the chickenpox vaccine?What could happen if my child or I don’t get the chickenpox vaccine?Additional Common QuestionsShould adults get the chickenpox vaccine?Anyone who hasn’t gotten chickenpox should get the chickenpox vaccine. Older children and adults can get it at any time. Older children and adults should receive two doses at least 28 days apart if they’ve never had chickenpox or received the chickenpox vaccine.Is the chickenpox vaccine mandatory?The chickenpox vaccine is included in the childhood immunization schedule. School enrollment requirements and mandatory vaccinations are decided on a state-by-state basis.A note from Cleveland ClinicThe chickenpox vaccine can protect you or your child from chickenpox. Chickenpox causes an itchy rash, fever, headache and other symptoms. While usually mild, chickenpox can lead to serious health issues in babies, pregnant women and people with weakened immune systems. The chickenpox vaccine is 90% effective in preventing chickenpox. Side effects are usually mild and can include pain, redness and swelling at the injection site. Serious reactions are rare. Talk to your healthcare provider about whether you or your child should get the chickenpox vaccine.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/23/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementQuestions 216.444.2538Appointments & LocationsRequest an AppointmentFind a Primary Care ProviderFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"