"Chin Implant: Surgery, Recovery, Types, & Risks800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Chin ImplantAdvertisementAdvertisementAdvertisementChin ImplantA chin implant is a surgical procedure to enhance a small or recessed chin. Most people get chin implants for cosmetic reasons, such as improving the definition in their lower face. Some people get chin implants to reconstruct the chin after surgery or trauma.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewBefore (left) and after (right) a chin implant surgery; this procedure adds definition to your lower face, profile and jawline.What is a chin implant?A chin implant can help enhance a small or receding chin and add definition and contour to your lower face, profile and jawline. Most people get chin implants for cosmetic reasons, but sometimes, the surgery can help reconstruct your face. A plastic surgeon makes a cut in your skin, inserts the implant and molds it to your chin bone to achieve a natural, balanced look.Other names for chin implant surgery are chin augmentation (enlargement) or chin enhancement.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyDo chin implants come in different materials and sizes?Chin implants are usually made out of silicone, a flexible, artificial substance. Sometimes, implants are made from bone, but these aren’t as common. Implants come in different shapes, sizes and styles. Your surgeon selects the best type for your needs and aesthetic goals.Who gets chin implants?Anyone concerned about a small or recessed chin may consider chin implants. A recessed chin is when your chin doesn’t stick out far enough from your face. From the side, your chin isn’t in proportion with the lines of your forehead, nose and other features.People who’ve had trauma to their face, such as a facial fracture or tumor removal, might also consider and benefit from a chin implant.A chin implant might be part of or in addition to other surgeries, such as:Double chin surgery.Facelift (rhytidectomy).Facial masculinization surgery.Facial reconstruction surgery.Genioplasty (chin augmentation).Rhinoplasty (nose reshaping).The ideal candidate for chin implant surgery is someone who:Doesn’t have a jaw disorder, jawbone deformity or very short chin height.Doesn’t smoke.Has reached full skeletal maturity (bone growth is complete; late adolescence).Has realistic expectations about the results of chin implant surgery.Is physically healthy.AdvertisementChin implant vs. filler vs. fat grafting: What’s the difference?A chin implant isn’t the only way to add definition to your chin and jawline. You may be able to have dermal fillers or fat grafting:Chin filler: Dermal fillers are injections of hyaluronic acid or another substance just beneath your skin. They add volume to your face. Fillers may enhance the look of a small chin or smooth wrinkles around your chin and jawline. Fillers are nonsurgical and fade over time.Chin fat grafting: A plastic surgeon performs liposuction (procedure to remove fat using suction) on another area of your body (usually your belly or thighs). Then, they inject the fat into your chin. Fat grafting is a minimally invasive procedure.Procedure DetailsHow can I prepare for chin implant surgery?Your healthcare provider will give you instructions on how to prepare for chin implant surgery. You may need lab tests and a physical exam to make sure you’re in good health. If you smoke, you should quit smoking several weeks before the procedure.Your healthcare provider may also ask you to stop taking certain medications before chin implant surgery. Let them know about any medications you take, including aspirin, anti-inflammatory drugs or herbal supplements. They may ask you to start taking antibiotics before surgery to reduce the risk of infection.Your healthcare provider might take photos of your chin and side profile before surgery. Photos help your surgeon plan your procedure and compare before and after results.AdvertisementWhat happens during chin implant surgery?During chin implant surgery, your care team and surgeon:Give you local anesthesia, sedation or general anesthesia, depending on the length and complexity of your procedure.Make an incision on the inside of your mouth, in the crease of your lower lip. In some cases, the incision may be on the outside of your chin.Use special tools to move skin, fat and tissue aside. The surgeon inserts the implant and molds it to the shape of your chin bone to achieve a natural look.Close the incision using dissolvable stitches or glue.Apply a bandage and antibiotic ointment.What happens after chin implant surgery?Depending on the complexity of your surgery, you may be able to go home the same day as your procedure. Less often, people stay in the hospital overnight. Your surgeon will give you specific instructions about how to care for your incision.Care at Cleveland ClinicPlastic Surgery CareMake an AppointmentRisks / BenefitsWhat are the risks of a chin implant?Like all surgeries, a chin implant does carry some risks, including:Bleeding.Bruising.Burning or prickling sensation.Erosion or resorption of your chin bone.Hair loss near the incision (if the incision is on the outside of your chin).Implant extrusion (implant pokes through the incision).Implant rejection.Infection.Nerve injury.Scarring.Shifted or misaligned implant.What are the benefits of a chin implant?A chin implant can:Create a more balanced look to your face, jawline and side profile.Restore lost chin volume.Recovery and OutlookWhat can I expect after a chin implant?You should take it easy for about a week or two after your chin implant. You can do light activities, but you should avoid:Heavy lifting.Strenuous activity.Bending over.You might notice swelling and bruising. Talk to your healthcare provider about the best way to care for your incision. They may recommend a soft food diet for a few weeks. Rinsing your mouth with salt water or a prescription dental rinse before and after meals can also help keep the incision clean and reduce pain.Most people have favorable results after a chin implant. Many people report satisfaction with the outcome.When to Call the DoctorWhen should I see my healthcare provider?Contact your healthcare provider if you have:Fever, chills or other flu-like symptoms.Signs of infection such as pus or drainage coming from the incision.Swelling or pain that lasts longer than a few days.A note from Cleveland ClinicA chin implant is a surgical procedure to enhance the size of your chin. Most people get a flexible silicone implant. The procedure can help add definition and balance to your chin and jawline. It’s a fairly low-risk cosmetic procedure. Some people get a chin implant with other procedures such as a rhinoplasty or facelift.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/13/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPlastic Surgery CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"