"Circumcision Revision800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Circumcision RevisionAdvertisementAdvertisementAdvertisementCircumcision RevisionCircumcision revision is a rarely done surgical procedure  on a boy's penis after a circumcision. It's performed when the original circumcision has unsatisfactory results, such as too much foreskin left on the penis.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewWhat is circumcision revision?Circumcision revision is an uncommon but sometimes necessary procedure. It refers to a second surgical procedure performed due to unsatisfactory results with the original circumcision. Circumcision is the removal of the foreskin, which is the sheath of skin covering the head of the penis.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is circumcision revision needed?Redundant foreskin. The most common reason for a circumcision revision is that too much of the foreskin is left following a circumcision. This is called redundant foreskin. It can cause scar tissue to form as an infant grows and develops more fat in the area around the penis.Buried penis. Circumcision revision may also be needed if the penis drops back into the fatty area surrounding it, seeming to “trap” it. This causes a buried penis, making it difficult to urinate and increases the risk for skin infections around the penis.Penile skin bridge. Another reason circumcision revision may be required is if something called a “penile skin bridge” develops. This is when the shaft of the penis becomes attached to the tip of the penis.You should seek medical attention for your circumcised child if you notice any of these problems with his penis. Don't wait if a circumcision revision is needed -- the problem won't resolve itself and may become worse as the child grows.Procedure DetailsWho performs circumcision revision?Circumcision revision is most often done by a urologist in a hospital. General anesthesia is needed.AdvertisementHow is circumcision revision done?The type of revision that is needed will depend on the reason for your child’s circumcision revision. A urologist will be able to decide the type of revision that is best for your child.The sleeve surgical technique, in which the foreskin is removed from its pulled-back position, is commonly used for revision in patients with redundant foreskin or a concealed penis. Other techniques may be used depending on the cause of the revision and age of the patient.Care at Cleveland ClinicUrology CareMake an AppointmentRisks / BenefitsWhat are the risks and benefits of circumcision revision?There are risks associated with anesthesia-airway management, normal surgical risks for bleeding and infection, and redundant (excess) skin following the procedure. The benefits would be decreased risk for infection and aesthetically pleasing results.AdvertisementRecovery and OutlookWhat is the prognosis for males who have circumcision revision?Circumcision revision is a very successful procedure. Your child’s urologist should be able to best advise you on whether your son would benefit from a circumcision revision.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 12/18/2020.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicUrology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"