"Circumcision: Treatment, Risks, Benefits, Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/CircumcisionAdvertisementAdvertisementAdvertisementCircumcisionCircumcision is the surgical removal of foreskin from a baby’s penis. There are several benefits to circumcision, including a lower risk of diseases like urinary tract infections. Older boys and men get circumcised as well. At any age, the circumcised penis usually heals within a week.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is circumcision?Circumcision removes the foreskin covering the glans (head) of the penis. Usually, babies undergo circumcision shortly after birth. Circumcision began as a religious rite. Today, people get circumcised for religious, medical and cultural reasons.Many baby boys get circumcised, usually within the first week of life. Adults can get circumcised as well, though it’s less common.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is the foreskin?The foreskin is a piece of skin that covers the round tip of the penis. When a baby is born, the foreskin is completely attached to the penis. Over time, the foreskin separates from the head of the penis and is able to be retracted, or pulled back. Sometimes, the foreskin doesn’t separate when it should and remains tight, a condition called phimosis. Usually phimosis requires further intervention or circumcision to correct it.How common is circumcision?Circumcision is the most common surgery among males. In the United States, up to 60% of baby boys are circumcised. Around the world, the rate is about 33% of males. The highest rates of circumcision are in the U.S., Middle East and South Korea. It’s much less common in Europe, other parts of Asia and South America. Jewish and Muslim people perform circumcision as part of their religions.AdvertisementWhen are most circumcisions performed?Typically, circumcisions happen a day or two after birth, in the hospital. It’s best to do it as soon as possible. Delaying the procedure can make it riskier.In the Jewish faith, circumcision (also called a bris) gets performed when a baby is 8 days old. Other cultures perform circumcision at a later age.Who performs a circumcision?A urologist, obstetrician or pediatrician can do the circumcision on the newborn in the hospital. A healthcare provider can also perform it later, in the office. In a bris, a trained professional called a mohel performs the circumcision.AdvertisementProcedure DetailsWhat happens before a circumcision?Your provider may recommend giving the baby some acetaminophen to help with pain relief. In most cases before the procedure, the person doing the circumcision will:Place the baby on his back.Gently restrain the baby’s arms and legs, so his limbs don’t flail during the procedure.Clean his penis.Apply an anesthetic, either an injection or a cream, so the baby won’t feel pain.What happens during a circumcision?The person doing the baby’s circumcision:Separates the foreskin from the head of the penis.Uses a scalpel to remove the foreskin.What happens after a circumcision?Immediately after removing the foreskin, the person doing the procedure applies ointment and wraps the penis in gauze.How long does circumcision take?The entire procedure takes approximately 20 minutes. Often, a bris takes less time.Is circumcision painful?Like any surgery, circumcision can cause some pain. But using pain medications and anesthetics can reduce discomfort. These can help both during the procedure and afterward.Can an adult get circumcised?Yes. People who were not circumcised as babies may choose to undergo circumcision as an adult. Generally, the procedure is the same for older boys and adults as it is for babies.You’ll likely have the procedure in the hospital, using anesthesia. The surgery may take slightly longer than it does for infants. You will need stitches after the circumcision, too. Your healthcare provider will talk to you about recovery, including when you can resume having sex.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentRisks / BenefitsWhat are the risks of circumcision?Circumcision is a routine, safe procedure. As with any surgery, there are some risks, though. These include:Bleeding.Infection.Reaction to anesthesia.Pain.Cutting the foreskin too long or too short.Irritation on the tip of the penis.Meatitis (inflamed opening of the penis).In rare cases, the foreskin doesn’t heal properly and can adhere to the end of the penis (penile adhesion). If that happens, the child may need a second procedure.What are the benefits of circumcision?Circumcision has several benefits. Not only does it help aspects of penis health, but it can improve hygiene. That’s because a circumcised penis is simpler to clean and wash, especially for children.The specific health benefits of circumcision include a lower risk of:Certain penis conditions: · These penile disorders include balanoposthitis (inflammation of the glans and foreskin), paraphimosis and phimosis, when the foreskin gets stuck out of place.Cervical cancer for partners: Female sex partners of circumcised men are less likely to get cervical cancer.Penile cancer: Men who had circumcisions are less likely to get cancer of the penis.Sexually transmitted infections: Men who had circumcision have a lower risk of certain STIs, including HIV.Urinary tract infections: UTIs are more common in uncircumcised males.Who should not have a circumcision?Your provider may recommend delaying circumcision or not doing it at all if your baby:Has medical concerns.Has physical problems with the penis that may need surgery. (Sometimes, surgeons will need the foreskin to correct the problem.)Was born prematurely.###Recovery and OutlookHow long does it take to recover from circumcision?Recovery from circumcision takes about eight to 10 days. While the penis heals, it may look swollen and red. You may see a yellow film at the tip.How do I take care of my baby’s penis after a circumcision?Your healthcare provider will explain how to take care of the circumcised penis. You’ll need to:Apply Vaseline at each diaper change.Use pain relief your provider recommends, including frequent breastfeeding or medications for infants.Wash the area gently as it heals.If the penis doesn’t seem to be healing correctly or you have concerns, call your healthcare provider.Does circumcision affect fertility or sexual pleasure?Circumcision doesn’t affect fertility (ability to produce a biological child). And researchers believe it doesn’t hurt or enhance sexual pleasure.When to Call the DoctorWhen should I call a healthcare provider after a circumcision?Call a healthcare provider if you see signs that the penis isn’t healing well, such as:Frequent bleeding or bleeding that doesn’t stop.Leaking with a foul odor.Urination not resuming in 12 hours.Additional DetailsShould I have my baby circumcised?Several major medical associations recommend offering circumcision as a choice for parents. These groups include the American Urological Association (AUA) and the American Academy of Pediatrics (AAP).Both organizations believe that circumcision has benefits as well as risks. Ultimately, the decision is personal, with the groups suggesting that parents decide. Talk to your child’s healthcare provider about the pros and cons. You can then make the decision that’s right for you.If you do choose circumcision, the AAP recommends that the healthcare provider use pain medication.What should I know if I choose not to circumcise my child?If you choose not to have your son circumcised, talk to your healthcare provider. They’ll explain how to keep the penis clean. During the first few years of life, the foreskin will stay attached to the penis and won’t retract. Don’t force it back. Once your son is old enough, teach him how to clean the penis and foreskin.A note from Cleveland ClinicCircumcision in baby boys is a very common procedure. There are several benefits to circumcision, including making the penis easier to clean. Circumcision can also reduce or prevent certain diseases, like urinary tract infections. As with any surgery, circumcision comes with some risks. Be sure to talk with your healthcare provider about the circumcision procedure and if it’s the right choice for your baby.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/23/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"