"Clear Liquid Diet: Description, How to Follow and Using for Colonoscopy, Diverticulitis800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Clear Liquid DietAdvertisementAdvertisementAdvertisementClear Liquid DietA clear liquid diet is prescribed for short periods for specific medical purposes. It helps your gastrointestinal tract heal from severe bouts of disease, such as diverticulitis, and it helps clear it out before certain tests and procedures, such as colonoscopy.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional Common QuestionsOverviewA clear liquid diet means only liquids you can see through.What is a clear liquid diet?A clear liquid diet is medically prescribed for short periods to rest and clean out your digestive tract while providing adequate short-term hydration and some energy. Just like it sounds, the diet consists of clear liquids and foods that melt into clear liquids (like Jell-o®). It excludes solid foods and liquids that you can’t see through (like milk). Clear liquids are easily absorbed by your digestive system, and they also allow technicians to see clearly into your digestive tract during an imaging test, such as a colonoscopy.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is a clear liquid diet prescribed?The diet is usually prescribed for one of three reasons:To clear out your digestive tract and/or prevent nausea before a procedure, such as an imaging test or surgery.To give your digestive system a rest from severe gastrointestinal symptoms, such as inflammation, vomiting and diarrhea.To offer nutrition without eating after a fast or surgery. Surgery in your digestive system may require a few days to rest the affected organs afterward. Other surgeries may require the diet for just 24 hours afterward until your anesthesia wears off.This is not a prescribed weight-loss diet. It’s not particularly nutritious and includes a lot of empty calories from refined sugar. The diet is designed to require minimal effort on the part of your digestive system while providing hydration, some minerals and electrolytes, and a little energy to get you through. The clear liquids also help clear out built-up residue in the digestive tract that can worsen gastrointestinal symptoms and clutter up imaging tests.Procedure DetailsWhat can you eat on a clear liquid diet?The clear liquid diet includes:Coffee and tea without milk or non-dairy creamer (sugar or honey is OK).Clear, nonfat broths.Strained, pulp-free fruit and vegetable juices.Sodas and sports drinks.Clear nutritional drinks.Pulp-free popsicles.Jell-o®.Your healthcare provider will give you more specific directions on the amounts of each type of liquid you should consume. If the diet is prescribed before an imaging test, you might be asked to exclude the color red. Red liquid can resemble blood on an imaging test.AdvertisementHow long should you stay on a clear liquid diet?The diet is usually only prescribed for a few days. If it is prescribed for longer, it will be modified with certain supplements to provide more adequate nutrition over the longer term.Care at Cleveland ClinicDigestive CareMake an AppointmentRisks / BenefitsWhat are the health benefits of a clear liquid diet?The health benefits are primarily from giving your digestive system a chance to rest and heal from severe symptoms. If you have inflammation from pancreatitis, gastritis or inflammatory bowel disease, the clear liquid diet can give it a chance to calm down. If you have diverticulitis, an infection in your colon, the inflammation is aggravated by poop in the colon. A clear liquid diet for a few days can help clear that out.If you have severe diarrhea or vomiting, the clear liquids can restore your depleted water, energy and electrolytes without triggering further diarrhea or vomiting. However, the clear liquid diet is not nutritionally adequate for more than a few days. In most cases, your healthcare provider will want you to progress as soon as possible to a full liquid diet or “soft” (low fiber) diet to prevent malnutrition.AdvertisementWhat are the possible risks of a clear liquid diet?Malnutrition: It’s safe to limit calories and nutrition for short periods, but you risk malnutrition if you stay on the clear liquid diet for more than five days. Healthcare providers will rarely recommend this. If they do, they will prescribe supplements to enhance your nutrition.High blood sugar: If you have diabetes, you may need to discuss this with your healthcare provider before proceeding with the clear liquid diet. You may need to find sugar-free alternatives to some of the liquids, adjust your medications, and monitor your blood sugar carefully during the diet.Swallowing problems: If you have dysphagia or another swallowing problem, you might need to discuss thickeners with your healthcare provider to thicken your clear liquid diet to a consistency you can more easily swallow.When to Call the DoctorWhen should I discontinue a clear liquid diet?Contact your healthcare provider if you experience:Stomach pain or cramping.Severe weakness.Difficulty swallowing.Additional Common QuestionsWhat's the difference between a clear liquid diet and a full liquid diet?A full liquid diet includes all liquids and foods that become liquid at body temperature. Shakes, milk, frozen yogurt and creamy soups are allowed, as long as they don’t have any chunks or food particles in them. A full liquid diet is prescribed for similar reasons as the clear liquid diet — to rest the digestive system after illness or surgery and reintroduce it slowly to normal eating — but it’s a less severe diet for less severe cases. Some people need to start on the clear liquid diet first before progressing to the full liquid diet. Those who are preparing for an imaging test will need to stick to clear liquids to keep their digestive tract clear.A note from Cleveland ClinicA clear liquid diet is a brief but important intervention. It’s a safety measure that keeps you hydrated before and/or after surgery. It can help your gastrointestinal system heal and help healthcare providers get a better look inside at what’s troubling you. It might seem difficult, but most people manage it well for a day or two. While on the clear liquid diet, follow your healthcare provider’s guidance carefully. Your digestive system will thank you, and may even reward you with rapid relief.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/17/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicDigestive CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"