"Clitoroplasty: Purpose, Procedure, Risks & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/ClitoroplastyAdvertisementAdvertisementAdvertisementClitoroplastyA clitoroplasty is a procedure that either changes the look of a person’s clitoris or creates a clitoris. Treatment for congenital conditions, cosmetic concerns and gender affirmation are common reasons a person has a clitoroplasty.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is clitoroplasty surgery?Clitoroplasty is a surgical procedure for your clitoris. Containing over 8,000 nerve endings, the clitoris is the pleasure center of the female reproductive anatomy. It’s a small nub of flesh at the top of your vulva (external genitalia). The goal of clitoroplasty is to create or change the appearance of your clitoris while still retaining its pleasure-center characteristics. There’s a high risk of sensory or blood flow challenges that come with a clitoroplasty.A clitoroplasty could involve:Reducing the size of your clitoris.Repositioning your clitoris.Creating a clitoris.Changing the appearance of your clitoris.There are several reasons you might get a clitoroplasty. Some of these include:Being born without a clitoris but having other female genitalia.Wanting to improve the appearance of your clitoris, usually making it smaller than before.Desiring a clitoris so your genitals more clearly align with your gender (gender affirmation surgery).Correcting damage from genital mutilation (female circumcision).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat conditions does a clitoroplasty treat?Children, teens and adults can have a clitoroplasty. A clitoroplasty can treat certain congenital conditions (conditions you’re born with). A surgeon may perform a clitoroplasty as part of feminizing genitoplasty. Feminizing genitoplasty is surgery that changes the way your genitals look or fashions new genitalia from existing tissue.ClitoromegalyClitoromegaly is the medical term for an enlarged clitoris. A larger-than-average clitoris can be present at birth (congenital) or develop later in life. Most often, exposure to androgens (a hormone in men and people assigned male at birth) causes clitoromegaly in women and people assigned female at birth (AFAB). A clitoroplasty helps people with this condition get a clitoris that’s a more typical size and shape.Congenital adrenal hyperplasia (CAH)CAH is an endocrine condition that can cause a person assigned female at birth to have an enlarged clitoris that resembles a penis. A clitoroplasty shapes the tissue into a more typical-looking clitoris.Female pseudo hermaphroditismThis is a condition where a person is assigned female at birth because they have ovaries and other internal female genitalia, but their external genitals appear to be male (they have a penis or scrotum). Someone with this condition may have a clitoroplasty as part of feminizing surgery.Cosmetic clitoroplastyA cosmetic clitoroplasty reduces or repositions your clitoris. This type of procedure is most common in adults whose clitoris has changed in some way. Most often, a person desires a cosmetic clitoroplasty because their clitoris affects their sexual pleasure in some way, although there can be other reasons.Gender-affirming surgery (feminizing genitoplasty)Gender-affirming procedures help some people whose sex assigned at birth differs from their gender identity. For example, a transgender woman may wish to have female genitalia. In these cases, a surgeon usually performs a clitoroplasty as part of a vaginoplasty. A vaginoplasty is surgery that creates a vagina.Clitoroplasty for atypical genitalia or intersexAtypical genitalia (ambiguous genitalia or intersex genitals) is when your sexual anatomy doesn’t appear to be classically male or female. Intersex traits might be apparent when you’re born, but they might not appear until later. A clitoroplasty can help people with atypical genitalia or people who are intersex achieve the external genitalia they desire. Parents should consult with their child’s healthcare provider to carefully weigh the pros and cons of surgical options for their children, as surgery has long-lasting effects.Procedure DetailsHow should I prepare for a clitoroplasty?The first step is having an appointment with your healthcare team to discuss your full health history, the goals of clitoroplasty and the procedure’s risks. They can answer any questions you have about the surgery and recovery. Your provider may order imaging tests or blood tests, and conduct wellness and physical exams to make sure you’re ready for surgery. Let your provider know of any allergies you have or medications you take at this time.Your provider will give you instructions for the day of your surgery, including information on when to stop eating or drinking and when to arrive at the hospital or surgical center.AdvertisementWhat happens during a clitoroplasty?The exact method a surgeon uses for a clitoroplasty varies depending on why you’re having the surgery and its complexity. For example, a procedure to change the appearance of a clitoris in a person assigned female at birth differs from a procedure that’s part of gender affirmation.You may receive local anesthesia to numb just the treatment area while you stay awake for the procedure. Or you may get general anesthesia, which makes you go to sleep.A clitoroplasty that aims to reduce the size or change the appearance of a person’s clitoris involves cutting away at excess clitoral tissue, then reshaping the tissue. The surgeon uses stitches to close any cuts (incisions).On the other hand, surgeons that need to create a clitoris use existing genital tissue to construct a clitoris. Feminizing genitoplasty typically follows a vaginoplasty, which involves removing most of the penis. Your surgeon reshapes the outer skin, turns it “inside out,” and inserts the tissue into your body to form a vagina. The surgeon shapes the clitoris from this same tissue. For people assigned female at birth with congenital anomalies, a surgeon uses whatever genital tissue is present to create a clitoris. The surgeon closes any incisions with stitches.Most people who have a clitoroplasty go home the same day (outpatient procedure).How long does it take?The exact timing varies, but you can expect the surgery to last between one and two hours.What happens after a clitoroplasty?Your healthcare team will monitor you after surgery to make sure your blood pressure, breathing rate and heart rate are normal. Once they’re pleased with your recovery, they’ll allow you to go home. Make sure you have a driver to help you get home safely. You may need additional support at home for the first 24 to 48 hours.You can expect some pain, swelling and discomfort. Your healthcare provider may recommend taking time off from work or school and scaling back physical activities for at least a week or two. Your recovery is unique to you and how complex your clitoroplasty was. Talk to your surgeon about what you can expect during your recovery.The swelling should improve within six weeks, but you may still look swollen for up to three months after a clitoroplasty. Your healthcare provider will schedule periodic follow-up appointments to check that you’re healing well.These steps can ease your recovery:Apply a cold pack over your underwear for 20 minutes several times daily.Take antibiotics and pain relievers as directed by your provider.Wear loose-fitting clothing to avoid irritating the area.Don’t have sex or place anything inside your vagina for six weeks.Care at Cleveland ClinicUrology CareMake an AppointmentAdvertisementRisks / BenefitsWhat are the benefits of clitoroplasty?The benefits of a clitoroplasty can be physical or functional as well as emotional and psychological.In infants and children with congenital conditions, a clitoroplasty can be necessary and beneficial for the child’s medical and emotional well-being as they grow and develop.In the case of clitoroplasty for gender-affirming surgery, the procedure can improve self-confidence and allow people to feel more comfortable with their gender identity.For others, this procedure can:Help reduce pain during sexual activity.Increase sexual pleasure.Correct an injury or other trauma to the area.What are the risks of clitoroplasty?Clitoroplasty is a somewhat controversial procedure. As with most controversial topics, people have varying beliefs on if procedures like this are necessary and to what extent. Studies on the success of clitoroplasty, especially among children and teens, are ongoing.Some healthcare providers think the risk of losing nerve sensation outweighs cosmetic benefits if the underlying condition isn’t causing pain. In addition to nerve damage, there’s also a risk of chronic pain following surgery, which can be very difficult to live with. Other risks include:Vaginal stenosis.Urinary incontinence.Urethra-vaginal fistula.Bleeding or bruising.Recovery and OutlookHow long does it take to recover from a clitoroplasty?Recovery time for a clitoroplasty varies depending on how complex the clitoroplasty was and how your body heals. Your healthcare provider will give you specific instructions on how best to care for yourself, including how to care for your genitals in the days immediately after surgery. They’ll let you know of any limitations or modifications to your normal routine, like avoiding exercise.You can expect to make a full recovery within six to 12 weeks. You should avoid sexual intercourse for at least six weeks or until your provider says it’s OK to resume sex.Your healthcare provider will schedule a follow-up appointment to assess your clitoris after surgery.When to Call the DoctorWhen should I call my healthcare provider?Contact your healthcare provider if you had a clitoroplasty and experience any of the following symptoms:Fever of 100.4 degrees Fahrenheit (38 degrees Celsius) or higher.Chills.Pain that doesn’t improve with pain medication.Pus, bloody discharge or foul smells from the surgical area.A note from Cleveland ClinicA clitoroplasty can help a person aesthetically, emotionally and physically. Whatever your reason for seeking clitoroplasty, know that there are trained surgeons and healthcare providers who can help you achieve your goals. Remember that clitoroplasty is a life-changing procedure, and its success isn’t guaranteed. Having an open and honest conversation with your healthcare team about your expectations is important, so they can best help you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/26/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicUrology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"