"Clitoral Hood Reduction: Benefits, Procedure & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Clitoral Hood ReductionAdvertisementAdvertisementAdvertisementClitoral Hood ReductionHealthcare providers perform clitoral hood reductions to make the clitoral hood smaller. This skin fold covers and protects the clitoris, which is extremely sensitive. Some people have large clitoral hoods that are prone to irritation. Others may want to increase clitoral sensation. Clitoral hood reduction can fix these issues.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is a clitoral hood reduction?A clitoral hood reduction removes excess tissue from the skin folds that cover and protect your clitoris. These skin folds are your clitoral hood.A clitoral hood reduction is a type of plastic or cosmetic surgery. Plastic surgery refers to surgery that reconstructs a part of your body. Cosmetic surgery is a type of plastic surgery that alters and improves appearance.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are other names for a clitoral hood reduction?Other names for a clitoral hood reduction include:Clitoral hoodectomy.Clitoral hoodoplasty.Clitoral unhooding.What are the clitoris and clitoral hood?Your clitoris and clitoral hood are part of the reproductive system of people designated female at birth (DFAB). The labia minora (inner lips that surround your vaginal opening) come together to form a small bulge that is your clitoris.The outer part of your clitoris that you can touch is the glans. Your clitoris contains thousands of sensory nerve endings that make it extremely sensitive. It plays a critical role in achieving orgasm.Your clitoral hood is a fold of skin (foreskin) that protects your clitoris. When you’re sexually aroused, your clitoris becomes swollen (engorged). The swelling pulls back your clitoral hood.Without your clitoral hood, your clitoris would be overly sensitive to touch and irritants, like friction from clothing rubbing against it. Your clitoral hood makes a lubricant called sebum that helps it glide smoothly over your clitoris. This function is similar to the foreskin that covers the tip of a penis.What does a clitoral hood reduction do?In some people, the clitoral hood is large and has extra tissue. A clitoral hood reduction removes this excess skin. Healthcare providers refer to this type of cosmetic surgery as feminizing genitoplasty.AdvertisementShould I get a clitoral hood reduction?You may consider getting a clitoral hood reduction if you want to:Correct problems present since birth.Improve the look of your genitalia.Make the clitoris more accessible for enhanced sexual pleasure.Reduce irritation from clothing rubbing against a large clitoral hood or labia.Does a clitoral hood reduction increase sensitivity?A clitoral hood reduction by itself doesn’t increase sensitivity. But the procedure exposes more of your clitoris, an extremely sensitive area. Having more of your clitoris available can lead to heightened sexual sensation.AdvertisementProcedure DetailsWho performs clitoral hood reductions?These experts may perform clitoral hood reductions:Plastic surgeon, a medical doctor who specializes in reconstructive procedures.Cosmetic surgeon, a plastic surgeon who performs procedures to improve a person’s appearance (aesthetic).Gynecologic surgeon, a medical doctor who performs surgery on the reproductive system of DFAB people.What happens during a clitoral hood reduction?A clitoral hood reduction is an outpatient procedure that takes about one hour. You go home the same day. You may receive local anesthesia to numb just the treatment area while you stay awake or sedated for the procedure. Or you may get general anesthesia, which makes you go to sleep.Healthcare providers sometimes perform a labiaplasty at the same time as a clitoral hood reduction. A labiaplasty trims excess skin from your labia minora (small lips) to reshape them and improve how they fit within your labia majora (large lips) that surround your vagina. This procedure gives the labia a more even or symmetrical appearance.During the procedure, your provider:Performs a labiaplasty first (if desired).Trims excess skin from the clitoral hood while taking great care not to disturb the tissue and nerves of your clitoris.Closes the wounds with dissolvable stitches.Risks / BenefitsWhat are the risks of a clitoral hood reduction?In rare instances, your surgeon may remove too much tissue (over-resection) or not enough (under-resection). If you have an under-resection, you may need another procedure to remove more tissue. There isn’t a way to correct an over-resection.Other risks of a clitoral hood reduction include:Bleeding and bruising.Infections.Nerve damage.Recovery and OutlookWhat is recovery like after a clitoral hood reduction?You can expect some pain, swelling and discomfort. Your healthcare provider may recommend taking a week off from work and other physical activities following a clitoral hood reduction with labiaplasty. Recovery from a clitoral hood reduction without labiaplasty is often shorter.The swelling should improve in six weeks, but you may still look swollen for up to six months after the procedure.These steps can ease your recovery:Apply a cold pack over your underwear to the area for 20 minutes. Remove the cold pack for 20 minutes and then repeat.Elevate your bottom with pillows when lying down.Keep showers brief (don’t bathe) and gently pat dry the area.Pat dry (don’t wipe) after using the restroom.Take antibiotics and pain relievers as directed by your provider.Wear loose-fitting clothing to avoid irritating the area.Don’t have sex or use tampons for four to six weeks.What sort of results can you expect from a clitoral hood reduction?Most people who undergo clitoral hood reductions with labiaplasties are very satisfied with the results. The procedure can improve the appearance and comfort of your outside genitals.When to Call the DoctorWhen should I call the doctor?You should call your healthcare provider if you experience:Excessive bleeding, swelling or bruising.Nausea and vomiting.Severe pain.Signs of infection, like foul-smelling discharge or fever.Additional Common QuestionsIs a clitoral hood reduction a type of vaginal rejuvenation?Yes, a clitoral hood reduction is a type of vaginal rejuvenation. It improves the appearance and function of your genitalia.Other types of vaginal rejuvenation include:Labiaplasty to even out your labia.Vaginoplasty to repair vaginal injuries or defects.Vulvoplasty to reshape the outer part of your vagina.What’s the difference between a clitoral hood reduction and clitoroplasty?A clitoroplasty trims away some of your clitoris, making it smaller. A clitoral hood reduction removes tissue from the clitoral hood, making it smaller.Some people get clitoroplasties to improve the appearance and sensitivity of a clitoris that’s too large. An overly large clitoris may stick out, causing irritation and discomfort.Providers also perform clitoroplasties to correct damage from genital mutilation. This form of female circumcision still takes place in parts of sub-Saharan Africa, the Arab States, Asia and other regions. A clitoroplasty corrects the damage, restoring some degree of sensitivity to the area.For transgender women, a clitoroplasty is part of gender affirmation surgery. Providers use a person’s existing tissue to create a clitoris.A note from Cleveland ClinicTalking about your genitalia, especially as it relates to sexual pleasure, can be uncomfortable. Know that your surgeon is here to support you for all reasons you might be considering clitoral hood reduction. Your surgeon will listen to you, provide details about how they’ll perform the procedure, what results to expect and answer all of your questions.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/13/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"