"Cochlear Implants: Types & How They Work800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Cochlear ImplantsAdvertisementAdvertisementAdvertisementCochlear ImplantsCochlear implants are electronic devices that reduce hearing loss. They don’t restore hearing. Instead, they improve your ability to understand speech and hear more sounds. Most people who receive cochlear implants benefit by having audiologic therapy that helps them relearn how to hear.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewCochlear implants are electronic devices that reduce hearing loss. They don’t restore your hearing, but they can improve your ability to understand speech and hear other sounds. Cochlear implants work by creating a new pathway in your ear. The new pathway moves sound from your outer ear to your inner ear. There, it sparks an electrical signal your auditory nerve carries to your brain. Your brain interprets the signal as speech, music or other sounds.What are cochlear implants?Cochlear implants are electronic devices that reduce hearing loss. Cochlear implants don’t restore your hearing, but they can improve your ability to understand speech and hear other sounds.What are the types of cochlear implants?Cochlear implant types differ depending on the location of the external sound processor. External sound processors are one of the pieces of equipment used in cochlear implants. The processor may be:Behind your ear.Attached to your clothes.On your scalp.How cochlear implants workTo understand how cochlear implants work, it may help to know more about how you hear. Hearing starts with sound that travels from your outer ear and your middle ear to your inner ear. Your inner ear contains your cochlea, which supports hearing.Part of your cochlea contains very tiny hair cells. These hair cells connect with your hearing (auditory) nerve. Sound traveling from your outer ear to your inner ear hits your cochlea, sparking an electrical signal that your hearing nerve carries to your brain’s temporal lobe. Your temporal lobe perceives the electrical signal as sound that your brain interprets as speech, music or other noise.Cochlear implants essentially bypass your inner ear structure, creating a new pathway for sounds to make their way to your brain. It works like this:You wear a sound processer that sorts the sounds coming into your outer ear.The sound processor sends signals to a transmitter attached to your scalp with a magnet.The transmitter converts the signals into electric impulses that it sends to electrodes placed in your cochlea.The electrodes in your cochlea collect the impulses, sending them on to hearing nerves.The hearing nerves let your brain know sounds are coming in.How do I wear a sound processer?There are two styles of processors. One style sits on your ear with a cable that attaches to a disc on the side of your head. Another style attaches to the side of your head and doesn’t require an ear unit.Who could benefit from having a cochlear implant?Studies suggest there are many people who could benefit from having a cochlear implant, but only 2% of those people have implants. You don’t have to have complete hearing loss to benefit from having a cochlear implant.The U.S. Food and Drug Administration (FDA) has approved cochlear implants for people with moderate, profound or severe hearing loss. This includes people with hearing loss in both ears, hearing loss in one ear (single-sided hearing loss) or who have normal hearing for low pitches that drops off to moderate to severe hearing loss. Children age 9 months and older may have cochlear implants.If you’ve used hearing aids to cope with hearing loss, you may be a candidate for cochlear implants if your hearing aids work but you still don’t understand speech as well as you’d like.In general, healthcare providers recommend cochlear implants if you:Have significant hearing loss in one or both ears.Use hearing aids, but would like to hear better.Don’t have health issues that make it risky to have surgery.What tests are done before I have a cochlear implant?Your hearing team may do the following:Hearing tests: An audiologist may do tests to check the extent of your hearing loss, including your ability to hear sound and understand speech both with and without hearing aids. Hearing tests may include auditory brain stem response. This test checks the connections between your inner ear and brain. Audiologists may use this test to check hearing in children and people who can’t complete pure-tone tests.Vestibular test battery: Your inner ear also manages balance. Vestibular tests are another way to evaluate your inner ear health.Imaging tests: Providers may do a magnetic resonance imaging (MRI) test or computed tomography (CT) scan to examine your inner ear structure.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens during cochlear implant surgery?You’ll receive general anesthesia before surgery. Your surgeon then:Makes a small incision behind your ear to insert the implant.Creates an opening in the bone behind your ear that connects to your cochlea.Uses the opening to place the electrodes on the end of the implant that connect the cochlea to the transmitter.Uses sutures to close the incision behind your ear.What happens right after cochlear implant surgery?Cochlear implant surgery is an outpatient procedure. That means you won’t stay in the hospital overnight.What happens after that?About two weeks after your surgery, you’ll have a follow-up appointment where your audiologist will:Put the sound processor in place and adjust its fit.Check the transmitter and electrodes to be sure they’re working.Turn on the device and assess what you can hear.Adjust the device so you’re hearing as well as you can.Hearing is a learned behavior. If you have hearing loss, your brain needs to relearn how to process sounds. Most people with cochlear implants work with an audiologist or a speech-language pathologist (SLP) to help their brains understand what sounds mean. Patients need to be committed to doing auditory-based relearning to optimize the benefit.How long do cochlear implants last?That depends on the device. In general, the internal parts — the transmitter and electrodes — last indefinitely. The external parts — the sound processer and microphone — typically last five to 10 years.Care at Cleveland ClinicSchedule a Cochlear Implant EvaluationFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the potential benefits of this treatment?There are many benefits to having a cochlear implant, whether you’re someone with complete hearing loss or someone who can still hear with the help of hearing aids but wants to hear better.People with hearing loss who have cochlear implants can use phones and can often enjoy participating in conversations in groups or while in noisy places.Children born with hearing loss often learn to speak as soon as children who don’t have hearing loss.Do cochlear implants have a 100% success rate?Hearing loss is different for everyone who experiences it. For example, success for children born with hearing loss depends on their families’ goals for their child’s hearing.Almost all adults who develop hearing loss after having it throughout their lives do well with cochlear implants. How much benefit they get from cochlear implants depends on factors, including:Whether their hearing loss was sudden or gradual.How long they’ve had hearing loss.Whether they consistently used hearing aids before having hearing loss.Whether they wear their implant consistently.Whether they participate in hearing therapy.Likewise, success varies depending on people’s hearing loss goals and factors.AdvertisementWhat are the risks or complications of this treatment?All surgeries come with risk, including risks associated with general anesthesia and infection. The benefits of cochlear implants far outweigh the risks of surgery. Risks specific to cochlear implant surgery include:Nerve damage: Very rarely, cochlear implant surgery may damage nerves that run through your middle ear and near the spot where your surgeon needs to place your implant. If that happens, you could have taste issues, weakness on the side of your face with the implant or a sense of numbness around your ear.Meningitis: Rarely, people with unusual inner ear structures develop meningitis. Their providers may recommend they be vaccinated against meningitis to reduce the risk of developing the condition.Cerebrospinal fluid leaks: Rarely, people whose cochlea is shaped differently may develop this issue. You have fluid in the tissue that surrounds your brain and spinal cord, including the subarachnoid space. The subarachnoid space connects to part of your inner ear. Cochlear implant surgery involves placing holes in your inner ear. When that happens, you may develop a cerebrospinal fluid leak.Loss of residual hearing: Residual hearing is hearing you still have despite severe or profound hearing loss. Cochlear implant surgery may damage some remaining cochlear hair cells, so you don’t have that residual hearing.Dizziness or vertigo: Your cochlea also helps manage balance. Surgery may affect your sense of balance.Tinnitus (ringing in your ears): Cochlear implants typically reduce tinnitus, but tinnitus may be more noticeable during surgery.I have some hearing ability. Will I lose all hearing if I have a cochlear implant?No, you won’t. Historically, you could expect to lose all hearing after cochlear implant surgery. But improved cochlear implant surgery techniques and implant design means about 50% of people who do have some hearing retain their hearing after surgery.Recovery and OutlookHow long will it take before my hearing improves?It may take some time before you notice a big change for the better. That’s because your brain needs time to get used to receiving information from your hearing nerve. In general, people’s hearing improves about a month after their implant is activated. In some cases, it takes three to six months for people to reach their full hearing potential.In general, people’s hearing improves more quickly if they:Consistently participate in hearing practice and therapy.Consistently wear their implants anytime they’re awake.Wear their implants for the appropriate amount of time.What does noise sound like with a cochlear implant?You may notice that what you hear sounds different from what you remember. At first, what you hear may sound artificial or mechanical. That’s because your implant sound impressions are different from regular sound impressions.AdvertisementLiving with a cochlear implantYou’ll have this implant for life, which means you’ll work with audiologists and surgeons for the rest of your life. You’ll have regular appointments so your audiology team can confirm that:Your device is working well.The settings on your device are functioning at their best.Your skin at the site of the magnet is healthy.A cochlear implant can be a life-changing device. In addition to improved hearing, however, you may have to manage challenges, including:Medical examinations and treatments: You may not be able to have certain treatments, including ionic radiation therapy, electrical surgery or neurostimulation.Contact sports: Taking a hit on the field could dislodge your implant.What can I do to make cochlear implants help my hearing?There are many things you can do to increase the chance cochlear implants will make a difference in your hearing. Some suggestions are:Use the implant consistently: That means wearing the external processor while you’re awake.Participate in therapy: Your brain is relearning how to interpret signals. Participating in therapy helps that process.Connect with other people who have cochlear implants.Do cochlear implants affect my brain?No, they don’t. Cochlear implant surgery isn’t brain surgery. The electrodes in your cochlea send signals to your brain, but they don’t connect with your brain in a way that affects it.That being said, cochlear implant surgery does improve cognition. Cognition is your ability to gain knowledge and understanding through your senses, including hearing. Studies suggest cochlear implants can delay or reverse cognitive decline.When to Call the DoctorWhen should I call my healthcare provider?You should contact your provider if you notice hearing changes or you have ear pain or discomfort in your ears.A note from Cleveland ClinicA cochlear implant may be life-changing. If your child was born with hearing loss, a cochlear implant could be their first step into a world of sounds. If you have moderate, severe or profound hearing loss, it may be a way back to a world you thought you’d never hear again. But cochlear implant surgery is just the beginning. You or your child may need hearing rehabilitation therapy to help the brain relearn how to process sound. Your journey may take some time, so it may help to know your hearing team will be with you every step of the way.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/23/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule a Cochlear Implant EvaluationFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"