"Cognitive Behavioral Therapy (CBT): What It Is & Techniques800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Cognitive Behavioral Therapy (CBT)AdvertisementAdvertisementAdvertisementCognitive Behavioral Therapy (CBT)Cognitive behavioral therapy (CBT) is a structured, goal-oriented type of talk therapy. It can help manage mental health conditions, such as depression and anxiety, and emotional concerns, such as coping with grief or stress. CBT can also help manage nonpsychological health conditions, such as insomnia and chronic pain.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is cognitive behavioral therapy (CBT)?Cognitive behavioral therapy (CBT) is a structured, goal-oriented type of psychotherapy (talk therapy).Mental health professionals, including psychologists, therapists and counselors, use it to treat or manage mental health conditions and emotional concerns. It’s one of the most common and best-studied forms of psychotherapy.CBT is based on several core principles, including:Psychological issues are partly based on problematic or unhelpful patterns of thinking.Psychological issues are partly based on learned patterns of unhelpful behavior.Psychological issues are partly based on problematic core beliefs, including central ideas about yourself and the world.People experiencing psychological issues can learn better ways of coping with them. This can help relieve their symptoms and improve their mental and emotional health.During CBT, a mental health professional helps you take a close look at your thoughts and emotions. You’ll come to understand how your thoughts affect your actions. Through CBT, you can unlearn negative thoughts and behaviors and learn to adopt healthier thinking patterns and habits.CBT usually takes place over a limited number of sessions. Using a question-and-answer format, your therapist helps you gain a different perspective. As a result, you learn to respond better to stress, pain and difficult situations.CBT can be used alone or along with medication and other therapies. Your therapist will customize your treatment based on the issue you’re addressing.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat conditions can cognitive behavioral therapy (CBT) treat?Cognitive behavioral therapy is a valuable tool for treating and managing a wide range of mental health conditions and emotional challenges. People of all ages (including children) can receive CBT.Therapists and psychologists use CBT to treat many mental health conditions, including:Depression.Anxiety.Obsessive-compulsive disorder (OCD).Post-traumatic stress disorder (PTSD).Attention-deficit/hyperactivity disorder (ADHD).Phobias.Personality disorders.Eating disorders, including bulimia, anorexia or binge eating disorder.Substance use disorder and alcohol use disorder.When combined with medication, CBT is useful in treating bipolar disorder and schizophrenia.Studies have shown that CBT is also effective in helping manage nonpsychological medical conditions, including:Insomnia.Fibromyalgia and other causes of chronic pain.Chronic fatigue syndrome.Migraines.Irritable bowel syndrome (IBS).CBT can help people work through everyday challenges and life changes, too. You might seek help for issues such as:Relationship issues.Divorce.Problems at work.Grief.Adjusting to a new life situation or medical condition.Stress and coping difficulties.How do I find a CBT therapist?A therapist can be a psychologist, psychiatrist (a medical doctor who can prescribe medications), psychiatric nurse, social worker or family therapist.Finding the right therapist for you is often a time-consuming task. Try not to become discouraged. Talk to people you trust to give you a referral for a therapist who uses cognitive behavioral therapy, whether it’s your primary healthcare provider or a friend or family member.You can also search for therapists online through local and state psychological associations.Be sure that any therapist you’re interested in seeing is a state-certified and licensed mental health professional and that they treat your area of concern (for example, depression, eating disorders, substance use disorders, etc.).Most therapists’ websites list the conditions and problems they treat. If you have questions, call or email the therapist’s office before you choose.AdvertisementProcedure DetailsHow does cognitive behavioral therapy (CBT) work?Cognitive behavioral therapy is an evidence-based treatment that’s grounded in theory and skill-based dialogue (conversations). It provides a supportive, nonjudgmental and safe environment that allows you to talk openly with a mental health professional who’s objective and specially trained to help you with the issues you’re having.Cognitive behavioral therapy usually takes place over a limited number of sessions (typically five to 20). You shouldn’t expect results immediately. CBT usually takes time and sometimes involves uncomfortable work. Think of your therapist as a partner working with you through a process. If you keep working together toward the goals you’ve set, you’ll be able to mark your progress over time.Here’s how it works. Your therapist will:Gain an understanding of the issue: At the start of therapy, you’ll discuss challenges you’re dealing with, symptoms you’ve noticed and any concerns you have. If you’ve been diagnosed with a mental health condition, tell your therapist. This important first step will help you set goals for your therapy.Ask a series of questions: Depending on your situation, your therapist may ask you questions. You might discuss an incident in your past, fears or phobias, troubling behaviors or your thoughts and feelings. Together, you’ll explore your answers so you can gain insight into how you respond to challenges in your life.Help you recognize problematic thoughts and behaviors: Through interactive question-and-answer sessions, your therapist will encourage you to pay close attention to how you respond to tough situations. You’ll work together to identify unhealthy emotions, beliefs or behaviors that may be contributing to your troubles. Your therapist may ask you to keep a journal of these situations and your responses to them.Work with you to adjust your thoughts and behaviors: Your therapist will help you find ways to change negative emotions, thoughts and habits. You can change your perspective and adopt positive thought patterns and behaviors. Then, you can apply those skills to future situations.Care at Cleveland ClinicMental Health CareMake an AppointmentRisks / BenefitsWhat are the pros and cons of cognitive behavioral therapy (CBT)?Cognitive behavioral therapy helps you become more aware of your emotions, thoughts and behaviors. After CBT, most people adopt healthier habits. CBT can’t make stressful situations disappear, but you can respond to them more positively and feel better overall.Many studies show that CBT is as effective as, or more effective than, other forms of psychological therapy or psychiatric medications.Depending on your situation, you might feel slightly more upset during therapy. Your therapist can help you work through these feelings. You can use new skills to overcome negative emotions.AdvertisementRecovery and OutlookHow long will I need cognitive behavioral therapy (CBT)?Cognitive behavioral therapy usually lasts for 12 to 20 weeks. However, each person is unique, and mental health conditions are complex, so the length of therapy can vary.Try not to get discouraged by how long it may take to be able to better manage your thoughts and feelings and have a better quality of life. The important thing is that you’re seeking help. Any progress is good progress.When to Call the DoctorWhen should I see my healthcare provider?It’s normal to feel uncomfortable during therapy because it can be painful to explore negative emotions, fears and past experiences. If your symptoms get worse or you experience more severe anxiety or depression, contact your healthcare provider right away.Get help immediately if you have thoughts of suicide or if you’re thinking about harming yourself or others.A note from Cleveland ClinicWhile it can be overwhelming to acknowledge and seek help for a mental health condition or emotional difficulties in your life, it’s important that you do. Cognitive behavioral therapy (CBT) can help you better understand and work through the roadblocks that are preventing you from living a full and healthy life. Mental health professionals are experts in their field and have up-to-date knowledge on research and therapy strategies that can help you. Your mental health professional will tailor the therapy to your situation and needs.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/04/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicMental Health CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"