"Colectomy (Colon Resection Surgery): Definition & Procedure800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Colectomy (Bowel Resection Surgery)AdvertisementAdvertisementAdvertisementColectomy (Bowel Resection Surgery)A colectomy is an operation to remove part or all of your colon. It’s also called colon resection surgery. You may need a colectomy if part or all of your colon has stopped working, or if it has an incurable condition that endangers other parts. Common reasons include colon cancer and inflammatory bowel diseases.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a colectomy?A colectomy is a surgical operation to remove part or all of your colon. It’s also called colon resection surgery. Your colon is part of your large bowel, which makes colectomy a type of large bowel resection.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is the colon?Your colon is part of your large intestine, where waste from the food you’ve been digesting is gradually solidified into poop. After your colon, your large intestine continues into your rectum and anus, where food waste exits your body.Why is colectomy done?You may need to have part or all of your colon removed for many different reasons. This can include cancers or diseases that can't be treated with medications. Removing the affected portion helps to ensure that the rest of your gastrointestinal tract can continue to function.AdvertisementWhat conditions does colectomy treat?Many problems can occur that may require part of your colon to be removed.Conditions commonly treated with colectomy include:Colon cancer. When cancer is found in your colon, it’s important to remove the portion of your colon with cancer to figure out the stage of cancer and help prevent it from spreading.Precancerous conditions. If a colonoscopy reveals changes in your colon that have a high risk of progressing to cancer, your healthcare provider may recommend removing that portion of the colon preventatively. You may also choose an elective colectomy if you have an inherited condition with a high likelihood of progressing to colon cancer, such as familial adenomatous polyposis (FAP) or Lynch syndrome.Large bowel obstruction. If your colon is severely blocked and other treatments haven’t worked, surgery may be required to remove the blockage. A blockage may be caused by a twist (volvulus) or narrowing (stricture) of the large intestine.In persistent and severe cases, colectomy may be used to treat:Inflammatory bowel disease. If ulcerative colitis or Crohn’s disease has severely affected your colon, your healthcare provider may suggest a colectomy to relieve symptoms.Diverticulitis. When diverticulitis either occurs several times repeatedly, won’t improve with medical treatment, or causes damage to other nearby organs, a colectomy may be necessary.Uncontrolled bleeding. Injury and bleeding in your colon are difficult to treat from the outside. When gastrointestinal bleeding can’t be stopped, it becomes increasingly dangerous, and colectomy becomes a safer alternative.Is colectomy a major surgery?Most people would say so. While there’s no standard definition of major vs. minor surgery, colectomy has an operating time of several hours and a recovery time of up to six weeks, both of which are on the longer side. Besides, a colon resection impacts the way your food travels through your gastrointestinal tract. Some versions of colectomy may affect the way you go to the bathroom in the future.However, if conditions are favorable, colectomy surgery can be performed using minimally-invasive methods. If you are a candidate for laparoscopic or robotic surgery, your operation and recovery time will be shorter. These minimally-invasive surgery methods use smaller incisions than traditional open surgery, which means faster healing and less pain overall. Your condition will determine what kind of operation you have.AdvertisementWhat is the difference between a colectomy and a colostomy?A colectomy removes part or all of your colon. But what happens to the rest of your intestinal tract after the diseased tissue is removed? That varies, depending on several factors. Sometimes the two remaining ends of your intestines can simply be stapled together in the same surgery, and your intestinal tract can continue to function as usual. But sometimes that’s not possible. In this case, you may need an ostomy — either an ileostomy or a colostomy. The ileostomy or colostomy may be temporary or permanent.An ostomy is another surgical procedure that creates a new pathway for your poop to follow when the usual pathway is unavailable. If your system can’t pass your food waste along to your rectum and out through your anus, you'll need another way for your poop to come out. A colostomy or ileostomy lets waste come out through a hole in your abdominal wall, called a stoma. A pouch called an ostomy bag attaches to the outside of the stoma to collect the poop.Not all colectomies require an ostomy, and not all colostomies are permanent. You may only need one temporarily while your intestines are healing from the colectomy. After a few months, many ostomies are reversible, depending on your health. You may return to surgery to have the severed ends of your intestines reconnected (anastomosis) and your stoma closed. Others may need a permanent ostomy.Procedure DetailsHow do you prepare for a colectomy?Health screeningBefore scheduling a colectomy, your healthcare team will evaluate your fitness for surgery. In addition to a physical exam and health history, this may include:Blood tests.X-ray.Electrocardiogram (EKG) test.Urinalysis.Colonoscopy.Pre-operative counselingYour healthcare team will want to make sure you understand everything about the procedure before you sign your consent. They’ll counsel you about:Surgical risks.Living with a colostomy, if you’re going to have one.Options for pain management.Bowel prepWhen you have surgery on your bowels, it’s important for them to be empty. You’ll need to prepare for this a couple of days in advance. Your healthcare provider may ask you to:Consume only a clear liquid diet.Fast before the procedure (no food or drinks).Take a laxative or enema to clear out your bowels, like polyethylene glycol (Miralax®). These bowel preparations come with their own specific instructions.What happens when you have a colectomy?The specifics of your colectomy surgery will depend on the type of operation you’re having and the surgical method being used. The operation will follow a general pattern, though.General procedureIn general, you can expect your provider to:Put you to sleep under general anesthesia.Make one or more incisions in your abdomen (belly area).Carefully separate and remove the affected colon tissue.Connect the healthy bowel ends using staples or sutures, orCreate a stoma and redirect your bowel end to the stoma.Close your abdominal incisions.Open vs. laparoscopic/robotic surgeryYour surgeon may perform your colectomy by traditional open surgery or by minimally-invasive laparoscopic surgery.Open surgery means opening up your abdominal cavity through one long incision. This method provides the easiest access to your organs and may be necessary when your case is more complicated, or if you are having emergency surgery.Laparoscopic surgery is performed through several small incisions, using the aid of a tiny video camera called a laparoscope. If you have a laparoscopic/robotic colectomy, your surgeon will begin with a single small incision, which is used to place the laparoscope. They'll pump gas through the incision to inflate your abdominal cavity for better visibility, then place the camera, which will project your organs onto a video screen. One or more additional small incisions will give your surgeon access to your colon with special tools.Colon resection variationsYou may need all or only part of your colon removed. Operations to remove different sections of the colon have different names.Total colectomyA total colectomy removes your entire colon. This is the majority of your large intestine. It begins at the end of your small intestine and ends at your rectum, the tail end of the large intestine that leads into the anal canal.Partial / subtotal colectomyA subtotal or partial colectomy removes a portion of your colon. Your operation may go by a more specific name that references the section of your colon that's being removed. For example:Sigmoid colectomy. A sigmoid colectomy, or sigmoidectomy, removes the last section of your colon, known as the sigmoid colon. This is the part that connects to your rectum.Hemicolectomy. A hemicolectomy removes one side of your colon. A left-side hemicolectomy removes your descending colon, the section that travels downward on the left. This is in the latter half of your colon. A right-side hemicolectomy removes your ascending colon, the section that travels upward on the right side. This is roughly the first half of your colon.Proctocolectomy. A proctocolectomy removes part or all of the colon and the rectum with it. “Procto” means rectum. (A total proctocolectomy removes the entire colon and rectum.)Anastomosis or ostomyAfter your bowels have been resected, your surgeon may be able to join the severed ends right away. Or, they might have to wait and join them in another surgery later on. Sometimes they're not able to reconnect your bowels together. Your colectomy will end with one of these procedures:Anastomosis. Anastomosis means the two ends of your bowels are joined together, making your intestines whole again. Many if not most colectomies end this way.Colostomy / Ileostomy. If your bowels can’t be reconnected at the time of your colectomy, your surgeon will create a stoma in your abdominal wall. They’ll redirect the upper portion of your intestines to the stoma. If your colectomy removed the first part of your colon that connected to your small intestine, the end of your small intestine will be redirected to your stoma. This is called an ileostomy, after the ileum — the last part of the small intestine. If your colectomy removed a section from the middle or end of your colon, the upper part of your colon will be redirected to your stoma in a colostomy. These operations may be temporary or permanent.Ileal pouch. If you had a total proctocolectomy and your entire colon and rectum were removed, you might be a candidate for an ileaoanal anastomosis. That means your ileum can be connected directly to your anus, with the addition of an ileal pouch. The pouch is an internal alternative to a colostomy or ileostomy bag. Your surgeon creates the pouch out of the ileum, to serve as a reservoir to store waste as your rectum once did. This procedure often occurs in follow-up surgeries, but sometimes it can be done as part of your proctocolectomy surgery.What happens after colectomy surgery?You’ll spend a few days recovering in the hospital before you’re discharged. It might be two days or up to a week, depending on what kind of operation you had and how you are doing. During this time, you’ll be:Monitored for any signs of complications from the procedure.Gradually weaned from your pain medication.Fed with a liquid diet or soft diet.Waiting for your bowels to begin functioning again.You’ll also receive counseling on how to take care of yourself when you get home. This may include:Wound care.Ostomy care.Dietary advice.Risks / BenefitsWhat are the potential risks or complications of colectomy?Complications are rare, but they're always possible. Complications of colectomy may include:Bleeding.Infection.Injury to nearby organs.Anastomotic leak.Recovery and OutlookHow long does it take to recover from a colectomy?Recovery at home takes up to six weeks. Many people get back to most of their usual routines within two weeks after surgery. Try to be extra gentle with yourself in the first few days after you get home. Getting up to walk around is good for you, but you may feel weak. Don’t try to do too much, too soon.What can I eat after a colectomy?You'll likely meet with a dietitian or nutritional counselor after surgery to give you specific advice. They may recommend sticking to a low-fiber diet for up to one month after surgery. Low-fiber foods create less work for your colon while it’s trying to heal. They may also recommend you drink more water.When to Call the DoctorWhen should I call my healthcare provider?Call your provider anytime you have concerns, especially if you have:Redness, swelling or foul odor near the incision site.Any pain (especially around your belly) that gets worse over time.No bowel movements after returning home.Signs of infection like fever or vomiting.What questions should I ask my healthcare provider?If your provider has recommended you have a colectomy, you may want to ask:What type of colectomy do you recommend for me?How comfortable and experienced are you with performing this procedure?Do you plan to use a laparoscopic, robotic or open approach to surgery? Why?How should I prepare for surgery?What should I expect during my recovery? When can I expect to feel like my normal self?What are the main risks and complications of this procedure?Will this surgery change how I eat or use the bathroom?Do I have other options that may treat my problem?A note from Cleveland ClinicWhile colectomy is major surgery, it is largely safe and effective. Recent medical advances may help you get back to your usual routines faster than you expect. If you’re concerned about potentially needing an ostomy, reach out to your provider. They can answer any questions or concerns you have about how an ostomy bag may affect your life. You may not need one at all. But if you do, you should know that having a colostomy bag doesn’t have to stop you from living a full, active and happy life.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/24/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"