"Colostomy & Colostomy Bags: Definition, Procedure & Care800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/ColostomyAdvertisementAdvertisementAdvertisementColostomyA colostomy is a surgical procedure that changes the trajectory of food waste through your bowels. When part of the colon needs to be bypassed for medical reasons, surgeons make a new opening in your abdominal wall for poop to come out. With a colostomy, you poop into a colostomy bag. The operation can be temporary or permanent.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a colostomy?A colostomy is an operation that redirects your colon from its normal route, down toward the anus, to a new opening in your abdominal wall. The opening is called a stoma. The colon, where poop forms, will now expel poop through your stoma instead of your anus. You may need to wear a colostomy bag to catch the poop when it comes out. Some people only have a colostomy for a few months, and others need it for life.A colostomy often follows a colectomy, a procedure to remove part or all of your colon. Other conditions may require you to stop using your colon, either temporarily or permanently. After the operation, “colostomy” also refers to your newly redirected colon. Your healthcare provider will talk to you about living with and caring for your colostomy.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy would you need a colostomy?You may need a colostomy if you have a medical condition that requires you to stop using your colon or anus normally. It may be a temporary intervention that allows your body to heal, or it may be a permanent solution for an irreversible condition.Some conditions that may require a temporary colostomy include:Serious infection, such as diverticulitis.Acute inflammation from inflammatory bowel disease (IBD).Acute injury to your colon.An obstruction (or blockage) in your colon or anus.Anal fistula (a tunnel leading from your anal cavity through to your skin or another organ).Partial colectomies (when the remaining ends of the bowels can be reattached later).Some conditions that may require a permanent colostomy include:Incurable fecal incontinence.Advanced colorectal cancer.Permanent removal of the rectum and/or anus.What's the difference between a colostomy and an ileostomy?The colon and the ileum are two different parts of the bowels, also called the intestines. The colon is part of the large intestine, and the ileum is part of the small intestine. In your body, food waste normally passes from your ileum into your colon, where it forms into solid stool. But if the first part of your colon that the ileum feeds into is removed or inactive, this pathway is interrupted.In this case, an ileostomy redirects your ileum to a stoma in your abdominal wall. When you have an ileostomy, you expel liquid waste from your small intestine through your stoma into an ostomy bag. Like a colostomy, an ileostomy may be either temporary or permanent, depending on your condition. Sometimes, when the colon is permanently unusable, surgeons can create an internal “ileal pouch” to replace it, and close the stoma.AdvertisementHow common is ostomy surgery?About 100,000 people in the U.S. each year undergo ostomy surgery. About 1 in 500 Americans — up to 1 million people — live with an ostomy. Some call themselves “ostomates.” Because it’s so common, there are a variety of specialized products on the market today to help ostomates live normally and discreetly with their ostomies, including different kinds of ostomy bags, underwear and swimwear. You can also find ostomy support groups in most areas.Procedure DetailsWhat happens before a colostomy?A colostomy is a major surgery, and it involves some preparation.Before the surgery: You’ll have what’s called a pre-operation assessment meeting with your surgeon. They’ll make sure you fully understand the procedure, the risks involved and the lifestyle changes you’ll have to make afterward before you sign your consent forms. You may also discuss your pain management options at this time. A nurse will take a blood sample to check that you are well enough for surgery. They may also have an EKG test to check that your heart is in good health.On the day of the surgery: You’ll need to avoid eating or drinking for six hours before surgery. Sometimes, you may be given an enema or bowel prep (like before a colonoscopy) to take at home. When you arrive at the hospital, you’ll change into a hospital gown. You’ll then be taken to a pre-op room to wait for your operation. Once you are in the operating room, you'll receive your anesthesia for surgery.AdvertisementWhat happens during the colostomy procedure?Colostomies may be performed through either laparoscopic surgery or open surgery:Laparoscopic surgeryLaparoscopic surgery is a newer, less invasive method than traditional open surgery. It’s done using a tiny lighted camera called a laparoscope. Your surgeon makes a small incision in your abdomen and inserts the laparoscope, which shows your abdominal organs on a screen. Your surgeon can then complete the surgery using one or more smaller incisions to access your organs. Because the incisions are smaller, laparoscopic surgery is associated with fewer complications, less pain and a faster recovery time. But not every surgery can be successfully carried out this way. Sometimes, a complicated case may require a planned laparoscopic surgery to convert to open surgery.Open surgeryIn an open surgery, the surgeon uses one long incision to open up your abdominal cavity. This the traditional way to access your abdominal organs, and it allows for better access, which is sometimes required. But it is considered a major surgery and carries a longer recovery time. Whether you have an open or a laparoscopic colostomy may depend on the condition you are treating and what else the surgeon needs to accomplish during the surgery besides the colostomy. In most cases, you’ll know in advance which type you’ll have and be able to plan accordingly.There are two general types of colostomy operations performed:Loop colostomyA loop colostomy is often the method of choice when a colostomy is meant to be temporary because it's easier to reverse. In this procedure, your surgeon identifies the section of your bowel that needs to be turned into the colostomy and pulls that section as a loop through an incision in your abdomen. The surgeon then snips the loop and places the two open ends side by side in your abdominal opening, creating two ends of the stoma. One is where your poop will come out through the remaining active part of your bowel. The other is connected to the remaining inactive part of your bowel, leading to your anus. This opening allows mucus to be discharged.End colostomyAn end colostomy is often done when the colostomy is expected to be permanent. In this procedure, after your bowel is cut, the end of your remaining active bowel is stitched to the opening in your abdominal wall, and the end of the remaining inactive bowel is sealed. You’ll have one stoma for poop to come out, and if you still have your anus intact, you'll discharge mucus through your anus instead of a stoma.What happens after the procedure?Your colon has four different sections where it may have been cut, depending on where the problem was. Colostomies in each section will have slightly different outcomes.Ascending colostomyThe ascending colon is the first section of colon that your small intestine feeds into. It’s called “ascending” because it travels up the right side of your abdomen. If you have an ascending colostomy, only a small segment of your colon will be left active. This means that the remaining colon will not have much chance to do what the colon does with food waste. Food waste that passes from the small intestine into the ascending colon is still very liquid and not fully digested. In the ascending colon, there are a lot of digestive enzymes in the mix to help break the waste down further. This is the liquid waste that will pass through your stoma after an ascending colostomy. You’ll have to take special care to prevent leakage and protect your skin from the abrasive enzymes in the poop.Transverse colostomyThe transverse colon is the second segment of the colon, which travels horizontally across your abdomen from the right side to the left side. This is also roughly the middle of your bowel. Transverse colostomies are often done to give the lower half of your bowel a rest, and sometimes to bypass it permanently. If you have a transverse colostomy, your poop will be a little more solid and have fewer digestive enzymes in it, but it still won’t be like the stool you’re used to. Because this is the high point of the colon, your colostomy may also be placed relatively high on the abdomen, which can make it more challenging to conceal.Descending and sigmoid colostomiesThe descending and sigmoid colon are the lower segments of the colon. The descending segment travels down the left side of your abdomen, and the short sigmoid “tail” end curves a little to the right and down. If you have a colostomy in either of these sections, you’ll have most of your colon left active. This means the poop that comes out of your stoma will be more familiar. It will have had time to solidify and the digestive enzymes will have been absorbed, so it won’t be irritating to the skin. You might even have a natural reflex to poop at a regular time of day and be able to plan around your bowel movements.Risks / BenefitsWhat are the advantages of colostomy?Colostomy is often the final stage of a more complicated surgery, such as a colectomy. When this is the case, the surgery as a whole is typically a life-saving intervention. A colostomy makes that intervention possible. If you require a colectomy or similar operation, a colostomy allows your body to continue functioning with the loss of a major organ.Other people may need to give their colon a temporary rest to heal from illness or injury. When this is the case, a colostomy allows that healing to take place safely without risking further complications. The illness or injury you are healing from might not seem like a life-threatening emergency yet, but it is the colostomy that prevents it from becoming one.Your survival and long-term health are the primary purposes of a colostomy. For some, it also improves their quality of life. If you have suffered a long time from chronic bowel diseases, having a colostomy can mean freedom from being ruled by your bowels. Now, you no longer have to live in the bathroom, attending to a temperamental colon.What are the risks of the surgery?Colostomy is a common and straightforward surgery. It’s generally safe, but there are always some risks. These include:Reactions to the anesthesia.Breathing problems under anesthesia.Injury to nearby organs.Infection.What complications might occur while living with a colostomy?Even when the surgery is successful, you might run into some complications with your colostomy down the road. These include:Skin irritation from contact with stool, especially the acidic, liquid stool of the upper colon. This is the most common stoma complication. It can usually be solved with a better-fitting bag.Bowel obstructions from scar tissue or from paralytic ileus (slow-moving bowels) after your surgery, preventing poop from passing. This can usually be solved with home constipation remedies.Stoma retraction or prolapse. A retracted stoma sinks back below the skin surface level. A prolapsed stoma sticks out too far. Both of these situations can make it difficult to fit your colostomy bag securely to your stoma. If you can’t find a bag that fits, your surgeon may have to re-site or revise your stoma.Parastomal hernia. This type of hernia occurs when loops of bowel bulge through the weakened abdominal muscles around your stoma. A hernia forms a visible bulge next to the stoma and can grow over time, potentially blocking your stoma’s output. Your colostomy nurse will talk to you about preventative measures you can take to prevent a hernia from developing after the surgery.Recovery and OutlookWhat is the recovery time from a colostomy?You’ll need to recover in the hospital for the next three to seven days. During this time, you’ll:Resume normal eating gradually. You’ll probably be fed a clear liquid diet for the first day after surgery, then progress to a full liquid diet or soft diet before resuming solid food.Learn all about colostomy care. A wound ostomy continence nurse (WOCN) will teach you about living with a colostomy bag and how to care for your stoma.Gradually wean from your pain medications. You may be given a short-term prescription to take home with you.Heal from your wounds, and your bowel movements will begin to regulate. It may take several days before your first one.What does a stoma look like?The first time you look at your stoma, it may appear bruised, red and swollen. This will subside over the next few weeks. It will shrink and fade to a soft red or pink. Since it is the inside of a tube (your intestines) you're looking at, it will be roundish in shape. It may look a little different from person to person. It may stick out a little or be flat against the skin.What does it feel like to have a stoma?The colostomy wound may hurt a little while it heals. You can use over-the-counter pain medications to manage it temporarily. The stoma itself is simply the end of your intestine. It has no nerve endings and doesn’t have any sensation. Once the surgery wound heals around the stoma, you won’t feel it.You might have a variety of emotional feelings about having a stoma, or an ostomy. You might worry about how other people in your life will feel about it. Your ostomy nurse can help talk you through this. They can also connect you with other people living with ostomies whom you can talk to.Can you still poop with a colostomy bag?Pooping will be different with a colostomy bag. Immediately after your surgery, your anus may continue to expel poop and other fluids that were left inside. But new poop will now exit through your stoma. Most people will be able to feel their bowels move and know when poop is about to come out. But you won’t be able to control it anymore. Unlike your anus, your stoma doesn’t have a muscle system that allows you to close it at will. So pooping won’t be the intentional action that it used to be.Some people who've had their colon removed may continue feeling phantom bowel movement urges, similar to phantom limb syndrome. They find that the urges subside if they sit on the toilet like they used to. If you still have your anus intact and you don’t have a separate stoma for anal discharge, you will continue to pass occasional mucous through your anus. This will feel similar to a bowel movement. The inactive colon continues to produce mucus as it always did, to lubricate and protect the skin.Will I always have to wear a colostomy bag?Many people choose to wear a colostomy bag at all times to catch poop when it comes out. This is easy to do, as modern colostomy bags are discreet and can be worn under almost any kind of clothing. People who have had descending or sigmoid colostomies, leaving much of their colon intact, may be able to predict when they will have a bowel movement and only wear a pouch during those times. They also may be able to induce regular bowel movements through a process called colostomy irrigation. By spending time daily clearing out their bowels with water, people can go without a bag between irrigations.What is the life expectancy of someone with a colostomy?If you need a colostomy, it’s likely because you already have a life-threatening condition. Different conditions come with their own life expectancy rates. The purpose of the colostomy is to improve those odds, and it generally does. But there are too many other factors involved to calculate life expectancy from the surgery alone. For example, the average age of someone receiving a colostomy is 70. Patients of this age may have other health issues besides the colostomy.When can I have a colostomy reversal?This will depend on a few factors, including:The reason you had a colostomy created.Your health since the operation.Whether you can handle more surgery.If your colostomy was intended to be temporary, you can discuss plans for a reversal with your doctor during follow-up visits after your surgery. They will assess your condition and schedule your reversal surgery when they feel you are ready. It might be a few months to a year after your first surgery. Sometimes, it's several years. There’s no time limit to a reversal, only health limits.When to Call the DoctorWhen should I see my healthcare provider about my colostomy?Contact your general care provider or ostomy nurse if you experience:Persistent constipation or diarrhea.Persistent nausea or vomiting.Blood in your stool.A change in your stoma’s regular size or color.Any strange foul odors coming from your stoma.A blockage in your stoma.A note from Cleveland ClinicA colostomy is often a life-saving operation, and it’s certainly life-changing. Whether it’s temporary or permanent, life with a colostomy requires a substantial adjustment. But you won’t be alone. There’s a wide community of ostomates living with ostomies who can help initiate you and offer companionship through the ins and outs of it. There’s also a wide industry of products available to make your life easier. People with colostomies live full and normal lives, and often enjoy more comfort and freedom than they did before the operation. After they’ve healed, some will go on to reverse the operation and resume normal bowel function. Others may have permanent colostomies — but they will also have longer lives.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 12/01/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"