"Condom Catheter For Incontinence: Application, Use & Care800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Condom Catheter for IncontinenceAdvertisementAdvertisementAdvertisementCondom Catheter for IncontinenceExternal catheters, including condom catheters, are used to treat conditions like urinary incontinence. Condom catheters may cause fewer urinary tract infections than other catheters.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewCondom catheters are put on like condoms and have tubing that drains the urine to a urine collection bag attached at the thigh.What is a condom catheter?A condom catheter is a urine (pee) collection device that fits like a condom over your penis, but also has a tube that goes to a collection bag strapped to your leg. Other names for this product include external urinary catheters and penile sheath catheters.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy would you need to use a condom catheter?People who have urinary incontinence may choose to use a condom catheter. Urinary incontinence refers to a loss of bladder control, which results in urine leaking out when you don’t want it to. Other external incontinence products include absorbent pads and disposable absorbent underwear. There are also catheters that are inserted into the urethra (indwelling catheters).You may need to use a catheter for other reasons. You may be unable to move easily or you may have had a recent medical procedure that limits your movement.Procedure DetailsHow do you choose a condom catheter?You need to first choose your product. Some condom catheters use latex, while others use are made of silicone. You need to consider this factor if you have a latex allergy.Condom catheters are also available in different sizes. You’ll need to measure the circumference of your penis at the base of the shaft. This is the place that the girth is largest. You’ll use this figure to find your size.You can also choose the way that the condom catheter is applied. Some products come with adhesive attached (self-adhesive). Other products are non-adhesive. You need to use glue that is meant for skin, tapes or adhesive strips to attach these condom catheters.AdvertisementHow do you use a condom catheter if you have a penis?You put a condom catheter on the same way you put on a condom: Roll it onto your penis, leaving a small space at the tip. This space should be about half an inch long. This will improve urine flow.Make sure that the condom fit is comfortable and secure, but not too tight. When you’ve attached the condom catheter to your clean skin, you then to connect the device to the urine drainage/collection bag.Some brands of external catheters are meant to be used with special underwear that helps to keep the catheter in place.Always wash your hands with soap and water when putting the catheter on. Clean your penis and the area around it, but make sure it’s dry when you attach the adhesive or use the skin glue. Wash your hands with soap and water after you've applied the catheter.How do you use an external urinary catheter if you have a vagina?There are external catheters for people with female anatomy, even though the anatomy isn’t as easily covered as a penis.One type has an external catheter system that covers the vulva. This type of urine collection device comes with adjustable underwear and uses a soft and absorbent pad that drains into a urine collection bag.Another type of female external urinary catheter has a curved tube like a thin banana. It’s covered with absorbent wicking material and runs from your pubic bone to the buttocks. The catheter uses a slight vacuum and attaches to a collection container.These catheters aren’t useful for walking around — they’re designed to be used only when you’re sitting or lying down.AdvertisementHow long can you wear a condom catheter?You will need to empty the urine collection bag when it’s full. You should change your condom catheter every day.Always wash your hands with soap and water when putting your catheter on or taking it off. Don’t reuse the catheters. If you reuse the drainage bag, wash it thoroughly.Risks / BenefitsWhat are the advantages of using a condom catheter or other type of external catheter?External catheters:Cause fewer catheter-associated urinary tract infections than indwelling catheters.Cause less damage to urethras than indwelling catheters.Can be used by non-medical professionals at home.May be more comfortable than indwelling catheters.What are the risks or complications of external catheters, including condom catheters?Risks or complications of external catheters include:Urine leakage.Skin conditions that range from mild irritation to necrosis (tissue death).Urinary tract infections.Your healthcare provider may not recommend a condom catheter if have a blockage in your urinary system or if you're unable to put the device on and take it off.When to Call the DoctorWhen should I see my healthcare provider?If you’re having trouble with urinary incontinence, talk with your healthcare provider. They’ll work with you to find the best solution for you.Call your provider if you’re using an external catheter and you any of these symptoms:Fever.Discomfort while urinating.Frequent urination.Blood in the urine (hematuria).Skin irritation, rashes or sores.A note from Cleveland ClinicThere are several reasons why you might consider using a condom catheter or female external urinary catheter. You may find that you’re not able to control your bladder or you might need some help after a procedure. Make sure that you understand how to put the external catheter on and how to take it off, as well as how to care for it. Talk with your provider about complications you should watch for.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/15/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"