"Continuous Glucose Monitoring (CGM): What Is It & How Does It Work800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Continuous Glucose MonitoringAdvertisementAdvertisementAdvertisementContinuous Glucose MonitoringContinuous glucose monitoring (CGM) devices help you manage Type 1 or Type 2 diabetes with fewer fingerstick tests. A sensor just under your skin measures your glucose levels 24 hours a day. A transmitter sends results to a wearable device or cell phone. It takes time to learn how to use CGM, but it can help you more easily manage your health.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is continuous glucose monitoring (CGM)?Continuous glucose monitoring is wearable technology that makes it easier to track your blood sugar levels over time. Blood sugar is another term for blood glucose.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat does CGM measure?CGM is a tool for people with diabetes. It measures your glucose levels 24 hours a day when you are wearing the device.Insulin is a hormone that helps your body regulate blood sugar levels. If you have Type 1 diabetes, your body doesn’t produce enough (or any) of the hormone insulin. In Type 2 diabetes, your body makes insulin but doesn’t use it effectively.People with diabetes need to give themselves insulin regularly to keep blood sugar levels steady.Why do people with diabetes need to track blood sugar levels?Tracking blood glucose levels tells you how much insulin your body needs and when. Blood sugar levels that go up and down a lot can damage your body in different ways. Very high (hyperglycemia) or low (hypoglycemia) blood sugar levels can be serious, and even life-threatening when not treated quickly.Many things (like the foods you eat, sports you play and your lifestyle) can affect your blood sugar levels. But diabetes affects everyone differently. How a food or activity affects one person’s glucose levels is often different from how that same thing affects someone else.Your body can also be unpredictable. Sometimes, your body can have a reaction that even healthcare providers don’t always understand. All of these factors can make managing diabetes challenging, even when you think you’re doing everything right.AdvertisementDo I need CGM to manage diabetes?You can regularly check your blood glucose levels using a fingerstick blood check and a blood glucose monitor. Many people do just that.But fingerstick checks only measure blood glucose at one moment in time. It’s like reading one page of a book. Doing more fingerstick checks gives you more snapshots, which can offer clues to what’s happening with your blood sugar levels.Procedure DetailsHow do continuous glucose monitoring (CGM) devices work?You can choose among a handful of CGM devices available today. Each works pretty much the same way. The main differences are in a device’s look, feel and features.In general, here’s how CGM works:You place a small sensor just under your skin, usually on your belly or arm. An applicator makes this part quick and easy to do. Adhesive tape holds the sensor in place.The sensor measures glucose levels in the fluid under your skin. Most CGM devices take readings every five minutes, all day and night. You’ll need to change the sensor regularly based on the device. For most devices, you change sensors at home every 7 to 14 days. For some long-term implantable CGM devices, your healthcare provider will change the sensor in a procedure in their office a handful of times (or less) each year.All CGM systems use a transmitter to wirelessly send the glucose data from the sensor to a device where you can view it. For some CGM systems, the transmitter is reusable and attaches to each new sensor. For other CGM systems, the transmitter is part of the disposable sensor.Depending on the CGM system, glucose data from the sensor is sent to either a handheld device called a receiver (similar to a cell phone), an app on your smartphone or an insulin pump.You can download CGM data (real-time glucose levels, trends and history) to a computer anytime. Some CGM systems will send data continuously. You can also share the information with your provider.AdvertisementAre continuous glucose monitoring devices easy to use?CGM devices are complex little machines. They do require some upfront time to understand their technical aspects.For example, you will need to learn how to:Insert the sensor properly.Calibrate the device with fingerstick blood glucose readings (for certain CGM devices).Set device alarms.Transfer data to a computer (for long-term analysis) or your phone.Respond to and make changes to your care plan based on the collected data.Do I need to figure out how to use a CGM device on my own?It takes time and patience to understand how a CGM device works. But you don’t have to do it alone. Your provider will need to prescribe a CGM device (much like any medication).Once you have a CGM, a qualified professional helps you learn how to use it safely. Your provider may recommend taking a diabetes education class or speaking one-on-one with a certified diabetes educator (an expert in diabetes tech).Care at Cleveland ClinicDiabetes CareMake an AppointmentRisks / BenefitsWhat are the advantages of using CGM to manage diabetes?Using a CGM device can make it easier to manage Type 1 or Type 2 diabetes. Some people use CGM for a week to understand their blood sugar patterns. Most use CGM long-term.A CGM device can:Show you a bigger picture of how diabetes affects you: CGM measures glucose levels every few minutes. That data shows a more complete picture of how your blood sugar levels change over time. This information can help you and your provider better understand how things like food, activity, stress and illness impact your blood sugar levels.Lead to more personalized care: CGM doesn’t give the whole story of all the ways diabetes affects you. It tells you when glucose goes up or down, not why. But your provider can download CGM data from your device and review it for patterns and trends. They can then personalize your care based on what they learn.Alert you to highs and lows: Most CGM devices send an alert when your glucose levels rise or fall a certain amount. With this information, you can make changes quickly. You may be able to treat or prevent highs or lows before they turn into a big problem.Reduce how many fingerstick checks you need to do: CGM significantly reduces how many fingerstick tests you’ll need to do each day.Recovery and OutlookIs CGM a cure for diabetes?CGM is not a cure for diabetes. It's a tool (and not one you can set and forget). You need to actively use CGM for it to be helpful. But once you get the hang of how to use it, CGM may help you better manage your blood sugar levels and overall health in less time.Can I stop doing fingerstick checks to monitor my blood sugar if I have a CGM device?No. Fingerstick checks will still be an essential tool for you to manage diabetes.Because fingerstick checks measure glucose levels in your blood, they provide the best picture of what your glucose level is at the precise moment you take it. CGM measures glucose under your skin, which shows where your glucose levels were five to 10 minutes ago.With diabetes, certain things can make glucose levels rise or fall quickly. Big or fast changes in blood glucose levels can be dangerous. Doing a fingerstick check can provide important information to help you take action to protect your health. It can also act as a backup tool to confirm CGM results.When might I need to do a fingerstick check when using a CGM device?You may need to do fingerstick checks to calibrate (set up or adjust) a CGM device. Either way, you’ll likely still need to do fingerstick checks to look at your blood glucose in certain situations.For example, a fingerstick check may give you peace of mind if your CGM device shows rising or falling numbers, but you feel OK. It can also provide answers if you don’t feel well, but the CGM says your glucose levels are in target.When to Call the DoctorWhen should I call the doctor?Reach out to your provider if you have any questions about how to use a CGM device safely.Very high or low blood sugar levels can be dangerous when left untreated for too long. In the most severe cases, this can lead to seizures, coma or even death. You can avoid these complications by keeping blood sugar levels in a healthy range. Call your provider if you have any symptoms you’re worried about.Common symptoms of high blood sugar include:More frequent urination (peeing).More thirst than usual.Nausea or vomiting.Problems thinking clearly.Additional DetailsIs a continuous glucose monitor the same as an insulin pump?No, CGM devices and insulin pumps are not the same.They do very different things:CGM devices measure your glucose level automatically every few minutes, all day long.Insulin pumps deliver a steady flow of insulin based on instructions you give.But they are similar in some ways. Both CGM devices and insulin pumps are:Automated: They work all day and night for as long as you wear them.Worn directly on your body: Most people wear CGM devices and pumps on their arm or belly.Customizable: You can adjust CGM and pumps based on your life and how diabetes affects you.Convenient: With CGM, you need fewer fingerstick tests. Insulin pumps mean fewer injections (insulin shots).Not a quick fix: CGM and pumps both help you better manage diabetes. But each device requires you to actively use it and direct your own treatment decisions.Can I use a continuous glucose monitor and an insulin pump at the same time?Yes, many people use both a CGM device and an insulin pump. But you can also choose to use one and not the other (a CGM device or an insulin pump).Are there benefits to using a CGM device and an insulin pump?While both devices offer unique benefits, CGM systems and pumps that work together can offer additional benefits. Some pumps will make certain insulin delivery adjustments automatically based on data from a CGM. Even these joint systems still require user input and management but can offer an added level of safety and a quicker response to increasing and decreasing glucose levels.How much does continuous glucose monitoring cost?CGM devices can be expensive. More and more insurance providers cover them today, which may make the cost more affordable. Your health insurance policy may only cover certain CGM devices.Keep in mind that you’ll need to replace sensors and possibly transmitters regularly. Check with your insurance provider to see what devices and supplies your plan covers. Many providers and CGM companies have resources to help make CGM more affordable for those who need it.A note from Cleveland ClinicLearning how to use a CGM device can take time. It’s not a diabetes cure or a quick fix. But it has the potential to help you better understand the disease. A CGM device lets you keep a closer eye on glucose trends (instead of individual glucose numbers). By seeing the bigger picture, you can prevent problems or catch them early on to better manage your health. CGM’s automated, “always-on” setup may give you more freedom, flexibility and peace of mind. It could also help you focus on other things without worrying about your blood sugar as much.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/07/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicDiabetes CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6568Appointments & LocationsRequest an AppointmentVirtual Visits for DiabetesFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"