"Convalescent Plasma: What It Is & How It Works800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Convalescent PlasmaAdvertisementAdvertisementAdvertisementConvalescent PlasmaConvalescent plasma is a treatment therapy that provides passive immunity for someone who has an illness for the first time. Healthcare providers may use convalescent plasma therapy when there are new viral outbreaks, such as COVID-19.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is convalescent plasma?Convalescent plasma (also called immune plasma or hyperimmune plasma) is blood plasma that a person who has recovered from a specific illness has donated for the goal of providing passive immunity to a person who currently has that specific illness. Convalescent plasma contains antibodies to the germ or virus that caused the illness, so a person who has that illness for the first time may receive the plasma to boost their ability to fight the pathogen.The word “convalescent” describes anyone recovering from a disease.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCan convalescent plasma therapy be used to treat COVID-19?The U.S. Food and Drug Administration (FDA) has given emergency use authorization (EUA) for convalescent plasma therapy with high antibody levels (“high titer”) to help treat COVID-19 in people who are in the hospital and are in the early phase of the virus.Based on scientific evidence available, the FDA has concluded that convalescent plasma may be effective in treating COVID-19 and that the known and potential benefits of the plasma therapy outweigh the known and potential risks.Healthcare providers do not rely solely on convalescent plasma to treat cases of COVID-19.What is plasma?Plasma is the liquid portion of blood. Approximately 55% of your blood is plasma. The remaining 45% of your blood consists of red blood cells, white blood cells and platelets that are suspended in the plasma.About 92% of plasma is water, but it also contains the following important components:Salt.Enzymes.Antibodies.Clotting factors.Albumin and fibrinogen, which are proteins.When you donate blood, healthcare providers can separate these vital components from your plasma, which they can then concentrate into various products for treatment therapies. Convalescent plasma is one of those therapies. Healthcare providers are looking for certain antibodies in your plasma when you donate convalescent plasma.AdvertisementHow does my immune system work?Your immune system is a complex network of organs, white blood cells, antibodies and chemicals that work together to protect against infection, illness and disease.When your immune system is working properly, it can tell which cells are yours and which cells and substances do not belong in your body. It activates, mobilizes, attacks and kills invader germs and pathogens that can make you sick.Your immune system learns about germs after you’ve been exposed to them, and your body develops specialized blood proteins called antibodies to protect you from those specific germs. The antibodies kill the germs and prevent them from spreading to other cells in your body. It can take several days for your immune system to form antibodies against a specific germ that has entered your body for the first time.Your immune system then “remembers” germs and pathogens that have entered your body and can respond and release specific antibodies to attack them right away if they enter your body again.How does convalescent plasma therapy work?The goal of convalescent plasma is to provide passive immunity — short-term immunity that results from introducing antibodies from another person. Healthcare providers may give convalescent plasma to people who have an illness that their immune system hasn’t responded to yet because they’ve never had the illness before.A person who donates convalescent plasma has already had and recovered from the specific illness. Because of this, they have the antibodies needed to attack and kill the pathogen that causes the illness.When a person who has a specific illness for the first time receives the convalescent plasma, the antibodies in the plasma bind to the disease-causing virus or bacterium and can potentially decrease or prevent the virus from entering into their cells and reproducing.If you have not been previously exposed to or vaccinated against a pathogen, it can take as long as two to three weeks for your body to form antibodies against it. Providing antibodies through convalescent plasma has the potential to:Prevent illness.Shorten the length of time you’re sick.Lessen the severity of your illness.AdvertisementWho receives convalescent plasma therapy?In general, people who are either early in their illness or who have weakened immune systems may be given the option of convalescent plasma therapy.Scientists aren’t sure if convalescent plasma can benefit someone whose illness has progressed to organ damage or extreme inflammation, and healthcare providers don’t expect convalescent plasma to treat these complications. This is why providers suggest providing convalescent plasma in the early phase of the illness, especially for people who have weakened immune systems.What conditions does convalescent plasma treat?Scientists and healthcare providers use convalescent plasma primarily to try to treat people who have been exposed to new viruses. This is because the vast majority of the population does not have antibodies to a new virus outbreak, and scientists and providers may not know the best way to treat a new virus at first.Providers have used convalescent plasma as a treatment therapy to provide passive immunity for several viral outbreaks, including:Coronavirus disease (COVID-19, or SARS-CoV-2).Severe acute respiratory syndrome-associated coronavirus (SARS-CoV).Spanish influenza A (H1N1).Avian influenza A (H5N1).2009 pandemic influenza A (H1N1).How effective is convalescent plasma therapy?Each virus and illness is different, and each person is unique. Because of this, convalescent plasma therapy may benefit some people but have no effect on others. Scientists have not yet thoroughly studied just how effective convalescent plasma therapy is.One study on the H1N1 (a type of flu) pandemic revealed that people who received influenza convalescent plasma might have had a reduction in the risk of death of more than 50% and had improvements in symptoms.On the other hand, another study revealed that people who received convalescent plasma for Ebola virus disease did not have a significant improvement in survival. This could be because there were unknown levels of antibodies (most convalescent plasma therapy requires high levels of antibodies), and Ebola is generally more lethal than influenza. However, there is no way to know for sure based on the limits of the study.Procedure DetailsWhat happens before this procedure?Before donating, the convalescent plasma donor will go through a thorough screening process to make sure they’re eligible to donate their plasma. There’s screening for any type of plasma donation and specific screening tests for convalescent plasma donations.Specific screening for convalescent plasma will vary based on the type of virus or pathogen the plasma is used for. In most cases, you need to be fully recovered from the illness and have a high level of antibodies in your plasma in order to donate convalescent plasma.In general, the following factors will make you ineligible to donate blood plasma:Illness: If you have a fever, are feeling generally unwell or are currently taking antibiotics to treat an infection, you won’t be able to donate plasma.Certain medical conditions: The American Red Cross considers 23 different medical conditions when screening blood and plasma donors. Some conditions automatically disqualify someone from donating, such as hepatitis and HIV, whereas others require special circumstances for you to be able to donate.Certain medications and medical procedures: Certain medical treatments, such as blood transfusions, and surgeries may disqualify you from donating plasma.Travel to certain countries or areas: If you’ve recently traveled to certain parts of the world, you may be more likely to be infected with certain disqualifying illnesses, such as Ebola.Recent tattoo or piercing: If you’ve received a body piercing or tattoo recently — usually within the past 12 months — you may not be able to donate plasma.If you’re receiving convalescent plasma, your healthcare provider will check your medical history, blood type and overall health condition to make sure you’re eligible to receive convalescent plasma.What happens during this procedure?Convalescent plasma therapy involves two different procedures based on the two people involved: the plasma donor and the plasma recipient.Procedure for the convalescent plasma donorIf you’re eligible to donate convalescent plasma, you’ll likely do so at a blood donation center. The process of donating convalescent plasma includes the following steps:You’ll lie or recline on a comfortable chair.A specially trained healthcare provider called a phlebotomist will clean and disinfect the area of your arm where they’re going to inject a needle.After the area is clean, they’ll inject a needle into one of your veins.A special machine called a plasmapheresis machine will draw out blood from your vein and separate the plasma from the rest of your blood.The plasmapheresis machine then returns your red blood cells and platelets to you through the same needle along with some saline.Once the procedure is over, your phlebotomist will carefully remove the needle and have you put pressure on the site with gauze until it has stopped bleeding. They’ll then cover the site with a bandage.You’ll likely rest for at least 10 minutes, and a healthcare provider will check in with you to make sure you’re feeling well.Once you’re cleared, they’ll give you something to eat and drink. You’ll then be able to go home.On average, the process takes one to two hours.Procedure for the convalescent plasma recipientThe procedure for receiving convalescent plasma is the same as regular plasma transfusions, which includes the following steps:You’ll likely lie on a comfortable bed or recline in a comfortable chair.A phlebotomist will clean and disinfect the area of your arm where they’re going to inject a needle.After the area is clean, they’ll inject a needle into one of your veins in your arm and attach an IV (intravenous) line.The convalescent plasma will then slowly travel from its bag, through a rubber tube and into the vein in your arm.Once the procedure is over, your phlebotomist will carefully remove the needle and have you put pressure on the site with gauze until it has stopped bleeding. They’ll then cover the site with a bandage.After the transfusion, your healthcare provider will monitor your vitals to make sure you don’t have any side effects.Plasma transfusions can take one to four hours to complete.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentRisks / BenefitsWhat are the advantages of convalescent plasma therapy?Advantages of receiving convalescent plasma therapy include:It’s generally very safe and low-risk.It may reduce the length of your illness.It may reduce the severity of your illness.It may lower your risk of complications from your illness.What are the risks and side effects of convalescent plasma therapy?The medical world has used blood and plasma transfusions for a long time to treat many conditions. Blood and plasma transfusions are usually very safe since the donor must be screened and the blood must be tested for safety.While these complications are rare, convalescent plasma therapy risks for the recipient include:Allergic reactions.Lung damage and difficulty breathing.Infections such as HIV, hepatitis B and hepatitis C.For most people who donate plasma, there are very few side effects, but possible side effects may include:Dehydration.Fatigue.Bruising.Discomfort.Infection.Recovery and OutlookWhat is the recovery time for convalescent plasma therapy?If you’ve received convalescent plasma, it may take time before you see improvement in your condition. You’ll likely be under other forms of treatment for your illness, so it can be difficult to tell which treatment is helping you recover. Sometimes convalescent plasma has no effect on people.If you’ve donated convalescent plasma, it’s important to make sure you drink enough water and stay hydrated for the next day or so. Also try to avoid doing strenuous activities.When to Call the DoctorWhen should I see my healthcare provider?If you’ve donated convalescent plasma and are experiencing concerning side effects, such as pain or fever, contact your healthcare provider as soon as possible.Additional Common QuestionsWhat are the requirements for donating COVID-19 convalescent plasma?According to the U.S. Food and Drug Administration, the following are the requirements for donating COVID-19 convalescent plasma:You must be fully recovered from COVID-19 for at least two weeks.You must be eligible to donate blood in general.You must have a prior diagnosis of COVID-19 documented by a laboratory test.You must meet other convalescent plasma donor qualifications.How long does it take for antibodies to develop after exposure to COVID-19?It can take up to two to three weeks for your immune system to develop antibodies after you’ve been exposed to COVID-19.A note from Cleveland ClinicHealthcare providers have been using convalescent plasma therapy for over 100 years to provide passive immunity for certain illnesses. Convalescent plasma therapy is generally safe and may help people recover from their illness. If you’d like to know if you can become a convalescent plasma donor, reach out to your local blood donation center or contact your healthcare provider.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/13/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementLab Appointments & LocationsCOVID-19 Testing InfoFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"