"Coronary Revascularization: Procedure Details & Risks800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Coronary RevascularizationAdvertisementAdvertisementAdvertisementCoronary RevascularizationRevascularization refers to a group of medical treatments that restore blood flow to parts of your heart when that flow is limited or blocked. These include both surgery and minimally-invasive procedures. These procedures treat existing blood flow problems, especially heart attacks, and some can also prevent similar problems in the future.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewThe main ways to restore blood flow to your heart.What is coronary revascularization?Coronary revascularization is a group of treatments or procedures that restore blood flow to areas of your heart that aren’t getting enough blood to meet their needs, a problem known as ischemia. These treatments can help after you’ve had a heart attack, or they can prevent heart attacks when you’re at a higher risk of having one.Coronary revascularization typically refers to two specific procedures:Percutaneous coronary intervention (PCI). This is a minimally-invasive procedure that restores blood flow from the inside.Coronary artery bypass grafting (CABG). This is a surgery where a provider creates a bypass around a blocked section of an artery.Who needs to have these treatments?Coronary revascularization (pronounced “re-vas-cue-lar-ih-zay-shun”) has the potential to help anyone with limited blood flow to part of their heart. Coronary artery disease is the most common reason for blockages, and it becomes more common as people get older. Because this condition is connected strongly to aging and certain risk factors, revascularization procedures happen most frequently in people over 65.Why is this treatment used?Coronary revascularization procedures treat ischemia (pronounced “iss-key-me-uh”), which is cell damage from a lack of blood flow. Ischemia usually happens because of atherosclerosis. That’s when plaque, a fat-like, waxy residue, builds up inside your heart’s arteries.Atherosclerosis is a key feature of coronary artery disease, and over time, plaque buildup can narrow an artery like grease buildup inside a clogged drainpipe. If an area of that plaque ruptures and breaks open, a blood clot can form there and create a partial or total blockage of the artery, leading to ischemia.When ischemia is very severe or lasts too long, those cells may start to die. Ischemia in your heart muscle is especially dangerous because when those cells die, the damage is permanent. However, restoring blood flow quickly can limit the damage or prevent it entirely.What does this procedure treat?Heart ischemia can happen with any of the acute coronary syndrome conditions. These include:Heart attack.Stable angina.Unstable angina.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before this procedure?Before you undergo any coronary revascularization procedure, you’ll likely take several medical tests that will help providers plan the best ways to treat your condition. These tests can include, but aren’t limited to, one or more of the following:Electrocardiogram (ECG or EKG).Echocardiogram.Cardiac catheterization.X-ray angiography or computed tomography (CT) scan angiography.Coronary calcium scan.Complete blood count.Cardiac enzyme tests.If you’re having a coronary revascularization procedure in a nonemergency situation, your provider will also have you fast before it starts. That usually involves stopping all foods except clear liquids at least eight hours before the procedure and stopping all liquids at least two hours before.Right before the procedure begins, a healthcare provider will also place an intravenous (IV) line into one of your veins (usually on one of your arms). IV lines let providers give you fluids and medications quickly and easily. You’ll likely receive a sedative medication to help you relax for PCI. You’ll receive general anesthesia for CABG, which puts you into a deep sleep through the procedure.What happens during this procedure?PCI and CABG try to achieve the same goal but use very different approaches.PCIPercutaneous coronary intervention involves a catheter (hollow, tube-like device) that a healthcare provider inserts into a major blood vessel somewhere on your body (usually in your wrist or upper thigh). Once the catheter’s inside, the provider steers the catheter to your heart and uses various tools and methods to restore blood flow. They may also inject a special liquid that’s visible on X-ray imaging to help them see a blockage and how to approach it.Depending on your situation and needs, a provider may use one or both of the following tools and techniques:Balloon angioplasty. This technique involves a balloon attachment on the leading tip of the catheter. Once the provider steers the catheter to the blocked or narrowed area of the artery, they inflate the balloon to widen it.Stenting. This technique involves placing a stent, a framework support structure that keeps a narrowed area of the artery open. Stents can be bare metal, or the framework may have a medication coating. The coating slowly releases a medication to prevent new stenosis (narrowing) in the immediate area around the stent.Brachytherapy. This involves applying radiation from inside the blood vessels to prevent more stenosis after medical procedures like stenting. While brachytherapy is mainly a cancer treatment, it’s also a useful procedure to prevent stenosis (narrowing) of blood vessels from returning.After widening the artery (and placing a stent, if that happens), the provider will withdraw and remove the catheter and stitch the access site closed to finish the procedure.CABGTo do this, the surgeon will first locate and “harvest” a blood vessel from somewhere in your body. That vessel can come from a leg, arm or your back. They then access your heart in one of two ways:Open surgery: Open surgery uses an incision in your chest to access your heart. This incision is several inches long down the center of your chest, allowing a surgeon to crack your sternum (breastbone) and then lift and separate your rib cage. That gives them easy access to your heart.Minimally-invasive and/or robot-assisted surgery: This method involves one or more small incisions, letting a surgeon reach your heart with specialized surgical tools that use the spaces between your ribs to get to your heart. With robotic surgery, this same approach happens but with robotic arms “driven” by the surgeon, along with a small robot arm-mounted camera that lets them see what to do.Providers may temporarily stop your heart and use a heart-lung bypass machine, depending on the method. That device adds oxygen to and takes carbon dioxide out of your blood, and keeps your blood circulating. However, some people may have off-pump bypass surgery, during which their heart beats continuously.Once the surgeon reaches your heart, the surgeon uses the harvested blood vessel to craft a bypass vessel around a blocked section of the artery. The bypass restores or maintains blood flow to areas of your heart with limited or no blood flow.Once the bypass is in place, they can stitch your chest closed and restart your heart (if they stopped it). If they use the open method, they’ll put your ribs back into place and wire your sternum together so it can heal before closing the incision. If they use minimally-invasive or robot-assisted methods, they’ll withdraw the tools through the smaller incisions and stitch those closed.Specialized approachesMultiple techniques can happen along with those listed above to increase your chances of a successful revascularization procedure, or they can happen on their own. These include:Total arterial revascularization: This means that the blood vessel harvested to create a bypass vessel is also an artery rather than a vein. Arteries tend to hold up better when used to create a bypass vessel and are less likely to have some of the common complications with vein-based bypass grafts.Transmyocardial revascularization: Transmyocardial means, “through the heart muscle.” Often known as transmyocardial laser revascularization or TMR, this procedure involves firing a specific type of laser into the heart muscle. The laser’s effects on the muscle help improve blood flow to those areas of the heart muscle and stimulate the formation of new blood vessels that can supply those areas. TMR can help when other procedures aren’t an option or haven’t worked, but it also has limitations on when it’s useful. It’s also sometimes used along with CABG to improve CABG’s chance of success.AdvertisementWhat happens after this procedure?After this procedure, you’ll need some time to recover. The recovery time depends on the procedure itself, your overall condition and whether you need the procedure for an emergency reason. In general, the better your overall health is, the shorter your hospital stay and the easier you’ll recover.As you recover, your healthcare provider may recommend that you participate in a cardiac rehabilitation program. These programs have expert staff from multiple backgrounds, including doctors, nurses, exercise physiologists, nutritionists and dietitians, and more.These professionals will help you learn how to exercise and care for yourself and your heart’s needs. That ensures that your condition improves and that you have the strength, ability and understanding to resume your usual daily routine as you recover from coronary revascularization.Your provider will also schedule follow-up visits and testing to ensure your heart is functioning as it should. It’s important to keep up with those visits and follow your provider’s guidance regarding what you eat, physical activity, medications to take and more. It’s also important to understand what your provider’s telling you and why, so asking questions about anything you don’t understand can make a big difference in your well-being.Care at Cleveland ClinicGet Coronary Artery Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of this procedure?Coronary revascularization has several advantages.Preventive ability. Coronary revascularization procedures can often prevent heart attacks from happening, especially when you get a coronary artery disease before you have a heart attack.Life-saving potential. Coronary revascularization is one of the treatments for heart attack, a life-threatening medical emergency.Preserves heart function. Ischemia causes your heart muscle cells to die, but they don’t die immediately. That’s why it’s important not to delay medical care for a heart attack. With quick coronary revascularization, it’s possible to prevent permanent heart damage, or at least limit its severity.AdvertisementWhat are the risks or complications of this procedure?The risks of coronary revascularization depend strongly on the procedure itself. The general risks are:PCI: Risks mostly include damage to your heart or nearby blood vessels from the inside. This can cause irregular heart rhythms (arrhythmias), blood clots, stroke or bleeding.CABG: Surgery has additional risks, especially pain, bleeding and a chance of infection.Overall, the risks and complications depend not only on the procedure, but also on your health. That includes any other conditions you might have, your age, medical history and personal circumstances. Your healthcare provider is the best person to tell you about what to expect with this procedure, especially the risks and possible complications.Recovery and OutlookWhat is the recovery time?In general, PCI has much shorter recovery times because it isn’t major surgery. PCI is sometimes an outpatient procedure, especially in nonemergency situations, and recovery usually takes days. The hospital stay for CABG may be several days, and recovery can take weeks or even months. Your healthcare provider is the best person to tell you how long your recovery should take, what to expect and how you can help yourself along the road to recovery.When to Call the DoctorWhen should I see my healthcare provider?If you’ve had a coronary revascularization procedure, your healthcare provider can advise you on the potential signs and symptoms that are warnings of possible problems. In general, the symptoms to watch for are those that happen with a heart attack or other such conditions. These include:Chest pain (angina).Shortness of breath (dyspnea).Dizziness or feeling lightheaded.Fainting or passing out.A note from Cleveland ClinicHeart problems can be a major source of fear and anxiety, and it’s normal to have those feelings when you find out you have a heart condition. Coronary revascularization can help treat certain heart problems and prevent others from getting worse. Understanding the treatments that fall under coronary revascularization can also help you manage any feelings of worry. That way, you can focus on getting the care you need and then getting back to the life you want to live.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/24/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Coronary Artery Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"