"Coronary Bypass Surgery: Purpose, Procedure and Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Coronary Artery Bypass SurgeryAdvertisementAdvertisementAdvertisementCoronary Artery Bypass SurgeryCoronary artery bypass grafting (CABG), also known as heart bypass surgery, is a procedure to restore blood flow to areas of your heart. Artery blockages can cut off blood flow, causing heart attacks or heart attack-like symptoms. CABG restores blood flow by using blood vessels from other parts of your body to create a detour around blockages.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewBypass grafts providing blood to blocked arteries.What is this procedure?Coronary artery bypass grafting is a surgery that restores blood flow to areas of your heart that aren’t getting enough blood. This surgery can improve your heart function and how you feel, especially when you’ve just had a heart attack or there’s an increased risk for you to have one in the near future.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is coronary bypass surgery done?Your heart works 24/7, supplying your entire body with blood. To do its job, your heart also needs blood flow, which it gets through a network of supply arteries that wrap around it. When tissues in your body aren’t getting enough blood flow, this causes a problem called ischemia (pronounced “iss-key-me-uh”).The muscle cells in your heart are especially sensitive to ischemia, and when it's severe, those heart muscle cells will start to die. Coronary artery bypass grafting (abbreviated CABG and pronounced “cabbage”) treats ischemia by restoring blood flow to the affected heart muscle.What conditions are treated by this surgery?The condition that’s most likely to lead to CABG is coronary heart disease, a group of conditions that includes heart attack and coronary artery disease. Other conditions under coronary heart disease include angina pectoris, which is chest pain caused by ischemia in your heart, and silent myocardial ischemia, which is heart ischemia without any symptoms.Conditions that fall under coronary heart disease usually involve a narrowing of the arteries in your heart because of a buildup of a fatty, wax-like residue called plaque. As plaque builds up on the inside of your heart's arteries, the arteries become stiffer and narrower. If an area of plaque breaks open, blood clots can form there and create blockages in those arteries. Those blockages cause ischemia in parts of your heart, which can lead to a heart attack.AdvertisementWho needs to have this procedure?The average age for people who have CABG surgery is around 66 years old. About 72% of the people who undergo it are men.How common is CABG surgery?CABG surgery is very common, with about 200,000 such procedures happening every year.AdvertisementProcedure DetailsWhat happens before this procedure?CABG is major surgery, and people who have this done must first undergo a wide range of tests and other preparations.Imaging and lab testsBefore you can undergo CABG, you will need to undergo several tests to see if it's safe for you to have this surgery and whether or not you need the surgery in the first place.The potential tests include, but aren’t limited to, the following:Electrocardiogram (ECG or EKG).Echocardiogram.Exercise stress test.Nuclear cardiac stress test.Cardiac catheterization.X-ray angiography or computed tomography (CT) scan angiography.Coronary calcium scan.Lab tests, such as a complete blood count, that analyze your cholesterol, blood sugar, and other factors. Other possible tests include urine tests that analyze how well your kidneys function.Information and educationPart of preparing for CABG involves informing and educating you on what to expect and what you need to do before and after surgery to help you have the best possible outcome. Topics that you'll learn about include:Medications. Your healthcare provider will discuss what medications you’re taking before the surgery. They’ll also tell you which medications to keep taking and which medications you should stop (and when to stop them). In some cases, they may switch you to different medications or start you on new ones.How to prepare for surgery. Your healthcare provider will provide you with information and resources about how you can prepare for the procedure. This includes knowing what kind of help you’ll need at home, what you can and can’t eat after the procedure, necessities you’ll need to have at home and more. It also includes how to bathe (which often includes special soap) and groom yourself before the procedure.What to expect after surgery. Your healthcare provider will also give you information and resources that detail what you can expect during your recovery. This includes how long it will take you to recover, how you are likely to feel, symptoms to watch for and more.What happens during this procedure?CABG is a complicated procedure that takes several hours to complete (the actual time needed depends on the specific type of CABG surgery, how many bypasses you need, and more). The following steps happen for most of these surgeries.Anesthesia and life supportLike most major surgeries, the first step to this surgery is to put you into a state of deep sleep. This keeps you from feeling pain during the surgery. It also helps relax you for other steps in the preparation.Because CABG involves work on your heart, it usually involves multiple types of life support. These include:Intubation and ventilation. Intubation is where healthcare providers insert a tube down your throat and into your windpipe. They then attach that tube to a machine called a ventilator, which does the work of breathing for you. Your lungs still process and transfer oxygen into and carbon dioxide out of your bloodstream, but the ventilator makes the air move.Intravenous lines. Intravenous (IV) lines are tubes that allow providers to directly infuse medications and fluids into your body through one of your veins.Urinary catheter. Before starting surgery, providers will insert a small tube into your urethra until it reaches your bladder. This tube, called a catheter, allows urine to drain through the tube and into a bag. This lets you unconsciously “pee” even when you’re under anesthesia.Heart-lung bypass. This machine takes over for your heart and lungs by pumping blood out of your body through an IV line and into this machine, which also adds oxygen and removes carbon dioxide to your blood. The machine then pumps the blood back into your body through an IV line. Using this machine allows providers to temporarily stop your heart, making it easier for them to do some of the surgical work. A heart-lung bypass machine isn’t always necessary for CABG (see the section on variations of this surgery below), but the use of these is common.Blood vessel harvestingCABG involves creating a bypass for blood to use to reach blocked areas of your heart. A bypass is like a detour for your blood to use to get around an obstacle. Creating that bypass involves taking a blood vessel from somewhere else in your body, such as your leg, arm or chest, and using it to craft the detour around the blockage. In cases where there’s more than one blocked artery, multiple bypasses may be necessary. These are double (2), triple (3) and quadruple (4) bypasses.SurgeryTo reach your heart to perform the surgery, a cardiothoracic surgeon will make an incision in the center of your chest. They’ll also split your breastbone (sternum) down the middle, then spread and lift your rib cage to make it easier to access your heart.Once they reach your heart, the surgeon will take the harvested blood vessel and craft the bypass. The upper end (beginning) of the bypass attaches to your aorta, the large artery that carries blood out of your heart and to the rest of your body, just after it exits your heart. The lower end (ending) of the bypass will attach to the blocked artery just past the blockage.Once the bypass is in place, the surgeon can restart your heart (if they stopped it) and get your blood flowing again. They’ll then lower your rib cage back into place and wire it together so it can heal. They’ll then close the incision in your chest with staples and sutures (stitches).Variations of this surgeryWhile CABG tends to use the same techniques in most people, there are instances where different techniques are better for your particular needs. The variations of this surgery include:Off-pump CABG. This type of CABG doesn’t use a heart-lung bypass machine. That means the surgeon doesn’t stop your heart during this procedure and does all the work while your heart is still beating. This type of surgery is not for every patient, and it is more challenging for the surgeon. However, some surgeons have special training and experience in performing CABG surgery this way.Minimally invasive CABG. This variation of CABG doesn’t use a large incision and splitting/lifting of your sternum and rib cage. Instead, the surgeon uses much smaller incisions and accesses your heart through the gaps between some of your ribs. This version of the procedure may also use the off-pump technique.Robot-assisted CABG. Surgical robots are highly advanced machines that a surgeon can use to perform CABG surgery. To do this, a surgeon \"drives\" the robot, meaning they control the robot's movements. Robotic surgery uses smaller incisions and doesn't involve opening and lifting your sternum. Robotic surgery may involve heart-lung bypass, or it may use the off-pump technique.Hybrid procedure. This version of the procedure mixes CABG with other techniques or approaches. This usually involves robot-assisted CABG on at least one artery, but non-CABG techniques like stenting for the remaining diseased blood vessels. Stenting is the placement of a stent, a device with a frame-like structure, into an artery. Inserting a stent helps hold the artery open because the stent acts as a skeleton inside the artery.What happens after this procedure?After surgery, people who undergo CABG go to the hospital’s intensive care unit (some hospitals use different terms like critical care unit). Staying in the intensive care unit (ICU) is necessary because ICU staff have specialized training and experience that is better suited for people with specialized needs like those who’ve just undergone CABG.Once a person is stable and a doctor feels they’re ready, they can transfer to a regular medical-surgical room in the hospital for the remainder of their stay. The average hospital stay for CABG is between 8 and 12 days (longer for people who had CABG because of a heart attack, shorter for people who had stable ischemic heart disease or similar problems).After leaving the hospital, most people who have CABG will also complete a cardiac rehabilitation program. Often called cardiac rehab, these programs help you recover and rebuild your strength after intensive cardiac procedures or events like heart attacks. Cardiac rehab programs include specially trained and highly qualified staff. They usually include nurses, exercise physiologists, nutritionists and dietitians, counselors and behavioral health specialists and doctors.Care at Cleveland ClinicGet Coronary Artery Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of this procedure?CABG has several advantages that make it a useful and common part of treating heart problems.A long history of use. Surgeons performed the first CABG procedures in the early 1960s. In the decades that followed, additional studies and advancements helped make this procedure a key and reliable technique for treating ischemia of the heart.Better for multiple blockages or blockages in certain arteries. CABG is often the best choice when a person has multiple blocked arteries in their heart. It’s also a superior procedure for blockages in certain places. Many studies have linked CABG with improved long-term outcomes, including better survival odds. This advantage often grows when used alongside advanced bypass techniques with durable results.Lower risk for follow-up procedures. The main alternative to CABG is percutaneous coronary intervention (PCI), often known as angioplasty. In many cases, PCI has a higher risk of needing a follow-up procedure.What are the risks or complications of this procedure?CABG is a major surgery, which means there are some potential risks and complications. While most of these risks and complications are avoidable or treatable, it’s still important to understand them. Possible risks include:Irregular heart rhythms (arrhythmias). The most common arrhythmia after CABG is atrial fibrillation, which causes an increased risk of stroke. Fortunately, it’s usually only a temporary concern.Bleeding. This is a risk with any major surgery. To avoid this, people who take blood thinners will need to stop taking them (with guidance and monitoring from their healthcare provider) before the surgery.Infections. Another possible complication of surgery is infection. When infections spread throughout your body, they can cause sepsis, a life-threatening overreaction of your immune system. Sepsis is a medical emergency, and having two or more of its symptoms (fast heart rate, fever, chills, confusion, rapid breathing or confusion) should be considered as dangerous as a heart attack or stroke. Fortunately, major infections after CABG are rare thanks to improved surgical care and techniques.Confusion or delirium. These cause symptoms like agitation, trouble thinking clearly, memory problems or someone behaving unusually (where they seem like a different person).Kidney problems.Stroke.Heart attack.Recovery and OutlookWhat is the recovery time?Most people who have CABG will need several weeks to fully recover from this procedure. During that time, your provider will likely have you avoiding any strenuous activities or situations that might put too much stress on your heart and incisions.Your healthcare provider is the best person to tell you how long it will probably take you to recover and what you should expect. They’ll also tell you when you can start resuming your regular activities like work, exercising, driving, etc.When to Call the DoctorWhen should I see my healthcare provider?You should see your healthcare provider as recommended after your procedure. They'll schedule follow-up visits where they can check your heart function, remove any remaining stitches or staples, and make sure your wounds are healing well.During your recovery, you should also follow your provider’s guidance regarding the following:Take your medication. This is an essential part of your recovery, and it's very important that you take medications exactly as your provider prescribes them. If you have any questions about how to take your medications or store them, you should ask your provider these questions as soon as possible.Go to cardiac rehab. These programs can make a huge difference in your overall recovery and how you feel after your procedure. Because they’re medically monitored and staffed by trained medical professionals, they can also help catch any potential problems or warning signs sooner rather than later.Take care of your mental health. People who undergo CABG could experience mental health issues like anxiety or depression. These are normal and are nothing to feel shame over. Talking to mental healthcare professionals about these issues is just as important as seeing a provider about your heart problems.Make lifestyle changes. Though CABG can restore blood flow, the issues that caused you to need CABG can still happen again. It’s important to follow your healthcare provider’s guidance on improving your lifestyle, including diet and how much you exercise. Improving your lifestyle can help you avoid further complications in the future.When should I go to the emergency room?You should go to the hospital right away if you have any of the following:Chest pain.Trouble breathing.Feeling dizzy or lightheaded.Passing out or fainting.Heart palpitations (the unpleasant feeling of your heart beating without feeling for your pulse).Drooping of your face or weakness on one side of your body.Slurred or distorted speech.Having a fever or chills.Fast heart rate or breathing.A note from Cleveland ClinicCoronary artery bypass grafting is a surgery that can make a big difference in how you feel and your overall length and quality of life. It's also a major procedure, and it’s normal to worry or feel anxious about having this surgery. Talking to your healthcare provider is important because they can provide you with information and resources that can help you better understand what’s happening. They can also guide you on what you can do to help yourself avoid complications and have the best possible outcome.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/11/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Coronary Artery Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"