"Corpus Callosotomy: How it’s Done, Risks & Benefits, Recovery, Outlook800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Corpus CallosotomyAdvertisementAdvertisementAdvertisementCorpus CallosotomyCorpus callosotomy is surgery to treat epilepsy seizures when antiseizure medications don’t help. The procedure involves cutting a band of fibers (the corpus callosum) in the brain. Afterward, the nerves can’t send seizure signals between the brain’s two halves. It makes seizures less severe and frequent and may stop them completely.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a corpus callosotomy?A corpus callosotomy is a surgical treatment for epilepsy. Epilepsy is a chronic condition that causes recurrent seizures in children and adults.During a corpus callosotomy, a doctor called a neurosurgeon, cuts the brain’s corpus callosum. This band of nerve fibers carries messages between the brain’s two halves, or hemispheres. A corpus callosotomy stops seizure signals from going back and forth between the two hemispheres. This procedure is also called callosal sectioning or brain-splitting.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow does a corpus callosotomy work?A cut corpus callosum can’t send seizure signals from one side of the brain to the other. Seizures still occur on the side of the brain where they start. After surgery, these seizures tend to be less severe because they only affect half of the brain.What type of seizure does a corpus callosotomy treat?This surgery helps people who experience a lot of atonic seizures despite taking antiseizure medications. A person experiencing an atonic seizure suddenly loses muscle strength and collapses or drops to the ground.An atonic seizure increases the risk of injuries, including broken bones and concussions. Atonic seizures are also known as drop seizures or drop attacks.A corpus callosotomy is not an effective treatment for people who experience partial (focal) seizures. These seizures develop in a small region, or focal point, of the brain.AdvertisementProcedure DetailsWhat should I expect before a corpus callosotomy?Your healthcare provider will review presurgical steps with you. You may need some tests to help your provider find where the seizures originate. These tests include:Electroencephalogram (EEG) to track electrical (seizure) activity in the brain.Magnetic resonance imaging (MRI) scan to evaluate structural changes in the brain that may cause seizures.Positron emission tomography (PET) scan to identify areas of the brain where seizures start.How is a corpus callosotomy performed?A corpus callosotomy takes place under general anesthesia, which means you’re asleep throughout the procedure. Your neurosurgeon will perform a craniotomy, opening the skull to access the brain.During the procedure, your surgeon:Removes a piece of your skull.Peels back a section of the dura, the tough membrane that protects the brain.Uses surgical microscopes to insert special instruments to locate and cut the corpus callosum.Replaces the dura.Uses stitches or staples to secure the skull bone back into place.Sometimes, a corpus callosotomy procedure takes place in two stages. During the first stage, your neurosurgeon cuts only the front part of the corpus callosum. This approach allows the two brain sections to continue sharing visual information. If you continue to have frequent, severe seizures, your doctors may consider a second surgery to sever the corpus callosum completely.AdvertisementWhat should I expect after a corpus callosotomy?You’ll spend several days in the hospital. You should be able to get back to everyday activities within six to eight weeks. Some patients take longer to recover than others. It depends on a lot of factors, such as if a person has side effects and the extent of the callosotomy.A corpus callosotomy doesn’t stop all seizures, so it's expected you'll remain on antiseizure medications after the procedure. During recovery, you may temporarily experience:Fatigue.Feelings of depression.Headaches.Memory problems.Nausea.Numbness at the incision site.Speech difficulties.Care at Cleveland ClinicEpilepsy and Seizures TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the potential risks or complications of a corpus callosotomy?Any type of surgical treatment for epilepsy has risk, which will be weighed carefully with the chance you will benefit from the procedure by your care team. Serious problems after a corpus callosotomy are rare.Disconnection syndrome is the most common issue after surgery. With eyes closed, the two sides of the brain don’t cooperate when carrying out simple tasks. The right and left sides of the body move in conflict with each other.Other potential problems include:Loss of coordination or balance problems.More partial seizures on one side of the brain.Speech problems, including trouble producing speech (apraxia) and trouble speaking and comprehending (aphasia).Stroke.Swelling in the brain.Recovery and OutlookHow effective is a corpus callosotomy?Studies show that a corpus callosotomy is an effective way to reduce seizures when medications don’t work. Up to half of people who have this surgical procedure no longer experience drop attacks. Approximately one in five people are seizure-free after surgery.When to Call the DoctorWhen should I call the doctor?You should call your healthcare provider if you experience:Fever or other signs of infection at the incision site (skin is red, tender or has yellow discharge).More severe or frequent seizures.Severe headaches or nausea.Signs of stroke (slurred speech, blurred vision or sudden paralysis, often on one side of the body).Speech problems.A note from Cleveland ClinicEpileptic seizures are unpredictable. They can disrupt your life and increase your risk of injury. Some seizures can be life-threatening. If antiseizure medications don’t control atonic (drop) seizures, your healthcare provider may recommend surgery. Studies show that a corpus callosotomy is an effective way to reduce — and sometimes completely stop — these seizures. The surgery may greatly improve your quality of life. Talk to your provider about the benefits and risks of epilepsy surgery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/18/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicEpilepsy and Seizures TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"