"Cosmetic Dentistry: What It Is, Procedures & Types800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Cosmetic DentistryAdvertisementAdvertisementAdvertisementCosmetic DentistryCosmetic dentistry is the branch of dentistry that focuses on improving the appearance of your smile. Common cosmetic dental treatments include teeth whitening, dental bonding and veneers.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is cosmetic dentistry?Cosmetic dentistry focuses on improving the appearance and aesthetics of your smile. Common cosmetic dental procedures include teeth whitening, dental bonding and veneers.What’s the difference between cosmetic dentistry and general dentistry?A general dentist is a primary dental care provider. They offer preventative care, like teeth cleanings, and restorative dentistry treatments, such as dental fillings, crowns and bridges. Most dental treatments restore appearance as well as health and function. However, a cosmetic dentist focuses on beautifying your smile. They offer treatments aimed at improving the appearance of your teeth and gums.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho benefits from cosmetic dentistry?Cosmetic dentistry might be an option if you have:Chipped or cracked teeth.Small gaps or spaces between your teeth.Tooth discoloration and staining.Misshapen teeth.Misaligned teeth.Can anyone undergo cosmetic dentistry treatments?As long as you have healthy teeth and gums, you can pursue cosmetic dental treatments. But if you have extensive cavities or gum disease, your dentist will want to address those conditions first. Once your smile is healthy again, you can decide which cosmetic treatments you want to explore.AdvertisementProcedure DetailsWhat are examples of cosmetic dentistry?Cosmetic dentistry aims to create a more balanced, symmetrical and aesthetically pleasing smile. Common cosmetic dental services include teeth whitening, dental bonding, veneers, and tooth and gum contouring.Teeth whiteningOver time, dark-colored foods and drinks (like coffee, tea and berries) can stain your teeth. Professional teeth whitening can dramatically and safely lighten the shade of your teeth and brighten your smile.Many dentists offer both in-office and at-home teeth whitening. In-office whitening takes about one hour to complete. At-home whitening usually takes a couple of weeks.Dental bondingDental bonding involves the application of tooth-colored composite resin. Your dentist uses this material to cover up and conceal cracks, craze lines (hairline cracks), discoloration and other cosmetic imperfections. Dental bonding can change the shape of a tooth to make it longer, wider or more uniform.Dental bonding usually needs replacing every five to seven years. It doesn’t require the removal of natural tooth enamel either, which means it’s completely reversible.Porcelain veneersMade of medical grade ceramic, porcelain veneers are thin, strong shells that adhere to the front surfaces of your teeth. Like dental bonding, veneers can conceal a wide range of cosmetic flaws, including chips, cracks and discoloration.There are many types of veneers, including traditional and minimal prep. All veneers require at least some removal of natural enamel, which means they could be reversible depending on which kind you choose. In most cases, porcelain veneers need replacing every 10 years or so.Tooth contouringThis procedure removes small amounts of enamel to change the shape of your teeth. Because you only have so much natural enamel, there’s a limit to how much tooth structure your dentist can remove. Your dentist can complete tooth contouring during a single office visit.Gum contouringSome people are born with excess gum tissue. When this happens, it can make your smile appear “gummy” or unbalanced. During gum contouring, your dentist removes excess gum tissue and reshapes your gum line for a more symmetrical, balanced appearance.Can restorative dental procedures also offer cosmetic benefits?The procedures outlined above are strictly cosmetic in nature. But sometimes, restorative dentistry treatments, which repair teeth, can also improve the appearance of your smile. For example, if you repair a cracked tooth with a dental crown, it not only improves the health and function of your smile, but also its appearance.Similarly, dental braces aim to improve your bite and your overall oral health. But braces also improve the aesthetics of your smile dramatically.AdvertisementWhat is the most popular cosmetic dental procedure?Teeth whitening is the most common cosmetic dental procedure. It allows people to make noticeable improvements to their smile without undergoing invasive treatments.Care at Cleveland ClinicGet Dental CareFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of cosmetic dentistry?Cosmetic dentistry services can:Enhance your smile.Brighten dull, stained teeth.Improve the shape of your teeth.Conceal chips and cracks.Bring balance and symmetry to your smile.Boost your confidence.What are the disadvantages of cosmetic dentistry?Cosmetic dentistry costs aren’t usually covered by insurance. This is because insurance companies don’t consider cosmetic procedures essential or necessary from a health standpoint.You’ll also need a certain level of commitment to maintain your smile. Some treatments — like porcelain veneers — are irreversible and require replacement every few years.Recovery and OutlookWhat is the recovery time?It depends on the type of cosmetic procedure and the number of teeth that need treatment. For example, someone who has dental bonding on one tooth can resume normal activities immediately. However, someone who has gum contouring may need to take a day or two off work to recover. Your dentist can tell you what kind of recovery timeline to expect.When to Call the DoctorWhen should I see my healthcare provider?If chipped, cracked, crooked or discolored teeth make you feel embarrassed or self-conscious about your smile, talk to your dentist about options in cosmetic dentistry. There are several different ways to improve the appearance of your smile. Your dentist can talk with you about your cosmetic goals and recommend an appropriate treatment plan.In the meantime, you should continue seeing your general dentist for routine care, such as dental check-ups and cleanings. Practice good oral hygiene at home between visits to keep your teeth and gums healthy.A note from Cleveland ClinicCosmetic dentistry focuses on improving the appearance of your smile. There are many treatments available, ranging from simple to complex. Talk to your dentist about your specific cosmetic goals so they can design a treatment plan that works for your budget and lifestyle.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/27/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Dental CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"