"CPAP Machine: What It Is, How It Works, Pros & Cons800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/CPAP MachineAdvertisementAdvertisementAdvertisementCPAP MachineA CPAP (continuous positive airway pressure) machine is one of the most common treatments for sleep apnea. It keeps your airways open while you sleep so you can receive the oxygen you need for optimal function. CPAP machines can significantly improve sleep quality and reduce your risk for a number of health issues, including heart disease and stroke.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is a CPAP machine?A CPAP (continuous positive airway pressure) machine is used in the treatment of sleep apnea. This device delivers continuous pressurized air through tubing into a mask that you wear while you sleep.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is a CPAP machine used for?CPAP machines are used to treat both obstructive and central sleep apnea. In both disorders, your breathing is interrupted during the sleep cycle. This can occur hundreds of times in a single night, leading to a lack of oxygen and a higher risk for high blood pressure, heart disease, stroke, diabetes and other health concerns. A CPAP machine helps keep your airways open by delivering continuous air through your nose and mouth.Are there different types of CPAP machines?A CPAP machine is just one type of PAP (positive airway pressure) device. While CPAP is the most common among these machines, there are other types as well. These include:Bi-level PAP. This machine uses two different pressures — one during inhalation and one during exhalation.Auto CPAP. This device self-regulates, using a range of pressures to keep airways open.Adaptive servo-ventilation (ASV). Reserved for people with central sleep apnea, ASV keeps your airway open by delivering a mandatory breath when necessary.AdvertisementWhat are the different types of CPAP masks?There are a few different types of masks available. The kind that’s best for you depends on your comfort level, breathing habits and the type of sleep apnea you have. CPAP mask types include:Nasal mask. This option covers your nose. A nasal mask is often recommended for people who move around a lot when they sleep.Nasal pillow mask. Rather than covering your entire nose, a nasal pillow mask only covers your nostril area. Some options also have prongs that fit into your nostrils. People who wear nasal pillow masks can wear their glasses comfortably.Full mask. This triangular mask fits over your nose and mouth. A full mask is best for people who breathe through their mouth during sleep. Your healthcare provider may also recommend this type of mask if you suffer from a nasal blockage.Procedure DetailsHow does a CPAP machine work?A CPAP machine takes in room air, then filters and pressurizes it before delivering it through a tube and into your mask. The continuous flow of air gently keeps your tongue, uvula and soft palate from shifting too far into your airway. This stabilizes your breathing and improves your overall sleep quality.AdvertisementHow should I clean my CPAP machine?Keeping your CPAP machine clean helps you avoid bacteria and mold exposure. For optimal hygiene, you should clean your tubing, mask and water chamber daily. If this isn’t possible, make an effort to clean your CPAP machine at least once a week. You should always follow the manufacturer’s recommendations for cleaning your CPAP machine, but here are some general guidelines:Disassemble your CPAP machineUnplug the device.Remove your mask and headgear from the tubing.Remove the tubing from the CPAP machine.Remove the water chamber from the CPAP machine.Soak the parts of your CPAP machineFill a basin with warm water and a small amount of dish soap.Submerge your tubing, mask and headgear.Allow the parts to soak for at least 30 minutes, then rinse.Allow the CPAP parts to air dry.Clean the external surfaceDampen a soft cloth and wipe down the external surfaces of your CPAP machine.Reassemble your CPAP machineOnce the parts are completely dry, reassemble your CPAP machine.Turn the device on temporarily to ensure that everything is working properly.Clean the humidifier once every weekUse hot water and mild soap.Allow the humidifier to air dry.You should only use distilled water when running your humidifier.Note: Don’t use external cleaning devices that aren’t included in the manufacturer’s instructions, as many of these products haven’t been approved by the U.S. Food and Drug Administration (FDA).Risks / BenefitsWhat are the advantages of a CPAP machine?CPAP machines prevent breathing interruptions caused by sleep apnea. These devices also eliminate harmful sleep apnea side effects. Notable CPAP machine benefits include:Improved sleep quality.Lower risk of heart attack and stroke.A reduction in daytime sleepiness.Possible improved sugar management in people with diabetes.Are there any CPAP machine side effects?It may take time for you to become accustomed to your CPAP machine. Some people find them cumbersome or uncomfortable. Drawbacks include:Difficulty falling asleep (insomnia).Nasal congestion.Dry mouth.Feeling claustrophobic.Nosebleeds.Feeling bloated.Skin irritation.As you get used to your CPAP machine, most of these side effects will diminish. If your device feels uncomfortable, ask your healthcare provider about different mask or equipment options.Are there alternatives to CPAP machines?Yes. While CPAP machines are the most common sleep apnea treatment, there are other alternatives. These include:Oral appliance therapy. Specific dentists can make a custom oral appliance that fits over your teeth. This device opens the airway by placing the jaw in a more favorable position. Oral appliances work best in mild or moderate cases of sleep apnea.Positional therapy. People who sleep on their backs are more prone to apneic episodes. There are devices that encourage you to sleep on your side or stomach, reducing your risk for sleep apnea.Weight control. Obesity is one of the leading causes of obstructive sleep apnea. Many people can reduce their risk for the condition by losing weight.Surgery. In some instances, sleep apnea is caused by skeletal abnormalities. Surgery may be required in these cases. Common options include soft tissue removal, jaw repositioning or an implantable nerve stimulator.When to Call the DoctorWhen should I see my healthcare provider?People with sleep apnea may not realize they have the condition because so many symptoms occur during slumber. However, your partner may hear you snoring or gasping for air during your sleep cycle. You may also notice tiredness, morning headaches, insomnia, dry mouth or irritability. If you experience any of these symptoms, schedule a consultation with your healthcare provider. They can help determine if a CPAP machine is right for you.Additional Common QuestionsDo you need a prescription to buy a CPAP machine?Yes. Though CPAP machines are safe and pose little risk for abuse, a formal prescription from your healthcare provider is necessary for purchase.How long does a CPAP machine last?Overall, CPAP machines last approximately five years. However, masks will need to be replaced several times a year. Additionally, your headgear, tubing, filters, humidifier chamber should be checked routinely and replaced when necessary.Are CPAP machines loud?While older CPAP models were noisy, newer ones are especially quiet. In fact, the average CPAP noise output is rated at 30dB (decibel) — which is about as loud as raindrops or a whisper.Do CPAP machines really help?Research shows that CPAP machines are incredibly effective in the treatment of sleep apnea. CPAP is often the first line of defense against the condition because it yields excellent results.Can CPAP damage your lungs?There is no indication that CPAP can damage your lungs. Some people report a burning sensation in their lungs following CPAP use. However, this is usually the result of inhaling cold, dry air. To correct this problem, use warm humidified air instead.What’s the difference between a CPAP machine and a ventilator?CPAP machines and ventilators both help people breathe better. However, these two devices cannot be used interchangeably. Unlike a CPAP machine, a ventilator is used to treat people who are in intensive care situations. Ventilators push air in and out of the lungs through a tube, which is inserted in the mouth or nose.A note from Cleveland ClinicCPAP machines are one of the leading treatments for sleep apnea. Left untreated, sleep apnea can have a negative impact on your health and quality of life. If you have symptoms of sleep apnea, such as daytime tiredness, loud snoring or interrupted sleep, talk to your healthcare provider about your options. A CPAP machine could offer significant benefits for your overall wellbeing.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/09/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"