"Craniectomy: What It Is, Procedure, Recovery & Risks800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/CraniectomyAdvertisementAdvertisementAdvertisementCraniectomyA craniectomy is a type of brain surgery that relieves pressure on your brain. A surgeon will remove a piece of your skull during the procedure. You’ll need to wear a helmet to protect your skull after surgery. This surgery is usually an emergency.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is a craniectomy?A craniectomy is a type of major brain surgery where a surgeon removes part of your skull to access your brain. Your surgeon doesn’t replace your skull during this procedure. A follow-up procedure called a cranioplasty replaces the removed piece of your skull at another time.Your care team might consider a craniectomy to reduce swelling, pressure or bleeding (extra fluid) on your brain. Pressure in your skull from swelling or extra fluid can be life-threatening or cause brain damage because there isn’t a lot of room between your brain and your skull. Any pressure is dangerous and can affect how your brain functions.Your surgeon may call a craniectomy a decompression craniectomy.What does a craniectomy treat?A craniectomy treats:Swelling.Pressure (intracranial pressure or hypertension).Bleeding (hemorrhage) or extra fluid.Causes of swelling, pressure or bleeding (extra fluid) on your brain can include:A traumatic injury.A stroke.A blood clot.Hematoma.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow should I prepare for a craniectomy?A craniectomy is usually an emergency surgery. You likely won’t have time to prepare for this surgery.Your surgeon and care team will need the following before your surgery:A physical exam.Blood tests.Imaging tests (an X-ray, MRI, CT scan, PET scan or angiography).If your surgery isn’t an emergency situation, your surgeon will let you know if you need to stop taking any medications, especially blood thinners before your surgery. Your surgeon may recommend taking antibiotics or anticonvulsants. You shouldn’t eat anything before your surgery.What happens during a craniectomy?Before your surgery, an anesthesiologist will give you anesthesia so you won’t feel pain. For some types of craniectomy surgeries, you’ll be asleep and for others, you’ll be awake so your surgeon can monitor your cognitive function.Once you’re in the operating room, your surgeon will:Shave your hair and clean the area of your head near the incision site.Make an incision (cut) into your skin. They’ll move any muscles or tissues away to expose your scalp.Use a drill to make holes in your skull, and then cut in between each hole to remove a piece of your skull.Treat the reason for the craniectomy.Cover the open part of your skull with a mesh material.Move your skin tissue and muscles back into place then close the incision in your skin with staples or sutures.How long does a craniectomy take?A craniectomy usually takes several between three and five hours to complete. Some procedures take longer, depending on why you need a craniectomy.AdvertisementWhat happens after a craniectomy?After a craniectomy, you’ll be moved to an intensive care unit. Your care team will monitor your vital signs and any bleeding or swelling on your brain. As your surgeon won’t replace the part of your skull they removed during your surgery, you’ll need to wear a helmet to protect your brain from injury.Your surgeon will save the removed piece of your skull to reapply it during a future surgery called a cranioplasty. Your surgeon might instead replace the piece of your skull with a metal plate or a synthetic material.You’ll need plenty of rest after a craniectomy. Keep your head upright instead of lying flat while you’re resting. Your care team will give you instructions and help you during your hospital stay and prepare you to go home when you’re ready. You’ll need follow-up appointments after your surgery to make sure you’re healing as expected.Risks / BenefitsWhat are the benefits of a craniectomy?The benefits of a craniectomy include treating the cause. This can reduce:Brain damage.Life-threatening complications.How successful is a craniectomy?Many variables go into calculating the success rate of surgery, including your general health and reason for surgery. Your success rate improves with long-term neurological care and rehabilitation. Some people may not fully recover, especially if their reason for the surgery is a stroke. Many people recover from a craniectomy, but side effects are possible.AdvertisementWhat are the risks or complications of a craniectomy?Risks associated with craniectomies include:Bleeding.Hernia.Continued intracranial pressure.Brain damage.Infection.Seizure.Paralysis.Changes to your mood or behavior.Coma.These complications can be fatal. You may have an increased risk for falls and a loss of balance and coordination after surgery, so it’s important that you get the rest you need until you’re healthy enough to walk or move on your own. Your surgeon will tell you what to expect and when you can start moving again after a craniectomy.Recovery and OutlookWhat is the recovery time for a craniectomy?Your recovery time after a craniectomy will depend on the cause and extent of the surgery. On average, your skull will heal in a month or two, but you may be in recovery for years. Your recovery will take more time when you undergo a second surgery (crainioplasty) to replace the removed portion of your skull. It’s common to need extended rehab and lifelong care after a craniectomy.When can I get back to my regular activities after a craniectomy?Your surgeon will let you know when (or if) it’s safe to get back to your regular activities after a craniectomy. You should avoid doing the following activities after your surgery:Walking without assistance.Heavy lifting.Driving.Manual labor.Exercising.Your care team will give you specific instructions on how you can take care of yourself after surgery. Contact your healthcare provider if you have questions about whether or not an activity is safe.Do people survive craniectomy surgery?Yes, many people survive a craniectomy surgery and make a full recovery. Others may survive and have side effects. Your survival rate will depend on your reason for surgery and general health.When to Call the DoctorWhen should I call my healthcare provider?Contact your healthcare provider if you:Have a fever.Experience severe pain and swelling.Have changes to your cognitive function, mood or behavior.Have severe headaches.Call 911 or your local emergency services number if you:Have a seizure.Have difficulty breathing.Have signs of a stroke.Additional DetailsWhat is a suboccipital craniectomy?A suboccipital craniectomy is a type of craniectomy where your surgeon will remove a piece of the suboccipital region of your skull (the base). This area is in the back of your head near your neck.A note from Cleveland ClinicA craniectomy is a major life-saving surgery. It reduces complications caused by pressure on your brain from blood (extra fluid) or swelling. You may need this type of surgery after a traumatic brain injury or a stroke. Many people make a full recovery after this surgery, but side effects are possible. While your incision site can heal within weeks, you’ll likely need months to years of rehabilitation and lifelong follow-up care after a craniectomy.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/13/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"