"Cryoablation: Cryotherapy, Cryosurgery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/CryoablationAdvertisementAdvertisementAdvertisementCryoablationCryoablation is a procedure that uses extremely cold gas to freeze and destroy abnormal cells or diseased tissue. It’s often used for skin disorders and cancer. Also called cryotherapy or cryosurgery, the procedure is usually safer and less invasive than surgery to cut out diseased tissue. People usually go home the same day.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is cryoablation?Cryoablation is a procedure that uses extremely cold gas to freeze and destroy abnormal cells or diseased tissue. It’s sometimes called cryotherapy or cryosurgery.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAre there different kinds of cryoablation?Cryoablation can be performed in different ways:Topically, on the surface of the skin.Percutaneously, inside your body through a small puncture (hole).Surgically, inside the body through a larger, open incision (cut).Why is cryotherapy used?Cryoablation may be used to treat several conditions:Abnormalities on the skin, such as atypical moles, warts, skin tags or actinic keratosis (precancerous skin growths).Arrhythmia (abnormal heart rate and rhythm).Cancer tumors (such as skin, liver, kidney, bone, lung, prostate and breast).Precancerous cells in the cervix.AdvertisementProcedure DetailsWhat happens before cryotherapy?Before cryoablation, your healthcare team will give you instructions on how to prepare. Depending on what type of cryoablation you’re having and other factors, they may ask you to:Arrange for a ride home after the procedure.Report if you may be pregnant.Stop taking certain medications, such as aspirin, NSAIDs or blood thinners.Take certain medications in advance to prevent pain or infection.Tell them if you have any allergies or health conditions.Wear loose, comfortable clothing the day of the procedure, and leave jewelry and valuables at home.What happens during cryoablation?Topical cryoablation is often done in a physician’s office during a regular appointment. You may not even have to change clothes, and you may not need any medication to prevent pain.If you are having percutaneous or surgical cryoablation, your healthcare team may ask you to wear a hospital gown during the procedure. You may receive anesthesia. It can prevent pain in a specific area (numbing spray or needle), make you feel relaxed, or put you to sleep so that you feel nothing.Just before cryoablation, your healthcare team will position you on an examination or surgical table. They might shave or sterilize the area. For surgical procedures, you may be connected to machines to monitor your heart rate, blood pressure, oxygen level and pulse.During cryotherapy, a surgeon uses a needle-like, hollow applicator called a cryoprobe. The cryoprobe contains and circulates extremely cold gas, such as:Liquid nitrogen.Liquid nitrous oxide.Compressed argon gas.When working inside your body, your surgeon uses imaging technology to locate the correct area. The specialist touches the diseased or abnormal tissue with the cryoprobe for a few seconds or minutes. The intense cold at the tip of the cryoprobe freezes and destroys the diseased tissue. Your surgeon might need to touch the diseased tissue with the cryoprobe more than once.When cryoablation is finished, your surgeon takes out the cryoprobe and closes the incision if needed. The entire process can take just a few minutes for small skin problems to a few hours for open cryosurgery.AdvertisementWhat happens after cryoablation?People usually go home the same day as cryoablation. But a few may need to stay overnight, for example, if the procedure involved a large incision or a deep tumor. Someone should drive you home after cryoablation, except for simple skin procedures.Over time, your body will naturally get rid of the dead cells.Care at Cleveland ClinicSchedule General SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of cryosurgery?Compared to open surgery to remove (or cut out) diseased tissue, cryoablation is generally:Associated with fewer side effects and less scarring.Easier to recover from.Less damaging to surrounding tissue.Less expensive.Safer, with lower chances of infection.What are the risks or complications of cryoablation?Cryoablation is generally very safe. Yet there are some risks, particularly with percutaneous or surgical cryoablation, such as:Bleeding.Complications from anesthesia, such as trouble waking up or nausea.Damage to surrounding structures.Fluid collection in surrounding areas (for example, the lungs).Infection from any opening in the skin.Nerve damage leading to weakness or numbness.Recovery and OutlookWhat is the recovery time after cryotherapy?Recovery from cryoablation depends on the type of procedure you receive:Topical cryotherapy: You might be able to go back to normal activities right away.Percutaneous cryosurgery: You might need one to three days to recover.Surgical cryoablation: You shouldn’t lift anything for 72 hours, and you might need to restrict normal activities for seven to 10 days.Your healthcare team will tell you when you can get back to work and other daily activities.When to Call the DoctorWhen should I see my healthcare provider after cryoablation?Your healthcare provider will give you instructions on when to follow up after cryoablation. For topical procedures, you may not need to return. For percutaneous or surgical cryoablation, you will likely see your healthcare provider a few weeks later.What questions can I ask my healthcare provider about cryotherapy?If your healthcare provider recommends cryoablation, consider asking:What type of procedure do I need?Will I need anesthesia? What kind?Should I stop taking any of my medications beforehand?Should I take anything before the procedure to prevent pain or infection?Will I need a ride home after the procedure?Do you think I’ll need to stay in the hospital overnight?Will this cure my condition?When should I come back to see you after the procedure?When should I call you if I have any side effects or complications after cryoablation?A note from Cleveland ClinicCryoablation is a procedure that uses extremely cold gas to freeze and destroy abnormal cells or diseased tissue. Often used for skin disorders and cancer, the procedure is generally safer than surgery that cuts out diseased tissue. People usually go home the same day as cryoablation and only have short-term restrictions on activities.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/29/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule General SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"