"Cervical Cryosurgery Treatment & Information800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Cryosurgery of the CervixAdvertisementAdvertisementAdvertisementCryosurgery of the CervixCryosurgery of the cervix, also called cervical ablation, uses liquid nitrogen to treat suspicious cells. It’s used for precancerous tissue that could turn cancerous and unusual bleeding. The procedure takes a few minutes in a medical office. There are very few risks, and you can go back to most activities almost immediately.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is cryosurgery of the cervix?Cryosurgery of the cervix uses extremely cold chemicals, like liquid nitrogen, to destroy suspicious cells or tissue in a woman’s cervix. This inch-long tube forms the lower part of the uterus and connects to the vagina.Cryosurgery of the cervix is one example of a treatment called cryotherapy. Other names for this treatment include cryoablation and cryosurgical ablation.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs to have cryosurgical ablation of the cervix?Cervical cryotherapy can help women who have:Abnormal cells in the cervix that can turn into cancer, such as cervical intraepithelial neoplasia (CIN) and cervical carcinoma in situ (sometimes called stage 0 cancer).Irregular bleeding from the cervix.Procedure DetailsWhat happens before cervical cryoablation?Cryosurgery takes place in a healthcare provider’s office while you’re awake.Before the procedure, your healthcare provider may or may not use local anesthesia, a medication to numb the area. Occasionally, you may also receive a sedative, a medication to help you relax.Your healthcare provider may offer warm blankets to keep you more comfortable.AdvertisementWhat happens during the cryoablation procedure?The procedure takes only a few minutes. While you’re lying on an exam table, the healthcare provider will:Insert a metal or plastic tool called a speculum into the vagina to open it, as happens during a Pap test.Insert a hollow metal tool called a cryoprobe into the vagina. The probe contains and circulates the chemical (which is as low as –50 degrees Celsius).Touch the tip of the cryoprobe to the cells or tissue that need treatment. The tip of the probe will have ice crystals and be cold enough to freeze the tissue.Hold the probe in place a few minutes, until the tissue freezes at about –20 degrees Celsius.Wait a few minutes, then repeat the ablation if needed.What happens after cervical cryosurgery?You’ll be able to go home the same day as treatment.As the frozen cells thaw, they either get absorbed by the body or flushed out through the vagina. The discharged (leaked) substance is often watery but sometimes a little thicker. It may contain a small amount of blood. This may last up to several weeks. You may want to wear a pad.Your healthcare provider will tell you how and when to follow up. Most people need a test a few weeks or months later to make sure the cells were destroyed. Options may include:Biopsy.Pap test.AdvertisementRisks / BenefitsWhat are the advantages of cryosurgery of the cervix?Cryosurgery is less invasive than other types of surgery, so it involves less pain, bleeding, and risk of other complications. It’s also less expensive and requires less time than other types of surgery.The procedure doesn’t harm nearby tissues. It can get repeated or combined with other treatments if needed.What are the risks or complications of cervical cryosurgery?Cryoablation is generally safe, and it shouldn’t affect your ability to get pregnant later. But it may cause:Cramps or pain.Vaginal spotting.Fainting.Infection.Scarring on the cervix (rarely), a condition called cervical stenosis.Recovery and OutlookHow effective is cervical cryosurgery?Cryosurgery of the cervix is effective about 90% of the time, and abnormal cells usually don’t come back. If they do, you may need more cryotherapy or another treatment.What is the recovery time?Most people can go back to their normal routines right away. Talk to your healthcare provider about how long you should rest or if you should avoid any activities.Your provider may recommend avoiding vaginal intercourse, tampons and douching for a few days to a few weeks. That may help you heal and prevent infection.When to Call the DoctorWhen should I call my healthcare provider?You should call your healthcare provider right away if you have certain warning signs. They could signal an infection or other complication and include:Chills.Fever of 101 degrees Fahrenheit or higher.Heavy vaginal bleeding.Severe pain in your belly area.Vaginal leaking that smells bad.A note from Cleveland ClinicIf you have precancerous cells or unusual bleeding in the cervix, cryosurgery may help. The procedure uses extremely cold chemicals to freeze and destroy suspicious cells and tissue. The procedure is safe and effective, and you can go back to most normal activities immediately.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/15/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"