"Cupping Therapy: Definition, Types & Benefits800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Cupping TherapyAdvertisementAdvertisementAdvertisementCupping TherapyCupping therapy is an ancient healing method that may ease back pain, neck pain, headaches and other issues. It uses suction to pull on your skin and increase blood flow to the affected area. Cupping causes bruising and can lead to skin infection. There’s mixed evidence on the benefits of cupping, but the treatment risks are generally low.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewCupping therapy uses the force of suction to pull blood toward the surface of your skin. The idea is to increase your body’s natural healing response in these areas.What is cupping therapy?Cupping therapy is an ancient healing technique that some people use to ease pain. A provider places cups on your back, stomach, arms, legs or other parts of your body. A vacuum or suction force inside the cup pulls your skin upward.Cupping therapy is a form of traditional medicine that originated in China and West Asia. People have practiced this method for thousands of years.Other names for cupping therapy include cupping, cup therapy and suction cup therapy.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat does cupping therapy do?Cupping uses suction to draw blood to or away from specific areas of your body. People mostly use cupping to relieve conditions that cause pain. Some people say it also helps with chronic (ongoing) health issues. Cupping may ease symptoms of:Arthritis, including rheumatoid arthritis.Back pain, neck pain, knee pain and shoulder pain.Asthma and other breathing issues.Carpal tunnel syndrome.Gastrointestinal (GI) disorders like irritable bowel disease (IBD).Headaches and migraines.High blood pressure (hypertension).Procedure DetailsHow does cupping work?Experts are still exploring how cupping eases pain and disease symptoms. There isn’t a lot of research on the therapy.Suction from cupping draws fluid into the treated area. This suction force expands and breaks open tiny blood vessels (capillaries) under your skin. Your body replenishes the cupped areas with healthier blood flow and stimulates proper and normal healing at a cellular level. Because of this effect, some people think that cupping releases toxins.AdvertisementHow do healthcare providers perform cupping?There are different ways to do cupping. The steps vary slightly depending on the chosen method. Your provider will leave the cups in place for several minutes. Some treatments involve briefly moving the cups to stretch and massage the area.Cupping methods include:Dry: Your provider heats the inside of each cup. The traditional method involves setting an alcohol-soaked cotton ball aflame. The heat sends oxygen out of the cup, creating a vacuum. A more modern approach involves using a suction device to remove air from the cups. The vacuum force pulls your skin up into the cup.Running: This is like dry cupping. But before beginning, your provider will apply lotion or oil to your skin. Once they place the cups, they’ll gently move them in different directions over the affected area of your body.Bleeding: Your provider uses a needle to lightly puncture your skin before placing the cups. This allows for the release of toxins through the suctioned blood captured in the cup.Depending on the treatment, your provider may place multiple cups on your skin. On average, providers use between three and five cups, though they might use up to seven. It’s uncommon to get more than seven cups in a single treatment.What type of cups do they use?Most providers use glass or plastic cups, but cups may also be:Bamboo.Ceramic.Metal.Silicone.What should I expect after cupping?The suction force from cupping breaks open tiny blood vessels called capillaries under your skin. You’ll have red, round cupping therapy marks that should fade in a week or two. Although these marks will look like bruises, they’re not true bruises that injure muscle fibers.Does cupping hurt?Cupping shouldn’t cause pain, though you may experience some skin tightness during the procedure. After cupping therapy, you may feel bruised and slightly sore, but you shouldn’t have severe discomfort.AdvertisementWho performs cupping therapy?A variety of healthcare providers can receive training to perform cupping, including:Acupuncturists.Chiropractors.Massage therapists.Medical doctors.Physical therapists.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentRisks / BenefitsWhat are the potential benefits of cupping therapy?Many people who’ve had cupping therapy report that it:Reduces pain and inflammation.Decreases muscle tightness.Improves blood flow.Increases range of motion.What are the risks or complications of cup therapy?Cupping is a relatively low-risk therapy. Still, you may experience:Bruising.Burns from heated cups.Fatigue.Headaches.Muscle tension or soreness.Nausea.Skin infections, itching or scarring.In rare instances, people may develop vasovagal syncope (fainting after a drop in your blood pressure and heart rate). This is most common after wet cupping for people who pass out with needle sticks.Who shouldn’t get cupping?Because researchers know so little about cupping’s effects on pregnancy, you shouldn’t have cupping therapy if you’re pregnant. You should also avoid cupping if you have:Anemia.A pacemaker.Bleeding disorders like hemophilia.Blood clotting problems, like deep vein thrombosis (DVT) or a history of strokes.Cardiovascular disease.Skin conditions, including eczema and psoriasis.Seizures (epilepsy).Even though cupping therapy carries a low risk of complications, it’s not for everyone. Talk to your healthcare provider before trying cupping or any other alternative medical treatment.Recovery and OutlookHow effective is cupping?There’s mixed evidence about the effectiveness of cupping. Experts note many different reasons why cupping might work. In fact, the success of cupping may result from a combination of these reasons.For example, cupping therapy might:Encourage whole-body comfort and relaxation.Increase your pain threshold.Reduce inflammation.Enhance blood circulation.Remove toxins from your body.Reduce cholesterol and low-density lipoprotein (LDL).Help prevent cardiovascular diseases like atherosclerosis.Increase red blood cells.Stimulate your peripheral nervous system.Most healthcare providers recommend cupping as a complementary medicine treatment. In other words, you should use it in combination with traditional Western medicine rather than as a stand-alone procedure.When to Call the DoctorWhen should I call my healthcare provider?You should call your healthcare provider if you get cupping and experience:Burns.Extreme pain or soreness.Fever or other signs of skin infection (redness, tenderness, yellow discharge).What questions should I ask my healthcare provider?If you’re thinking about trying cupping therapy, here are a few questions you might want to ask your healthcare provider:Could cupping help my specific symptoms?Are there other treatments I should try in addition to cupping?What’s your experience with cupping therapy?Are there any reasons why I shouldn’t try cupping?Are there cupping therapists in the area that you recommend, or how can I identify a qualified cupping therapist?A note from Cleveland ClinicPeople have used cupping therapy to relieve pain, headaches and other symptoms for thousands of years. While there’s not a lot of research to back up claims of success, cupping seems to work for some people — and it doesn’t carry a lot of risks. Still, you should talk to a healthcare provider before trying cupping or any alternative therapy. Your provider may be able to recommend a practitioner or specialist who can provide the alternative therapy and do so effectively and safely.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/07/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.448.4325Appointments & LocationsSign Up for News & InfoFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"