"Cystectomy (Bladder Removal): Procedure, Risks & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/CystectomyAdvertisementAdvertisementAdvertisementCystectomyA cystectomy is the full or partial removal of your bladder. Surgeons most often recommend it to treat bladder cancer. If they remove your entire bladder, they’ll create a new way for urine to leave your body. Risks include bleeding, infection and sexual side effects. Recovery may take several weeks to months.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a cystectomy?Cystectomy is a complex surgical procedure in which a surgeon removes some or all of your urinary bladder — the organ below your kidneys and above your urethra that holds your urine (pee) before it leaves your body.Surgeons usually perform a cystectomy to treat bladder cancer. However, they sometimes perform a cystectomy to treat benign (not cancerous) conditions that affect the bladder and urinary system.Another name for a cystectomy is bladder removal surgery.Is a cystectomy major surgery?Yes, a cystectomy is major surgery. It removes all or part of your urinary bladder.Can a person live without a bladder?Yes, you can live without a bladder, but you’ll need a new reservoir to hold pee that your kidneys produce. However, if a surgeon removes your entire bladder, there’s an adjustment period as you become more comfortable with a new way to relieve yourself. You can still do many of the activities that you did before surgery.Why is a cystectomy done?Surgeons mostly perform cystectomies to treat bladder cancer. However, they may also recommend the procedure to treat congenital conditions (conditions you’re born with) or other conditions that affect your urinary system.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before a cystectomy?Before a cystectomy, you’ll meet with a healthcare provider. They’ll check your general health and take your vitals (temperature, pulse and blood pressure). They’ll also talk to you about which surgical approach they’ll use to remove your bladder. They may remove part of your bladder (partial cystectomy) or your entire bladder (radical cystectomy):Partial cystectomy. Your surgeon removes only part of your bladder. If they’re performing a partial cystectomy to treat cancer, they’ll usually remove nearby lymph nodes as well to determine whether any cancer has spread beyond your bladder. Lymph nodes are small bundles of tissue that filter your body’s lymph fluid (clear fluid that contains white blood cells and keeps your body’s cells moist) and produce immune system cells. Your surgeon repairs the remaining bladder, and it stays in your body.Simple cystectomy. Your surgeon will remove your bladder, but not any of the surrounding structures. This approach treats benign bladder conditions such as neurogenic bladder, radiation cystitis, urinary fistula and severe interstitial cystitis.Radical cystectomy. Your surgeon removes your entire bladder and nearby lymph nodes. In men and people assigned male at birth (AMAB), surgeons almost always cut the vas deferens and remove the prostate and seminal vesicles. In women and people assigned female at birth (AFAB), your surgeon often removes your uterus, fallopian tubes, ovaries and cervix. They occasionally remove part of the vaginal wall, too.Tell your healthcare provider about any prescription or over-the-counter (OTC) medications you’re taking. These include herbal supplements. Aspirin, anti-inflammatory drugs, certain herbal supplements and blood thinners can increase your risk of bleeding. Be sure to check with a healthcare provider before stopping any medications.Tell your healthcare provider about any allergies you have as well. Include all known allergies. These include medications, skin cleaners like iodine or isopropyl alcohol, latex and foods.Your healthcare provider will also give you specific directions on eating and drinking before your cystectomy. You shouldn’t eat or drink anything after midnight the night before your surgery. If you must take medications, you should take them with a small sip of water.What happens during a cystectomy?A special team of healthcare providers will perform a cystectomy. The team typically includes:A urologist.An anesthesiologist.Nurses.The anesthesiologist will sedate you (put you under) with general anesthesia. You won’t be awake, won’t move and won’t feel any pain during the procedure.Your urologist will perform your cystectomy using one of two different surgical approaches:Open cystectomy. Your urologist accesses your bladder and the tissues around it with one, long vertical surgical incision (cut) of about six to seven inches (15 to 18 centimeters) between your belly button and pubic bone. They’ll then insert their gloved hands into your body cavity through the incision to perform the operation.Minimally invasive (laparoscopic or robotic) cystectomy. Your urologist will first inflate (insufflate) your abdomen with carbon dioxide to create a working space. They’ll then make five to six very small incisions (about half an inch or less) in your abdomen (belly area) so that they can insert long, thin instruments, including a camera, into your body cavity. Laparoscopic surgery means your urologist uses these instruments to perform the surgery with these tools. Robotic surgery involves attaching the instruments to a surgical robot that your urologist controls through a surgical console (controller). A surgical robot enhances the operation by providing three-dimensional vision as well as more precise movements.After removing some or all of your bladder, your urologist will perform reconstructive surgery. Reconstructive surgery creates a new way to store pee and remove it from your body. If your urologist performs a complete cystectomy, they’ll reconstruct your urinary tract in one of three ways so that the pee you produce can leave your body. These methods include:Ileal conduit. Your urologist disconnects a short section of your small intestine (ileum). The ureters (the tubes that carry pee from your kidney to your bladder) attach to one end of the ileum. The other end attaches to an opening in your skin (stoma). The stoma is usually close to the right side of your belly button. A plastic bag (ostomy bag) goes over the stoma to collect pee.Continent cutaneous diversion. Your urologist creates a reservoir out of part of your small and large intestines to store pee. Your ureters attach to one end of the reservoir, and the other end of the reservoir connects to a stoma in your abdomen. You must periodically empty the reservoir by inserting a small drainage tube (catheter) into the stoma. You don’t have an ostomy bag outside your body with a continent cutaneous diversion.Neobladder. Your urologist uses a long piece of your small intestine to create a reservoir to store pee. Your ureters attach to one end of the reservoir. The other end of the reservoir connects to your urethra. You must periodically empty the reservoir by relaxing your pelvic muscles and tensing your abdominal muscles. Some people with neobladders need a urinary catheter to help drain pee.How long does cystectomy surgery take?A cystectomy takes approximately six hours to perform.AdvertisementWhat happens after a cystectomy?After a cystectomy, a healthcare provider will stitch your incisions and cover them with bandages.The anesthesiologist will stop putting anesthesia into your body. You’ll be conscious (awake) within a few minutes, but you’ll likely still feel groggy.You’ll then move to a recovery room. Healthcare providers will wait for you to wake up more fully and track your overall health. Once you fully wake up, providers will treat your pain. You may need pain medication and management techniques.How long is a hospital stay for bladder removal?Your hospital stay depends on the type of cystectomy you have.You’ll typically need to stay in the hospital for at least one day after a laparoscopic or robotic cystectomy.For an open cystectomy, your hospital stay is longer. You may need to stay in the hospital for up to a week.During your hospital stay, providers will monitor your recovery and make sure you’re beginning to heal and aren’t having issues with pain management. If you need an ostomy bag, they’ll also teach you how to attach, empty and change it.Care at Cleveland ClinicUrology CareMake an AppointmentRisks / BenefitsWhat are the advantages of a cystectomy?The main advantage of a cystectomy is that it treats bladder cancer or another noncancerous condition that affects your bladder or urinary system.AdvertisementWhat are the risks or complications of a cystectomy?Like any major surgery, a cystectomy poses risks. These risks include:Bleeding.Blood clots.Infection.Bowel complications.Scar tissue that blocks the flow of pee from your kidneys.Organ damage.Anesthesia risks.Healing problems.Fluid buildup at surgical sites (seroma).As you recover, you may have a poor appetite and abnormal bathroom habits, including constipation, diarrhea or both. You may also have changes in how you pee after a cystectomy. Your bladder is smaller after a partial cystectomy, so you may need to go to the bathroom more often. It’s also normal to have mucus in your pee. If you have a radical cystectomy, your ability to pee depends on the type of reconstructive surgery you have.For some men and people AMAB, a cystectomy may cause sexual side effects. You may have difficulty getting and maintaining an erection.Women and people AFAB may also experience sexual side effects. Intercourse is still possible, but it may cause discomfort if the urologist removes part of your vagina. Some people may have nerve damage. Nerve damage may limit your ability to become sexually aroused and achieve orgasm.Recovery and OutlookWhat is the recovery time?A complete recovery may take several weeks to months.Your recovery depends on the type of bladder removal surgery you have. Typically, most people who have a partial cystectomy will have a shorter recovery period than people who have a radical cystectomy.How is life after a cystectomy?After a few weeks, you should be able to return to work or school and resume light physical activities.After you recover from a cystectomy, it may take time to adjust to the changes to your body. If you have an ostomy bag, the following tips may help you adjust faster:Empty the bag before it’s half-full to keep it flat.Use warm water, a washcloth and mild, fragrance-free soap to clean and rinse the skin around your stoma.After you wake up, change your pouch before you drink anything to help prevent dripping.After you empty your bag, add a pouch of ostomy deodorant to help control odors.Use ostomy powder when you change your bag to reduce skin irritation.Some people find it helpful to be upfront with others about their ostomy bag. Ultimately, it’s up to you to decide how open you want to be about your surgery and ostomy. Your healthcare provider can recommend how and when to explain your surgery and ostomy bag to others.When to Call the DoctorWhen should I see my healthcare provider?After a cystectomy, contact your healthcare provider right away if you notice any of the following symptoms:Signs of infection, including fever, chills and dark, cloudy pee.Long-lasting nausea and vomiting.Heavy bleeding at your surgical sites.Increasing discoloration, swelling, pain or pus from your surgical sites.Black, brown or dark purple skin discoloration of your stoma.Excessive pain that you can’t control with your prescribed medications.Inability to pee or difficulty draining your pee from your diversion.A note from Cleveland ClinicA cystectomy is a surgical procedure that removes part or all of your urinary bladder. It can be a stressful procedure and recovery. There may be an adjustment period as you get used to the changes in your body and your daily routines. Your healthcare providers will help you adjust, answer all of your questions and offer the best recommendations for your long-term health and quality of life.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/17/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicUrology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"