"Jaw Surgery (Orthognathic): Types, Procedure & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Jaw Surgery (Orthognathic Surgery)AdvertisementAdvertisementAdvertisementJaw Surgery (Orthognathic Surgery)Jaw surgery, also called orthognathic surgery, is surgery to fix your upper jaw (maxilla) and/or your lower jaw (mandible) when they don’t line up. Orthognathic (“ortho nathic”) jaw surgery isn’t a single event. It’s a process that starts with orthodontia, then jaw surgery and several months of recovery before having more orthodontia.ContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is jaw (orthognathic) surgery?Jaw surgery, also called orthognathic surgery, is surgery that helps align your upper jaw (maxilla) and lower jaw (mandible). If your jaws don’t line up, it can affect your bite and make it hard for you to eat and speak.Orthognathic (“ortho nathic”) surgery isn’t a single event. It’s a process that includes orthodontic treatment to prepare your teeth for your jaw surgery, the surgery itself, recovering from surgery and then more orthodontic treatment for up to a year after your surgery. All told, the jaw surgery process can take between two and three years.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow do people develop jaw bone problems?Generally speaking, jaw bone problems are either present at birth (congenital) or caused later in life by injuries or other medical conditions that affect your jaw.What are examples of congenital jaw problems?Congenital jaw problems can be individual issues like having an overbite or can be related to an overarching medical condition like Treacher Collins syndrome. Here are some other examples of congenital jaw problems.Crossbite. This happens when some of your bottom teeth sit out in front of your upper teeth.Underbite.Open bite. Open bite is when many teeth don’t come together when you close your mouth.Cleft lip and palate. Cleft palate happens when your face and mouth didn’t develop normally.Pierre Robin sequence. Children born with Pierre Robin sequence often have small lower jaws that can make it difficult for infants to eat or breathe.What are examples of jaw problems caused by injuries or medical conditions?Facial fractures. The term jaw fracture can refer to your lower jaw (mandible) or your upper jaw (maxilla). You can break your lower jaw by being hit or punched by an object. You can break your upper jaw by falling, being in a motor vehicle accident or being hit.Cysts and tumors. Healthcare providers might also perform jaw surgery to treat radiation exposure.Obstructive sleep apnea (OSA). OSA happens when your airway muscles, tonsils, tongue or excess tissue block your airway so your breath stops and starts when you sleep. OSA is treated with jaw surgery called maxillomandibular advancement (MMA).Temporal mandibular joint disorders (TMJ). TMJ can be caused by an improper bite, which is when your upper and lower teeth don’t line up.Growth disturbances. This refers to changes in your jaw when your body develops too much growth hormone. The excess hormone makes your tissues, including your upper and/or lower jaw, grow unusually large.What do I need to consider before having jaw surgery?You should have a clear idea of what jaw surgery can accomplish and what’s involved when you have jaw surgery. You might have a before-and-after image of your face in mind. If you do, share that image with your healthcare providers. Tell them what you expect jaw surgery to accomplish. Everyone’s jaw problems are different, though. Your healthcare providers will explain what they recommend to solve your specific issues and what you can expect.Understanding your personal goals is one of the factors healthcare providers consider when recommending jaw surgery. They also consider your overall health and the specific health concern your jaw problem causes.Jaw surgery isn’t a one-and-done event, though. It’s a process that can take years to complete. As you consider jaw surgery, ask questions about the process, from pre-surgery orthodontia to recovery to post-surgery orthodontia. Understanding what jaw surgery involves will help you prepare for what will be a long-term commitment.AdvertisementWhat happens before this procedure?There’s a lot of pre-work that goes into jaw surgery. Your healthcare provider needs certain information to plan your surgery. Here are some tests and steps they might take to obtain that information:X-rays.Computed tomography (CT) scans.Photographs of your teeth and jaw.Impressions of your teeth to create a dental model.They might also scan your teeth.Will I need orthodontic treatment before my jaw surgery?Yes. Your orthodontist will prepare your mouth and teeth for your new jaw. To do that, they might remove teeth and may put braces on other teeth. If you do need braces, you’ll probably wear them for a year before your surgery, during your surgery and for several months after your surgery.Is there anything I should do to prepare for jaw surgery?Yes. Your healthcare provider will likely restrict food intake to liquid foods you can eat without chewing. Before surgery, consider stocking up on soups, milk, nutrition drinks and fruits and cooked vegetables you can liquefy using a blender.You’ll receive general anesthesia before your surgery. Ask your healthcare provider about preparing for general anesthesia.What are the different types of jaw surgery?Jaw surgery corrects problems that make your jaws stick out too much or too little, making your facial features appear unbalanced. There are three types of jaw surgery:Maxillary osteotomy. This surgery is done when your upper jaw sticks out too much or too little. Maxillary osteotomy also treats an open bite and cross bite.Mandibular osteotomy. This surgery is done when your lower jaw sticks out too much or too little.Double jaw surgery. This surgery is done if you have a problem that affects both jaws.AdvertisementWhat happens after jaw surgery?You may need to stay in the hospital for one to four days after your surgery so your healthcare providers can monitor your progress. Here’s what you might experience while you’re in the hospital and throughout your recovery:You’ll have a plastic splint in your mouth that your healthcare provider placed during surgery. The splint will help train your mouth muscles to work with your new jaw position. You’ll need to wear your splint except when you eat or clean your teeth.Your face will probably be pretty swollen. You’ll sleep with your head raised and take medication to help with swelling.Your healthcare provider will prescribe medication to help with pain and protect against infections.You’ll need to keep ice packs on your face throughout the first 24 hours, using the ice pack for 20 minutes on, 10 minutes off.You’ll start the liquid diet you’ll be on for the next several weeks.The swelling and the splint in your mouth might make it hard for people to understand you. That can be frustrating. Let your healthcare provider know if you’re really struggling. They’ll suggest things you can do to communicate.Your healthcare provider will remove the plastic splint about eight months after surgery.If you have braces, you’ll continue wearing them for six to nine months after surgery.After your braces are removed, you’ll need to wear removable retainers to keep your teeth in their new position. Your healthcare provider will let you know how often you need to wear your retainers, but most people wear them continuously for a full year. After that, you might need to wear your retainers a few nights a week.Risks / BenefitsWhat are the advantages of this procedure?Jaw surgery can solve problems caused when your upper and lower jaws don’t line up. Jaw surgery is an option when orthodontic treatment hasn’t helped your problem.What are the risks or complications of jaw surgery?Like any major surgery, there are several risks involved in jaw surgery. Some risks are common surgical risks, such as anesthesia risks, risk of bleeding or infection. Other risks are more specific to jaw surgery. Those risks include:Your teeth are damaged.Your bones don’t heal as they should.You have problems with your jaw joint.You can’t open your mouth as wide as you’d like.Your cheeks and lower lip remain numb after surgery.You might need additional surgery to fix problems your first surgery didn’t solve.Your original bite problem — the reason you had jaw surgery — might come back.You might have scars.Recovery and OutlookWhat is the recovery time after jaw surgery?Every person’s recovery is different, but most people recover at home for several weeks before returning to work or school. You may be able to do light exercise while you recover, like taking brief walks. Talk to your healthcare provider before adding any exercise to your daily routine. Healing takes time. It might be a year before your jaw heals completely.When to Call the DoctorWhen should I see my healthcare provider?You’ll see your healthcare provider about eight weeks after surgery so they can remove your mouth splint and your stitches.When should I go to the emergency room?You should go to the emergency room if you:Are suddenly short of breath.Have a fever higher than 100. 4 degrees Fahrenheit (38.3 degrees Celsius.)Have pain that’s getting worse instead of better.Notice your surgery site is oozing a green smelly discharge, particularly if your surgery site is dark red or feels hot to the touch.Have persistent vomiting or diarrhea.Notice the stitches holding your incisions together appear to be separating.Are bleeding more than you expect.A note from Cleveland ClinicIf you’re thinking about jaw surgery, the most important step is to be sure of your decision. Jaw surgery is a major surgery that can disrupt your life for several weeks and months. You owe it to yourself to understand how jaw surgery will affect your life. You also should understand what you can expect from your jaw surgery. Talk to your healthcare providers about your options and expectations. They’ll understand you’re making a big decision and will be glad to answer your questions. Just as important, they’ll give you time to be sure jaw surgery is right for you.Care at Cleveland ClinicSchedule Oral and Maxillofacial SurgeryFind a Doctor and SpecialistsMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/03/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Oral and Maxillofacial SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"