"Jawline Filler: Options, What To Expect, Before & After800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Jawline FillerAdvertisementAdvertisementAdvertisementJawline FillerJawline filler injections smooth wrinkles and fine lines, giving your face a more youthful appearance. These dermal fillers add shape, volume and definition to thinning, saggy skin. This nonsurgical cosmetic procedure offers noticeable, immediate results. Jawline filler effects are temporary but can last months or years.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewA jawline filler is a cosmetic injection procedure to give your jaw a more defined look.What is jawline filler?Jawline filler is a nonsurgical cosmetic procedure that gives your jaw area a more defined look. Your healthcare provider injects safe substances called fillers underneath your skin. The filler plumps up your skin. You get smoother-looking skin that looks more youthful.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are other names for jawline fillers?Jawline fillers are a type of dermal filler. The word “dermal” (dermis) refers to your skin. You may also hear these terms:Facial fillers.Injectable fillers.Soft tissue fillers.Who gets jawline fillers?You can get dermal filler injections in different parts of your face and body. More than 3 million Americans get some type of dermal filler each year.You may want a jawline filler to:Add volume to your jawline.Create a more defined separation between your jawline and neck.Give your jawline a sharper angle.Have a more youthful appearance.Make your jawline more symmetrical.Reduce the effects of aging like sagging skin and wrinkles.Smooth creases or fine lines in your jaw.AdvertisementHow do jawline fillers work?There are different dermal fillers that enhance the appearance of the jawline. How jawline fillers work depends on the type:Calcium hydroxylapatite (CaHA): This mineral compound exists in your bones. As a jawline filler, you get an injection of CaHA mixed into a water-based gel. Collagen forms around the gel, adding fullness to your jawline and smoothing lines. Radiesse® is one type of CaHA filler.Hyaluronic acid (HA): This naturally occurring body substance keeps your skin hydrated and full. You make less of this acid as you age, leading to fine lines and thinner, saggy skin. HA injections include Juvederm® and Restylane®. These dermal fillers plump up your jawline, smoothing wrinkles and fine lines.Polymethylmethacrylate (PMMA): These tiny collagen beads keep your skin looking fuller and firmer. It also contains bovine (cow) collagen. This semi-permanent filler can last for years, but often requires repeat injections to get the full effect. Bellafill® is one type of PMMA filler.How long do jawline fillers last?Over time, your body naturally breaks down and absorbs jawline fillers. How long they work depends on the filler type:Calcium hydroxylapatite (CaHA) filler lasts for up to 12 months.Hyaluronic acid filler lasts six to 12 months (and sometimes up to two years).PMMA lasts five years.AdvertisementWhat other procedures may take place with jawline fillers?It depends on your aesthetic goals. Your healthcare provider may recommend a jaw implant in addition to (or instead of) jawline fillers. During this cosmetic surgery, a plastic surgeon places a solid silicone implant into your jawline. The implant permanently adds definition and shape to your jawline.Or your healthcare provider may recommend these nonsurgical cosmetic procedures:Botulinum toxin injections (Botox®).Lip augmentation or dissolving lip filler.Nonsurgical facelift.Vampire facelift.Who shouldn’t get jawline fillers?You shouldn’t get dermal fillers if you have:Cold sores (herpes simplex virus type 1).Connective tissue diseases like lupus or scleroderma.An infection.Uncontrolled diabetes.Procedure DetailsWho performs jawline filler procedures?Different types of healthcare providers can inject jawline fillers. You should look for a licensed provider who has experience with dermal fillers.Providers who perform jawline filler procedures include:Dermatologists.Cosmetic or plastic surgeons.Physicians, physician assistants and nurse practitioners.Where do jawline filler procedures take place?You can get this quick outpatient procedure at your healthcare provider’s office. You can also get dermal fillers at a medical spa (also called a medspa or medispa). This medical clinic delivers cosmetic procedures in a spa-like environment.What happens before a jawline filler procedure?Your healthcare provider will examine your face and discuss your treatment goals. This information helps determine the filler type and amount that’s right for you, as well as the depth and locations of the injections. They may mark your face to show where the injections go. They may also take pictures to show before-and-after results.Before the procedure, your healthcare provider will review possible side effects. You’ll learn what to expect in terms of results and recovery. Your provider may also recommend other cosmetic procedures or surgeries to help achieve your desired look.You should tell your healthcare provider about your:Medications and supplements: Nonsteroidal anti-inflammatory drugs (NSAIDs), blood thinners (including aspirin) and some supplements can increase your risk of bleeding and bruising.Nicotine use: Smoking and using nicotine products can slow the healing process.Skin conditions: Dermal fillers may not be an option if you have an active skin disease or are getting certain treatments.What happens during a jawline filler procedure?The outpatient procedure takes 10 to 20 minutes. You go home soon after treatment. Your provider will cleanse your skin and apply a topical numbing anesthetic cream. Some fillers also contain a numbing agent to ease discomfort.Your healthcare provider uses a very thin needle to inject small amounts of filler underneath your skin. You may feel a slight pinch or sting, but the procedure isn’t painful.Care at Cleveland ClinicPlastic Surgery CareMake an AppointmentRisks / BenefitsWhat are the benefits of jawline fillers?Compared to more invasive cosmetic surgeries, jawline fillers offer:Fast procedure and recovery with little, if any, missed work or activities.Immediate results.Minimal health risks.Monetary savings (it’s less expensive than surgery).What are the risks of jawline fillers?Jawline filler procedures are relatively safe. Any side effects tend to be temporary. They include:Allergic reaction to the filler.Asymmetrical appearance.Bleeding, bruising and redness.Bumps that look like acne.Infections.Numbness.Skin damage or scars.Skin discoloration, sensitivity and swelling (edema).Recovery and OutlookWhat is recovery like after a jawline filler procedure?You may have some bruising or swelling after the procedure. These side effects go away in a few days. Still, you should be able to see an immediate and noticeable difference. You can apply cold compresses or ice packs to the treatment area to minimize any discomfort.Follow your healthcare provider’s recommendations about resuming activities. Depending on the type of work you do, you should be able to return to work after the procedure. Your provider may recommend waiting 24 hours before performing strenuous physical activities.When to Call the DoctorWhen should I call the doctor?You should call your healthcare provider if you experience:Allergic reaction like an itchy rash.Bruising, redness or swelling that lasts for more than a week.Bumps or nodules near the injection sites.Lopsided (asymmetrical) appearance that lasts for more than a week.Signs of infection, such as fever.Additional Common QuestionsCan you get a fat transfer procedure instead of jawline fillers?A fat transfer (fat grafting) procedure uses fat from your body as the dermal filler. Fat grafting is a more complicated process than a filler injection (although it’s still an outpatient procedure). A plastic surgeon performs this procedure.Fat transfer requires liposuction, a surgical body contouring procedure. Your surgeon removes fat deposits from one or more areas of your body, like your butt or thighs. After purifying the fat, your surgeon injects it into your jawline.About half of the injected fat survives, creating permanent lifelong changes. However, you might not get the changes or look that you get with more traditional dermal fillers. The risk of complications is also greater. And recovery after liposuction can take as long as two weeks.A note from Cleveland ClinicJawline filler is a fast, noninvasive cosmetic procedure to smooth wrinkles in your jawline. These fillers can enhance your jawline’s appearance and make you look younger. The effects of jawline fillers are temporary. You’ll need repeat injections every six to 18 months. While dermal fillers are relatively safe, skin injections aren’t without risk. It’s important to choose an experienced healthcare provider who can help you get the look you seek.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/28/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPlastic Surgery CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"