"J-Pouch: What It Is, Surgery & Complications800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/J-Pouch SurgeryAdvertisementAdvertisementAdvertisementJ-Pouch SurgeryIf you have to remove your whole colon due to a serious disease, you’ll need an alternative route to pass poop from your body. The J-pouch is one solution that your surgeon can create. It’s an internal pouch made from the end of your small intestine that connects to your anal canal. This allows you to poop on a toilet in the old-fashioned way.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewThe small intestine is bent in the shape of a “J” to form a pouch.What is a J-pouch?A J-pouch is one type of ileal pouch that a surgeon can create inside your body to replace your colon and rectum. A surgeon constructs an ileal pouch from your ileum, which is the end of your small intestine.There are a few different types of ileal pouches, but the J-pouch is the most popular one today. The pouch acts as a reservoir for your poop that connects to your anus (butthole), the way your rectum once did.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho is the J-pouch for?If you’ve had or need to have a total proctocolectomy, you may wish to have a J-pouch with it. A total proctocolectomy removes your colon and rectum when they’ve become unusable due to disease.When most of your large intestine is gone, you’ll need an alternative way to pass food waste (poop) from your body. J-pouch surgery is one solution that allows you to continue to poop through your anus.What is the difference between a J-pouch and an ileostomy?The J-pouch is an alternative to a permanent ileostomy. If your anus is still functional, the J-pouch can replace your colon and rectum internally. It reconnects your ileum and anus so you can poop normally.An ileostomy, on the other hand, diverts your ileum to a new opening in your abdomen called a stoma. Your poop comes out of the stoma into an external ileostomy bag, which you’ll then empty.How do you empty a J-pouch?The J-pouch is an internal pouch that mimics your original anatomy. It empties itself through your anus as your rectum used to do. When it’s full, you’ll feel the urge to poop and find a bathroom.AdvertisementProcedure DetailsWho can have J-pouch surgery?You may be a candidate for J-pouch surgery after your proctocolectomy if:The muscles and nerves in your anus are functional enough to control your bowel movements. Your surgeon will evaluate their condition after you’ve healed.You’re healthy enough to be safe for multiple surgeries. Some people who need a proctocolectomy have other conditions or take medications that need to be considered.Your surgeon will discuss these factors with you before and after your proctocolectomy.What happens during the J-pouch procedure?J-pouch surgery usually happens in two to three stages, beginning with your total proctocolectomy. Your surgeon may begin the process during your proctocolectomy surgery or later in a separate surgery.You’ll have a temporary ileostomy after your proctocolectomy unless you’re having a permanent ileostomy instead. Your temporary ileostomy will remain until your J-pouch is ready to use.Your surgeon will:Find the end of your small intestine and measure out two loops, each about 6 inches long. Fold this length in half, like a “U.” Open up the inside seam of the “U” and sew the two edges together to make a pouch.Pull this pouch down from your abdominal cavity into your pelvic cavity. The many coils of your small intestine will stretch out a little to reach. The pouch now appears to have a longer stem on one side, resembling a “J.” Connect the bottom of the pouch to your anal canal, usually with staples but sometimes with stitches. This is called ileal pouch-anal anastomosis, or IPAA.Divide the small intestine above the new J-pouch to create a temporary loop ileostomy. One end of the loop ileostomy goes up to the intestines and stomach, and the other down to the new J-pouch. Your poop will come out through the ileostomy for several months, “bypassing” the J-pouch while it heals.After eight to 12 weeks, test your pouch at the end of the healing period to make sure it’s healed properly and doesn’t leak. The test is called a pouchogram. A healthcare provider will fill your J-pouch with a contrast solution through a tube inserted into your anus — similar to a barium enema. Then they’ll take fluoroscopic X-rays.When your J-pouch has passed the leak test, your surgeon will schedule your final surgery. They’ll reverse your temporary ileostomy and close your stoma. Your poop will now go through the healed J-pouch.AdvertisementWhat should I expect after J-pouch surgery?After the procedure, your body will need time to adapt to your new anatomy. Your J-pouch will be small at first, with little capacity. It’ll gradually stretch out over the following months as you use it more.This means you won’t be able to hold much poop in the beginning. You’ll probably poop more often during the day and a few times during the night. This will gradually improve over time.In addition, your anal muscles will be weak from a lack of exercise. You may need to retrain them to control your bowel movements. Your provider might suggest Kegel exercises to help with this.Your healthcare provider will be there to support your recovery process. They’ll continue to monitor your condition and look for signs of possible complications during follow-up appointments.Care at Cleveland ClinicDigestive CareMake an AppointmentRisks / BenefitsWhat are the possible risks of J-pouch surgery?Risks of J-pouch surgery include:Anastomotic leak. If your ileal-anal anastomosis leaks, bacteria from your intestines could leak into your abdominal or pelvic cavity and cause an infection. You might develop an abscess that needs to be drained. The infection could also become systemic and lead to sepsis.Abdominal adhesions. Sometimes, excessive scar tissue can develop around your abdominal organs after abdominal surgery. The scar tissue can cause an obstruction in your small intestine, making it difficult for food to pass through. It can also affect female reproductive organs, leading to female infertility.Sexual dysfunction. Surgery around your anus and rectum can sometimes damage nerves connected with sexual function. This may cause pain or sensitivity with sex for women and people assigned female at birth (AFAB). It can sometimes cause erectile dysfunction in men and people assigned male at birth (AMAB). These symptoms often improve over time.What long-term complications or side effects may occur with the J-pouch?J-pouch complications include:Pouchitis. Pouchitis means inflammation inside your J-pouch, which may cause symptoms like pain, urgency to poop or even bleeding. About half of people with a J-pouch will develop pouchitis at some point. Most of the time, it’s thought to be due to a bacterial infection, and antibiotics quickly relieve it. But some people develop persistent pouchitis. This may require medical therapy to prevent the pouch from failing.Stricture/stenosis. Sometimes, scar tissue at the site of the ileal pouch-anal anastomosis causes the pathway into your anus to narrow. This can cause an obstruction or blockage in your J-pouch. You might have difficulty passing gas and stool. Trapped stool may cause an infection in the pouch. You or a healthcare provider may need to use a dilator to stretch it out again.Twisted pouch syndrome. Your J-pouch can also become obstructed if it was rotated in your pelvis when it was made, twisting the opening. This recently discovered complication is named twisted pouch syndrome. Common symptoms include severe abdominal pain or pelvic pain, difficulty pooping, erratic bowels and needing to poop more than 10 times a day. A twisted J-pouch needs reoperation to fix. Thankfully, this is rare.In twisted pouch syndrome, your J-pouch is rotated in your pelvis at the time of construction.How successful is J-pouch surgery?The estimated long-term success rate is 95%. A small number of J-pouches fail. Failure means the pouch has persistent complications that prevent it from working well, and it needs to be removed or replaced. In this case, your quality of life is better with a good permanent ileostomy than with a bad ileal pouch.How will I know if my J-pouch is failing?J-pouch failure is possible when you’ve had troublesome symptoms for a long time that persist despite treatment. These will usually be symptoms of inflammation in or around your pouch, like:Pain that feels like it’s in or just above your anus.A feeling of heat, swelling or irritation when you poop.Blood in your poop.Tenesmus (constantly feeling like you have to poop, but you can’t).What are the advantages of the J-pouch?When you have a total proctocolectomy, the way you poop will change forever. Whether this is an elective surgery or a lifesaving one, it helps to know that you’ll have some options going forward.Your choice will be either to have a permanent ileostomy or an internal ileal-anal pouch. For most people, this means the J-pouch. (Other ileal pouches are used in special circumstances.)The J-pouch is a simple and effective design. It connects to your anus, allowing you to poop using normal pooping muscles and nerves. It holds your poop until it’s ready to come out, like a new rectum.The J-pouch eliminates the need to live with and care for a stoma and an ostomy bag. While you’ll poop more often than before, you’ll maintain bodily control over when and where you poop.Recovery and OutlookCan you live a normal life with a J-pouch?You’ll use the bathroom normally with a J-pouch, although it’ll be more often than before. You may have more than 10 bowel movements a day at first, then settle down to between five and 10.Your poop will also be wetter because it’s traveling a much shorter distance than before. Without passing through your colon, your poop won’t have the chance to slowly solidify as it used to.This also means that your body won’t be able to reabsorb fluids from your poop as it used to. You’ll need to take extra care to stay hydrated. However, this is also true with an ileostomy.Most people report an improved quality of life after J-pouch surgery. You’re free of the disease that caused you to have a total proctocolectomy, and you’re also free of the demands of an ileostomy.Should I change my diet after J-pouch surgery?There’s no one prescribed diet for people living with a J-pouch. But eating a balanced, healthy diet will help you heal well and avoid bothersome symptoms. Your healthcare providers might suggest:Starting slow: When you first begin eating solid foods again after surgery, you’ll want to be gentle with your digestive system. Choose bland, easy-to-digest foods in smaller portions. Avoid high-fat, high-fiber and highly seasoned foods. Introduce new foods gradually during this time.Staying hydrated: You’ll lose more fluids and electrolytes through your poop than you used to, especially in the beginning. Replacing lost electrolytes with salted broths, sports drinks or oral hydration formulas is a good idea. As your poop becomes more solid, you can adjust your fluid intake.Controlling diarrhea: If your poops continue to be wetter and more frequent than you’d like, you can try to bulk them up by eating more starches, like bananas, potatoes, rice and bread. You should also avoid excessive sugar, caffeine, fat and alcohol, which aggravate diarrhea.Controlling inflammation: You can help prevent and manage inflammation in your pouch with your diet. A diet rich in unsaturated fats and antioxidants, like the Mediterranean diet, can help reduce inflammation and support a healthy microbiome in your pouch to prevent infection.A note from Cleveland ClinicJ-pouch surgery is a big step, and it’s natural to feel nervous about how it’ll change your life. Take all the time you need to research and ask questions about the procedure before you take the leap.When you’re ready, don’t forget to reach out to your social support system. It helps to have a dedicated friend or family member to accompany you to the hospital and help you manage after your surgeries.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/26/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicDigestive CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"