"What Is ECMO?800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/ECMOAdvertisementAdvertisementAdvertisementECMOECMO (extracorporeal membrane oxygenation) is a type of artificial life support that can help a person whose lungs and heart aren’t functioning correctly. This process continuously pumps blood out of your body and sends it through a series of devices that add oxygen and remove carbon dioxide. The machine then pumps your blood back into your body.ContentsArrow DownOverviewRisks / BenefitsAdditional Common QuestionsContentsArrow DownOverviewRisks / BenefitsAdditional Common QuestionsOverviewECMO pulls blood out of your body and puts it back after adding oxygen to it.What is ECMO?ECMO (extracorporeal membrane oxygenation) is a type of artificial life support that can help a person whose lungs and heart aren’t functioning correctly. ECMO continuously pumps blood out of your body and then sends it through devices that add oxygen and remove carbon dioxide. It then pumps the blood back into your body.ECMO treatment can be especially valuable in making it possible for your heart and lungs to rest and heal from a respiratory infection, heart attack or trauma.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat does ECMO stand for?ECMO stands for extracorporeal membrane oxygenation. Extracorporeal means “outside the body.” The rest of the name refers to getting oxygen to your body’s cells.How does ECMO work?During ECMO treatment, blood flows out of your body through a tube in a large blood vessel in your chest, near your groin or in your neck. A pump pushes your blood through tubes that carry it to a machine that adds oxygen and removes carbon dioxide. Then the machine pumps your blood back into your body.ECMO treatment helps people who need support for their lungs, but it can also bypass both your heart and lungs.AdvertisementIs ECMO considered life support?Yes. ECMO is a complex setup that healthcare providers only use for people who need intensive or critical care. Mechanical ventilation devices are a type of life support, but they can only move air. They can’t add oxygen to and remove carbon dioxide directly from your blood. ECMO can exchange these gases similarly to how your lungs do.What conditions does an ECMO machine treat?Providers use ECMO for the following conditions:Acute respiratory distress syndrome (ARDS)Damage to your lungs can cause acute respiratory distress syndrome, limiting how well your lungs can put oxygen in and take carbon dioxide out of your blood. This can happen with:Respiratory infections such as pneumonia, the flu, the novel coronavirus that causes COVID-19 and more.Sepsis, which damages your lungs.Burns and inhalation injuries. Inhaling smoke, toxic chemicals and fumes, or breathing in hot air from a fire can damage your lungs.Drug overdose.Pancreatitis. Inflammation of your pancreas can cause your body to release chemicals and toxins that can damage your lungs.Drowning or aspirating something into your lungs, such as water, beverages, food or vomit.Airway bleeding.Pulmonary embolismPulmonary embolism happens when a blood clot that formed somewhere in your body (usually your legs) travels to your lungs and gets stuck. This can keep blood from flowing through your lungs, which can cause deadly failure of your heart and lungs.Heart injuriesYou may need ECMO treatment if you have injuries to your heart from trauma or other diseases or conditions. Some of these include:Heart attack.Trauma, such as from a fall or car crash, can bruise and damage your heart muscle.Infants and newbornsNewborns and infants with heart and lung problems, especially babies born prematurely, often receive ECMO treatment.Transplants and surgeriesECMO can help serve as a “bridge” until a person can get a specific type of care or procedure. Healthcare providers use ECMO for someone waiting for a heart or lung transplant or at these times:Transplant surgery.Heart and lung surgery.Recovery after surgery.Keeping an organ donor alive as long as possible.How commonly is an ECMO machine used?ECMO has become a significant asset in critical care units (CCUs) and intensive care units (ICUs) over the past 30 years. It’s also getting more use as an add-on to CPR. And critically ill people with COVID-19 have received ECMO.About 500 hospitals worldwide can do ECMO and a little over half of them are in the United States.Providers used ECMO more than 20,000 times worldwide in 2021, according to the Extracorporeal Life Support Organization.Risks / BenefitsWhat are the advantages of being on an ECMO machine?An ECMO machine can be a life-saving tool for people who are critically ill because it can support their lungs and heart. This can have the following effects:Eases the strain on the heart and lungs, making it possible for these organs to heal.Keeps a person alive during surgery or another medical procedure.Supports a person as they wait for a transplant.Helps infants who were born with heart issues or lungs that weren’t fully developed.AdvertisementWhat are the possible risks or complications of being on an ECMO machine?While an ECMO machine is an invaluable medical tool, it’s also one that has risks, some of them significant.Clotting problems. Anyone on ECMO also has to be on blood thinners because of the risk of clots forming. Clots could also become stuck in the ECMO circuit, interrupting blood flow.Infection. Any break in your skin is a risk for an infection, and the tubes of an ECMO circuit can give an infection direct access to your bloodstream. This can make it easier for an infection to spread throughout your body.Bleeding. Because tubes have to go into major arteries and veins, this can increase your risk of bleeding.Low or uneven blood oxygen levels. Normally, your blood oxygen level should be between 95% and 100%. In general, ECMO’s target range is 86% to 92%. Maintaining an even blood oxygen level throughout your body can also be a challenge.ECMO circuit failure. A mechanical failure in any part of the ECMO circuit can cause the entire circuit to stop. This can be life-threatening.Stroke. Stroke can occur as a result of either spontaneous bleeding in the brain during ECMO support or from clots in the circuit that end up traveling to the brain. This can be life-threatening.When should an ECMO machine not be used?ECMO is less likely to help older people. Your healthcare provider can advise you on the age-related risks and benefits.There are several conditions or circumstances where ECMO isn’t an option. These include:When the person has heart, lung or circulatory problems that aren’t repairable or that a transplant won’t fix.People with damage to other critical organs like their liver or brain.Cancer that has spread from its origin.Uncontrolled internal bleeding, especially in the head, or injuries that could lead to uncontrolled bleeding.Additional Common QuestionsHow long can a person be on an ECMO machine?People can stay on ECMO anywhere from days to weeks. The length of time that a person will spend on ECMO depends on why they need this treatment.What happens when you come off of ECMO?Healthcare providers will routinely check a person’s heart and lung functions while they’re on ECMO to make sure they’re in good condition and there are no complications. This also lets providers know how much longer to keep someone on ECMO.Once a person shows signs of recovery, providers will begin weaning them off ECMO. In most cases, this process takes between two and five days.Can a person stay on ECMO for months, years or more?ECMO isn’t meant for people who have no hope of recovery. Your provider is the best person to assess your condition. ECMO supports your body while recovery is underway. The only exception is to delay death for organ and tissue donation.Can ECMO be done for just the heart?Yes, ECMO can help with compromised heart function. Alternatively, providers can use other support devices such as ventricular assist devices.A note from Cleveland ClinicECMO is an option that can help many people who are critically ill with lung and heart problems. It’s not a new treatment, having been in use for decades. Modern medicine also has a better understanding today than ever before of how ECMO can help save lives. But it isn’t meant for everyone. Your healthcare provider can explain the potential benefits and risks and help you decide what’s best in your situation.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 12/29/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"