"Electrocauterization Surgery: What It Is & Procedure Details800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/ElectrocauterizationAdvertisementAdvertisementAdvertisementElectrocauterizationElectrocauterization is a form of electrosurgery. It’s a technique that uses an electric current to cut tissue or create scars. Electrocautery may happen during surgery or as a stand-alone procedure.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is electrocautery?Electrocautery is a technique that uses an electrical current to apply heat to tissue in order to:Cut tissue without searing it.Create targeted areas of scar tissue.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow is electrocautery different from electrosurgery?Any procedure that uses an electrosurgical unit (ESU) is electrosurgery. An ESU is a device that generates electricity to cut or manipulate tissue.Electrocautery is a type of electrosurgery. It applies an electrical current directly to tissue. Another type is fulguration, which creates a spark that generates enough heat to kill targeted cells. Other electrosurgery methods deliver treatments by sending an electrical current through your body.What is electrocautery used for?Healthcare providers use electrocauterization to:Control bleeding from small blood vessels.Remove diseased tissue.Destroy abnormal tissue.Prevent uncontrolled bleeding due to issues such as chronic nosebleeds.Remove small skin growths and areas of damaged skin.AdvertisementHow is electrocauterization used?Electrocauterization has many uses:Treating eye issuesDistichiasis, an extra set of eyelashes that grow from the tissue under your eyelids.Dry eyes.Trichiasis, lashes that grow toward your eye instead of away from it.Other proceduresAbnormal uterine bleeding.Airway blockages due to growths such as papillomas and lipomas.Chronic nosebleeds.Genital warts, including those due to human papillomavirus.Removing pacemaker and implantable cardioverter-defibrillator (ICD) wires. This may be necessary if they get entangled with nearby tissue.Tumors in hard-to-reach areas or delicate tissue, like your brain.Skin issuesActinic keratosis.Moles.Molluscum contagiosum.Noncancerous growths on your skin’s outer layers, such as angiomas and syringomas.Seborrheic keratosis.Cosmetic concernsSkin tags.Sun damage.Warts.Procedure DetailsHow does electrocauterization work?This technique uses a handheld device (probe) similar to a pen. An electric current heats the tip. Healthcare providers can adjust settings to control the temperature and energy level. The settings used depend on the goals of your procedure.There are two ways to perform electrocautery:Monopolar uses a single small electrode.Bipolar uses a two-pronged probe, like tweezers, to apply pressure when necessary.AdvertisementWhat happens during electrocautery?What happens during the procedure depends on why you need electrocauterization.Electrocauterization during surgeryFor electrocautery that’s part of a surgical procedure, here’s what to expect:Medications put you to sleep or make you tired and relaxed.Your healthcare provider starts performing the procedure you need.When electrocauterization is necessary, your surgeon applies the cautery pen to the area.After electrocautery, your provider carries out the rest of your procedure.Nonsurgical electrocautery proceduresIf electrocauterization is part of a procedure on the surface layers of your skin, here’s what happens:Your healthcare provider delivers an anesthetic to the treatment area.They may apply gel to the treatment area to prevent burns.They place a grounding pad on your body to protect against electric shock.Using the electrocautery device, your healthcare provider carries out the procedure you need.Care at Cleveland ClinicSchedule General SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of electrocautery?Electrocauterization has many benefits, including:Precision: Electrocautery offers a higher degree of control than other cautery methods.Speed: This technique takes only a few minutes.Effectiveness: Electrocauterization has a high success rate and typically only requires one treatment.Less blood loss: Electrocautery helps minimize blood loss during surgery.What are the risks of electrocautery?Risks include:Infections: Electrocauterization causes tissue damage, making it easier for bacteria to grow.Heart complications: The procedure can disrupt electrical activity in your heart. This can lead to complications in people with a pacemaker or implantable cardioverter defibrillator (ICD).Poor outcomes: Some electrocautery procedures are more successful than others. For example, moles sometimes come back after electrocautery.Burns: If the probe is too hot or the intensity is too high for the procedure, it can cause burns.Recovery and OutlookWhat is recovery from electrocauterization like?When electrocautery is part of a surgical procedure, following instructions from your healthcare provider can help you have a successful recovery.For stand-alone electrocauterization, especially ones involving your skin, here’s what to expect:Healing can take a few weeks. It’s essential not to pick or scratch the area during this time.Skin may become lighter or darker for a few months after it heals. It also may be sensitive to sun. This is usually temporary.The treatment area may be sore, itchy or swollen for a few days.You may experience pain, but over-the-counter meds can provide relief.When to Call the DoctorWhen should I contact my healthcare provider after electrocautery?Contact your healthcare provider if you experience:Abnormal bleeding.Pain that doesn’t subside after a few days.Signs of infection, such as a fever or skin that’s warm to the touch or oozes pus.Additional DetailsCan I use an at-home electrocauterization device?At-home electrocautery devices are available. However, a healthcare provider can perform the safest, most effective electrocauterization. They have the experience to deliver treatment to the right spot. They also use research-based techniques to protect you from complications.Is electrocautery painful?It’s typically not painful when you receive electrocauterization from a healthcare provider. You receive medications to numb the area or put you to sleep before the procedure.A note from Cleveland ClinicElectrocauterization is a method of using electricity to apply heat to tissue. It has many uses. For example, electrocautery can stop bleeding from small blood vessels and safely remove abnormal growths. Treatment areas are often small and heal with time. Follow all care instructions to keep your recovery moving forward.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/15/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule General SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"