"ECT (Electroconvulsive Therapy): What It Is & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Electroconvulsive therapy (ECT)AdvertisementAdvertisementAdvertisementElectroconvulsive therapy (ECT)Electroconvulsive therapy (ECT) is a procedure that uses a mild electrical current to cause a brief seizure. This treatment effectively treats severe mental health conditions, including depression, schizophrenia, and more. It's also safe, and modern methods use anesthesia to minimize any discomfort you might feel during the procedure.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is electroconvulsive therapy (ECT)?Electroconvulsive therapy (ECT) is a medical procedure that involves passing a mild electric current through your brain, causing a short seizure. This procedure is proven to have strong positive effects on severe, treatment-resistant mental health conditions. ECT’s history stretches back more than 80 years, and extensive research shows it’s an effective, safe technique. This treatment involves anesthesia so that you won't feel pain during the procedure.ECT often has a negative connotation because of how it's been shown in movies, television shows and other media. These portrayals of ECT are usually inaccurate about how this procedure happens, whether or not it's painful or frightening and whether or not it's effective. These portrayals are not true-to-life, and they don’t show how healthcare providers do this procedure safely and humanely.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs to have this treatment?ECT can treat people with severe mental health conditions and is an option for a wide range of ages. This procedure can help children (some states have specific restrictions), teenagers, and adults of all ages. The strongest benefits from ECT tend to happen in people over 60.Why is ECT used?The most common reasons for ECT are severe mental health conditions under the following circumstances:When medications aren’t working.When the person experiences an extreme shut down of function, called catatonia.In situations where a person is a danger to themselves or others, and medications will take days or weeks to become effective.AdvertisementWhat conditions are treated with ECT?ECT is a possible treatment for several conditions, including the following:Depression (especially in people who are over the age of 60).Schizophrenia (including other schizophrenia-spectrum conditions and psychotic disorders).Bipolar disorder and other conditions that involve mania.How common is ECT?Although it's effective and safe, ECT is not a common procedure. That’s likely the case for several reasons, a few of which include:ECT is rarely a first-line treatment for depression.There are several newer medications available to treat this condition.Fewer hospitals offer ECT (which affects people receiving inpatient and outpatient care).AdvertisementProcedure DetailsWhat happens before this procedure?Before you start ECT, your healthcare provider will explain to you (or to someone who can make healthcare decisions for you) what ECT is and how it works. They’ll also make sure you don’t have any underlying health conditions or reasons that might mean you shouldn’t receive ECT.Several tests are possible leading up to ECT, including (but not limited to) the following:Blood and urine tests. Some examples include complete blood count, a metabolic panel (basic or comprehensive), thyroid function, kidney function and more.Imaging tests on your skull, brain and spine. These may include X-rays and computerized tomography (CT) scans.Electrocardiogram (ECG or EKG). This test looks at your heart function and can spot any unusual changes or problems with your heart’s electrical system.Reasons why you shouldn’t receive ECTThere are some conditions and reasons why you shouldn’t receive ECT. Known as “contraindications,” these are all considered on a case-by-case basis. Even if you have a contraindication, providers can often adjust the treatment procedure to take these into account so you can still receive ECT. Contraindications include:A recent heart attack (myocardial infarction) or other unstable heart condition.Conditions that increase the pressure inside your skull (such as intracranial hypertension or brain tumors).A recent stroke, aneurysm or other cause of bleeding in your brain.Severe lung diseases like chronic obstructive pulmonary disease (COPD).Certain other life-threatening conditions or people who meet the level 4 or 5 requirements on the American Society of Anesthesiologists physical classification system.Stoppage of food and liquidsBecause general anesthesia is a part of ECT, your healthcare provider will have you fast before this procedure. That means stopping food eight hours before the procedure and stopping liquids two hours before.What you should take off or removeA healthcare provider may tell you to remove jewelry, medical devices, accessories or prosthetics before having this procedure. Common examples include taking off or removing your glasses, contact lenses, hearing aids, dentures or dental plates, etc. This helps avoid any risks of injury or choking because of these items.Medication stoppageCertain medications can affect how ECT affects you, including how effective this treatment is. Your healthcare provider may ask you to stop certain medications or reduce your dosage. However, you should only stop or change medications as directed by your provider.What happens during this procedure?ECT involves multiple healthcare providers, including a psychiatrist, anesthesiology specialist and other trained personnel.Anesthesia and other preparationsECT procedures start with general anesthesia, which puts you into a deep sleep and keeps you from feeling any pain, discomfort or anxiety during the procedure. Providers will also give you a muscle relaxant to avoid any injuries or strain that might happen during the seizure.Providers will also insert a bite guard into your mouth to protect your teeth, and also insert an intravenous (IV) needle into one of your veins (usually one in your arm). The IV allows quick injection access for medications for anesthesia reasons or to counteract any side effects.Electrode placementA healthcare provider will then place electrodes, which are contact points for the electric current to travel through, against the skin of your head. The placement depends on your specific needs, and providers will choose a placement with the lowest chance of causing side effects. There are three different ways that providers can place the electrodes.Right unilateral: This placement has both electrodes on the right side of your head. One electrode will be between your temple and the end of your eyebrow. The other electrode will be near the top of your head, directly above your right ear.Bifrontal: Electrodes placed using this configuration are on opposite sides of your forehead, just above the end of your eyebrow.Bitemporal: This placement involves one electrode aligned with the temple area on each side of your head.A healthcare provider will coat the electrodes in a conductive gel that should prevent irritation and burns to your skin. While the electrical current involved is very low, skin irritation and burns are still possible.Electricity requirementsECT involves a very small electrical current, up to about 0.4 amps. For comparison, a 9-volt alkaline battery can deliver about 0.6 amps of current for one hour before the battery is empty. Providers will also start the current at low levels and increase it until it has the desired effect.The electrical current duration for ECT is also very brief. For most treatments, delivery of electrical current to your brain only lasts a few seconds.Induced seizureECT uses an electrical current to cause a seizure, which is when a burst of electrical activity happens in your brain and causes affected brain cells to fire rapidly. This causes electrical and chemical changes in the way that area of your brain works, leading to improvements in how those areas of the brain work.Seizures from ECT typically last between 30 and 90 seconds. In cases where they last longer, healthcare providers can stop the seizure using injectable medications.What happens after this procedure?After the seizure stops, healthcare providers will monitor you as you awaken from anesthesia. They'll also check your vital signs to look for any signs of side effects or other anesthesia-related problems that might happen.Most people are fully conscious within 10 to 15 minutes after this procedure and can be on their feet and walk around within 30 minutes.Care at Cleveland ClinicMental Health CareMake an AppointmentRisks / BenefitsWhat are the advantages of ECT?ECT has many advantages that make it a critical tool for treating mental health conditions.It is extremely effective. Experts agree that ECT is one of the most effective treatments for mood disorders like depression. It is also especially effective at helping people with depression that resist other forms of treatment like medication or therapy.It is very safe. The use of anesthesia and other modern care practices have greatly improved this procedure's overall safety. Even people who have heart problems can often receive ECT with adjustments to their medication or close monitoring of their vital signs.It is very safe in pregnancy.It works quickly. People who receive ECT typically see improvements in their symptoms, especially with conditions like major depressive disorder, after three to five treatments. That’s especially helpful when a person has a very severe mental health condition that puts their safety in jeopardy.It can help people when other treatments are unavailable. People who can’t take medications for mental health conditions for any reason can often still receive ECT. This can make a big difference for people with organ function problems or people who are pregnant (ECT is safe during all three trimesters of pregnancy).It’s especially effective in combination with medication. People receiving ECT often also receive medications for treatment, which can further improve the chances that their mental health condition will improve.What are the disadvantages, risks or possible complications of this procedure?Though it is extremely effective, ECT does have some disadvantages.There’s a risk of memory loss. Most people who undergo ECT have temporary memory loss and confusion. Most people's confusion clears up quickly, and memory loss usually goes away entirely within a few months. However, some people do have permanent memory problems. Using the right-unilateral electrode placement and shortening the electrical current duration can reduce the risk of this happening.It’s a medically intensive procedure. Each ECT procedure requires multiple providers with advanced training to be present. That means this treatment is often not available in smaller healthcare facilities and communities.This procedure might only have short-term effects. Some people who receive ECT need follow-up treatments. These “maintenance” procedures may need to happen for weeks or months. Usually, these follow-up treatments can happen once a week or even once every several months. The use of medication along with ECT can help with this.Recovery and OutlookWhat is the recovery time?Most people who receive ECT recover quickly from the procedure. Most wake up within 15 minutes and can be on their feet within 30 minutes.The overall course of treatment with ECT involves multiple treatments. These can happen multiple times per week for several weeks. Usually, people receive three ECT treatments per week.When to Call the DoctorWhen should I see my healthcare provider?Your healthcare provider can tell you more about the potential signs and symptoms to watch for that mean you need medical attention in the near future or immediately. If you notice the following, you should call your healthcare provider or go to the nearest emergency room:Severe headache.Fast heartbeat (tachycardia) or irregular heartbeat (arrhythmia).If you don’t feel better within two to three days, or if you feel worse.If you are worried about your mood or mental state.When should I get emergency medical care?You should get emergency care if you have disturbing thoughts about harming yourself, including thoughts of suicide or about harming others. If you have thoughts like this, you can call any of the following:Suicide and Crisis Lifeline (United States). To call this line, dial 988.Local crisis lines. Mental health organizations and centers in your area may offer resources and help through crisis lines.Dial 911 (or your local emergency services number): You should call 911 (or the local emergency services number) if you feel like you’re in immediate danger of harming yourself. Operators and dispatchers for 911 lines can often help people in immediate danger because of a severe mental crisis and send first responders to assist.Additional Common QuestionsIs ECT painful?No, the ECT procedure isn’t painful. ECT involves general anesthesia, which means you’re asleep while the procedure is happening. After the procedure, you may have some side effects, such as headache, nausea or sore muscles, but these are all normal. If you're worried about these, you can talk to your healthcare provider and ask them for guidance on what you can do to minimize these effects.Is ECT safe?Yes, advances in modern medicine and ECT procedures make this treatment very safe. If you have healthcare conditions or concerns and you're worried about if these will be a problem, you can talk to your healthcare provider about these. Your provider can take other health conditions or circumstances into account, adjusting this procedure accordingly. They might also offer alternative options better suited for your needs.Does ECT cause brain damage or memory loss?Researchers and experts have looked at ECT using many different tools, imaging technologies and diagnostic tests. The available research shows that permanent negative effects from ECT like memory loss are rare. Memory loss does happen in some cases, but it’s usually temporary and goes away within a few months. Researchers also found that ECT stimulates certain types of brain function, which improves the symptoms that happen with many mental health conditions.Does ECT work?The available research shows that ECT is extremely effective, more so than any other available treatment for depression. No one entirely understands how ECT works for depression, but there are many theories. ECT may cause changes in brain chemistry or repair changes to the brain caused by severe, chronic depression.A note from Cleveland ClinicElectroconvulsive therapy is a procedure that can help people with severe mental health conditions. It's especially useful in cases where other treatments aren't an option or haven't worked. While this procedure often provokes a negative reaction because of portrayals in movies and television shows, this procedure is safe and effective. Healthcare providers will also go through several steps to make sure you are comfortable during this procedure and have minimal side effects. ECT can make a huge difference in relieving severe symptoms for many people, and it's often a life-saving procedure.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/06/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicMental Health CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"