"Elemental Diet: What it Is & How it Works800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Elemental DietAdvertisementAdvertisementAdvertisementElemental DietThe elemental diet is a medical protocol prescribed for certain gastrointestinal conditions. The diet consists of a liquid formula of complete nutrition broken down into its most elemental form. This “predigested” nutrition is easily absorbed in the upper digestive tract, allowing the lower digestive tract to rest and recover from illness or injury.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewWhat is an elemental diet?The elemental diet is a liquid meal replacement diet that offers a complete nutritional profile broken down into its most “elemental” form. Proteins, fats and carbohydrates are broken down into amino acids, short-chain triglycerides and short-chain maltodextrins, combined with vitamins, minerals and electrolytes. These dietary “building blocks” are easily absorbed in the upper digestive tract, allowing the rest of your digestive system to rest and recover from illness or injury. Several prescription and non-prescription formulas are available on the market. They come in a liquid or powder form designed to be mixed with water. They can be taken orally or enterally (through a tube).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is the elemental diet used for?The elemental diet is usually medically prescribed for people with severe gastrointestinal diseases or recovering from gastrointestinal surgery, who need to rest their digestive systems to heal. Resting the digestive system can help calm inflammation flare-ups, prevent autoimmune reactions to food irritants and starve overgrown gut bacteria. Occasionally, the formula might be prescribed as a dietary supplement for people struggling to meet their nutritional needs. Under medical supervision, the duration and calorie intake of the diet is customized to the person. Guidance on the diet is recommended, but if you want to try it briefly to see if it helps your gut issues, this is generally safe.What conditions are the elemental diet recommended for?Your healthcare provider may recommend the elemental diet if you have one of the following:Inflammatory or autoimmune conditionsCrohn’s disease.Colitis.Chronic pancreatitis.Eosinophilic esophagitis.Celiac disease.Arthritis.IBS.Radiation enteritis.Food allergies and intolerances.Small intestinal bacterial overgrowth.Conditions requiring supplemental nutritionAnorexia.Cancer.HIV.Conditions in which the digestive system isn’t fully functionalShort bowel syndrome.Pancreatic insufficiency.AdvertisementWho should not go on the elemental diet?People with blood sugar conditions, such as diabetes. The elemental diet is high in carbohydrates, which may cause blood sugar spikes.People trying to lose weight. The elemental diet is designed to change the way that you consume your calories, not how many you consume. Pre-digested foods aren’t necessarily better for weight management. They’re better for a spectrum of medical conditions.Procedure DetailsWhat should I do before starting the elemental diet?Ideally, you should consult with a qualified healthcare provider regarding your symptoms and what you might hope to gain from the diet. Based on your condition, your healthcare provider might recommend the diet for three to five days to manage acute symptoms, or for several weeks to give your digestive system a restorative rest and reboot. They'll also let you know how much of the formula to take to meet your body’s caloric needs. Healthcare providers often lean toward higher-calorie recommendations to make sure you won’t feel too hungry or depleted during the diet.AdvertisementCan I eat food or drink other liquids on the elemental diet?On the full elemental diet, you don’t eat any other foods. The point of the diet is to replace food and minimize digestive activity. Following the diet exactly allows your gut the rest it needs to heal. You may be allowed to drink tea without anything added.Sometimes healthcare providers recommend a “half-elemental diet” for people who need a secondary source of nutrition or who are transitioning into or out of the full diet. In this case, the elemental formulas provide half of your calories, and the other half come from food.There are some formulas specifically marketed for a half-elemental diet, which may not be completely elemental — for example, they may contain MCT oil or whey. These are not completely broken-down sources of protein or fat, but they are generally easy to digest and make the half-diet easier to follow.How do I survive the elemental diet?This diet is very restrictive, and it can be challenging. To stick to the diet successfully, healthcare providers recommend that you:Keep it cold. Blending the formula with ice, smoothie-style, makes it more palatable.Sip it slowly to prevent nausea and drink plenty of water between “meals.\"Make it portable. Have a temperature-controlled thermos to keep your formula in so you don’t get hungry when you’re out and about.Stay busy. Distract yourself with fun, non-food-related activities and good company.What are the possible side effects of the elemental diet?During the diet, you may experience symptoms that make you wonder if it’s actually helping your condition or making it worse. Medical guidance can help you sort through this. Symptoms may include:Abdominal cramping. The first few days on a liquid diet may loosen poop that has been stuck in your colon, causing gas and discomfort as the residual poop is pushed out. This is a symptom that feels bad temporarily but indicates that something good is happening.Detox symptoms. During bowel rest, your liver may take the opportunity to offload extra toxins. This can lead to temporary detox symptoms, including headaches, lightheadedness, nausea and fatigue. Detox feels bad for a few days, but most people feel much better afterward.Bacteria die-off symptoms. If you have small intestinal bacterial overgrowth or small intestinal fungal overgrowth, the elemental diet can effectively starve them of food in your lower digestive tract, causing them to die off in great numbers. This can give you detox symptoms. These symptoms usually begin several days into the diet and recede after several days more.Reduced motility. It’s common to have less frequent bowel movements on the elemental diet. This may lead some people to believe they’re constipated, especially if they have residual poop in their colon that hasn’t come out yet. The diet doesn’t cause constipation, but it can slow down your bowel function. This is natural and generally no cause for concern.What should I do after the elemental diet?It’s important to reintroduce foods gradually as your digestive system is ramping back up again. Healthcare providers typically recommend following a half-elemental diet or a low-FODMAP diet during the transition. They may also recommend probiotics to re-populate your gut with beneficial flora, and prokinetic agents to stimulate your bowels to begin moving more regularly again. As you return to your more regular diet, pay attention to the way different foods affect your digestive system. If they cause too much distress, back off a bit and try again later.Care at Cleveland ClinicDigestive CareMake an AppointmentRisks / BenefitsWhat are the benefits of the elemental diet?The primary benefits of the diet are:Bowel rest. The diet allows your digestive system to heal from severe illness and injury without sacrificing your nutrition.Reduced inflammation. Many acute and chronic conditions cause temporary inflammation flare-ups that affect your digestion and quality of life. Reducing irritants in your digestive system gives inflammation a chance to subside.Reduced bacteria overgrowth. The types of gut bacteria that cause problems when they are overgrown depend on undigested food in the lower digestive tract to live. The elemental diet keeps food out of the lower digestive tract, starving the problematic bacteria and restoring balance.What are the downsides of the elemental diet?The taste. Most of the formulas are flavored, but they still have a reputation for not tasting great.It’s boring. It can be hard to drink the same formula all day, every day. For those with a more emotional relationship to food, this can cause some negative feelings.It’s high in carbohydrates. This won’t work for people with blood sugar conditions or carbohydrate intolerances.When to Call the DoctorWhen should I see my healthcare provider?Keep in touch with your healthcare provider regularly during the diet and let them know how you’re doing. They’ll let you know if they think it might be helpful or harmful to adjust your protocol.A note from Cleveland ClinicThe elemental diet has been used in clinical settings for decades, but recently has become more popular as an outpatient protocol. It has a well-documented success rate in relieving symptoms of SIBO and Inflammatory Bowel Disease. Other related conditions have not been as thoroughly studied, but theoretically and anecdotally, they may benefit just as much. If you have a chronic inflammatory condition, your healthcare provider may suggest the elemental diet as an intervention. With professional guidance, the temporary diet is safe for most people to try. It might be challenging, but the results might be worth it.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/18/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicDigestive CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"