"Embolectomy: Purpose & Procedure Details800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/EmbolectomyAdvertisementAdvertisementAdvertisementEmbolectomyAn embolectomy removes a blood clot that moved from where it started in a blood vessel to another part of your body. Your healthcare provider can do a minimally invasive procedure using a catheter or do a traditional surgery. You’ll need about a week to recover in the hospital after surgery. Like any surgery, it has a risk of complications.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsAdditional Common QuestionsOverviewWhat is an embolectomy?An embolectomy — also sometimes called thrombectomy — is the removal of a blood clot (thrombus) that’s keeping blood from flowing through a blood vessel normally.The blood clot may have formed in one part of your body (like your legs) and moved somewhere else (to your lungs, for example). That type of clot is an embolus.Or, the blood clot may have formed directly in the place where it’s causing problems. That type of clot is a thrombus.A surgeon or a doctor trained in minimally invasive procedures can perform embolectomy/thrombectomy (clot removal).Depending on the size and location of the clot, this can be an urgent procedure because the clot prevents blood from getting to an important part of your body.On the one hand, your blood needs to be able to clot so you don’t bleed too much when you have a cut. But some people have blood that tries to clot too much in places it shouldn’t. In these cases, your healthcare provider may need to remove the clot.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs to have an embolectomy?If you have deep vein thrombosis of the leg (blood clot in your leg), it can travel to your lungs and lead to a condition known as pulmonary embolism. If your healthcare provider can’t take care of it with medications, you may need an embolectomy/thrombectomy procedure.You may be more likely to get a blood clot (whether you’re bleeding or not) if you have:Heart disease.Obesity.Pregnancy.Cancer.Certain blood clotting disorders.Why is an embolectomy done?Your healthcare provider may do an embolectomy if you have pulmonary (lung) embolism or a blood clot in the right side of your heart and one of these is true:You can’t have anticoagulants (blood thinners) or thrombolytics (“clot-busting” medicine).Anticoagulants or thrombolytics didn’t work.You’re at risk for paradoxical embolism (when a blood clot can move through a defect in your heart and possibly go to your brain or other important parts of your body).Most people who have a blood clot that’s causing problems receive medicine for it instead of having surgery. However, surgery and other less invasive procedures are options depending on the situation. A team of healthcare providers typically decides on a person-by-person basis.AdvertisementProcedure DetailsWhat happens before an embolectomy?Your healthcare provider will set up a transesophageal echocardiogram (a type of imaging that uses ultrasound to show your heart in motion) to use during your surgical embolectomy.For a catheter embolectomy, your healthcare team gets an ultrasound machine ready to help them find the clot and sets up an angiogram (X-rays of your blood vessels) to help them put the catheter in the right place.For either type, you’ll receive some form of anesthesia so you don’t feel pain during the procedure.What happens during an embolectomy?Depending on the size of your blood clot, your healthcare provider may use one of two methods of removing your blood clot:Catheter embolectomy.Surgical embolectomy.Catheter embolectomy procedure stepsYour healthcare provider will:Inject numbing medicine into your skin before making a small cut.Put a small needle through the cut and into your blood vessel, which may be in your neck or your inguinal (groin) area.Place a catheter into your blood vessel. The catheter is gently pushed along the blood vessels and placed where the clot is. They’ll use X-rays during this step.Use a catheter to aspirate the clot out of the blood vessel (like a vacuum). They’ll repeat this step until enough clot is “vacuumed” out and blood flow to that area is better.Remove the catheter from your body and place a bandage over the small cut in your skin. They may place pressure over the skin cut for several minutes to make sure there isn’t too much bleeding.Surgical pulmonary embolectomy procedure stepsYour healthcare provider will:Make a cut down the middle of your chest (median sternotomy).Open your pericardium, the sac surrounding your heart.Start using cardiopulmonary bypass (a machine that takes over for your heart and lungs).Make a cut in your main pulmonary artery and extend the cut to where the artery splits.Remove blood clots.Some people may receive a vena cava filter to catch future blood clots. This keeps them from becoming another pulmonary (lung) embolus.AdvertisementWhat happens after an embolectomy?With either method, your healthcare provider will need to put a bandage and pressure on any external cuts they made. With surgical embolectomy, they’ll stitch your internal and external cuts and stop using cardiopulmonary bypass.After surgery, you may also need:Anticoagulants (blood-thinning medications).Transthoracic echocardiogram.After catheter embolectomy, you may also stay in an intensive care unit (ICU), where your medical team will monitor your recovery.Care at Cleveland ClinicBlood Clotting Disorders TreatmentDoctors and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of an embolectomy?Not everyone is a candidate for an embolectomy. But embolectomy (through either surgery or a minimally invasive procedure) may be the better choice if:You’re not a candidate for blood thinners or clot-busting medicine injected through an IV.You’re not getting better after IV medications and supportive care.Your symptoms are severe enough to choose a faster treatment to get the blood clot out of you.What are the risks or complications of an embolectomy?Interventions (both surgical and minimally invasive) have risks.Risks of (minimally invasive) catheter embolectomy include:Bleeding from blood vessel damage.Injury to your heart and/or interfering with your heart rhythm (arrhythmia).Leaving some of the clot behind.Risks of surgical embolectomy include:Bleeding.SVT (supraventricular tachycardia, a fast heartbeat).Heart failure.Kidney failure.Infection.Death.Recovery and OutlookWhat is the recovery time?With a pulmonary embolectomy, you’ll be in the hospital for at least a day or two until your breathing and heart function look good enough to go home. You may spend some time in the intensive care unit (ICU). Healing after a surgical embolectomy is usually longer than from a catheter embolectomy.In the past, a quarter to half of the people who had a pulmonary embolectomy didn’t survive. However, since the 2000s, death rates from this procedure have dropped to about 5% to 16%. A study that followed up on people who had this procedure found that 73% were alive five years after the surgery.When to Call the DoctorWhen should I see my healthcare provider?Because some complications can happen after an embolectomy, you should let your healthcare provider know if you experience:Trouble breathing.Infection.Chest pain.Heart palpitations.Bleeding.Additional DetailsEmbolectomy vs. thrombectomyBoth of these involve the removal of a blood clot, which is also called a thrombus. A thrombectomy is the removal of a blood clot sitting in your blood vessel, where it started. An embolectomy is the removal of a blood clot that went somewhere else after it started in your blood vessel.Embolectomy vs. endarterectomyAn embolectomy removes a blood clot that went to another part of your body. An endarterectomy removes plaque, a kind of waxy fat that clogs blood vessels.Embolectomy vs. thrombolytic therapyAn embolectomy is a procedure (surgery or minimally invasive) to get a blood clot out of your body. Thrombolytic therapy uses clot-busting medicine given in your blood vessels to make blood clots dissolve in your body. Thrombolytic (clot-busting) therapy can cause bleeding in other parts of your body (including your brain).A note from Cleveland ClinicHealthcare providers have several options for treating embolism. Because your case is unique to your situation, your healthcare provider will go over the best options available. If you or your loved one is having an embolectomy, don’t be afraid to ask questions about the procedure and its risks. Having an embolus (or thrombus) in your body can lead to some serious problems (even death) if not treated. It’s important to know the risks and benefits of the treatments available.Additional Common QuestionsChoi JH, O'Malley TJ, Maynes EJ, et al. Surgical Pulmonary Embolectomy Outcomes for Acute Pulmonary Embolism. Ann Thorac Surg. 2020 Sep;110(3):1072-1080. Accessed 6/17/2022.Deas DS, Keeling B. Surgical Pulmonary Embolectomy. Crit Care Clin. 2020 Jul;36(3):497-504. Accessed 6/17/2022.Fernandez-Jimenez R, Tapson V, Fuster V, Ibanez B. PULMONARY EMBOLISM. In: Fuster V, Harrington RA, Narula J, Eapen ZJ, eds. Hurst's The Heart, 14e. McGraw Hill; 2017. Accessed 6/17/2022.Kon ZN, Pasrija C, Bittle GJ, et al. The Incidence and Outcomes of Surgical Pulmonary Embolectomy in North America. Ann Thorac Surg. 2019 May;107(5):1401-1408. Accessed 6/17/2022.National Library of Medicine. Multiple pages. Accessed 6/17/2022.NHS. Embolism. Accessed 6/17/2022.Overall WR, Yock PG. Innovation and Interventional Cardiology: Looking Back, Thinking Ahead. In: Samady H, Fearon WF, Yeung AC, King III SB, eds. Interventional Cardiology, 2e. McGraw Hill; 2017. Accessed 6/17/2022.Rao RK, Crawford MH. Pulmonary Embolic Disease. In: Crawford MH, eds. CURRENT Diagnosis & Treatment: Cardiology, 5e. McGraw Hill; 2017. Accessed 6/17/2022.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/17/2022.Learn more about our editorial process.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicBlood Clotting Disorders TreatmentDoctors and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointment Center 24/7 216.445.7050Appointments & LocationsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"