"Emollients: Creams, Soaps, Moisturizers, Ointments, Benefits800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/EmollientsAdvertisementAdvertisementAdvertisementEmollientsEmollients are ingredients in skin creams, lotions, moisturizers or ointments that form a film on your skin. These ingredients can relieve dryness, itching and scaling. Emollients can help your skin feel more comfortable if you have eczema, psoriasis, dry or sensitive skin.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat are emollients?Emollients are ingredients in skin care products that soothe dryness or irritation. Emollients are also called barrier creams because they form a film on your skin’s outer layer. Healthcare providers often recommend emollients for skin conditions that cause scaling or dryness, such as eczema and psoriasis.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat do emollients do?Skin care creams, lotions and ointments that contain emollients can:Attract moisture (water) to your skin.Prevent the loss of moisture in your skin.Soften scaling or peeling skin.Soothe irritated or dry skin.What’s the difference between an emollient and a moisturizer?An emollient is an ingredient in moisturizer. The job of the emollient is to soften skin. Moisturizers contain other ingredients that help bring water into your skin.AdvertisementWhat are the types of emollients?There are two main types of emollients, and many moisturizing skin care products contain a combination of both:Occlusives form a thick and greasy coating on your skin and don’t dissolve in water. Examples of occlusives include petroleum jelly, mineral oil, lanolin and liquid paraffin. Occlusives don’t add moisture to your skin but help it hold onto the moisture it already has.Humectants attract and bind water to your skin, increasing its moisture. These ingredients feel less thick and greasy than occlusives but wash off more easily in water. Examples of humectants are glycerin, hyaluronic acid, propylene glycol and urea.What conditions can emollients treat?Emollients can help relieve symptoms of skin conditions that cause dryness, cracking or scaling, including:Dermatitis.Eczema.Psoriasis.Emollients can also help with dry skin due to:Cancer treatment.Cold, dry air.Diabetes.Frequent hand washing.Working with chemicals.AdvertisementProcedure DetailsCan I use emollients if I use prescription creams?Follow your healthcare provider’s instructions if you use prescription creams or products with active ingredients, such as steroid creams. You may need to apply your prescription medications or active products before applying the emollient.What’s the best way to use emollients?Emollients absorb better when skin is damp. To get the most out of your emollient:Take a warm (not hot) bath or shower and use a gentle cleanser.Rinse your skin well and gently pat dry.Take a handful of emollient and warm it between your hands.Apply the emollient to the areas of dry, scaling or irritated skin, ideally within three minutes of getting out of your shower or bath.Rub the emollient into your skin gently in a downward circular motion.Can I use emollients instead of soaps?Soaps and skin cleansers may contain ingredients that can aggravate eczema or dry skin. To combat this, wash your hands with an emollient after washing with soap:Wash your hands with soap and warm water for 30 seconds.While your hands are still damp, take a tablespoon of your emollient and rub it all over your hands like soap.Rinse your hands.Gently pat your hands dry (don’t rub).Apply more emollient if needed.This approach helps remove germs from the skin while minimizing the drying effects of soap. Whenever possible, wash your hands with fragrance-free, hypoallergenic soap and use hand sanitizers that contain moisturizers.Can I use emollients more than once per day?You can also use emollients throughout the day whenever your skin feels dry. Emollients without active ingredients are usually safe to use as needed. Check the product’s label to see if it contains active ingredients, such as hydrocortisone.When trying new emollients, don’t use more than one new product at a time unless your healthcare provider recommends it. If you use multiple products and have a skin reaction, it’s harder to determine which product caused the issue.Care at Cleveland ClinicGet Dermatology CareMake an AppointmentRisks / BenefitsWhat are the benefits of using emollients?Using emollients regularly may help you manage dry or itchy skin and can be a helpful addition to prescription skin creams. Emollients can make your skin feel more comfortable, relieving itching and pain from dryness or irritation. Daily use can help prevent skin cracks, helping you avoid infections.What are the risks of using emollients?Emollients are generally safe. But consider these risks before trying a new product:Allergic reactions: Some skin products can cause allergic reactions or irritation. If you have sensitive skin or allergies, choose a hypoallergenic or sensitive skin formula with only a few ingredients.Acne: If you’re prone to acne, occlusive products like oils and petroleum jelly may aggravate or cause acne breakouts. Look for products labeled as noncomedogenic or non-acnegenic.Choose products that don’t contain common irritants or allergens, including:Alcohol.Dyes or colors.Essential oils.Fragrance.Latex.Preservatives, such as parabens or methylisothiazolinone.To minimize these risks, ask your healthcare provider which products are right for your skin type.Recovery and OutlookAre there risks to long-term use of emollients?Emollients are generally safe to use for the long-term. If you have a chronic skin condition that isn’t improving, talk to your healthcare provider about other treatment options.When to Call the DoctorWhen should I see my healthcare provider?Call your healthcare provider if you notice any of these changes to your skin:Cuts or wounds that won’t heal.Irritation.Itchiness.Rash.Redness.If you have a skin condition or chronic health condition, see your healthcare provider regularly for checkups.When do I need to go to the emergency room?Seek emergency medical care if you develop a rash that’s:Accompanied by fever.All over your body.Blistering.Forming red streaks on your skin around the rash.Oozing yellow or green fluid.Sudden and spreading quickly.Painful.Warm to the touch.A note from Cleveland ClinicEmollients are a helpful tool in your skin care routine if you have dry, irritated or itchy skin. Even if you use prescription skin creams, emollients can complement your treatment and make your skin look and feel better. Emollients can help heal dryness, irritation and scaling. With so many creams and ointments available for different skin types, most people can find one that fits their needs. If you have any skin conditions, ask your healthcare provider which products will work best for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/17/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Dermatology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"