"Endometrial Ablation: What Is It, Side Effects & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Endometrial AblationAdvertisementAdvertisementAdvertisementEndometrial AblationEndometrial ablation is a procedure that uses heat, cold or different types of energy to destroy the tissue that lines your uterus so that you bleed less during your periods. Heavy periods happen for lots of reasons. There are different methods used for endometrial ablation, but they all involve destroying a layer of tissue that surrounds your uterus. When it’s time for your period, you’ll bleed less because you’ll have less of your uterus lining to shed.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is endometrial ablation?Endometrial ablation is a procedure that uses heat, cold or different types of energy to destroy the lining of the uterus. If heavy periods are a problem, your doctor may recommend an endometrial ablation as an option to treat them. It’s less dangerous and has fewer limitations than a hysterectomy. However, many patients try medications to control their bleeding before having an endometrial ablation. After an endometrial ablation, you may have no bleeding, less bleeding or no change in your bleeding during your periods.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is considered a heavy period?Periods are considered heavy if they:Cause you to be anemic because you lose a lot of blood every month.Last more than 7 days.Interfere with your ability to do your normal activities.Who can have endometrial ablation?Endometrial ablation can help control heavy periods when medications don’t provide relief. You may be a candidate for endometrial ablation if:You’re absolutely sure you don’t want to get pregnant and have a tubal ligation (tubes tied), your partner has a vasectomy or you are willing to use some form of birth control.Your doctor does not find a cause for your heavy periods, such as cancer or thyroid disease.AdvertisementWho should not have this procedure?Endometrial ablation isn’t for everyone. Your healthcare provider will evaluate your bleeding and determine if endometrial ablation is an option for you. Generally, you shouldn’t have an endometrial ablation if:Your healthcare provider hasn’t evaluated your bleeding.Your uterus is an abnormal shape.You or your partner are not sterilized (tubal ligation or vasectomy) or you are not willing to use birth control after the procedure.You are post-menopausal.Additionally, some people with fibroids or who’ve had certain surgeries on their uterus are not able to have an endometrial ablation.Procedure DetailsWhat happens before endometrial ablation?Your healthcare provider will make sure that endometrial ablation is the right procedure to reduce your bleeding. During this evaluation:You’ll take a pregnancy test. You can’t be pregnant during an endometrial ablation.Your provider may do a biopsy to look for abnormal cells in your uterus and make sure you don’t have cancer.Your provider will check what medicines you’re taking. You’ll want to be sure that you’re not taking medicine that could cause problems during the procedure (for example, if you’re taking a blood thinner).Your provider will order an MRI or ultrasound to take a closer look at your uterus.You’ll prepare for the day of your endometrial ablation.Plan for someone to pick you up afterwards.Depending on the type of endometrial ablation, you may take medicine that thins your uterus lining.Plan to fast (no food or drink) 8 hours before the procedure.AdvertisementWhat happens during endometrial ablation?An endometrial ablation may be done in the office or in the operating room. You’ll be given a gown and an IV. You’ll situate yourself on a table as if you’re having a pelvic exam. You may be given medicine about an hour before the endometrial ablation to help manage any discomfort after the procedure. Depending on the type of endometrial ablation, your provider may numb your pelvic area and give you sedatives so that you don’t feel any pain or discomfort during the procedure.During endometrial ablation, your healthcare provider inserts a delicate, wand-like device into your vagina. This device extends through your cervix and into your uterus, where it can reach the lining. Depending on the type of endometrial ablation, the device sends energy, heat or cold to destroy part of the lining. The technology makes things quick and you should have minimal or no discomfort during the procedure.What are the types of endometrial ablation?There are different types of endometrial ablation, but they all involve destroying the lining of your uterus.Microwave: A small applicator releases microwaves that heat the lining of your uterus, destroying parts of it. The process takes from three to five minutes.Radiowaves (radiofrequency): A wand-like instrument with a mesh tip unfurls inside your uterus, just enough so that radio waves can reach the lining. The mesh releases radio waves that heat and destroy parts of the lining. The process takes from one to two minutes.Electricity (electrosurgery): A small, tube-like device with a viewing lens (resectoscope) is fitted with a wire loop, roller ball or laser that releases electricity. The electricity destroys parts of your uterus lining. The viewing lens helps your provider see inside your uterus and monitor the electrical currents as they turn parts of the lining into scar tissue. This type of ablation is the least common and may require you to have anesthesia. You’ll probably need to go to a hospital for electrosurgery.Heated fluid (hydrothermal): A thin, flexible tube with a viewing lens that lets the doctor see inside your body (hysteroscope) moves room-temperature saline into your uterus. Once inside, the saline is heated to a temperature hot enough to destroy the lining. The process takes about 10 minutes. This kind of ablation works well for uteruses that have an irregular shape.Heated balloon (balloon therapy): A tiny balloon is placed onto a thin tube (catheter). A fluid is pumped through the tube and into the balloon and heated. The heat causes the balloon to expand and touch the uterus lining. The heat from the balloon destroys those parts of the uterus lining that it touches. The process takes from two to 10 minutes.Cold (cryoblation): A tube with a cold tip creates tiny ice balls that freeze parts of the uterus lining, destroying it. The process takes from 10 to 20 minutes.What happens after endometrial ablation?Have a friend or family member drive you home. Pay close attention to your body. You’ll probably notice some changes after you’ve had the endometrial ablation. They’re normal, so there’s no need to worry.You may feel a little nauseous.You may have to pee more the first day after the procedure.You may have period-like cramps for one to three days after an endometrial ablation.You may have light bleeding or pink discharge for a few weeks after. It’s usually heaviest on Day 2 and Day 3 after you’ve had the procedure. You’re bleeding the uterus lining that was destroyed so that you don’t have a heavy period later.Give yourself time to heal. Don’t douche or use a tampon the first 3 days after you’ve had the procedure.Care at Cleveland ClinicAbnormal Period TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsEndometrial ablation can stop heavy bleeding without having to take medicine every day. It’s a common procedure. Still, the procedure does destroy tissue, which means it has risks:Heavy bleeding.An allergic reaction.Puncturing the uterus.Harming organs near the uterus.The technology that turns healthy tissue into scar tissue is designed to be precise, though, so that only a safe portion of the uterus lining actually gets destroyed.People who have experienced menopause or are high-risk for endometrial cancer shouldn’t have this procedure. After menopause, the risks for developing endometrial cancer increase. Destroying endometrial tissue makes it harder to find cancer cells in the uterus. The risk of missing cancer cells outweighs the benefits of lighter periods.How will endometrial ablation affect my weight?Endometrial ablation won’t make you gain or lose weight.How will endometrial ablation affect intimacy?It’s important to follow your healthcare provider’s instructions. Nothing should go in your vagina for a few days.How will endometrial ablation affect my periods?Your periods will be lighter than they were before. Or, you may no longer have a period. Be sure to monitor how heavy your periods are and how regularly they occur.How will endometrial ablation affect future pregnancy?Getting pregnant is dangerous for you or the baby after an endometrial ablation. You’ll still ovulate (put out eggs) and you can get pregnant. You’ll have some remaining uterus lining, which means that an egg can implant and be fertilized. Following endometrial ablation, you have a higher chance of a miscarriage or dangerous complications during pregnancy. This is why it’s so important to use birth control after the procedure. Some people choose to get sterilized (tubal ligation) when they have an endometrial ablation.Recovery and OutlookWhat is the recovery time?You should feel like your normal self within two to three days, and you should be able to carry on with your routine. Within two to three months, you’ll notice that your periods are lighter. You may even stop having periods altogether.When to Call the DoctorWhen should I see my healthcare provider?Monitor your recovery. Call your provider if you have symptoms that give you pause, such as:Fever.Trouble peeing.Intense cramping.Heavy bleeding. If you’re using more than one pad per hour, go to the emergency room.Discharge from your vagina that’s smelly.If you’re still having heavy periods or spotting after two to three months, make an appointment with your healthcare provider to check on your recovery.Make sure to keep any appointments your provider recommends after your endometrial ablation.A note from Cleveland ClinicHeavy periods are uncomfortable. They may also be a sign that something is wrong. There are many treatments for heavy period, including endometrial ablation. Endometrial ablation may be an option that can reduce your bleeding so that it doesn’t get in the way of your life. If you’re having heavy periods, schedule an appointment with your healthcare provider to discuss what treatment is best for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/08/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicAbnormal Period TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementCall Appointment Center 24/7 866.320.4573Questions 216.444.2200Request an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"