"Endoscopic Mucosal Resection: What It Is, Procedure & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Endoscopic Mucosal ResectionAdvertisementAdvertisementAdvertisementEndoscopic Mucosal ResectionEndoscopic mucosal resection is a minimally invasive procedure to remove irregular tissue from your digestive tract. Compared to open surgery, it allows you to recover more quickly with less pain. You may need endoscopic mucosal resection if you have tumors or precancerous lesions in your mucosa, the membrane lining your gastrointestinal tract.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is endoscopic mucosal resection?Endoscopic mucosal resection is a minimally invasive procedure to remove irregular tissue from your digestive tract. Your digestive, or gastrointestinal, tract is the series of organs your food travels through as it’s digested. The technique allows your healthcare provider to reach your digestive tract without making any incisions from outside your belly. This means you experience less pain and recover faster after endoscopic mucosal resection than after open surgery.During the procedure, a gastroenterologist (a doctor specializing in gastrointestinal diseases) uses a long, flexible tube with a camera called an endoscope. After sedation, they insert the endoscope through your mouth or anus, depending on what part of your digestive tract they need to reach. Then, they insert surgical tools through the endoscope to remove irregular tissue.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat does endoscopic mucosal resection treat?You usually have endoscopic mucosal resection to treat early-stage cancer or precancerous growths (lesions or polyps). Gastroenterologists use endoscopic mucosal resection for tumors that grow in your mucosa, the inner membrane lining your gastrointestinal (GI) tract.Endoscopic mucosal resection is typically used to treat:Barrett’s esophagus, which may cause precancerous lesions.Colorectal cancer.Esophageal cancer.Small intestine cancer, including duodenal cancer.Stomach cancer.Who is a candidate for endoscopic mucosal resection?You may be a candidate for endoscopic mucosal resection if you have a small tumor or precancerous lesion. Larger tumors may require other treatments, like:Chemotherapy.Endoscopic submucosal dissection for tumors that have grown into deeper layers of the wall of your gastrointestinal tract.Radiation therapy.Surgery.AdvertisementProcedure DetailsWhat happens before endoscopic mucosal resection?Your gastroenterologist will give you specific instructions to prepare for endoscopic mucosal resection. If they’re treating your upper GI tract (esophagus, stomach or small intestine), you’ll need to avoid eating or drinking for several hours before the procedure. If they’re treating your lower GI tract (large intestine, which includes your colon and rectum), you may need to complete a bowel prep.Bowel prep involves taking laxatives to cleanse your colon. This allows your gastroenterologist to get a clear view of your colon and rectum.What happens during endoscopic mucosal resection?You’ll receive anesthesia to remain comfortable and calm during the procedure. You may receive general anesthesia, where you’re put to sleep. Or you may get conscious sedation, where you’re awake but don’t remember anything afterward.During endoscopic mucosal resection, your gastroenterologist:Inserts the endoscope through your mouth (for upper GI procedures) or anus (for lower GI procedures).Directs the endoscope to the irregular tissue.Threads surgical instruments through the endoscope.Removes the irregular tissue by suctioning it, injecting a solution or cutting it out with an electric wire.The procedure usually takes around 30 to 60 minutes.AdvertisementWhat happens after endoscopic mucosal resection?Your gastroenterologist may send a sample of the irregular tissue to a laboratory. A pathologist (a doctor specializing in studying body tissue) analyzes the tissue sample for signs of disease.You’ll move to a recovery room while your anesthesia wears off. You’ll need someone to drive you home, as it can take up to 24 hours for the full effects of anesthesia to go away completely.What are the side effects of endoscopic mucosal resection?Depending on the area treated, you may have some mild to moderate side effects for a day or two. They may include:Bloating.Cramping.Excessive gas and gas pain.Nausea or vomiting.Sore throat.Care at Cleveland ClinicDigestive CareMake an AppointmentRisks / BenefitsWhat are the benefits of endoscopic mucosal resection?Endoscopic mucosal resection removes precancerous or cancerous tissue before it grows and spreads (metastasizes) to other body parts. The technique allows your gastroenterologist to remove irregular tissue without making large incisions or removing part of your digestive tract.Compared to open surgery, endoscopic techniques offer multiple benefits, like:Faster recovery.Less pain.Lower risk of complications.No scarring.What are the risks or complications of endoscopic mucosal resection?Complications of endoscopic mucosal resection are rare but may include:Bleeding.Gastrointestinal perforation.Scarring in your esophagus, which can lead to esophageal strictures.Recovery and OutlookHow long does it take to recover from endoscopic mucosal resection?Most people can return to work the day after endoscopic mucosal resection. You may need to follow a liquid diet for several days while your digestive tract heals.What is the follow-up care after endoscopic mucosal resection?You’ll likely have a follow-up appointment with your gastroenterologist within 12 weeks after endoscopic mucosal resection. Your gastroenterologist will use an endoscope to examine your digestive tract and make sure all the irregular tissue is gone. You may need additional exams or treatments, depending on what your gastroenterologist finds.When to Call the DoctorWhen should I call my healthcare provider?Call your gastroenterologist right away if you notice any signs of complications after endoscopic mucosal resection, including:Blood in your stool.Chest pain.Dizziness or fainting.Fever or chills.Shortness of breath (dyspnea).Additional Common QuestionsIs endoscopic mucosal resection major surgery?Endoscopic mucosal resection is a minimally invasive procedure. It doesn’t involve large incisions like you’d receive in a major open surgery.A note from Cleveland ClinicIt’s scary to hear the word “cancer.” But with surgical innovations like endoscopic mucosal resection, it’s easier to remove small cancers and precancerous lesions. In fact, your surgeon won’t even make an incision. Compared to open procedures, you’ll recover from endoscopic procedures quicker, with less pain and a lower risk of complications. If your tumor is larger or more advanced, you may need other procedures or treatments like chemotherapy or radiation. Whatever your situation after endoscopic mucosal resection, you’ll be able to move on faster because you won’t be recovering from a major surgery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/20/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicDigestive CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"