"Endovascular Aneurysm Repair (EVAR)800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Endovascular Aneurysm Repair (EVAR)AdvertisementAdvertisementAdvertisementEndovascular Aneurysm Repair (EVAR)An endovascular aneurysm repair procedure can save your life. Healthcare providers use tiny punctures to insert special devices called stent grafts. The grafts create a new lining for your artery, lowering the risk of a rupture.ContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewEndovascular aneurysm repair (EVAR) is a minimally invasive procedure to prevent an aortic aneurysm from bursting.What is endovascular aneurysm repair?Endovascular aneurysm repair (EVAR) is a minimally invasive procedure that can be used to manage abdominal aortic aneurysms. The aorta is the largest artery that carries blood from your heart to other parts of your body. For abdominal aortic aneurysms, EVAR uses small punctures and sophisticated instruments to repair bulges in blood vessels (aneurysms) located there.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy might I need EVAR?The goal of endovascular aneurysm repair is to prevent the abdominal aortic aneurysm from bursting, which is a life-threatening event.The force of blood flow against a weak spot in the wall of the blood vessel (here the aorta) causes the aortic walls to balloon outward, creating an aneurysm. This can lead to a burst, disrupting blood flow to your organs. Life-threatening complications can occur in minutes.EVAR lowers the chances of a rupture by re-lining the aneurysm with a new tube, which takes the pressure off the aneurysm. The tube is called a stent graft, and it’s made of fabric with a metal mesh frame.Who is a candidate for endovascular aneurysm repair?You may benefit from EVAR if you have an aortic aneurysm. Aortic aneurysms affect the body’s largest artery, the aorta.Not all aneurysms need treatment. Your healthcare provider may consider EVAR if you:Have a large aneurysm or smaller aneurysm that’s growing quickly.Do not qualify for open surgery with a large incision.Have healthy blood vessel tissue near the aneurysm.AdvertisementWhat is fenestrated endovascular aneurysm repair (FEVAR)?Fenestrated endovascular aneurysm repair (FEVAR) is a specialized EVAR technique that repairs complex aneurysms. Your abdominal aorta is like a tree trunk that has many branches coming out of it. These branches are the arteries that carry blood to organs in your belly. If an aneurysm occurs near one of those branching points, it’s harder to treat. That’s where FEVAR comes into play.FEVAR uses a fenestrated stent graft, meaning a graft with small openings. Those openings give rise to additional stent grafts that go into branching arteries. This special device fits the tree-like structure of your aorta and its branches. EVAR, by comparison, uses a graft that doesn’t have little openings for branches. It’s a standard tube shape.Your provider will decide which procedure you need depending on where your aneurysm is located.What is the difference between EVAR and TEVAR?EVAR treats aneurysms in your abdomen (belly). Thoracic endovascular aneurysm repair (TEVAR) treats aneurysms in your thorax (chest). TEVAR is especially suited to treat aneurysms in your descending aorta – the part that moves down through your chest toward your belly. Aneurysms very close to your heart, in your aortic root or ascending aorta, usually require open surgery.AdvertisementRisks / BenefitsWhat are the benefits of an endovascular aneurysm repair procedure?As a minimally invasive procedure, EVAR is gentler on your body. Benefits include:Fewer days in the hospital.Less blood loss.Less discomfort during recovery.Quicker return to daily activities.Reduced risk of a having a heart attack or dying around the time of your procedure than you’d have in open surgery.Shorter procedure time than open surgery.What are endovascular aneurysm repair risks?Endovascular aneurysm repair is a safe procedure with a high success rate. But there’s always a chance of complications. These include:Blood clots.Deep vein thrombosis (DVT).Endoleak, when blood continues filling the aneurysm after the procedure.Heart attackInfection.Kidney failure.BleedingWhat happens during an endovascular aneurysm repair procedure?If EVAR is right for you, here’s what to expect:You receive medications (anesthesia) to help you relax or fall asleep. These medications ensure you do not experience discomfort during the procedure.Your provider uses arteries near your groin, called the femoral arteries, to access the abdominal aortic aneurysm in your belly. Needles are inserted through your skin and underlying soft tissue and into your femoral arteries.Your provider inserts a catheter (thin tube) that contains a low-profile, expandable stent graft. The catheter is guided through your arteries to reach the aneurysm. Real-time imaging enables your provider to control the catheter’s journey.When the catheter reaches the aneurysm, your provider opens the stent graft so it expands and becomes a new, stable path for your blood to flow. The graft’s wireframe forms a tight seal that keeps the graft in place and prevents blood from entering the aneurysm.Once the procedure is complete, the healthcare provider removes the catheter.Puncture sites are so small that stitches are not necessary. A bandage covers the wounds as they heal.Recovery and OutlookWhat is recovery from an endovascular aneurysm repair procedure like?It takes days to months until you feel back to normal. Expect to stay in the hospital for a few days. You can start eating and drinking shortly after the anesthesia wears off. Nurses will help you get out of bed and start walking as soon as it is safe to do so.Once you get home, you may tire easily and need pain medications for a few days. You shouldn’t drive until you are off pain medications. Most people return to work within a month. Avoid lifting anything heavy for four to six weeks after your procedure.What happens after I recover from EVAR?A small number of people experience issues with the implanted devices, like endoleaks. These can occur even years after undergoing endovascular aneurysm repair. Even with successful treatment, it’s possible to experience another aneurysm. Ongoing monitoring and imaging studies help healthcare providers determine whether additional treatments are necessary.When to Call the DoctorWhen should I consult my healthcare provider?Contact your healthcare provider if you experience:Deep vein thrombosis symptoms, such as swelling, pain, or cool skin in your lower limbs.Dizziness or fainting.Pain in your back, chest or abdominal area.Rapid heartbeat (heart palpitations).Redness in your groins or other leg pain.A note from Cleveland ClinicEndovascular aneurysm repair (EVAR) offers a less invasive option compared with traditional open surgery. You’ll have a shorter hospital stay and recovery. But you still need to care for your aorta and your heart after you’ve recovered. Lifestyle changes like exercising and reducing salt intake can help avoid future problems. It’s also important to keep all your follow-up appointments so your provider can check how your new stent graft is working and fix any problems if they come up.Care at Cleveland ClinicAortic Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/13/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicAortic Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"