"Endovascular Stent Graft: Aortic Aneurysm Repair800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Endovascular Stent Graft: Aortic Aneurysm RepairAdvertisementAdvertisementAdvertisementEndovascular Stent Graft: Aortic Aneurysm RepairContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewHow are aortic aneurysms treated?The best method to repair an aneurysm depends upon several factors, including the location and shape of the aneurysm as well as the physical condition of the patient.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is endovascular grafting?Endovascular grafting is a minimally invasive method to treat an aortic aneurysm. Instead of an open aneurysm repair in which your chest/abdomen are surgically opened, your surgeon may consider a procedure called an endovascular aneurysm repair (EVAR). In addition to EVAR, you may also hear your doctor refer to the procedure as a thoracic endovascular aneurysm repair (TEVAR) or fenestrated endovascular aneurysm Repair (FEVAR), depending on the type of repair that is being discussed. Endovascular surgery is performed inside your aorta using thin, long tubes called catheters to place a stent surrounded with a fabric liner to reinforce the weak spots. You may be eligible for endovascular stent grafting if your aneurysm has not ruptured and the aneurysm is 5 centimeters or more in size.Why is endovascular grafting performed?The goals of aortic aneurysm treatment are to reduce the risk of complications from aneurysms. The major risk for untreated aneurysms is rupture, and as an aneurysm gets bigger, the risk gets greater. There are several factors to consider when deciding to treat an aneurysm with surgery, including:The presence of symptoms, including abdominal pain, back pain or pain in the groin or inner thigh.The size of the aneurysm, in particular its diameterHow fast the aneurysm is growing, in particular, rapid aneurysm growth (diameter grows more than 1 centimeter per year)The development of an of an aortic dissection, which can be accompanied by sudden and severe sharp tearing pain in the chest or backThe patient’s overall medical conditionYour doctor will consider your specific condition and needs when choosing the best treatment for you.AdvertisementWhere is the procedure performed and who performs this procedure?This procedure is performed in the hospital surgical suite by a vascular surgeon.Procedure DetailsHow do I prepare for the procedure?A few days before the procedure, you may need pre-procedure tests to make sure it is safe for you to have the surgery. You may need to stop taking certain medications before the procedure. Your healthcare team will give you specific instructions to help you prepare for the procedure.AdvertisementWhat happens during the procedure?You will either receive a sedative and a local anesthesia or general anesthesia (be put to sleep). You surgeon will make small incisions in your groin and perform the surgery through those openings. Catheters are inserted in the incisions to guide and deliver a stent-graft through the blood vessels to the aneurysm. An endovascular stent graft is a fabric tube supported by metal wire stents (also called a scaffold) that reinforces the weak spot in the aorta.Using X-ray guidance, the surgeon places the graft in the area of the aneurysm. The graft is then opened up inside the aorta and held in place with metal hooks and stents rather than sutures (stitches).By tightly sealing the area with your artery above and below the aortic aneurysm, the graft allows blood to pass through it without pushing on the aneurysm.How long does the procedure last?The procedure itself generally takes 2 to 3 hours. You will stay in the hospital 1 to 2 days. Full recovery will take about a month.What happens after the procedure?Your surgeon will give you specific instructions to follow after the surgery until your incision is properly healed.You may have the following restrictions after the procedure:DO NOT drive until your doctor says it is OK (usually within 1–2 weeks after the procedure and you have stopped taking pain medication).DO NOT take a bath until the incisions heal. Showers and sponge baths around the incision are OK 2 days after the procedure.DO NOT lift more than 10 pounds for about 4 to 6 weeks after the procedure.Care at Cleveland ClinicAortic Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the risks of the procedure?This is generally a very safe procedure and special precautions are taken to decrease the risk of complications. However, as with any surgical procedure, there are risks. Your doctor will discuss the specific risks and potential benefits of the recommended procedure with you.Complications that can happen after endovascular aneurysm repair include leaking of blood around the graft, the graft moving away from its initial placement and the stent breaking. Complications that are rare but serious include paralysis, delayed rupture of the aneurysm or infection. Other risks may be possible.When you meet with your doctor, please ask questions to make sure you understand the risks of the procedure, outcomes and why the procedure is recommended.Are there any side effects of the treatment?As with any surgical procedure, you will feel a bit tired for a few weeks. You may develop an inflammatory response as blood stops flowing through the aneurysm. The inflammation may cause a low-grade fever (temperatures to 100 or 101) make you feel like you have the flu, but the symptoms will go away in several days.You will not notice the stent itself. You should notice no difference in your ability to perform daily activities, and you should be able to get back to all of your regular activities without any restrictions.Recovery and OutlookWhat are the results of the procedure?Your doctor will discuss the results of the procedure with you. Endovascular grafting produces very good outcomes. You will need follow-up visits for the stent graft, but most patients live a normal life after the procedure. In general, patients with aneurysms should follow a healthy lifestyle that includes a healthy diet and regular exercise. Having an aneurysm increases your risk of heart disease and atherosclerosis, and, along with the aneurysm repair, you should have a full evaluation to assess your risk of these other diseases.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/29/2019.Learn more about our editorial process.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicAortic Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"