"What Is Enucleation Surgery?800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/EnucleationAdvertisementAdvertisementAdvertisementEnucleationEnucleation of the eye is a surgery to remove the globe of your eye and its contents. It’s a treatment for diseases like eye cancer and traumatic eye injuries. After the surgery, you can obtain a prosthetic (artificial) eye.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is enucleation?Enucleation is a phrase that refers to the removal of the entire globe of your eye and a part of your optic nerve. Your eye muscles remain. Your surgeon can attach an implant to the muscles.What does enucleation treat?A provider may suggest enucleation to treat a damaged and sightless eye. Conditions that may require eye enucleation include:Traumatic eye injuries.Eye cancers, including intraocular melanoma and retinoblastoma.Severe infections, such as acanthamoeba keratitis and endophthalmitis.Phthisis bulbi.Painful or cosmetically unpleasant blind eye.Sympathetic ophthalmia, an autoimmune condition that attacks both eyes even when you only have an injury to one eye.Microphthalmia.In the United States, eye injuries are the top reason for eye removals, followed by eye cancers. Cancer is the primary reason for enucleation in young children (3 and under).How common is this treatment?Eye removal surgery is a very old procedure. There are records of eye removal in ancient cultures. It isn’t an uncommon surgery, but your provider will consider all options before recommending this treatment.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens during an enucleation?Before the enucleation procedureYour surgeon will go over pre-surgery instructions.You may have to stop eating and drinking by a certain time before surgery, often midnight the previous day.Be sure to discuss all the medications and over-the-counter products you take with your healthcare team. You may need to stop taking specific medications days or hours before your surgery. This is often true of drugs that thin your blood (anticoagulants).Speak to your surgeon about what you’ll need to do after the surgery if you’re getting a prosthetic (artificial) eye.During eye enucleationMost enucleations are outpatient surgeries. A healthcare provider will usually give you general anesthesia, and you may have to stay overnight in the hospital. In some cases, the surgeon may use local anesthesia combined with sedation. The surgery usually takes about an hour.Your surgeon will cut the globe away from the orbit and put an implant that looks like a marble into the empty space.They’ll sew your four eye muscles, still connected to your sclera, to the implant. The sclera is the white part of your eye that provides support and protection.A conformer will cover the implant. A conformer is a piece that helps by saving space for the final version of your prosthetic eye.Your surgeon may decide to sew your eyelid shut while you heal.Your surgeon will place a pressure bandage over the area to keep inflammation down, stop bleeding and protect the area.After eye enucleationYou’ll spend time in the recovery room, where your healthcare team will monitor your vital signs. Your healthcare team will go over your discharge instructions with you, including information on restarting medication you may have had to stop before the surgery.When it’s time to leave, you’ll need an adult family member or close friend to drive you home. You may want someone to spend the night with you.Typically, your provider will remove the bandage after a week when you go for your post-operative visit. However, different surgeons may have different suggestions. You may need to apply topical antibiotics. Keep the bandage dry while you wear it.Your provider may prescribe pain medications, antibiotics or steroids. Most people do well with over-the-counter pain relievers, such as NSAIDs or acetaminophen. The pain is usually not severe and lasts three to five days. Take these medications as prescribed.You’ll need to avoid strenuous activity for two to four weeks after the procedure. You shouldn’t bend over or lift anything heavy for about a month.You’ll have a follow-up exam in about a week.You’ll have a fitting with your ocularist for a prosthetic eye in about six to eight weeks, depending on your healing time. An ocularist is a healthcare provider who makes, fits and paints artificial eyes.Care at Cleveland ClinicEye CareFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the potential benefits of enucleation?Enucleation can provide:Removal of damaged tissue.Disease treatment.Relief from pain.Cosmetic benefits.AdvertisementWhat are the risks or complications of enucleation of the eye?Enucleation is generally a successful surgery, but there are risks to any procedure. Risks and complications of eye enucleation include:Bleeding.Infection.Formation of a scar.Eyelid issues, including drooping (ptosis) and inability to close your eye.Extrusion of the implant. (“Extrusion” is a term that means something is pushed out.)Recovery and OutlookHow long will it take for me to feel better after enucleation?Pain from the surgery should be gone within a week. You’ll gradually be able to go back to doing your everyday activities.One of the main reasons enucleation happens is to relieve pain from a diseased eye after other efforts didn’t succeed. It can be a very difficult decision to make, but hopefully, the fact that you’re able to get back to a normal, pain-free life will make the decision worthwhile.Please ask your healthcare team for any help that you need to adjust to life with a prosthetic eye, including counseling or connections to support groups. These things may help to make the treatment easier on you.AdvertisementWhen to Call the DoctorWhen should I call my healthcare provider?Call your healthcare provider with any questions or concerns, especially if you have:A fever.Pain in your eye socket or head that gets worse despite taking over-the-counter pain relievers.Discharge, especially if it’s yellowish or greenish in color.An implant that falls out.Nausea and vomiting.A note from Cleveland ClinicEnucleation of the eye is a surgery to remove the globe of your eye and its contents. Deciding on enucleation of the eye isn’t easy. Your provider will discuss this with you. Usually, it’s the last treatment choice possible. However, this surgery provides pain relief and successful therapy for severe and life-threatening diseases. The surgery takes about an hour, but it can provide a lifetime of benefits.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/18/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicEye CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2020Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"