"Epilepsy Surgery: Types, Procedure, Risks & Results800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Epilepsy SurgeryAdvertisementAdvertisementAdvertisementEpilepsy SurgeryThe main goal of epilepsy surgery is to decrease the number of seizures you experience, the severity of the seizures or, ideally, to become seizure-free. There are several different types of epilepsy surgery.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewWhat is epilepsy surgery?Epilepsy surgery is brain surgery to stop or reduce the number of seizures you’re having and/or their severity. Seizures are a burst of uncontrolled electrical activity between your brain’s nerve cells, which can result in changes in your:Awareness.Muscle control (your muscles may twitch or jerk).Sensations.Emotions.Behavior.Surgical approaches to manage seizures include:Removing the part of your brain where the seizures start.Disconnecting brain nerve cell communication to stop the spread of seizures to other areas of your brain.Using a laser to heat and kill the nerve cells where the seizures begin.Implanting a pacemaker-like device and electrodes that send electrical signals to block or disrupt seizure activity at its source.Inserting delicate electrode wires (using robotic guidance) to record seizure activity from the depths of your brain.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhen might a person with epilepsy need surgery?Surgery for epilepsy is usually considered when:Anti-seizure medication(s) doesn’t control the seizures. (You may hear this described as drug-resistant epilepsy or medically refractory epilepsy. Technically, this means that at least two medications have been tried but don’t work to control the seizures.)You can’t tolerate the side effects of the anti-seizure medication(s).Diet therapy, such as the ketogenic diet, hasn’t helped control your seizures.The seizures are frequent, severe and debilitating.Surgery may also be recommended if the seizures are caused by non-epileptic conditions, such as a brain tumor or arteriovenous malformation.Who are the best candidates for epilepsy surgery?Epilepsy surgery is most successful in people:Whose seizures start and stay within one area of their brain.Whose surgery can be safely performed without causing new or additional problems in memory, speech, vision and movement.AdvertisementProcedure DetailsWhat tests are done to determine if I’m a candidate for epilepsy surgery?Healthcare providers perform pre-surgical testing on all people — children and adults — who are being considered for epilepsy surgery.The goals of pre-surgical testing are to:Determine if the tests, taken together, can locate where the seizures begin in your brain.Determine if the identified area of brain tissue can safely be removed or if communication between brain areas can be safely disabled.Determine what vital functions are controlled near the brain area where the seizures start.Help predict the outcome — reduction in seizure numbers or severity or stopping seizures — after surgery.There are usually two levels of pre-surgical testing. Phase I involves nonsurgical tests. Phase II testing requires surgery. Your surgical team will decide which of these tests is appropriate for you.Phase I testsPhase I tests include:Electroencephalogram (EEG): This is the standard test conducted in all people who have or are suspected to have epilepsy. Your healthcare provider places electrodes all over your scalp to measure electrical activity. Healthcare providers use an EEG to diagnose epilepsy, locate where seizures start in your brain and determine if the seizure remains local or spreads all over your brain. The EEG might not record a real-time seizure, but abnormal brain activity can still indicate that seizures are a possibility.In-hospital video EEG: This is a longer version of the regular EEG. You’re admitted to the hospital for several days. Your anti-seizure medications are stopped. This test captures your seizures on the EEG while the video captures your movements during seizures. Together, the information helps identify where the seizures are starting and how they affect your functioning.Positron emission tomography (PET): This scan measures brain function in all areas of your brain. It can identify where a seizure begins even when you’re not actively having a seizure. Healthcare providers may use it along with MRI (magnetic resonance imaging).Single-photon emission computed tomography (SPECT): This scan may be performed while you’re in the hospital being monitored with video EEG. If you have a seizure during the video EEG, blood flow increases to the area where the seizure begins. A SPECT brain scan can see the area of your brain that receives increased blood flow.Neuropsychological evaluation and functional MRI: Neuropsychological tests assess your verbal skills, memory function and other learning skills. This test serves as a baseline for measuring and comparing any changes before and after surgery. A functional MRI test measures brain activity while performing a cognitive function, such as memorizing or reading. This helps your neurosurgeon know which areas of your brain control these functions.Wada test: This test involves injecting a medication into your carotid artery (an artery in your neck), one carotid artery at a time. The medication puts one side of your brain to sleep for one to five minutes, while allowing your physicians to test your language and memory in the other (awake) half. The test helps identify which side of your brain is dominant for different functions.Phase II testsPhase II tests involve surgery to place electrodes on the surface of your brain or within brain tissue, which is closer to where seizures are happening than electrodes placed on the surface of your scalp (as in Phase I).Electrode placement: Based on the results of Phase I tests, your healthcare provider places electrodes directly on the surface of your brain in the specific area of interest. Another option (or addition) is to place wires with electrodes deep into your brain into the area of interest. Each electrode records brain activity along the full length of the wire.Stereoelectroencephalography (SEEG): This test involves placing electrodes at different depths in your brain — in the area of interest and the surrounding networks — to create a 3D view of the start and spread of seizure activity.Functional brain mapping: After your healthcare provider determines seizure areas, brief electrical stimulation through electrodes they place on your brain helps map out important functional areas. The purpose of the test is to see if there’s overlap in the seizure-producing areas and critical brain function areas. This allows surgery to be limited to the problem area, reducing cognitive (thinking and reasoning) problems after surgery.What brain surgeries for epilepsy are available?There are many types of surgical procedures for epilepsy. Here’s a summary.Surgical resectionIn resection surgery, your neurosurgeon removes a specific portion of your brain. Your neurosurgeon may remove brain tissue in the area where the seizures begin or remove the abnormal brain tissue that’s causing the seizures. There are several types of resections, including:Lesionectomy: This surgery involves removing lesions, such as tumors, cavernous hemangiomas and arteriovenous malformations, which can cause seizures.Lobectomy: This surgery involves removing a lobe (part of your brain). Each side of your brain is divided into four lobes — frontal (front of head section), temporal (above your ear section), parietal (above the temporal section) and occipital (back of head section). In a lobectomy, your neurosurgeon removes the one lobe in which the seizures begin. Temporal lobectomy is the most common type of epilepsy surgery.Multilobar resection: This surgery involves removing all or parts of two or more lobes of your brain. This surgery is considered only if you have no vital functions in those lobe areas.Hemispherectomy: This surgery involves removing or disconnecting one-half of your brain. “Disconnecting” means severing fibers that normally communicate between the right and left lobes of your brain. This surgery is usually only performed when seizures are severe, uncontrollable and debilitating. In such cases, the hemisphere that is considered for removal has often had a lot of injury or damage to it, resulting in paralysis or loss of feeling.Surgical disconnectionThese surgeries involve cutting the communication between the area of your brain generating the seizures and the remaining normal brain tissue.Corpus callosotomy: This surgery involves cutting the corpus callosum, which is the main fiber bundle connecting the two halves (hemispheres) of your brain. This surgery is considered when severe, debilitating seizures start on one side of your brain and spread to the other side of your brain.Multiple subpial transections: This surgery involves making several shallow cuts into a limited section of brain tissue. The incisions stop the communication between nerve cells where seizures are happening and other normal nerve cells. This surgery is considered when the area of your brain where seizures are occurring can’t be safely removed.Stereotactic radiosurgeryThis surgery involves using 3D computerized imaging to precisely focus radiation beams on a target to destroy the nerve cells that are misfiring and causing the seizures.Laser interstitial thermal therapyThis surgery is less invasive than the other open surgeries. First, your neurosurgeon makes a small hole in your skull and an MRI scan guides the small probe to the area in your brain where the seizures begin. Focused laser energy is aimed at the seizure site. The energy changes into heat energy and destroys nerve cells at the seizure site. A computer program checks the temperature in nearby tissue to protect it from heat injury. This surgery is used if the seizure site is limited to a small area.Neuromodulation (implanted devices)These procedures involve implanting devices to improve seizure control. No brain tissue is removed. They include:Vagus nerve stimulation: The use of this device involves placing electrical lead wires around the vagus nerve in your neck. Your vagus nerve starts in the lower area of your brain and travels down to your abdomen. A small, matchbox-sized pulse generator is implanted below your collarbone. The pulse generator sends scheduled mild electrical pulses to your brain to disrupt any abnormal bursts that happen during a seizure. This is an outpatient procedure that’s considered in people in where two or more anti-epileptic drugs have been tried but haven’t controlled seizures and in people who aren’t candidates for other types of surgery or when the surgery didn’t work.Responsive neurostimulation: This surgery involves placing a device into brain tissue or on the surface of brain tissue in the area where the seizures begin. When the device detects the start of a seizure, it sends an electrical impulse that stops the seizure. Implantation of this device is approved for adults with focal seizures (seizures limited to one area of your brain) where two or more anti-seizure drugs haven’t been able to control the seizures.Deep brain stimulation: This surgery involves implanting an electrode into your brain and placing a stimulator device under the skin in your chest. The electrode wire, guided by MRI, is placed in the exact area where the seizure starts. The stimulator device sends signals to the electrode to block signals from nerve cells that might trigger a seizure.AdvertisementWhat happens during surgery for epilepsy?First, your healthcare provider will shave the part of your head where they’ll perform the surgery. Your anesthesiologist will give you anesthesia so you’ll be asleep and not aware during your surgery. Your healthcare team will closely watch your heart rate, blood oxygen level and blood pressure.Your neurosurgeon will remove a small area of your skull and set it aside. They may perform an EEG during surgery to confirm the exact location or source of the seizures.In some cases, you may be woken up so you can respond to your neurosurgeon’s questions. This helps guide surgery and maps out areas in your brain that control vital functions, such as speech or movement. You won’t feel pain during this step of the procedure.After brain mapping is completed, you’ll be put back to sleep. Your neurosurgeon will surgically treat the area of brain tissue where the seizures occur with the appropriately determined surgical approach. They’ll set your skull bone back in place and secure it. They’ll then close the skin covering your skull and bandage your head.Epilepsy surgery takes several hours to complete.What happens after epilepsy surgery?Expect scalp and face swelling and headaches after epilepsy surgery. You’ll receive medications to treat these symptoms. Symptoms go away within a few weeks. Most people have a one-day intensive care stay and a three- to four-day hospital stay.You’ll continue taking your anti-seizure medications for some time after surgery. The medications help protect your brain as it heals and lowers the chance of having seizures later on.You’ll need plenty of rest as you slowly return to your normal daily activities in about four to six weeks. You can expect to return to work or school in about one to three months.If you don’t have any seizures after a year or more, your healthcare provider may gradually reduce your medication dosage and eventually stop it.Unless your vital functions have been affected (speech, memory, movement) you won’t need rehabilitation therapy.Care at Cleveland ClinicEpilepsy and Seizures TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the risks of epilepsy surgery?All surgeries have risks. Typical surgical risks include:Reaction to anesthesia.Bleeding.Infection.Tissue damage, in this case, in your brain.Delayed healing at the surgical site.In addition to these risks, brain surgery can affect vital functions such as memory, speech, vision and movement. These functions are located in different areas of your brain.This is why healthcare providers perform extensive pre-surgery testing and brain mapping to locate where the seizures start. Your surgical team wants to make sure, to the extent that they can, that your planned surgery avoids these vital areas.Are certain types of epilepsy surgeries less risky than others?Although all surgeries have their risks, in general, less invasive surgeries may be potentially less risky. They also offer these benefits:Shorter procedure time.Less tissue damage.Shorter hospital stay.Quicker recovery.Less invasive surgical options include:Stereotactic radiosurgery.Laser interstitial thermal therapy.Neuromodulation options, including vagus nerve stimulation, responsive neurostimulation and deep brain stimulation.Ask your epilepsy surgical team if any of these less invasive surgeries are options for your epilepsy.Is there a brain location or type of surgery that is considered a higher risk?Removing (resecting) part of the temporal lobe is the most common type of epilepsy surgery. However, it’s also the most delicate surgery because of the functions carried out by this area of your brain. Risks from this surgery include:Memory problems.Vision problems, such as double vision or loss of some peripheral vision (at the edges of your sight).Loss of muscle control.Speech difficulties.Mood problems and depression.Some of these problems may be temporary and will improve in time. Risks vary from person to person.How should I consider the risks of surgery vs. the benefits of surgery?The goal of epilepsy surgery is to decrease the number of seizures, the severity of the seizures or, ideally, to become seizure-free. You may or may not be able to achieve this goal. Results are different for everyone.Even if you aren’t completely free from seizures after surgery, you still may benefit from:A lower dose of your anti-seizure medication or the number of medications you need to take, which can also reduce medication side effects.A greater chance of returning to work and driving.A reduced risk of life-threatening complications, such as sudden unexplained death in epilepsy or status epilepticus.A lower risk of depression and anxiety if surgery is successful.On the other hand, continued uncontrolled seizures have potential risks. If you already take anti-seizure medication and your seizures aren’t controlled, adding more medications isn’t very likely to stop your seizures (successful in less than 10% of cases).Also, the more medications that are tried and don’t work, the lower your chance of seizure management. Other risks of ongoing, uncontrolled seizures include loss of memory and loss of social relationships over time if you withdraw from interacting with others.You and your epilepsy surgical team will need to decide if surgery is a possible option for you. You’ll have to undergo extensive testing to see if you’re a candidate for surgery. If you’re a candidate, ask to speak with other people who’ve undergone the particular surgery that’s been recommended for you, and don’t hesitate to speak with a counselor. If you’re a candidate, only you can decide if the benefits of surgery outweigh the risks.Recovery and OutlookWhat outcome can I expect if I have epilepsy surgery?The success of your surgery depends on many factors, including:The type of seizures you experience.The frequency and severity of seizures.The area of your brain involved.The type of surgery.Your age.Other existing health issues you may have.Approximately 50% of people undergoing a surgical work-up for epilepsy may require insertion of small electrode wires into their brain for further invasive testing to identify the source of their seizures.Up to 50% of people who undergo neuromodulation surgeries may experience better control of their seizures. Between 50% and 85% of people who have resection surgery or a hemispherectomy may experience significant improvement in seizure control and, in some cases, become seizure-free.Ask your neurosurgeon about what outcome you can expect if you have epilepsy surgery.A note from Cleveland ClinicIf you have epilepsy and medications have been tried and haven’t worked to control your seizures, surgery may be an option. Many different epilepsy surgeries are now available. Where the seizures start in your brain plays a big role in deciding which surgery is right for you. No two people with epilepsy are the same.If surgery is an option for you, your team of epilepsy specialists will provide you with the information you need to understand the risks and benefits of the surgery so you can make the best decision. Be open and honest with your treatment team and never hesitate to ask your team any questions. They’re here to support your decision.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/14/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicEpilepsy and Seizures TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"