"Evisceration: Procedure Details & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/EviscerationAdvertisementAdvertisementAdvertisementEviscerationEvisceration of the eye is an eye removal surgery that treats painful and blind eyes. Your surgeon will remove most of the contents of your eye but will leave the scleral shell. An ocularist can make a custom design for your artificial eye.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is evisceration of the eye?Evisceration of the eye refers to a surgical procedure that removes the contents of the eye while leaving the scleral shell, the muscles and other parts attached to the eye. Another name for the sclera is “the white of your eye.”Your surgeon will probably put an implant into the empty space so that your eye retains its shape. After the surgery, you can choose a prosthetic (artificial eye).What does evisceration of the eye treat or manage?Evisceration is a treatment for:Endophthalmitis, a serious infection.An eye injury that’s penetrated your eye.An eye that’s both blind and painful.Phthisis bulbi, also called end-stage eye.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow should I prepare for an eye evisceration?Before your surgery, you’ll want to make an appointment with the ocularist, the eye care specialist who’ll make your prosthetic eye. This prosthetic device will be a custom-painted item that’s like a thick contact lens.Before you have any surgery, your healthcare provider will ask you about any medications that you take regularly. If you take medication to thin your blood (anticoagulants), you may have to stop taking them a certain number of days before your surgery.Your surgeon will also let you know when you should stop drinking and eating the day before the surgery.You’ll need to have an adult friend or family member drive you home. Most eviscerations are outpatient procedures, meaning you’ll go home the same day.What happens during evisceration of the eye?The procedure will take place in an operating room. You’ll get general anesthesia or local anesthesia with a drug to relax you.With evisceration, the surgeon removes the contents of your eye but leaves the sclera (white of your eye) and all the muscles attached to it.Your surgeon may put a round implant into place and cover it with a temporary prosthetic called a conformer. The conformer keeps the space between your eyelids to allow a better fitting of the prosthesis in the future.It’s possible that your surgeon will sew your eyelids closed. They’ll cover your eye with a pressure bandage or dressing that’ll stop bleeding and reduce inflammation.How long does eye evisceration take?Typically, an eye evisceration takes between one and two hours to complete.AdvertisementWhat happens after evisceration of the eye?After your procedure, your surgeon will explain what comes next. Make sure you understand your instructions and that you have a phone number to call if you need to check in.After you wake up from the anesthesia, your driver can take you home.Ask your provider about when you can resume normal activities, like driving or returning to work or school, before you leave the facility.You may have a prescription for pain medications, or your surgeon may recommend over-the-counter (OTC) pain relievers. You may also get a prescription for antibiotics or for steroids.You should keep your eye covered for a day and avoid getting the bandage wet. Leave your bandage on as long as your healthcare provider suggests — whether it’s for one day or until your follow-up appointment.You should avoid swimming and other forms of vigorous activity for at least two weeks and possibly as long as four weeks.Avoid bending at the waist and lifting heavy items for four weeks.You’ll probably have a follow-up examination in about one week.Your provider will tell you when you should have an appointment with the ocularist for the final fitting of your prosthetic eye. This will usually take place about six weeks after surgery, when the tissues have healed.Care at Cleveland ClinicEye CareFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of evisceration of the eye?Evisceration can treat:Certain diseases, like endophthalmitis.Eye pain.Improve the cosmetic appearance of some disfigurements.How successful is eye evisceration?Eye evisceration is typically very successful.AdvertisementWhat are the risks or complications of eye evisceration?As with any procedure, there are risks or complications related to eye evisceration. These may include:Bleeding.Infection, including implant exposure, or infection and discharge after an implant.Sympathetic ophthalmia, which is a rare type of uveitis that can happen in your uninjured eye.Drooping upper or lower lid.Need for additional surgery due to changes in the orbital area, like hollows or creases.Pyogenic granuloma.Recovery and OutlookWhat is the recovery time for evisceration of the eye?After an eye evisceration, you’ll need to avoid swimming and strenuous physical activity for two to four weeks.You’ll probably see your ocularist in about two months so they can place your prosthetic eye. (It takes about that long for enough healing to happen.) It’s a good idea to contact the ocularist before your surgery takes place.You’ll probably need appointments with an eye care provider and your ocularist one or two times per year for an exam and for checking on and cleaning your prosthetic eye.When to Call the DoctorWhen should I call my healthcare provider?Your surgeon will give you a list of instructions when you leave which should include details on when to call. These signs and symptoms may include:Excessive bleeding.Excessive pain in your eye or your head that doesn’t improve with the use of pain relievers.Signs of infection, such as discharge or fever.Signs of pain in your remaining eye.Additional DetailsEvisceration of the eye versus enucleation: what’s the difference?The difference between enucleation and evisceration of the eye lies in what the surgeon removes from your eye. In an enucleation, your surgeon removes the entire globe and part of the optic nerve. Though similar, evisceration leaves parts of your eye like your sclera. You can receive a prosthetic eye after both types of surgeries. Enucleation is often the surgery of choice for certain types of eye cancer.A note from Cleveland ClinicHearing that eye evisceration is suggested as a treatment would concern most people. However, eye removal is suggested only when it’s the best possible therapy for a life-threatening or painful condition. Your eye care provider will give you all the necessary information and support before and after this treatment. It’s important that you ask for answers to your questions and for any type of service that’ll make your recovery easier and more useful.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/30/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicEye CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2020Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"