"External Beam Radiation Therapy (EBRT): Procedure & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/External Beam Radiation Therapy (EBRT)AdvertisementAdvertisementAdvertisementExternal Beam Radiation Therapy (EBRT)External beam radiation therapy (EBRT) is a standard cancer treatment and the most common form of radiation therapy. It uses a machine to send energy beams that destroy tumors. The machine never touches your body. EBRT relies on advanced technology that designs radiation treatments to destroy cancer cells while minimizing damage to surrounding healthy tissue.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is external beam radiation therapy (EBRT)?External beam radiation therapy (EBRT) is the most common form of radiation therapy used to treat cancer. With EBRT, you lie on a table while a machine directs radiation beams that are carefully designed for your tumor location toward you. The machine never touches you. Instead, your care team (or radiation oncology team) programs the machine to deliver radiation directly to cancer cells from a distance, destroying them.EBRT aims to kill cancer cells and shrink tumors while preventing damage to surrounding healthy tissue as much as possible.What is the difference between external beam radiation therapy and internal radiation therapy?There are two main types of radiation therapy: external beam radiation therapy and internal radiation therapy. Both types use radiation to kill cancer cells.What’s different is how they’re delivered. EBRT uses a machine that never touches your body to send radiation to a tumor. With internal radiation therapy, a provider places a radioactive device inside or near a tumor.What types of energy are used in external beam radiation therapy?Radiation consists of energy beams that contain supercharged particles. These particles are strong enough to destroy cancer cells. Depending on the type of radiation treatment you receive, the particles are powerful enough to penetrate deep into tissue, damaging cancer cells and healthy cells, too.A key goal of EBRT is to kill cancer cells without damaging healthy cells.These supercharged particles include:Photons (X-rays and gamma rays): Photons are the basic building blocks of energy. Photons can penetrate deep into your tissue, killing cancer cells. Most types of EBRT use photons.Protons: Protons are particles with a positive charge. They’re used in a newer form of EBRT called proton therapy. Protons deliver a burst of radiation that penetrates tumor cells but stops short of passing through healthy cells. This type of treatment can potentially provide better protection to healthy tissue. Still, proton therapy isn’t widely available. Scientists are still studying the biological effects of how protons interact with cells and the benefits of EBRT using protons compared to EBRT using photons.Electrons: Electrons are particles with a negative charge. They can’t travel as deeply into tissue as photons or protons, so electron beams are mainly used for skin cancer or tumors located superficially.Most types of external beam radiation therapy use a linear accelerator (LINAC) machine to speed up the particles and send them to cancer cells. Proton therapy uses a machine called a particle accelerator.What are the types of external beam radiation therapy?EBRT uses sophisticated technology to send energy beams to your tumor. Treatments are usually spread out over several days to allow time for your body to heal between sessions.3D conformal radiation therapy directs multiple energy beams toward your tumor that “conform” or fit your tumor’s exact size and shape. First, assisted with computer software, your care team analyzes images of your body (most commonly from a CT scan). Other imaging such as PET or MRI scans acquired during your diagnoses may be used to locate your tumor. The images show your tumor’s size, shape and location. The computer uses this information to create a 3D model of your tumor in relation to your other healthy tissue. Your radiation oncology team uses this model to design the energy beams that target cancer cells.Intensity-modulated radiation therapy (IMRT) is an advanced form of 3D conformal radiation therapy. The energy beams not only fit to the shape of your tumor, but each beam also contains several small beams with variable intensities, or strength. IMRT can send higher doses of radiation to concentrated areas of cancer cells while sparing healthy tissue.Image-guided radiation therapy (IGRT) uses imaging to ensure radiation beams are delivered precisely during each treatment session. Both 3D conformal radiation therapy and IMRT use imaging and computer software before your first treatment to ensure customized energy beams are directed at the tumor. IGRT repeats the imaging and analysis during every treatment session. The most common imaging used during treatment is on-board CT scans (a simplified CT scanner in the treatment machines). The energy beams can be repositioned based on changes to your tumor during treatment. If your tumor changes substantially during treatment, your radiation oncologist may decide to adjust the dose or redesign the energy beams (called adaptive radiation therapy).Tomotherapy/helical tomotherapy delivers radiation in a spiral-like pattern while you’re lying on a table. During treatment, you’ll move through a donut-shaped machine while the radiation encircles you. The machine directs energy beams of varying intensity toward your tumor.Stereotactic radiosurgery (such as Gamma Knife surgery) directs high radiation doses toward small brain tumors. This treatment is the standard for brain tumors that can’t be safely removed through surgery. Despite the name, this procedure doesn’t involve cutting out a tumor. It’s called “surgery” because it delivers precise results, similar to actual surgery.Stereotactic body radiation therapy (SBRT) is similar to stereotactic radiosurgery, but it’s used to treat tumors outside of your brain, especially tumors in your liver, lung or spine. SBRT is also used when surgery is too high-risk because of a tumor’s location or your health.Intraoperative radiation (IORT) happens alongside surgery if parts of a tumor can’t be safely removed. Your surgeon will protect healthy tissue with shields while a machine delivers radiation to the cancer site. You’ll be asleep for this type of radiation therapy.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is external beam radiation therapy used for?EBRT kills cancer cells and shrinks tumors. It may be used to:Destroy cancer cells or prevent their spread. EBRT is the primary treatment for many cancers.Complement other cancer treatments. You may receive EBRT alongside other treatments, like surgery, chemotherapy or immunotherapy. EBRT is often used to shrink tumors before surgery (neo-adjuvant therapy). It’s also used to destroy any remaining cancer cells after surgery to prevent cancer from returning (adjuvant therapy).Relieve symptoms. EBRT is often part of palliative care for cancer. Palliative care helps people with chronic, or long-term, conditions manage pain and other symptoms. Radiation destroys tumors that may be causing symptoms that interfere with your quality of life.What cancer does external beam radiotherapy treat?External beam radiotherapy is the go-to form of radiation treatment for most types of localized cancer. “Local” means that cancer cells are isolated within a specific body part. EBRT treats many of the most common types of cancer, including:Breast cancer.Colon cancer.Leukemia.Lung cancer.Non-Hodgkin lymphoma.Prostate cancer.Uterine cancer.Head and neck cancer.Others.Procedure DetailsWho performs external beam radiation therapy?EBRT requires a team-based approach. Your radiation oncology team includes:A radiation oncologist, who’s in charge of planning and delivering your treatment.A medical physicist and dosimetrist, who calculate your radiation dose, design your custom energy beams and program the LINAC machine to deliver the radiation.A radiation therapist, who’s in charge of positioning you during treatment, operating the machine and ensuring your comfort during treatment sessions.AdvertisementWhat happens before external beam radiation therapy?The planning phase of your treatment, called simulation, is essential to EBRT. Simulation ensures that everything is ready for your first treatment session. It also provides a preview of what to expect during treatment.During simulation:You’ll be positioned as if you were receiving treatment.You’ll receive a CT scan, MRI or PET scan to take images of your tumor. These images will allow your radiation oncology team to pinpoint the cancer site, also called the treatment field. They’ll use this information to design energy beams that destroy cancer cells within the treatment field.You’ll receive freckle-sized markings on your skin to identify the treatment field. These markings show where you should receive radiation during each session and should remain on your body throughout treatment.You may be fitted for accessories that will help you stay in position. You may receive a mask or a cast designed to fit the part of your body receiving radiation.Over the next few days or weeks, your radiation oncology team will use the information from simulation to design your treatment.How long does an external beam radiation therapy simulation take?Simulation sessions usually take longer than treatment sessions. Collecting the details in the beginning is essential to designing an effective EBRT. Simulation may be as brief as 30 minutes or as long as two hours.What happens during external beam radiation therapy?You’ll receive treatment in a hospital or treatment center and leave that same day. During treatment:You’ll be positioned as you were during simulation. Your radiation therapist will help place any accessories you need to stay still, like a mask or cast.Once you’re in position, your radiation therapist will leave the room so they can operate the machine. They’ll be able to watch you on a monitor to ensure you’re doing OK during treatment. You’ll be able to talk with your therapist using an intercom.During treatment, the machine will move around you and make small noises as the therapist controls it remotely. The machine’s movements position the energy beams in the precise locations needed to destroy cancer cells. You’ll need to lie perfectly still during the procedure. You can breathe normally.The machine won’t send constant radiation during your session. Instead, it’ll send radiation up to a few minutes each time its position changes.Does external beam radiation therapy hurt?EBRT is painless. You won’t feel the radiation at all.Still, you may notice things in your environment that seem stressful. For example, the machine will make clicking and whirring sounds as it moves. You may see flashes of light, especially if you’re receiving radiation therapy directed at your head. You may notice odd smells from the machine, too.These experiences are normal.How long does external beam radiation therapy take?Treatment time usually lasts between 15 and 30 minutes, with most time spent positioning you correctly. The therapist will tell you when the radiation starts.Most cancer treatments involving EBRT take place daily, from Monday to Friday. Treatment may last anywhere from two to eight weeks. Spreading out your treatment allows healthy cells recovery time, lessening side effects.There are some exceptions. For example, stereotactic radiosurgery often involves receiving a single strong dose in one treatment session.AdvertisementWhat happens after external beam radiation therapy?You’ll be able to leave the hospital or treatment facility after treatment. Depending on how you’re feeling, you may be able to return to your routine immediately.Risks / BenefitsWhat are the advantages of external beam radiation therapy?Radiation therapy has been around in various forms for over a century. Its uses include killing cancer cells, slowing tumor growth, preventing cancer from returning and easing symptoms. Advances in radiation therapy that allow energy beams to attack a tumor from multiple angles have made it a safer, more precise and more effective treatment.What are the side effects of external beam radiation therapy?Although your care team will work to minimize harm to healthy cells, it’s nearly impossible to prevent all damage. When healthy cells are damaged, you experience side effects. The most common side effect of radiation treatment is fatigue, or feeling tired. Other side effects depend on the damaged cells’ location and may include:Nausea and vomiting.Loss of appetite.Headaches.Hair loss.Trouble swallowing.Shortness of breath.Trouble peeing (incontinence).Skin irritation, including soreness and redness.Tenderness and inflammation at the treatment site.Still, your experience will be unique. Two people with the same type of cancer receiving EBRT may experience different side effects.Recovery and OutlookWhen can I resume my normal routine?Everyone’s experience is different. Some people leave radiation therapy treatments and resume their routine. Others experience fatigue so severe that they must take time off from work to rest.Often, people experience more side effects as treatment progresses. Radiation therapy doesn’t kill cancer cells immediately. It takes days or weeks of treatment before cancer cells are damaged enough to die. It’s possible that while you may feel OK in the beginning, you may have to allow more recovery time once cells begin dying.Similarly, side effects vary after treatment ends. You may take a few weeks to feel back to your old self, or it may take several months before you can resume normal activities.When to Call the DoctorWhen should I see my healthcare provider?Before starting treatment, ask your radiation oncologist what side effects you should expect, including which ones are severe enough for an office visit or even a visit to the ER. Your healthcare provider is your best resource for understanding likely side effects or complications.A note from Cleveland ClinicWhen people refer to radiation for cancer treatment, they usually mean external beam radiation therapy (EBRT). EBRT is a standard cancer treatment that’s much more sophisticated than early forms of radiation treatment that were around a hundred years ago. EBRT relies on precise technologies that can target tumors while shielding healthy tissue from harmful radiation exposure. Ask your provider what to expect during treatment and recovery. Discuss potential side effects and treatment outcomes that you should expect with EBRT.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/08/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"