"External Cephalic Version (ECV): Procedure & Risks800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/External Cephalic Version (ECV)AdvertisementAdvertisementAdvertisementExternal Cephalic Version (ECV)External cephalic version, or ECV, is a procedure used to turn a baby from a breech position to a head-down position. It's typically done around 37 weeks of pregnancy and improves your chances of having a vaginal birth.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookAdditional DetailsOverviewExternal Cephalic Version (ECV) is when a baby is turned to a head-down position in the uterus.What is external cephalic version?External cephalic version (sometimes called ECV or EV) is a procedure healthcare providers will use to rotate a baby from a breech position to a head-down position. A breech position is when a baby's feet or buttocks present first or horizontally across your uterus (called a transverse lie).A baby changes positions frequently throughout pregnancy. At around 36 weeks of pregnancy, most babies will turn so they are in a head-down position. This happens naturally within your uterus as your baby prepares for birth. The head-down position is called cephalic or vertex presentation, and it's the preferred position for a vaginal birth. If a baby is breech after 36 weeks, your healthcare provider may talk to you about flipping your baby.Not all people can have an external cephalic version. Your healthcare provider will discuss if it’s an option for you. If an external cephalic version doesn't turn your baby and it remains breech, you will most likely have a cesarean (c-section) delivery.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is an external cephalic version performed?ECV is performed if you want a vaginal delivery, but your baby is in a breech position. If it’s successful, an external cephalic version rotates your baby to a head-down position. This is the preferred position for a vaginal birth.How common is an external cephalic version?About 3% of babies are in a breech position after 36 weeks of pregnancy. Your healthcare provider will evaluate if you are a candidate for ECV after reviewing your medical history. Depending on the comfort level of your provider, they may recommend ECV at around 37 weeks of pregnancy.AdvertisementCan any pregnant woman have an external cephalic version?Most healthy people can have an ECV. However, certain factors make having an ECV unsafe:You have a low amount of amniotic fluid.You have had vaginal bleeding.You are having multiples.Your baby's heart rate is abnormally high or low.You have placenta previa (placenta is covering all or part of your cervix).You have an irregularly shaped uterus.You have high blood pressure or diabetes.You need a c-section for another health reason.If you have a condition that prevents you from taking medications to stop contractions, you might not be able to have an ECV. Your healthcare provider will review your medical history to determine if ECV is safe.Procedure DetailsWhen do doctors perform an external cephalic version?Healthcare providers typically perform an external cephalic version at 37 weeks of pregnancy. Before 36 weeks of pregnancy, there is a chance your baby will rotate to a head-down position on its own. After 38 weeks of pregnancy, your baby might be running out of room in the womb, which makes moving them difficult. That’s why 37 weeks is the recommended time for an external cephalic version.AdvertisementWhat happens before an external cephalic version?Your healthcare provider may give you medication to help you relax and relieve any pain from the procedure. In some cases, you are given medication to prevent contractions and preterm labor. They will review the procedure with you and answer any questions you have.Next, you will be hooked up to a monitor that listens to your baby's heart rate. The heart monitor will stay connected during and after the ECV. If there are issues with the heart rate at any point in time, the procedure will stop. Finally, an ultrasound is used to determine your baby's location, the location of the placenta and the amount of amniotic fluid surrounding your baby. Your healthcare provider may continue to use transvaginal ultrasound during the procedure as an additional monitoring tool.How is an external cephalic version performed?Your healthcare provider (most likely your obstetrician) will place their hands on your belly to turn your baby to a head-down position. The procedure is done externally by applying firm pressure to your abdomen. This pressure lasts several minutes and can cause the uterus to cramp.The entire procedure can take up to two hours once you factor in the time spent monitoring your baby before and after an external cephalic version. ECV is typically performed near an operating room in case an emergency c-section is needed.What happens after this procedure?You will need monitored to ensure labor isn't starting and that your baby isn't in any distress. You can go home and resume normal activities that day. Normal prenatal appointments will resume, usually in weekly increments.What are the success rates of an external cephalic version?ECV works a little more than half of the time. The success rate tends to be the best at 37 weeks. After 37 weeks there is less room within the uterus for your baby to move. Before 36 weeks, there is still a chance your baby can turn on its own.It's also likely to succeed if there is a normal amount of amniotic fluid and the fetus has not descended into the pelvis. People who have already given birth usually see more success with an ECV.Certain factors can lower the chances of a successful ECV. For example, your uterus is too hard or tense, or the obstetrician cannot grasp your baby's head. There is also a small chance your baby will flip back to a breech position after a successful ECV.Care at Cleveland ClinicHaving Your BabyGetting StartedLabor & Delivery ServicesRisks / BenefitsWhat are the advantages of an external cephalic version?The benefit of an external cephalic version is that you can increase your chances of a safe and successful vaginal delivery. Breech pregnancies are not dangerous until it's time for delivery. A baby in a breech position is at risk for complications, especially if a vaginal delivery is attempted. If you want to deliver vaginally, turning a breech baby might be your best chance at having the childbirth you planned.What are the complications of an external cephalic version?There are complications associated with ECV:Premature rupture of the membranes.Placental abruption.Preterm labor.Fetal distress.Vaginal bleeding.Your healthcare provider will discuss the risks with you and decide if an ECV is safe for you and your baby, given your health history and pregnancy.Recovery and OutlookCan an external cephalic version make you go into labor?Yes, having an external cephalic version can make you go into labor. ECV procedures are typically performed near an operating room in case an emergency c-section is needed. This happens less than 1% of the time.What happens if an external cephalic version doesn't work?Some healthcare providers may be comfortable delivering a breech baby through the vagina. It depends on their expertise and your health history and pregnancy. Speak with your healthcare provider about what options you have for delivery if an ECV doesn't work. They might recommend other methods to encourage your baby to turn. You can also have your baby via c-section.Additional DetailsDoes an external cephalic version hurt?You may feel some discomfort when pressure is applied to your belly. Some healthcare providers will give you medication during the procedure to help with the pain.Is an external cephalic version safe?There are risks for both you and your baby with an external cephalic version. Your healthcare provider will assess the risks and make a decision based on your health history and your comfort level with ECV.A note from Cleveland ClinicAn external cephalic version (ECV) can be a successful way to turn a breech baby to a head-first position. It’s used when a person wants to try for a vaginal delivery. Discuss the procedure with your healthcare provider to make sure you understand the risks. Delivering your baby healthy and safe is always the top priority.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/11/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicHaving Your BabyGetting StartedLabor & Delivery ServicesAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"