"Eye Surgery: Types, Details & Risks800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Eye SurgeryAdvertisementAdvertisementAdvertisementEye SurgeryEyes are fragile organs. Eye surgery is a way of removing, repairing or manipulating your eye and its surrounding tissues. Risks include infection, eye damage, dryness and/or vision loss. The risks are higher for some people than for others.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewSurgeons can perform many different types of surgeries on eyes, including those that improve sight and those that remove disease.What is eye surgery?Surgery refers to the physical manipulation, removal or repair of organs and tissues for the treatment of disease. In many cases, surgery may mean cutting into an organ. In the case of eye surgery, the organ is your eye, and the tissues are its surrounding muscles and nerves.Other names for eye surgery are ocular surgery or ophthalmic surgery. Ophthalmologists are eye surgeons.What conditions are treated with eye surgery?Eye care providers may suggest surgery for many types of eye conditions, including:Cataracts.Refractive error, such as nearsightedness, farsightedness and astigmatism.Eye cancer.Ptosis.Retinal detachment.Glaucoma.Can eye surgery improve vision?In many cases, eye surgery can improve vision. For example, vision improves with surgery to correct refractive error, cataracts and severely drooping eyelids.What are some types of eye surgeries?A healthcare provider will do different procedures to obtain different results. Some types of eye surgery include:Vision correction surgeries, including LASIK eye surgery and photorefractive keratectomy (PRK). Some people refer to these types of surgeries as laser surgery, but surgeons also use lasers for other types of surgeries.Cataract surgery.Corneal transplants. Other names for this procedure are keratoplasty and corneal grafting.Vitrectomies.Strabismus surgery.Surgery to repair an open globe injury.Surgery to remove an eye (enucleation).Surgery to treat glaucoma. These surgeries include trabeculectomy or tube-shunt surgery. These procedures create new pathways for fluid in the eye to drain to lower the pressure.Some types of plastic surgery on your face can involve surgery on the structures around your eyes, including eyelid surgery.What type of eye surgery is best?The type of eye surgery that treats your medical issue is the best for you. In recent years, using lasers and robots has improved some types of eye surgeries, making them “best” for those cases.How common is eye surgery?Some eye surgeries are more common than other procedures. Some of the factors behind how often surgeries are performed include insurance coverage, access to healthcare and number of tissue donors.There are about 20 million cataract surgeries performed each year throughout the world, with about 3.7 million surgeries in the United States. In addition, ophthalmologists performed about 800,000 laser refractive procedures in the U.S. in 2020, and they do about 47,000 corneal transplants each year.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before an eye surgery?Generally, before any type of procedure, a provider will want you to stop eating or drinking for a specific period before the surgery. In many cases, they’ll tell you to stop everything by midnight. You should ask them to confirm how far in advance you should stop eating or drinking.In some cases, they’ll ask you to stop regular medications at some point before the surgery. You should ask them to make sure what medications you may need to stop and when you should stop them.Many of the routine eye procedures are ones where you can go home the same day. You’ll need an adult to drive you home after the surgery and may need someone to stay with you a while when you’re home.What happens during an eye surgery?Many eye surgeries use local anesthesia, which means you’ll be awake but not in pain. This is important because of the position your head and eye need to be in for the surgery. You’ll need to be able to maintain a flat and still position. The provider will cover the eye that doesn’t need surgery.Some procedures call for the use of topical anesthesia. This refers to a drop or gel that numbs your eye so you can’t feel anything. This is true for operations like cataract removal or vision correction surgeries.Other types of eye surgeries, like those to repair globe injuries, require general anesthesia. Your child might need to have general anesthesia for an eye procedure, or you might need it if you’re especially nervous about the operation itself.The type of surgery dictates the things that happen during the procedure. Different procedures require different types of preparation, anesthesia, equipment (such as lasers) and implants.AdvertisementWhat happens after an eye surgery?If you’ve had an outpatient procedure, you’ll need an adult driver to take you home. Your provider will give you information on what to expect in terms of pain, medications, keeping your eye covered, positioning of your head and vision improvement. You’ll need to have a follow-up appointment fairly soon after the surgery.The recovery time will also depend on what type of surgery you’ve had. Recovery from cataract surgery and vision correction surgeries are faster than other types of surgeries.Care at Cleveland ClinicEye CareFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of eye surgery?All surgery, not just eye surgery, must balance benefits with risks. In many cases, vision surgery will treat a medical condition and/or improve your vision.AdvertisementWhat are the risks or complications of eye surgery?Most common eye surgeries are very safe. However, with all procedures, risks exist. Risks or complications of eye surgery vary depending on the type of surgery. Overall, risks may include:Dry eyes.Seeing glare or halos.Infection.Bleeding.Blurred vision.Decreased vision.It’s important to review and understand benefits and risks with your ophthalmologist prior to the procedure.Recovery and OutlookWhat is the recovery time after eye surgery?Recovery times vary depending on what type of eye surgery you have.For cataract surgery, it can take four to eight weeks to recover completely, but you should be able to return to your routine earlier than that.For LASIK and similar surgeries, it might take up to four weeks to get back to all your activities, but you may be able to go back to work the next day.For a vitrectomy, you’ll be off work or school for about two to four weeks. You’ll have to follow instructions on how to position your head.For glaucoma surgery, you’ll have a recovery time of about two to six weeks.For corneal transplants, you may have full vision after three months. It may take as long as 12 months or more.When to Call the DoctorWhen should I see my healthcare provider?Usually, when you have a procedure, the provider will write out when you need to call or go to an emergency room in your discharge paperwork. These events may include:Having more pain than expected.Experiencing excessive bleeding.Developing symptoms of an infection, such as swollen skin, a fever or seeing pus in the wound.Being unable to see clearly or at all.A note from Cleveland ClinicEyes are important and fragile organs, and you may feel anxious about having eye surgery. There are many different types of eye surgeries, with some of the more common ones done on an outpatient basis. It’s important to talk with your ophthalmologist about the procedure to determine if it’s best for you and to help you feel prepared for the day of surgery and for your recovery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 12/16/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicEye CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2020Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"