"Facial Masculinization Surgery: What Is It, Procedure & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Facial Masculinization SurgeryAdvertisementAdvertisementAdvertisementFacial Masculinization SurgeryFacial masculinization surgery reshapes bones and soft tissue so that your face appears more masculine. This is a gender-affirming procedure that yields permanent changes in facial features.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is facial masculinization surgery?Facial masculinization surgery creates a more angular face, which may be considered more masculine in appearance. It reshapes your bones and soft tissue to create more angular facial features.You can have masculinizing surgery on your:Cheeks.Chin.Forehead.Nose.Throat.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho is a good candidate for facial masculinization surgery?Facial masculinization is an option for people who were assigned female at birth (AFAB) but identify as men. This gender-affirming surgery is a common treatment for gender dysphoria, a condition in which differences between physical appearance and assigned gender cause distress.Many people start changing their appearance with masculinizing hormone therapy. Male hormones (testosterone) cause changes such as increased muscle mass, and body and facial hair. Masculinizing surgery enables you to make more significant changes that are permanent.Who shouldn’t have facial masculinizing surgery?You may not be a good candidate for facial masculinizing surgery if:The bones of your head and face are not done developing.You have a health condition that makes surgery dangerous.Your mental health prevents you from agreeing (consenting) to the procedure.What type of surgeon performs facial masculinization surgery?Types of providers that perform these procedures include:Plastic surgeons: Surgeons skilled in cosmetic procedures.Craniomaxillofacial surgeons: Specialists in head, neck, mouth and face surgery.Otolaryngologists: Ear, nose and throat surgeons.Some providers have extra training in gender-affirming surgery. Going to an experienced surgeon gives you the best chances of a successful procedure.AdvertisementIs surgery my only option?You may be able to achieve changes to your nose or a sharper jawline using dermal fillers. Healthcare providers inject these substances into specific areas to add bulk or definition. The results are temporary. You will need to keep receiving injections to maintain these changes.Procedure DetailsWhat happens before facial masculinization surgery?In addition to masculinizing hormone therapy, you will need a mental health evaluation. The mental health provider ensures your:Understanding of the procedure and its impact on your life.Ability to consent to surgery.AdvertisementHow do I prepare for facial female-to-male (FTM) surgery?Before the procedure, your healthcare provider performs a thorough assessment. They ask you about your goals for surgery and explain what you can expect after you recover.Your provider also makes sure you’re in good physical health by:Assessing your lifestyle, including smoking or drinking habits.Performing a physical exam, which may include running lab tests.Identifying risks for potential complications.Reviewing your current medications and any allergies you may have.You might also have imaging scans before facial masculinization surgery. X-rays or CT scans take pictures of the bones and soft tissues of your face and skull. This helps your surgeon plan treatment.What happens during facial masculinization surgery?The procedures that are right for you depend on the facial features you wish to change. You might have one surgery or several.Facial female-to-male surgery can change your:Cheeks: Using implants, surgeons make the cheeks more angular.Chin: Surgeons may use bones, implants or fat grafting to create a broader chin or sharper jawline. Fat grafting takes fat from one area of the body and deposits it in another.Forehead: Surgery can create a wider forehead. It may flatten the ridge on which your eyebrows sit. It can also lengthen the distance between the eyebrows and the hairline.Hair transplantation: Surgeons take hair from one area of the body and implant it in the face. This can give you fuller sideburns, a mustache or a goatee.Nose: Using cartilage or bone grafting, surgeons make your nose larger and broader.Throat: Surgeons use cartilage from other areas of the body to create an Adam’s apple. This is the small bulge of tissue in the center of a man’s throat.Care at Cleveland ClinicSchedule Gender Affirming SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the risks of facial masculinizing surgery?Risks include:Bleeding.Edema (fluid buildup).Hair loss along the incision.Implant migration, which occurs when an implanted device shifts out of place.Infection.Numbness and nerve damage.Poor healing of bones or incisions.What are the benefits of facial masculinization surgery?After recovering, many people feel more confident and secure.What other female-to-male surgeries are available to transmen?You may wish to pursue:Female-to-male top surgery: This procedure helps creates a more masculine-looking chest. It typically includes removing the breasts and repositioning nearby tissue.Metoidioplasty: Genital tissue is used to create a small penis. This method starts with enlarging the clitoris using hormones, which surgeons then use to construct a penis.Phalloplasty: This procedure creates a regular-sized penis using flaps of skin from other areas of your body.Recovery and OutlookWhat is the recovery process after facial masculinization surgery?An overnight hospital stay might not be necessary.You may go home with:Bandages and wound dressings.A splint on your nose.Support garments to reduce swelling.Surgical drains to help clear fluids.It’s natural to experience pain, swelling and bruising. You receive at-home care instructions to help you stay as comfortable as possible. You should also get plenty of rest and take medications as prescribed for pain.When to Call the DoctorWhen should I contact my healthcare provider after having facial masculinization surgery?Your care should include follow-up appointments to track your recovery. Contact your healthcare provider immediately if you experience:Shortness of breath or difficulty breathing.Blood-soaked dressings, which can be a sign of excessive bleeding.Infections that cause a fever or yellowish discharge from incisions.Pain that does not respond to medications.Not keeping fluids down due to vomiting.A note from Cleveland ClinicFacial masculinization surgery helps people achieve a more masculine appearance. There are many options, including lengthening the forehead or creating a sharper jawline. This is one of many gender-affirming procedures. For the best results, go to a surgeon who specializes in working with FTM individuals.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/24/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Gender Affirming SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"