"Facial Feminization Surgery (FFS): Procedure & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Facial Feminization SurgeryAdvertisementAdvertisementAdvertisementFacial Feminization SurgeryFacial feminization surgery (FFS) involves one or more procedures to make the features of your face more traditionally feminine. FFS can include a wide range of procedures, including jaw reduction, nose reshaping and cheek augmentation.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewFacial feminization surgery (FFS) changes your facial features to look more traditionally feminine. A surgeon can customize the procedure to help you achieve the results you want.What is facial feminization surgery (FFS)?Facial feminization surgery (FFS) changes features on your face to look more traditionally feminine. It might involve one surgery or a series of procedures.FFS uses bone, cartilage and soft tissue reshaping to soften your facial features. People commonly seek FFS to enhance their nose, jaw, forehead and hairline.Who can have facial feminization surgery?Anyone can have feminizing facial surgery. As long as you’re healthy enough to have surgery, you can have FFS.Who shouldn’t have facial feminization surgery?You may not be a good candidate for FFS if you:Are under the age of 18.Don’t have realistic expectations about the results.Have a health condition that makes surgery dangerous. (This includes heart disease, bleeding disorders or allergies to general anesthesia.)AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho performs facial feminization surgery?A plastic surgeon specializing in surgery of your face, head and neck performs facial feminization surgery. This type of healthcare provider specializes in surgery to change or enhance your physical appearance.Procedure DetailsHow do I prepare for facial feminization surgery?Before facial feminization surgery, your healthcare provider will perform a thorough personal assessment. They’ll ask you about your goals for surgery and explain what you can expect during your recovery after the procedure. It’s important that you and your surgeon have goals that are aligned and realistic.Your provider also makes sure you’re in good physical health by:Assessing your lifestyle, including smoking or drinking habits.Doing a physical exam and lab tests.Identifying risks for potential complications.Reviewing your current medications and any allergies you may have.You might also have imaging scans before facial feminization surgery. X-rays or CT (computed tomography) scans take pictures of the bones and soft tissues of your face and skull. Your surgeon may also measure your face, take photographs and assess your skin quality. All of this information helps your surgeon plan your treatment.AdvertisementWhat happens during facial feminization surgery?Facial feminization surgery is different for everyone. The process depends on the facial features you choose to change. You might have one surgery or several, including:Hairline lowering: A surgeon makes an incision along the length of your hairline and brings your skin forward over your forehead. They preserve healthy hair follicles, so your hair continues to grow. They can also perform hair transplantation, if necessary.Forehead contouring: If you want to reduce the size of the bone just above your eyebrow ridge, a surgeon can remove part of this bone and reshape it to give a smoother appearance.Cheek augmentation: Surgeons can change the shape of your cheeks with silicone implants or fat injections. They may take fat from another area of your body, like your thighs.Rhinoplasty (nose reshaping): If you want to reduce the width of your nose, a surgeon can reshape the underlying bone and cartilage.Lip lift and augmentation: Surgeons can raise the height of your top lip through a small incision under your nostrils. They may also make your lips fuller with fat injections or fillers.Chin reduction: Your surgeon may reduce the size of your chin and reshape it for a more pointed or oval shape. Another name for chin reduction is genioplasty.Jaw reduction: Through an incision inside your mouth, a surgeon can remove and reshape bone to reduce the size and angle of your jaw. This type of incision means you won’t have a visible scar.Adam’s apple reduction: During this procedure — also called a tracheal shave — a surgeon makes an incision under your chin and removes some of the cartilage in your neck.How long does facial feminization surgery take?It depends on your situation and whether you’re having one or multiple procedures. If you have everything done during one surgery, it can take up to eight or nine hours. Some surgeons recommend splitting the procedures into two surgeries, separated by seven to 10 days or longer. Doing two surgeries gives your face more time to heal.AdvertisementWhat happens after facial feminization surgery?You’ll have gauze or bandages over your incisions for several days. You might wear compression wraps around your forehead or jaw to reduce inflammation.You may go home with a surgical drain. A drain is a thin, plastic tube that your surgeon places under your skin. It helps drain blood and fluid to reduce swelling.Care at Cleveland ClinicGet ENT (Otolaryngology) CareMake an AppointmentRisks / BenefitsWhat are the benefits of face feminization surgery?Feminizing facial surgery can help you feel more confident and secure in your gender expression. It can boost your self-esteem and improve your quality of life.What are the risks of facial feminization surgery?Risks of facial feminization surgery include:Bleeding.Bruising.Edema (fluid buildup) and swelling.Hair loss (after hairline lowering or forehead contouring).Infection.Numbness in different parts of your face.Poor healing of incisions.Reaction to anesthesia.Recovery and OutlookHow long does facial feminization surgery take to heal?Your healthcare provider will probably take out the nonabsorbable stitches a week after your surgery, or they may place absorbable stitches that don’t require removal. Once your stitches are gone, it’ll still take several weeks to fully heal and achieve your desired results.Recovery varies from person to person and depends on several factors, including what procedures you choose, your health history and your body’s healing capacity. While most healing occurs over the first two to six weeks (like reduced bruising and swelling), your body will continue to recover over the coming months. For most people, it takes about one year to see full results.How painful is facial feminization surgery?Any time you have a surgical procedure, you can expect some degree of discomfort, swelling and bruising. But you shouldn’t have severe pain — and any discomfort should improve with medication.Most people who have feminizing facial surgery report minimal pain. Your surgeon will give you a list of postoperative instructions and provide you with any necessary prescriptions.Is facial feminization permanent?Yes, your FFS results should last the rest of your life. Injectable treatments (like dermal fillers) are the only exception. If you choose to plump up certain features with dermal fillers, you’ll need retreatment at some point. Some fillers last a few months while others can last up to five years.When to Call the DoctorWhen should I see my healthcare provider?Contact your healthcare provider right away if you experience any of these complications after your surgery:Arrhythmia (abnormal heartbeats).Chest pain.Shortness of breath.Symptoms of infection, including increased redness, pain, drainage or swelling.A note from Cleveland ClinicThe decision to get facial feminization surgery is very personal. When your appearance doesn’t fully reflect the way you feel inside, it can take a toll. Feminizing facial surgery helps soften your features to look more traditionally feminine. Everyone has their own perception of femininity, so this can mean different things for different people. To get the results you want, find a healthcare provider who understands your cosmetic goals and makes you feel confident in their ability to achieve them.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/01/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet ENT (Otolaryngology) CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"