"Factor Xa Inhibitors: How They Work & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Factor Xa InhibitorAdvertisementAdvertisementAdvertisementFactor Xa InhibitorFactor Xa inhibitors are newer anticoagulants that offer some advantages over older ones. The biggest advantage is that people taking them don’t need frequent blood tests. People take factor Xa inhibitors to prevent or treat blood clots. They can take them for days or months, depending on the situation.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a factor Xa inhibitor?Factor Xa inhibitors are drugs that keep your blood from clotting too much. Sometimes, people call them “blood thinners.” Healthcare providers call these medicines direct oral anticoagulants (DOACs). You can take them when you need to treat a blood clot and also as a long-term medicine to prevent blood clots.Factor Xa inhibitor drugs include:Apixaban.Betrixaban.Edoxaban.Fondaparinux. (You get this in a vein, or intravenously, instead of taking it by mouth.)Rivaroxaban.Conditions treated/managed with factor Xa inhibitorsFactor Xa inhibitors can:Lower your risk of stroke.Lower your risk of venous thrombosis (blood clots in your veins).Lower the risk of cardiovascular (heart and blood vessel) events in people with coronary artery disease and peripheral artery disease.Treat deep vein thrombosis (DVT).Treat pulmonary embolism (PE).Treat venous thromboembolism (VTE).Some people may take factor Xa inhibitors because they already have a blood clot. Others may take them because they may be at risk of a blood clot. This group includes people who:Just received a total hip or knee replacement.Have had a blood clot in the past.Have atrial fibrillation that doesn’t involve their heart valves.How common are factor Xa inhibitors?More than 3.7 million Americans on Medicare take factor Xa inhibitors, according to 2020 numbers from the Centers for Medicare & Medicaid Services.Factor Xa inhibitor vs. warfarinFactor Xa inhibitors have become a popular choice for people who need to take an anticoagulant. Before factor Xa inhibitors, many people took warfarin (Coumadin® or Jantoven®). Warfarin is an effective medication that healthcare providers have prescribed for many years.However, your provider has to adjust your dose based on the results of regular blood tests that check how long it takes your blood to clot. You may need to take these tests anywhere from once a month to twice a week.Frequent blood testing with warfarin is the major difference between warfarin and a factor Xa inhibitor.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow do factor Xa inhibitors work?Factor Xa inhibitors get in the way of a protein your body needs to make blood clots. Making a clot takes various steps. By keeping factor Xa from doing its part in the process, it’s like taking someone out of the assembly line. You slow down the clotting.How long will I need factor Xa inhibitors?The reason you’re taking factor Xa inhibitors determines how long you’ll need to take them. If you have atrial fibrillation, you may need to be on a factor Xa inhibitor for life.If you have venous thromboembolism (VTE), you’ll need to take a factor Xa inhibitor for three to six months. For deep vein thrombosis (DVT) or a pulmonary embolism (PE), you’ll take it for six months.If you’re having knee replacement surgery, you’ll only need to take a factor Xa inhibitor for 12 days afterward. You take them for 35 days after a hip replacement.Care at Cleveland ClinicVascular Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the potential benefits of factor Xa inhibitors?Factor Xa inhibitors provide these benefits:Help keep deep vein thrombosis (DVT) from happening again.Have a similar risk of bleeding as other drugs but without the need for frequent blood tests.Start to work in a few hours.Have fewer interactions with food and other medicines.Provide predictable results with a set dose.How successful are factor Xa inhibitors?Multiple studies have shown that factor Xa inhibitors work as well as or better than older drugs that prevent dangerous blood clots. Also, people taking factor Xa inhibitors have fewer bleeding episodes.AdvertisementWhat are the risks or complications of factor Xa inhibitors?You’re at risk of bleeding in your brain and digestive system while taking factor Xa inhibitors. It can be hard for people to control this bleeding. Also, factor Xa inhibitors — and drugs to reverse their effects — are more expensive than medicines that existed years earlier.A different drug, andexanet alfa, can reverse the effects of some factor Xa inhibitors. Providers use this if your bleeding is uncontrollable or life-threatening.All anticoagulants carry some risk of bleeding because they interfere with your blood clotting process.Other factor Xa inhibitor side effects may include:Bruises that happen easily.Rash.Recovery and OutlookHow long will it take for me to feel better?Factor Xa inhibitors begin to take effect in a few hours, so you should feel better the same day.AdvertisementIs there anything I can do to make factor Xa inhibitors easier on me?Because a factor Xa inhibitor can make you bleed more than you normally would without it, try to avoid getting hurt. Try these tips:Wear gloves and shoes to protect yourself when you’re doing yard work.Take care with scissors and knives.Wear gloves when washing dishes, especially knives.Use an electric razor instead of one that has a blade.Remove tripping hazards (like loose rugs) from your home to reduce your risk of falling and getting hurt.When to Call the DoctorWhen should I call my healthcare provider?Contact your healthcare provider if you experience:Heavy bleeding, especially if you can’t stop it.A fall.Chest, head or stomach pain.Difficulty breathing.Rash.A note from Cleveland ClinicFactor Xa inhibitors have freed many people from the need for frequent blood testing. However, they may not be a good choice for you. Talk with your healthcare provider about your situation to understand your options. Whichever anticoagulant you take, be sure to follow your provider’s instructions carefully. Ask questions if there’s something you don’t understand about how your medicine works.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/18/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicVascular Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"