"Family Therapy: What It Is, Techniques & Types800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Family TherapyAdvertisementAdvertisementAdvertisementFamily TherapyFamily therapy is a form of talk therapy that focuses on the improvement of relationships among family members. It can also help treat specific mental health or behavioral conditions, such as substance use disorder or oppositional defiant disorder. Family therapy can involve any combination of family members.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is family therapy?Family therapy is a form of group psychotherapy (talk therapy) that focuses on the improvement of interfamilial relationships and behaviors.A family unit is a group of people who care about each other. In family therapy, a group can consist of many different combinations of loved ones, such as parents/guardians and their children, siblings, grandparents, aunts and uncles, friends, kinship caregivers, etc.Therapy can help with situations such as:Adjusting to a new life change (like moving) or a medical condition.Changes and challenges that come with aging.Death and grief.Relationship conflicts, such as parent-child conflict or sibling conflict.Mental health professionals also use family therapy to help treat certain mental health or behavioral conditions for one person within the family unit. For example, family therapy involving all or multiple members of the family can help treat anorexia for one person in the family.Family therapy takes place with a trained, licensed mental health professional, such as a psychologist, therapist or counselor, who has specialized knowledge in working with families. Oftentimes, they’re Licensed Marriage and Family Therapists (LMFTs). Therapy can provide support, education and guidance to you and your loved ones to help you function better and increase your well-being.There are several different types of family therapy that vary widely in terms of therapy length, techniques and treatment goals.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the types of family therapy?Mental health professionals use several forms of family therapy, and many professionals specialize in certain types. The choice of therapy type depends on your family’s particular needs and circumstances. Therapists may combine elements from different therapeutic approaches to best meet your needs.Some forms of family therapy include:Functional family therapy (FFT): Therapists most often use this type to help families with children who have behavioral issues. FFT assesses the family dynamics that have contributed to a child’s problematic behavior, improves family communication and parenting skills, and supports positive reinforcement.Marriage counseling/couples therapy: This therapy involves you and your spouse or romantic partner. Licensed Marriage and Family Therapists (LMFTs) are specifically trained to help couples determine their problems and work on solutions. Issues may be related to communication, raising children, finances, understanding your or your partner’s mental health condition and more.Strategic family therapy: This is a short-term family therapy that focuses on making positive structural and behavioral changes in the family environment. It’s based on the foundation that the family plays the most important role in the life and development of children. Therapists may use this therapy form for families with children who have behavioral issues.Structural family therapy: This type of therapy looks at the inner relationships, boundaries and hierarchies within a family unit (its structure). It focuses on direct interactions among your family members as the primary way to bring about positive change. The main foundation of structural family therapy is that when guided by a therapist, families will discover their own alternatives to their problematic patterns of relating to one another.Systemic family therapy: The foundation of systemic family therapy is considering the family’s issues in the different contexts in which they live. For example, the therapist will consider how one family member functions as a partner in a romantic relationship, as a parent and as a child to their parents. Context also includes cultural, religious and political views, and socio-economic status. This approach regards context as having the most significance for your psychological development and emotional well-being.For families who are participating in therapy due to a mental health condition, psychoeducation is a crucial part of the therapy. Psychoeducation is the way that mental health professionals teach people and their families about mental health conditions. It involves basic information about the condition, causes, treatment and prognosis (outlook).What issues can family therapy help fix?Families attend therapy for several different reasons. Problems that family therapy can help fix include (but aren’t limited to):Strained relationships between family members.Stress.Anger.Communication issues.Trauma (physical or emotional).Coping with acute or chronic illness of a family member, such as multiple sclerosis, cancer, stroke, chronic pain or an autoimmune disease.The death of a loved one and grief.Divorce or romantic relationship issues.Coping with sudden changes, such as unemployment, moving or incarceration.Family therapy can be beneficial if a family member has any of the following mental health conditions:Anxiety disorders, such as obsessive-compulsive disorder (OCD).Eating disorders, such as anorexia.Mood disorders, such as bipolar disorder and depression.Personality disorders, such as borderline personality disorder.Schizophrenia.Substance use disorder.It can also help childhood behavioral conditions, such as:Conduct disorder.Disruptive mood dysregulation disorder (DMDD).Oppositional defiant disorder (ODD).Families who have neurodivergent members, such as someone with autism spectrum disorder or attention-deficit hyperactivity disorder (ADHD), also often participate in therapy.AdvertisementHow do I find a family therapist?A family therapist is usually a Licensed Marriage and Family Therapist (LMFT), but they can also be a psychologist, social worker or counselor.Finding the right therapist is often a time-consuming task. Try not to become discouraged. Talk to people you trust to give you a referral for a therapist, whether it’s your primary healthcare provider or a friend or family member.You can also search for family therapists online through local and state psychological associations.Be sure that any family therapist you’re interested in seeing is a state-certified and licensed mental health professional and that they have experience in treating your area of concern, such as divorce or childhood behavioral conditions.Most therapists’ websites list the conditions and situations they help treat. If you have questions, call or email the therapist’s office before you choose.It may be helpful to ask a potential therapist the following questions:How long have you been providing therapy?What type of therapy do you recommend for my family?How much time will you initially ask my family to commit to the entire therapy process?Procedure DetailsHow does family therapy work?Family therapy is an evidence-based treatment that’s grounded in theory and skill-based dialogue (conversations). It provides a supportive, nonjudgmental and safe environment that allows your family to talk openly with a mental health professional. This professional is objective and specially trained to help your family with the issues you’re having.With the guidance of a mental health professional, you work on improving the interactions and communication among your family members. You work to incorporate healthy behaviors to improve your family’s functioning and well-being. Family therapy can also help you understand and help treat a family member’s mental health or behavioral condition.Your therapist may:Ask each family member about their concerns and challenges and hopes for family therapy.Encourage everyone to talk and listen to each other.Clarify everyone’s words and feelings so everyone understands each other.Help your family members understand the impact of their words and behaviors.Help your family explore how you can work together to make positive changes.Suggest strategies for changing problematic behaviors and patterns.As conversation is the main part of family therapy, it’s essential for all family members who are participating to be actively involved in the therapy. The trust and relationship between you and your therapist are essential to working together effectively and benefiting from the therapy.The frequency and amount of sessions vary from family to family depending on their unique circumstances. Therapy may involve just a few sessions or they could continue for several months or more. Your therapist may suggest meeting with family members individually, as well as in a group.Care at Cleveland ClinicMental Health CareMake an AppointmentAdvertisementRisks / BenefitsWhat are the benefits of family therapy?Several research studies have shown the effectiveness of family therapy in treating a variety of mental and emotional conditions and health issues, like adolescent substance use, depression and obesity. Studies also show significant improvements in family member relationships and conflict.These improvements can also lead to better functioning at work or school.After participating in family therapy treatment:Almost 90% of people report an improvement in their emotional health.Nearly 66% report an improvement in their overall physical health.In child-parent cases, about 73% of parents report that their child’s behavior improved.What are the risks of family therapy?Family therapy isn’t for everyone. If one or more members are reluctant to participate during the sessions, it can increase family conflict.Family therapy is more likely to work if those participating:Are open and honest with the therapist.Are committed to making positive changes.Follow their agreed-upon treatment plan.Are ready to fully commit to therapy and do homework assignments (if applicable).Depending on your situation, you or your family members might feel slightly more upset during therapy. Your therapist can help you work through these feelings.Recovery and OutlookHow long does family therapy take to work?How long you and your family will need therapy depends on several factors, including:Your family’s specific reason for participating in therapy.What your goals are.If your family members are actively trying to work on the issues your family’s having.Family therapy can be short term (12 sessions, on average), dealing with immediate issues, or long term (months or years), dealing with mental health conditions and/or complex issues. Together, your family and therapist will determine the goals of treatment and arrangements for how often and how long you’ll meet.Some families participate in therapy multiple times over the years — whether for the same issue or different issues.When to Call the DoctorWhen should I see my mental health provider?It’s normal to feel uncomfortable during family therapy because it can be painful to explore negative emotions, fears and past experiences. If your symptoms get worse or you experience more severe anxiety or depression, contact your mental health provider or a healthcare provider right away.If you or a loved one are thinking about suicide, dial 988 on your phone to reach the Suicide and Crisis Lifeline. Someone will be available to help you 24/7.A note from Cleveland ClinicWhile it can be overwhelming to acknowledge and seek help for family issues, it’s important that you do. Family therapy can help you better understand and work through the roadblocks that are preventing your family from living a full and healthy life. It’s also effective in treating certain mental health conditions. Mental health professionals are experts in their field and have up-to-date knowledge of research and therapy strategies that can help you and your family.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/20/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicMental Health CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"