"Fat Transfer: Surgeries, Results, Risks & What to Expect800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Fat TransferAdvertisementAdvertisementAdvertisementFat TransferFat transfer is a minimally invasive cosmetic procedure. It uses your fat to enhance your lips, breasts, butt or other body parts. Fat transfer can provide a plumper, more youthful look and repair scars. Plastic surgeons also perform fat transfer for reconstructive surgery.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is fat transfer?Fat transfer surgeries take fat from one part of your body and inject it into another area to help shape your appearance. A plastic surgeon can remove excess fat from any area. Usually, they remove fat from your:Belly.Hips.Thighs.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyDoes fat transfer have other names?Yes, fat transfer is also known as:Autologous fat transfer.Fat grafting.Fat injections.Lipofilling.Which body parts can I have fat transferred to?After removing excess fat from your belly, hips or thighs, a plastic surgeon can transfer it to several areas. For example, you can have a:Fat transfer to your breasts (breast augmentation).Fat transfer to your buttocks (Brazilian butt lift).Fat transfer to your face.Fat transfer to your hips.Fat transfer to your lips (lip augmentation).Fat transfer to your cheeks.Under eye fat transfer.AdvertisementWhat can fat transfer help with?Fat transfer can add natural-looking volume to different parts of your body and create a more youthful appearance. Specifically, fat transfer can:Create higher cheekbones.Enhance your waist-hip ratio or create an hourglass shape.Fill in wrinkles on your face, such as below your eyes.Increase the size of your buttocks.Reconstruct your breast and repair damage after breast cancer.Reduce wrinkles on your hands.Repair facial scars.What can’t fat transfer do?Fat transfer isn’t a weight-loss procedure, so you won’t see a drastic change in the area where your surgeon removes the fat. The goal of fat transfer is to remove enough fat cells to plump up the desired area.AdvertisementWho’s a good candidate for fat transfer?You’re a good candidate for fat transfer if you:Are close to your ideal weight.Are in good health.Don’t smoke or can quit smoking.Have enough fat on your body, especially if enhancing a larger area like the hips or butt.Want subtle, natural-looking results and have realistic expectations.Does fat transfer really work?When performed by a trained, experienced plastic surgeon, fat transfer is effective at giving you a natural-looking, youthful look.Do fat transfers last?Results from fat transfer are permanent. However, not all fat cells survive the procedure, so you may not achieve the volume you want. It takes about six months for the injected fat cells to develop a new blood supply and to see final results.Will I need several fat transfer sessions?The number of sessions depends on the size of the treated area and your desired volume. Enhancing lips usually takes one session. Enhancing breasts or a butt may require multiple fat transfer surgeries.Is fat transfer safe?Fat transfer surgery is safe. It’s important to work with a plastic surgeon who has extensive experience performing fat transfer because it requires a high degree of skill. As with any cosmetic surgery, risks are possible.Procedure DetailsHow do I prepare for fat transfer surgery?You’ll receive specific instructions on how to prepare for your procedure, such as:Avoid herbal supplements.Don’t take aspirin or ibuprofen.Drink plenty of water so you’re well hydrated.Stop smoking.What happens before fat transfer surgery?Before fat transfer surgery, you typically receive local anesthesia. You’re awake during the procedure but don’t feel any pain.You might receive general anesthesia, where you are asleep during the procedure, if:The treated area is larger.You’re having additional cosmetic surgeries at the same time.What happens during fat transfer surgery?Fat transfer surgery can take anywhere from an hour to more than four hours. Timing depends on your specific case. For example, lip fat transfer takes about an hour. Breast fat transfer can take between three and four hours.During fat transfer surgery, your plastic surgeon:Uses liposuction to remove excess fat from one area of your body.Purifies the fat.Injects the fat in tiny droplets into the desired area.What happens after fat transfer surgery?After fat transfer surgery, it’s common to experience side effects in both the donor area and treated area. These side effects may include:Bruising.Swelling.Tenderness or soreness.You may need to wear a compression garment to help with healing and get the best results.Care at Cleveland ClinicPlastic Surgery CareMake an AppointmentRisks / BenefitsWhat are the benefits of fat transfer?Fat transfer has various benefits because you’re using your tissue versus an implant:Your results look more natural.It reduces the chances of having an allergic reaction since it’s not a foreign substance.Other fat transfer benefits include:It’s an outpatient procedure, so you go home the same day.You can plump up smaller parts of the body, like hands and acne scars.What are the risks of fat transfer?Risks of fat transfer may include:Bleeding.Fat that gets stuck in a vein and goes to your lung (fat embolism).Fluid buildup under your skin (seroma).Most fat cells not surviving.Significant scarring.Undesirable results.Recovery and OutlookWhat is the recovery time for fat transfer surgery?Your recovery time depends on the location of the fat transfer. It can take up to several weeks for some side effects, such as swelling, to subside.When can I return to work or my usual activities?Some people can return to work and regular activities after a week, while others need two weeks or more. Talk to your plastic surgeon about recovery and what to expect for your specific fat transfer procedure.When to Call the DoctorWhen should I see my healthcare provider?After a fat transfer procedure, call your plastic surgeon immediately if you experience:A high fever.Dizziness that doesn’t go away.Excessive bleeding.Redness and heat at the incision site.Severe nausea and vomiting.Sharp pain that comes on suddenly or doesn’t subside.Fluid leaking from your incisions.A note from Cleveland ClinicFat transfer is a safe, minimally invasive procedure that creates natural-looking, youthful results. During fat transfer, a plastic surgeon takes excess fat from one area of your body and injects it into your desired area. You can add volume to your face, butt, breasts or other body parts. Talk to your plastic surgeon about whether fat transfer is right for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/18/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPlastic Surgery CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"