"FTM Top Surgery: Gender-Affirming Surgery, Keyhole, Double Incision800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Female-to-Male (FTM) Top SurgeryAdvertisementAdvertisementAdvertisementFemale-to-Male (FTM) Top SurgeryFemale-to-male (FTM) top surgery is a procedure to create a more masculine-looking chest in transgender men. The procedure involves removing excess fat and skin, and repositioning the nipples to create a natural-looking flat chest. FTM top surgery may help relieve gender dysphoria and prevent complications related to chest binding.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is top surgery?Top surgery creates a more masculine-looking chest in transgender men. It’s a type of female-to-male (FTM) gender-affirming surgery.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat happens during FTM top surgery?There are many options for female-to-male top surgery. Procedures may involve:Removing both your breasts with a double mastectomy.Eliminating excess skin near your breasts.Repositioning your nipple and areola (dark-colored skin surrounding the nipple).Making other changes to create a natural, flat chest.Who is FTM top surgery for?Many people pursuing FTM top surgery have gender dysphoria. This is the distress that occurs when your sex assigned at birth does not match your gender identity. Top surgery may help alleviate this dysphoria.Surgery can also prevent complications of compression garments used in binding. These tight-fitting garments can cause skin damage, shortness of breath, discomfort and even possibly broken ribs.AdvertisementWhat type of surgeon performs this procedure?The ideal choice is a board-certified plastic and reconstructive surgeon who specializes in gender-affirming procedures. Going to an experienced provider gives you the best chances of successful surgery.Procedure DetailsWhat happens before FTM top surgery?To undergo female-to-male top surgery, you’ll need to meet the criteria defined by the World Professional Association for Transgender Health (WPATH). You’ll undergo a mental health evaluation to ensure your understanding of the procedure and its impact on your life.You’ll likely need gender-affirming hormone therapy with testosterone. Achieving the full effects can take up to a year and include redistributing fat away from your chest and broadening your shoulders.AdvertisementWhat are my options?There are several FTM top surgery options:Double-incision top surgery with nipple graftsThis is the most common option. It involves:Removing your nipples and areolas and decreasing their size.Making long incisions to access and remove your breasts.Performing liposuction to remove excess fat.Removing excess skin, if necessary.Preventing skin puckering (dog ears) near the incision with special stitches.Reattaching the optimized nipples and areolas to your chest.Periareolar top surgeryThis option is for individuals with smaller chests. It may involve:Making one circular incision around the border of your areola.Making a larger circular incision around the first one.Removing breast tissue and performing liposuction.Resizing and reattaching the areola by bringing together the edges of the larger incision.Keyhole top surgeryYou may be eligible for this procedure if you have a very small chest and tight skin. It involves:Making an incision along the bottom half of your areola, so it’s semi-attached.Removing breast tissue and performing liposuction.Resizing your nipple if necessary.What other gender-affirming surgeries are available to transgender men?You may wish to pursue:Facial masculinization: Makes your face more masculine-looking. It includes options such as lengthening your forehead or making your jaw more angular.Phalloplasty: Creates a regular-sized penis. This technique uses flaps of skin from other areas of your body.Metoidioplasty: Results in a smaller penis. This method starts with enlarging your clitoris using hormones. Surgeons use this tissue to construct a penis.Care at Cleveland ClinicSchedule Gender Affirming SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of FTM top surgery?One of the main benefits is relief from gender dysphoria. Achieving a flat, masculine-looking chest helps many transgender individuals feel better about themselves and can help alleviate gender dysphoria.Other benefits depend on the type of top surgery:Double-incision top surgery with nipple graftMore natural nipple positioning.Lower risk of sagging.Periareolar top surgeryPossible preservation of nipple sensation.Incision scars are hardly noticeable after they heal.Keyhole top surgeryPossible preservation of nipple sensation.Minimal scarring.What are the potential complications of FTM top surgery?Complications depend on the type of procedure and may include:Immediate and treatable issues like bleeding and potential for infection.Dog ears, a small piece of fat and skin that hangs out from the incision site.Loss of nipple sensation.Scarring.Fat tissue that builds up over time and requires additional liposuction.Uneven nipples or other surgical defects that need revision surgery.Recovery and OutlookWhat is recovery from FTM top surgery like?After surgery, you will need to:Wear compression bandages around your chest to prevent fluid from pooling.Sleep on your back.Take medications to relieve pain and prevent constipation.Rest, including staying home from work for a short period and temporarily avoiding lifting or reaching.Change the compression bandages regularly.What is life like after FTM top surgery?The outlook after FTM top surgery is excellent. It can take a few months for the pain and scars to fade. After recovering, most people have an improved self-image and quality of life.When to Call the DoctorWhen should I contact my healthcare provider after FTM top surgery?Your care should include follow-up appointments to track your recovery. Contact your healthcare provider immediately if you experience:Blood-soaked dressings, which can be a sign of excessive bleeding.Infections that cause a fever or yellowish discharge from the incisions.Pain that does not respond to medications.Signs of blood clots, such as abnormal swelling in your groin or lower leg.Vomiting and not being able to keep fluids down.A note from Cleveland ClinicFTM top surgery is a procedure that creates a more masculine-looking chest in transgender men. It’s one of many gender-affirmation procedures that relieve symptoms of gender dysphoria. Receiving care from a surgeon specializing in transgender procedures increases the chances of success.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/16/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Gender Affirming SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"