"Feminizing Hormone Therapy: What To Expect & How It Works800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Feminizing Hormone TherapyAdvertisementAdvertisementAdvertisementFeminizing Hormone TherapyFeminizing hormone therapy helps male-to-female transgender individuals (transwomen) achieve a more feminine appearance. It uses anti-androgens to block male hormones. Taking estrogen and progestin helps you develop breasts, softer skin, rounder hips and more.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is feminizing hormone therapy?This gender-affirming treatment uses female hormones to create a more feminine appearance. Feminizing hormone therapy may be used as a standalone treatment or combined with gender affirmation surgery.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho is feminizing hormone therapy for?Feminizing hormone therapy is an option for transwomen — people who were assigned male at birth (AMAB) but identify as women. This therapy is a common treatment for gender dysphoria (a condition in which differences between physical appearance and assigned gender cause distress).Nonbinary or intersex people may also choose to undergo feminizing hormone therapy. Nonbinary people have gender identities that don’t fit inside traditional male or female categories. Intersex people are born with reproductive or sexual characteristics that don’t fit traditional perceptions of male and female bodies. They may have conditions affecting their gonads, external genitals or chromosome patterns.Stated simply, feminizing hormone therapy is for anyone who feels that there’s a mismatch between their external appearance and their authentic sense of gender and self.What changes can I expect from feminizing hormone therapy?People assigned male at birth produce low levels of estrogen. Feminizing hormone therapy brings about physical and emotional changes that are more consistent with feminine anatomy and behavior.With this treatment, you will receive hormones and other substances. They include anti-androgens medication, estrogen and possibly progesterone.Anti-androgen therapy blocks male sex hormone (testosterone) production.Changes from anti-androgen therapy include:Decreased muscle mass.Fewer erections.Change in sex drive (libido).Smaller testicles.Thinning facial and body hair.Estrogen (estradiol) promotes physical changes that are more consistent with a feminine appearance.Progestin therapy may also help produce feminine physical changes. Changes from estrogen or progestin therapy include:Softer skin.More fat on the hips, buttocks and face.Full breasts.Mood changes, anxiety or depression.AdvertisementCan I undergo feminizing hormone therapy without help from a healthcare provider?Taking estradiol and progestins or anti-androgens without a healthcare provider’s guidance is dangerous. A healthcare provider will ensure you receive the correct dose for your needs. This helps you achieve the best possible results and avoid complications.What type of healthcare provider should I see?Many healthcare providers can help you, particularly ones specializing in transgender health.This may be a:Primary care physician.Endocrinologist.Gynecologist.Psychiatrist.AdvertisementProcedure DetailsAt what point in my gender transition can I start feminizing hormone therapy?The timing is up to you and your healthcare provider. Some people affirm their new gender identity first by changing their names and dressing differently. But this isn’t a requirement.Adolescents may wish to consider starting feminizing hormone therapy at age 16. Starting at a young age makes it possible to:Block the effects of puberty for their assigned gender.Proceed with puberty in a manner consistent with their authentic gender identity.How do I prepare for feminizing hormone therapy?There are many steps to help you prepare, including:Patient education to explain how treatment works and what to expect. This includes reviewing risks and benefits.Medical history to check for estrogen-dependent conditions, like certain breast cancers and endometriosis.Physical exam to ensure you are healthy enough to start feminizing hormone therapy.Lab tests, including a blood panel, urinalysis and liver function test.Mental health evaluation to make a gender dysphoria diagnosis. It also confirms your understanding of therapy and ability to agree (consent) to it.How does feminizing hormone therapy work?You start by taking anti-androgens to block testosterone production. Then, after a few weeks, you take estrogen. This hormone comes in many forms, including:Pills.Injection.Cream.Patch.People who choose feminizing hormone therapy start with a low dose of estrogen. The appropriate amount is different for each person. Your healthcare provider determines the type and dose that’s right for you.Starting with a low dose helps reduce the risk of complications and side effects. Then, as your body gets used to it, your provider will increase the dosage. After achieving the desired results, you take a lower dose for the rest of your life.How soon will I notice changes in my body?The speed at which changes occur depends on various factors. These include the dose and your body’s response. For most people, it takes 18 to 24 months to achieve the full effect.Risks / BenefitsWhat are the potential side effects of estrogen and anti-androgens?Side effects may include:Deep vein thrombosis (DVT).Electrolyte imbalance.Elevated blood sugar (hyperglycemia).High blood pressure.High potassium (hyperkalemia).Low blood pressure.OsteoporosisWater retention.How do I lower my risk of complications?Steps you can take to stay healthy on feminizing hormone therapy include:Seeing a healthcare provider experienced in transgender health.Taking estradiol, progestins and anti-androgens as prescribed.Maintaining follow-up appointments.What happens during follow-up appointments?These appointments enable healthcare providers to track your response to treatment. Care includes tests to check for signs of complications. These often include blood tests. Occasionally, you may need a bone density test (DEXA [DXA] scan).You can expect to see your healthcare provider:Every three months during the first year of hormone therapy.Every six to 12 months after that.Recovery and OutlookWhat is the outlook for transwomen on feminizing hormone therapy?Many transwomen find relief from gender dysphoria with this type of therapy. Having physical attributes that match your gender identity can ease anxiety and depression. Transwomen also have improved self-esteem and self-image. These factors contribute to a better quality of life.What other gender-affirming treatments are available to transwomen?Feminizing hormone therapy is often the first step in the gender affirmation process. Some transwomen also choose surgery to make more changes to their appearance. While surgery isn’t a requirement, there are many options available to you, including:Facial feminization: Procedures that transform the appearance of your face. It may include shortening the forehead or softening the angles of your jaw.Vaginoplasty: The procedure involves removing the penis, testicles and scrotum. Surgeons use the remaining tissue to create a functioning vagina.Voice feminization surgery: Surgeons alter the vocal cords to help you achieve a higher-pitched, more feminine-sounding voice.There is no right or wrong approach when it comes to gender-affirming treatments. What might be right for one person may not be right for you. It’s important to discuss your options with your provider in detail so you can achieve your desired results and live as your authentic self.When to Call the DoctorHow will I know if I need to see my healthcare provider between appointments?Certain side effects of estrogen and anti-androgens can be a sign of complications. Some can become severe or need immediate medical attention.Call your healthcare provider if you experience:Bulging eyes.Dizziness.Hives and swelling.Itchy skin.Joint pain.Muscle weakness.Tingling in your arms or legs (peripheral neuropathy).Vomiting.Yellowing of the skin or eyes (jaundice).A note from Cleveland ClinicLiving with gender dysphoria can be lonely and isolating. Many trans, nonbinary and intersex people also face discrimination in society, which can make anxiety and depression worse. Feminine hormone therapy can help address these issues by matching your appearance with your authentic gender identity. Discuss your options with your healthcare provider and take your first step to a more fulfilling life.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/04/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6568Appointments & LocationsRequest an AppointmentVirtual Visits for DiabetesFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"