"Fetal Surgery: What It Treats & How It's Performed800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Fetal SurgeryAdvertisementAdvertisementAdvertisementFetal SurgeryFetal surgery means operating on a developing fetus while it’s still in your uterus (in utero). It’s usually done to treat a life-threatening birth defect. It’s also done to repair spina bifida (myelomeningocele), improving outcomes for children born with the condition.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewWhat is fetal surgery?Fetal surgery is a procedure on a fetus while it’s still developing in your uterus. It’s also called in-utero or prenatal surgery. Your surgeon might call it “fetal intervention” if it’s simpler or less invasive. Fetal surgeons intervene to save the fetus or improve long-term outcomes after birth.When is fetal surgery needed?Some birth defects can threaten a developing fetus. For example, a large lung malformation may compress the fetus’s heart. This can lead to heart failure and death. Other conditions aren’t immediately life-threatening but cause disabilities after birth. Surgeons commonly treat these conditions after delivery. But treating them before birth can improve long-term outcomes.Who performs fetal surgery?A team of specialists performs fetal surgery. This may include:Highly trained pediatric surgeons who perform operations in-utero that they’d otherwise do after birth. They specialize in opening and closing your uterus and caring for you and the fetus.Maternal-fetal medicine specialists.Maternal and pediatric anesthesiologists.Fetal imaging specialists.Fetal cardiologists.Other surgeons who specialize in fetal surgical needs.How common is fetal surgery?Fetal surgery is still a new and emerging field in medicine. It’s only been around for about 30 years. There are only about 20 hospitals that offer fetal surgery in North America. Many centers have experience with the most common fetal procedures:Twin-to-twin perfusion syndrome.Repair of spina bifida.Ex-utero intrapartum treatment (EXIT) procedures for certain rare conditions.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow does fetal surgery work?Fetal surgeons use several techniques to operate on the fetus while it’s in your uterus. The technique they use will depend on the condition of the fetus and your health. They include:Open surgery. For open surgery, you’ll be under general anesthesia. Your surgeon first makes an incision in your abdomen to reach your uterus. Then, they make an incision in your uterus to reach the fetus. They keep the fetus inside your uterus while they operate. Then they close up your uterus and abdomen and let the pregnancy proceed to as close to term as possible.Fetoscopic surgery. For fetoscopic surgery, your surgeon operates through small, “keyhole” incisions in your uterus. It’s a minimally invasive method. To treat twin-to-twin transfusion syndrome or a diaphragmatic hernia, surgeons place a fetoscope — a tiny camera on the end of a long, fiber-optic tube — through your abdomen and into your uterus. Then they operate through the tube using long, narrow tools. To treat myelomeningocele (a type of spina bifida), your surgeon opens your abdomen to expose your uterus. They then place the camera and instruments through two to three smaller incisions in your uterus.Surgery at delivery. Surgeons perform some fetal procedures during a surgical delivery (EXIT procedures). Your surgical team places you under general anesthesia and gives you medications to relax your uterus. Then, your surgeon opens your uterus and partially delivers the fetus. Next, surgeons stabilize your baby before cutting the umbilical cord and separating it from the placenta. These procedures can relieve a blocked airway or remove a large tumor that may threaten your baby’s circulation or breathing when it’s born.What conditions can fetal surgery treat?Fetal surgery can treat the following fetal conditions:Monochorionic twin complications.Spina bifida (myelomeningocele).Congenital (present at birth) lung malformations.Congenital diaphragmatic hernia.Congenital high airway obstruction syndrome.Mediastinal or pericardial teratoma.Sacrococcygeal teratoma.Amniotic band syndrome.Lower urinary tract obstruction.Large neck masses that cause airway compression (teratoma or lymphatic malformation).Procedure DetailsWhat happens before fetal surgery?If you’re carrying a fetus with a congenital disorder, your healthcare team closely monitors you and the fetus. They’ll let you know exactly what condition affects the fetus, and determine a prognosis. They’ll then work with you and your family to help determine the best care plan.AdvertisementHow early can fetal surgery be performed?It depends on what condition affects the fetus. Fetal surgeons can do some minimally invasive procedures as early as 16 weeks. For more complex procedures, the ideal window is between 22 and 26 weeks of development.How is fetal surgery done?Fetal surgeons use different procedures to treat different conditions. For minor procedures, fetal surgeons use ultrasound and fetoscopy to visualize the fetus and then guide surgical instruments through small holes. Open surgery is more complex. Surgeons have to take care to keep the amniotic environment intact while operating. They use special staplers to prevent leaking and continuous infusions to replace lost amniotic fluid.Specific fetal interventions include:Open maternal-fetal surgery to repair spina bifida.Fetoscopic laser ablation for monochorionic twin complications.Fetoscopic endoluminal tracheal occlusion (FETO) for congenital diaphragmatic hernia.Shunt placement for chest fluid collections (pleural effusions) and urinary tract obstructions.Resection of teratomas and large lung lesions.EXIT procedure for airway obstructions or other conditions that impact the fetus’s breathing or circulation.AdvertisementWhat happens after fetal surgery?You’ll stay in the hospital for several hours to several days, depending on your procedure. Your healthcare team will continue to watch you and the fetus closely. Sometimes, they need to deliver early. For some procedures, you’ll need a planned C-section delivery even if your pregnancy continues to term. After birth, some babies need intensive care.Care at Cleveland ClinicFetal SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of fetal surgery?In most cases, healthcare providers only recommend prenatal surgery to save the fetus. Spina bifida is the exception to this rule. Since spina bifida symptoms progress as the fetus develops, repairing it earlier can reduce the damage it causes. Children born with repaired spina bifida are less likely to need treatment for hydrocephalus. They’re also more likely to have bowel and bladder control and be able to walk.What are the risks associated with fetal surgery?Your risks include:Side effects from medications, including low blood pressure and breathing too slowly or shallowly (respiratory depression).Blood loss, which may mean you need a blood transfusion.Uterine scar thinning or reopening (dehiscence), which adds risk to future pregnancies.The need to deliver current or future pregnancies by C-section.The fetus’s risks include:The chance that surgery will trigger preterm labor.Placental abruption, which could prevent the fetus from getting the nutrients it needs.Chorioamniotic membrane separation, which can cause complications.Chorioamnionitis (a rare infection of the amniotic fluid).When to Call the DoctorWhen should I see a healthcare provider about fetal surgery?If the fetus has a life-threatening defect and you’ve been told nothing can be done to save it, chances are something can be done. The field of fetal surgery is constantly advancing. And fetal surgeons continue to explore new strategies for treating congenital disorders. Get in touch with a hospital that specializes in fetal surgery. They’ll give you a personalized consultation to explore your options.A note from Cleveland ClinicWhen a congenital condition complicates your pregnancy, stress and emotions are high. This can make the decision process especially difficult for you and your family. You want the best outcome for everyone involved. Your healthcare team wants that, too. They’re there to offer you the information you need and the treatment you choose. They’ll be on your side, wherever your risk assessment lands.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/07/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFetal SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"