"Fibrinolytic (Thrombolytic) Therapy: Uses, Drugs & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Fibrinolytic (Thrombolytic) TherapyAdvertisementAdvertisementAdvertisementFibrinolytic (Thrombolytic) TherapyFibrinolytic therapy is used to dissolve blood clots that have suddenly blocked your arteries or veins. It improves blood flow and prevents damage to your tissues and organs. For best results, this emergency treatment should be given as soon as possible following a stroke or heart attack.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorResourcesContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorResourcesOverviewWhat is thrombolytic therapy?Thrombolytic therapy — also called fibrinolytic therapy — is the use of medications to break up blood clots that could lead to life-threatening problems, such as heart attack or stroke.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhen is fibrinolytic therapy indicated?Fibrinolytic therapy is most often used to treat heart attack (blocked arteries of your heart) and stroke (blocked arteries of your brain). But it can also treat:Pulmonary embolism (blocked arteries of your lung).Acute deep vein thrombosis (blocked veins of your leg).Acute arterial thrombosis (blocked arteries of your leg).Blocked catheters, dialysis fistulas or surgical bypasses.How is fibrinolytic therapy given?Your healthcare provider will either give you thrombolytic therapy drugs through an IV line (usually in a vein in your arm) or through a catheter (thin tube) that’s been placed at the site of the blood clot.Fibrinolytic therapy time frameIn the case of a suspected stroke, you should be given thrombolytic medications within 30 minutes after arriving at the hospital. (This means that you have a window of three to 4.5 hours after the onset of your symptoms.) Getting the medication in your system as soon as possible can reduce the risk of permanent damage.AdvertisementWho is a candidate for thrombolytic therapy?Precautions must be taken when considering thrombolytic therapy, and there are several situations in which this treatment can’t be used. You’re probably not a candidate for thrombolytic therapy if you:Are over the age of 75.Had prior bleeding into your brain.Are currently on blood-thinning medications.Have a history of stroke in the past three months.Have active bleeding or recent trauma or surgery.Have a known brain tumor.Are currently pregnant.Have uncontrolled high blood pressure.Have eye diseases related to diabetes.Have a severely low platelet count.Keep in mind, this isn’t an exhaustive list. When you arrive at the hospital, your healthcare provider will run tests to determine if you’re a candidate for thrombolytic therapy.What is an example of a thrombolytic drug?Thrombolytic agents are used to break up dangerous blood clots. The thrombolytic therapy drugs in use today are:Alteplase.Reteplase.Tenecteplase.AdvertisementProcedure DetailsWhat happens before thrombolytic therapy?Thrombolytic therapy is usually an emergency treatment. If your healthcare provider recommends this treatment, you’ll be transferred to an intensive care unit. There, your medical team will closely monitor your vital signs while they give you thrombolytic agents.What happens during thrombolytic therapy?Thrombolytic medications are delivered to the blood clot through an IV line or a catheter placed in your vein. During treatment, your providers use imaging tests — like CT scans or MRI — to see if the blood clot is dissolving successfully.In some instances, your healthcare provider may perform another type of therapy called mechanical thrombectomy. During this procedure, the blood clot is physically broken up using a long catheter with a tiny rotating device and suction cup.What happens after thrombolytic therapy?Following thrombolytic therapy, your healthcare provider will monitor your progress and determine if any residual pieces of the blood clot remain. In some cases, more treatment may be necessary, including stenting, balloon angioplasty or open surgery. Your provider will also likely place you on anticoagulants (blood thinners), such as warfarin or heparin to reduce the risk of future blood clots.Even with successful treatment, a clot can return in the same blood vessel. (This happens in about 12% of cases.) If this occurs, more aggressive treatment may be necessary.How long does thrombolytic therapy take?The duration of therapy varies from one hour to many hours depending on the type of blood clot being treated.Risks / BenefitsWhat are the advantages of thrombolytic therapy?Thrombolytic therapy can break down a blood clot and restart blood flow to your heart, brain, lungs or other vital organs. This can lessen the negative effects of a potentially fatal event.What are the risks or complications of thrombolytic therapy?The most common thrombolytic therapy side effects include bleeding and embolization (when small pieces of the blood clot break off and travel deeper into the affected organ).Bleeding may occur from your IV puncture wounds or other recent injury sites. Spontaneous bleeding can also develop in the following ways:Nosebleeds.Blood in your pee (urine).Blood in your poop (stool).Heavy vaginal bleeding.Brain bleed, which is rare.For most people, the benefits of thrombolytic therapy far outweigh the risks. Your healthcare provider can tell you if you’re a candidate.Recovery and OutlookWhat is the recovery time following thrombolytic therapy?Recovery times can vary depending on your unique situation. Generally, you can expect to spend at least one day in the hospital following thrombolytic therapy. However, if you have a severe medical condition, you may need to stay longer.What’s my prognosis after thrombolytic therapy?Thrombolytic therapy is successful most of the time. However, in up to 25% of cases, treatment is unable to dissolve the blood clot. In these cases, alternative treatment is necessary.Even if treatment is successful, the lack of blood circulation caused by the blood clot can lead to you permanent tissue or organ damage. Depending on the severity of this damage, you may need further treatment down the road.When to Call the DoctorWhen should I see my healthcare provider?If you’ve received thrombolytic therapy and develop complications — like excessive bleeding, pain or fever — call your healthcare provider right away. They can determine the cause of your symptoms and adjust your treatment accordingly.A note from Cleveland ClinicFibrinolytic therapy — or thrombolytic therapy — is an emergency treatment used to dissolve blood clots before they become fatal. If you or a loved one has a heart attack, stroke or another condition caused by a blood clot, fibrinolytic therapy can help prevent death and reduce long-term side effects. People who need fibrinolytic therapy should receive treatment as soon as possible, so call 911 or head to your nearest emergency room if you notice that something isn’t right. While fibrinolytic therapy has a relatively high success rate, you may still need further treatment to address underlying health problems.ResourcesBaig MU, Bodle J. Thrombolytic Therapy. [Updated 2021 Jun 17]. In: StatPearls [Internet]. Treasure Island (FL): StatPearls Publishing; 2021 Jan-. Accessed 4/18/2022.National Institutes of Health, National Library of Medicine. Thrombolytic therapy. Accessed 4/18/2022.RadiologyInfo.org. Catheter-directed Thrombolysis. Accessed 4/18/2022.Society for Vascular Surgery. Thrombolytic Therapy. Accessed 4/18/2022.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/18/2022.Learn more about our editorial process.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"