"Finger Splint: Types, Uses & Choosing the Right One800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Finger SplintAdvertisementAdvertisementAdvertisementFinger SplintFinger splints come in lots of shapes, sizes and materials. Your provider will tell you which type you’ll need and how long you’ll need to wear it.\n\nMake sure to wear the finger splint as often as your provider instructs. If you take it off too often or don’t wear it as frequently as they suggest, you might reinjure your finger or make it take longer to heal.ContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a finger splint?A finger splint is a medical device that stabilizes your finger and holds it in one position. It’s used to protect and support your finger after an injury. Healthcare providers sometimes call finger splints finger braces or orthoses.Which type of splint you’ll need to wear (and how long you’ll have to wear it) depends on the injury’s severity. Your healthcare provider will tell you how long you’ll need a splint and if you’ll need any other treatment. They’ll suggest treatments to help your finger heal and regain its usual function.How do finger splints work?A finger splint holds your injured finger in one position. You might see this referred to as immobilization. It’s made of a rigid material like metal or plastic. It also usually has a cushion of foam or padded fabric to prevent pressure sores on your finger while you’re wearing it.Whether you have a bone fracture or a damaged ligament or tendon, your finger needs time to recover before you can use it normally. A finger splint makes sure you don’t put stress on your finger while it heals.Depending on which type of injury you have, a splint will immobilize part or all of your finger. While your finger is in a splint, you won’t be able to move or bend it. This will help it heal. It’ll also help reduce pain and inflammation.Finger splint typesThe type of splint you’ll need depends on your injury. Your healthcare provider will tell you which type of splint you should buy and how to use it.The most common types of finger splints include:Gutter splints: A stiff material (usually metal or plastic) shaped like a U or half a circle that runs under and around your finger. Your finger fits into the gutter splint and is supported from the sides and the palmar side (the same side your palm is on).Ulnar gutter splints: These are a variation of gutter splint that starts at your forearm, covers your wrist and wraps around your ring and pinkie fingers.Two-finger splints: Your injured finger is surrounded with metal or plastic, then taped or bandaged to the finger next to it. You might see two-finger splints referred to as buddy splints.Stack splints: Stack splints fit over the end of your injured finger and cover the tip, the palmar side and the sides of your finger.Dynamic splints: A frame that might have a spring or hinged joint surrounds your finger on the palmar side and sides. Dynamic splints let you move your finger with support (in the same way you can move your knee while wearing a knee brace). They can be helpful if your provider recommends stretches or movements as part of your recovery.Thumb spica splints: Spica splints start at your forearm, cover your wrist and wrap around your thumb.What conditions do finger splints treat?Some of the most common conditions finger splints treat include:Mallet finger.Sprained fingers.Some types of broken fingers.Finger dislocations.Osteoarthritis.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyRisks / BenefitsWhat are the benefits of finger splints?Finger splints are easier to apply and remove than other forms of immobilization (like casts). They’re also adjustable, usually with Velcro®, fabric straps or tape. This is especially helpful if your finger is swollen right after the injury.They’re usually smaller and take up less space on your hand or wrist than casts, which should make it slightly easier to go through your daily routine. If your provider says it’s safe, you can remove a splint when you’re showering or bathing.Wear your splint as often as your provider suggests. This will help your injury heal correctly and as quickly as possible.Finger splints vs castsCasts and splints are both devices healthcare providers use for immobilization after injuries.Casts usually provide more support and protection than splints. They’re usually made from plaster or fiberglass and are custom-molded to the shape of your injured body part. It’s rare to need a cast for an injured finger, but you might need a cast if you break a bone in your hand or wrist.Splints usually provide less support than casts, but are easier to use. They’re typically pre-made devices that aren’t custom fit to your finger or body — your provider might recommend a custom-fitted splint, but it’s less common. You can buy splints over the counter (OTC) at pharmacies or retail stores. They can be adjusted or removed (if your provider says it’s safe).What are the risks of using finger splints?Finger splints have very few risks. However, some complications from wearing a splint include:Skin.Pressure sores.Nerve impingement.Infections.Recovery and OutlookHow long do I have to wear a finger splint?How long you’ll need a splint depends on the original injury. People usually need to wear a splint for a few weeks, but you might need it for a month or longer. Your provider will tell you how long you need to wear a splint.Follow your provider’s instructions about when it’s OK to remove a splint. They’ll tell you which activities are safe to do without the splint on, especially for physical therapy or other exercises they suggest.AdvertisementHow can I manage my symptoms?Depending on what caused your injury, you should be able to take over-the-counter (OTC) pain relievers, like NSAIDs (nonsteroidal anti-inflammatory drugs) or acetaminophen, to manage symptoms like pain and swelling. Talk to your provider before taking pain relievers for more than 10 days in a row.Talk to your provider if the pain is getting worse or doesn’t feel better after taking pain relievers.When to Call the DoctorVisit your provider if you’re experiencing any of the following symptoms:Severe pain.Swelling that’s getting worse.Discoloration or bruising.You can’t feel your finger, or you feel like the sensation in your finger is changing.A note from Cleveland ClinicFinger splints are one of the most common medical devices prescribed to treat a variety of injuries. You can probably buy one online or at your local pharmacy.Talk to your healthcare provider about which type of finger splint you need. They’ll show you how to wear your splint safely.Even if it’s annoying to have something covering your finger, wear the splint as often as your provider instructs to help your injury heal correctly and as fast as possible.Care at Cleveland ClinicGet Orthopaedic CareMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/12/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Orthopaedic CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2606Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"