"Foreskin Restoration (Circumcision Reversal): Risks & Benefits800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Foreskin RestorationAdvertisementAdvertisementAdvertisementForeskin RestorationForeskin restoration is a process that reverses a circumcision. You won’t get your old foreskin back. But you can stretch penile skin over time to create a new foreskin or surgically attach skin from another area of your body to your penis. Risks depend on the approach, but may include dissatisfaction with how your new foreskin looks.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is foreskin restoration?Foreskin restoration is a procedure that restores your foreskin (prepuce) after circumcision.The foreskin is a layer of skin that covers the head of your penis (glans). Most children assigned male at birth (AMAB) are born with a foreskin. Some medical experts believe it helps protect your penis and increases sexual pleasure. Others believe that removing the foreskin helps reduce your risk of developing certain conditions, including:Sexually transmitted infections (STIs).Genital ulcers.Penile inflammatory disorders, including balanitis.Tight foreskin that you can’t pull back (phimosis).Penile cancer.Foreskin restoration doesn’t restore your original foreskin. But it creates new skin tissue around the head of your penis. It isn’t a mainstream or widely accepted practice among healthcare providers who specialize in urinary/reproductive systems and penile surgery (urologists).Why should I restore my foreskin?Restoring your foreskin is a personal decision. It’s normal and healthy to have foreskin or remove it. You may wish to restore your foreskin to:Pursue your wants and desires for your body. Circumcision is the most common surgery in men and people AMAB. And most people get circumcised shortly after birth when they can’t give their approval (consent) for what happens to their body. Restoring your foreskin can be empowering.Improve sexual satisfaction. Foreskin may make your glans more sensitive, though there haven’t been many studies to confirm this. As a result, some people believe restoring your foreskin may make sexual intercourse and masturbation more pleasurable.What are the different foreskin restoration techniques?There are two different foreskin restoration techniques:Tissue expansion (stretching). During tissue expansion, you may use your hands, tape, straps, weights (Foreballs ) or a tissue expansion device to pull your penile skin toward the head of your penis. Over time, your skin forms additional skin cells that allow it to stretch and form a new foreskin that covers your glans. Tissue expansion is a gradual process. It may take several years of regular stretching to restore your foreskin fully. There isn’t enough data to confirm whether tissue expansion has good long-term results. Don’t attempt tissue expansion without first talking to a healthcare provider.Surgery. Surgical foreskin restoration involves taking skin from another area of your body and transplanting it to your penis (skin graft).How common is foreskin restoration?There aren’t many healthcare facilities that offer surgical foreskin restoration. If you have questions about foreskin restoration, talk to a primary care physician (PCP), urologist or plastic surgeon.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow should I prepare for foreskin restoration?You should talk to a healthcare provider before you attempt tissue expansion on your own. Many devices claim to be able to restore your foreskin safely. But they don’t have U.S. Food and Drug Administration (FDA) approval. You risk permanently damaging your skin and the sensory nerves that allow your penis to feel sensations.Before foreskin restoration surgery, you’ll meet with a healthcare provider. They’ll conduct a physical examination to evaluate your general health, including any preexisting health conditions or risk factors.Tell them about any prescription or over-the-counter medications you’re taking, including herbal supplements. Certain medications and herbal supplements can increase your risk of bleeding during surgery.You should also bring up any allergies you have. These include allergic reactions to:Medications.Skin cleaners, like iodine or isopropyl alcohol.Latex.Foods.They’ll also ask questions, which may include:Why do you want to restore your foreskin?What are your expectations?Do you think a lot about imagined or very small defects with your body?Is a spouse, partner or friend encouraging you to restore your foreskin?A healthcare provider may also take photographs of your penis for your medical records.What happens during foreskin restoration?Tissue expansionDuring tissue expansion, you gently stretch the skin on the shaft of your penis while it’s flaccid (soft) and/or erect (hard). You can use your hands or use different devices that claim to restore your foreskin. You may have to wear a device for several hours every day for months or even years to stretch your penile skin to your desired length.Foreskin restoration surgeryForeskin restoration surgery takes place in a hospital. Your surgical team generally consists of:Dermatologic surgeon. A dermatologic surgeon is a healthcare provider who specializes in skin surgery.Anesthesiologist. An anesthesiologist is a type of doctor who specializes in giving you anesthesia. Anesthesia reduces your pain during medical procedures or surgery.Surgical nurses. Surgical nurses help care for you before, during and after the surgery. They may also assist your surgeons.Shortly before foreskin restoration surgery, your anesthesiologist will give you general anesthesia so you sleep through the procedure and won’t feel any pain.Once you’re asleep, your surgical team will:Make incisions (cuts) to remove healthy skin from another area of your body (donor site). They’ll usually choose an area that contains tissue similar to the tissue that makes up your penis, such as your scrotum (the pouch of skin behind your penis that holds your testicles).Place the healthy skin over your penis.Use sutures (stitches) to secure the skin to your penis.Put bandages over your penis and donor site.How long does it take you to restore your foreskin?It depends on the type of foreskin restoration.Tissue expansion can take months or even years of regular stretching before the skin is long enough to cover the head of your penis.Foreskin restoration surgery usually takes fewer than two hours.AdvertisementWhat happens after foreskin restoration?After foreskin restoration surgery, your anesthesiologist will stop putting anesthesia into your body and you’ll move to a recovery room. Healthcare providers will wait for you to wake up and monitor your overall health.They’ll also give you instructions on managing your pain and promoting healing. This may include:Pain relievers or over-the-counter pain medicine like nonsteroidal anti-inflammatory drugs (NSAIDs) or acetaminophen (Tylenol®).Changing bandages and applying antibiotic cream or aloe vera cream.Avoiding certain physical activities that could damage your penis or the donor site, such as running, strenuous exercise and sexual intercourse.Care at Cleveland ClinicUrology CareMake an AppointmentRisks / BenefitsWhat are the benefits of foreskin restoration?Possible foreskin restoration benefits include:Boosted self-esteem.Reduced irritation on the head of your penis from clothing or during sexual intercourse.Some individuals claim that foreskin restoration improves penile sensitivity during sexual intercourse. But there isn’t enough research to support this.Some also claim the procedure provides natural lubrication during sexual intercourse. There isn’t any research to suggest that restored foreskin leads to better lubrication.Does foreskin restoration actually work?That depends on what your goals are. The primary goal of foreskin restoration is to give the appearance of an uncircumcised penis. But the restored foreskin doesn’t function like normal foreskin because it isn’t the same type of skin. Natural foreskin’s inner layer is mucosal, which is different from external skin.Foreskin restoration also isn’t a common surgical procedure, and tissue expansion may take up to several years to see results.AdvertisementWhat are the risks or complications of foreskin restoration?Tissue expansion risks include:It takes a long time to see results.You don’t have control over how your skin stretches. It may stretch unevenly, affecting how it looks and decreasing your satisfaction with the results. It also won’t pinch toward the end (taper).A fused appearance between your scrotum skin and penile skin (penoscrotal webbing). Penoscrotal webbing can cause pain when you get erections and make sexual intercourse difficult.Foreskin restoration surgery risks include:You’re not happy with how it looks.Anesthesia risks, including nausea and vomiting, chills and confusion.Blood or pus pooling under your new foreskin.Infection.Swelling.Bruising.Scarring.Recovery and OutlookWhat is the recovery time?Your body is unique, so your recovery time after foreskin restoration may differ from others. Talk to your healthcare provider. They can give you a better idea of when you can return to your regular activities after foreskin restoration.When should I see a healthcare provider for follow-up visits?Your healthcare provider will want to see you for follow-up appointments after foreskin restoration surgery to ensure you’re healing properly. They may also remove your stitches. They may also recommend physical therapy (PT) to improve your new foreskin’s ability to stretch (elasticity) and prevent scar tissue from developing.When can I go back to work/school?Tissue expansion shouldn’t prevent you from missing any school or work. If you have foreskin restoration surgery, you should take at least a few days off for the procedure and recovery. You may need more time off if you have a physically demanding job. Your surgeon will tell you what to expect.When to Call the DoctorWhen should I call a healthcare provider?Reach out to your healthcare provider if you have the following symptoms:Signs of infection, including fever, chills or pus that drains from your surgical sites.Excessive bleeding.Severe pain.Pain that doesn’t get better with medications.A note from Cleveland ClinicRestoring your foreskin is a personal decision, and there are many reasons why you may want to do it. Most people who wish to restore their foreskin want the appearance of an uncircumcised penis. It can also make you feel good to reclaim decisions about your body. But talking to a healthcare provider is important, especially before attempting tissue expansion. They can answer your questions and concerns and explain the risks and potential results.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/18/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicUrology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"