"Frenectomy (Tongue-Tie Surgery): Procedure & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Frenectomy (Tongue-Tie Surgery)AdvertisementAdvertisementAdvertisementFrenectomy (Tongue-Tie Surgery)A frenectomy is an oral surgery procedure that treats a lip-tie or tongue-tie. It may be used to increase your tongue’s range of motion or help close a gap between two teeth. Frenectomy is a simple treatment that offers a wide range of benefits.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewA frenectomy can address both lingual and labial frena.What is a frenectomy?A frenectomy — sometimes called a frenulectomy — is an oral surgery procedure that treats lip-tie or tongue-tie. During the procedure, your surgeon cuts or modifies a frenum (also called frenulum) — a band of connective tissue that joins two areas. In your mouth, frena (the plural of frenum) can join your lips to your gums or your tongue to the floor of your mouth.You have multiple frena in your mouth. Most of the time, they don’t cause any issues. However, if a frenum is too short or too tight, it can cause oral health problems and may have a negative impact on speech. In babies, it can cause issues with breastfeeding (chestfeeding) and swallowing.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs a frenectomy?Most of the time, frenectomies are performed on babies who are having feeding issues or if there are speech concerns. But sometimes, frenectomies are necessary for adults, too. For example, sometimes a frenum can be so tight that it pulls your gums away from your teeth. A frenectomy frees the band of connective tissue, reducing the risk of gaps, gum recession and other oral health problems.What is the purpose of a frenectomy?There are many reasons why you or your child might need a frenectomy. Your healthcare might recommend this procedure to correct a frenum that’s causing:A lip-tie, which limits lip movement.A tongue-tie, which limits your tongue’s range of motion.Diastema (a gap between your teeth), which may be cosmetically displeasing to some people.Gum recession, which can lead to gingivitis, cavities and mobility.Pain, swelling or tenderness with brushing or oral care.AdvertisementProcedure DetailsWhat are the types of frenectomies?There are two main types of oral frenectomies:Lingual frenectomy: This procedure removes or modifies the band of tissue that connects the underside of your tongue to the floor of your mouth. Lingual frenectomies are used to correct tongue-ties.Labial frenectomy: Sometimes called a maxillary frenectomy, this procedure removes the band of tissue that connects your upper gums to your front teeth. Labial frenectomies are used to correct lip-ties. It’s important to note that labial frenectomies can be performed on the lower lip, too — but upper lip frenectomies are more common.What happens before this procedure?Before your frenectomy, your healthcare provider will review your health history. They’ll also discuss the need for sedation and options for sedation, which may include nitrous oxide (laughing gas), oral sedation or IV sedation. Note: Sedation isn’t always necessary for a frenectomy. Your healthcare provider will help determine if it’s right for you or your child.When should frenectomy be done?It depends on the situation. Babies can have frenectomies quickly and with little discomfort just a few weeks after delivery. No matter what your situation, your healthcare provider can help determine the best time for your frenectomy.AdvertisementWhat happens during this procedure?In infants, the frenulum is removed using scissors. Usually, this is quick and takes a few minutes. In older children and adults, your healthcare provider may numb your tissue around the frenum with local anesthesia. Once you’re comfortable, they’ll remove or modify your frenum using a scalpel or surgical scissors. In some cases, sutures (stitches) may be necessary to close the incision. Typically, the procedure takes 30 minutes or fewer.What happens after this procedure?Following your frenectomy, your healthcare provider will give you detailed postoperative instructions.In infants, usually no further care is needed and they can resume feeding immediately.You may need pain relievers to manage any discomfort and you may need to use antibacterial mouthwash. Your healthcare provider may want to see you in a week or two to monitor healing.Care at Cleveland ClinicSchedule Oral and Maxillofacial SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of this procedure?Frenectomy surgery offers a number of benefits. For example, this procedure can:Improve breastfeeding problems in infants.Improve speech problems caused by tongue-tie.Reduce your risk of tooth decay, gum disease and other oral health problems.Enhance the appearance of your smile by eliminating gaps.What are the risks or complications of this procedure?Like all procedures, a frenectomy is associated with possible risks and complications. Risks of frenectomy surgery include:Bleeding.Infection.Injury to salivary ducts that drain near the tongue-tie.Pain.Swelling.Allergic reaction to anesthesia.Reattachment of frenum (rare).Recovery and OutlookHow long does it take to recover from a frenectomy?In infants, recovery is quick, and babies usually feed without difficulty immediately. In children and adults, recovery after a frenectomy usually takes about three to five days. Your healthcare provider will give you instructions for managing any discomfort during the healing phase.When can I go back to work or school?Following a frenectomy procedure, most people can go back to work, school and other routines after one day.When can I eat or drink?You can sip liquids immediately after your procedure. You should wait to eat until the numbness from the anesthesia wears off. Stick with soft foods for the first few days, then gradually try more solid foods as you become more comfortable.When to Call the DoctorWhen should I see my healthcare provider?If you think a frenum is interfering with eating, speaking or other functions, call your healthcare provider right away. They can perform an examination to determine whether a frenectomy is necessary.If you’ve already had frenectomy surgery, be sure to call your doctor if you develop a fever, pus or other signs of infection.A note from Cleveland ClinicIf you or your child has a lip-tie or tongue-tie that’s interfering with function or quality of life, talk to your healthcare provider to see if a frenectomy is right for you. Frenectomy surgery is a quick, straightforward procedure that can address a wide range of issues. Risks and complications are minimal — and in most cases, frenectomy surgery is completed quickly.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/11/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Oral and Maxillofacial SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"