"Frequency-Specific Microcurrent: What Is It, Procedure Details & Risks800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Frequency-Specific MicrocurrentAdvertisementAdvertisementAdvertisementFrequency-Specific MicrocurrentFrequency-specific microcurrent (FSM) is a way to relieve pain using very low levels of electrical current. This treatment option can be used on specific tissues in your body to help with pain caused by injuries or medical conditions. It’s typically painless.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsOverviewWhat is frequency-specific microcurrent (FSM)?Frequency-specific microcurrent (FSM) is a technique for treating pain by using low-level electrical current. The current is delivered to certain parts of your body in an attempt to relieve pain.A frequency is the rate at which a sound wave or electronic pulse is produced. This measurement is registered in hertz (Hz). During FSM treatment, various frequencies can be used to potentially reduce swelling (inflammation), repair tissue and reduce pain.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow does frequency-specific microcurrent (FSM) work?When you’re treated with FSM, your healthcare provider uses a special device to deliver a mild electrical current to certain parts of your body. The electrical current used in this treatment is extremely mild — one millionth of an ampere. Such a small amount of electrical current is safe. Interestingly, the human body actually produces its own current within each of your cells.Depending on the tissue involved, specific frequencies will be selected to encourage natural healing of the body and to reduce your pain. There are frequencies for nearly every type of tissue in your body.One of the ways FSM works is by potentially increasing the production of a substance called ATP that’s inside injured tissues. ATP is the major source of energy for all cellular reactions in your body. Because treatment with FSM can increase the amount of ATP that’s created in your damaged cells by as much as 500%, this treatment may help with your recovery. Depending on the condition, treatment with FSM can “loosen” or soften the muscles, which can help relieve pain or stiffness.What conditions can be treated with frequency-specific microcurrent (FSM)?FSM is most often used to treat pain, especially nerve and muscle pain, inflammation, and scar tissue, from the following conditions:Shingles.Burns.Kidney stones.Asthma.Irritable bowel syndrome.Disc injuries.Fibromyalgia.Diabetes-related neuropathy.Neuromas (overgrowth and scarring to a nerve after an injury).Tendinopathy (inflammation and/or swelling of the tendon).Acute (sudden) and chronic (long-term) musculoskeletal injuries.Acute and chronic neuropathic (nerve) pain.Chronic fracture and bone pain.Arthritis.Torticollis (the head is tilted to one side).Disc injuries/discogenic- and facet-based pain.Viscerally-referred pain.Concussions.Headaches.Plantar fasciitis (pain in the heel and foot).Sports injuries.Wounds.AdvertisementIs frequency-specific microcurrent (FSM) painful?In general, frequency-specific microcurrent treatment is non-invasive and painless. The currents used in FSM are so low that you may not even feel them. During FSM treatment, you might feel a warmth and softening of the affected tissues.Procedure DetailsHow is frequency-specific microcurrent (FSM) applied?During your FSM treatment, your healthcare provider will first set the frequencies that are going to be used for your particular condition. In many cases, the frequencies are set at two different levels — for example, one microcurrent channel might be set at 10 Hz and the second at 40 Hz. The current is usually applied with a moistened towel or with skin patches. It’s very important that you’re well hydrated before your FSM treatment. Make sure you drink plenty of fluids leading up to your appointment.AdvertisementHow long do the effects of a frequency-specific microcurrent (FSM) treatment last?Depending on the condition and your level of pain, the effects of an FSM treatment for pain can last several days or longer. For acute injuries, lasting pain relief can often be achieved.Risks / BenefitsAre there any situations in which frequency-specific microcurrent (FSM) should not be used?There are certain groups of people who shouldn’t receive FSM treatment, including:People with pacemakers.People with implanted pumps.Pregnant women.People who have uncontrolled seizures.Certain frequencies also shouldn’t be used in cases of acute infection, new scar tissue (within six weeks) and acute fractures. Make sure to talk about any of these concerns with your healthcare provider before treatment.What are the risks and side effects of frequency-specific microcurrent (FSM) treatment?The side effects of FSM treatments are usually very rare and mild. If you do experience side effects, they could include:Nausea (feeling sick to your stomach).Drowsiness.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/29/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2606Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"