"Fulguration: Definition, Types & Procedures800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/FulgurationAdvertisementAdvertisementAdvertisementFulgurationFulguration is a type of electrosurgery. In electrosurgery, healthcare providers use tools to direct high-frequency electrical currents from an electrosurgical generator to electrodes on your skin. In fulguration, healthcare providers create a spark between the tool and electrodes on your skin.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is fulguration?Fulguration (electrofulguration and/or electrocoagulation) is a type of electrosurgery. Electrosurgery operates on an ancient principle: Heat can heal.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow does electrosurgery work?Electrosurgery works by turning up the heat on abnormal cells. In electrosurgery, high-frequency electrical currents from an electrosurgical generator flow through your skin toward specific cells that might have formed benign or cancerous tumors.Since skin doesn’t conduct electrical energy, the electrical currents continuously raise the cells’ internal temperature. Target cells die instantaneously when the cells’ internal temperature hits 140 degrees Fahrenheit (60 degrees Celsius). Cells dry out once their internal temperature increases to 194 degrees Fahrenheit (99 degrees Celsius.) And cells vaporize when their internal temperature reaches 212 degrees Fahrenheit (100 degrees Celsius).To perform electrosurgery, healthcare providers use a special tool to send electric currents through your body toward the target cells. You’re given anesthesia before the procedure so you won’t feel the electrical currents or the heat they generate.How does fulguration work?Fulguration works on the same principle as electrosurgery. The difference is healthcare providers don’t make a direct connection between the electrical current and your skin. Instead, they hold the probe over your skin to create a spark to generate enough heat to kill the targeted cells.Sometimes, healthcare providers target growths with tiny wire loops carrying electrical currents. The loop generates heat to remove the growths and stop bleeding.AdvertisementWhat are other forms of electrosurgery?There are several types of electrosurgery, including:Electrodessication, which destroys abnormal cells by drying out tissue.Electrocoagulation, which causes bleeding blood vessels to clot.Electrosection, which involves cutting through tissue.What’s the difference between fulguration and cryoablation?Fulguration and other electrosurgery use electrical currents to remove or destroy abnormal cells. Cryoablation freezes cells with extremely cold gas.Is fulguration the same as ablation therapy?Ablation therapy uses microwaves, high-energy radiofrequency, lasers or cryoablation to remove or destroy abnormal cells. In ablation therapy, healthcare providers deliver treatment through thin probes inserted through your skin. Fulguration delivers heat through electrical currents without inserting a probe into your skin.What is cystoscopic fulguration?Cystoscopic fulguration is one way of treating urinary tract problems. Healthcare providers use a scope to view the inside of your bladder and urethra. Then they use fulguration to treat the problem.When do healthcare providers use fulguration?Healthcare providers use fulguration to destroy abnormal cells or growths on your skin or inside of your body. The growths can be benign, like the growths that cause endometriosis or condyloma (genital warts). They can be pre-cancerous, like actinic keratosis, which can become squamous cell carcinoma, or cancerous. Here are some examples of how providers use fulguration.Fulguration of skin cancer and other skin conditions.Fulguration of bladder cancer. This procedure is also known as Transurethral Resection of Bladder Tumor (TURBT). Healthcare providers perform TURBT to diagnose and treat your early bladder cancer. They use fulguration to kill cancer cells and to prevent bleeding.Fulguration of cervical cancer. This procedure is known as Loop Electrosurgical Excision Procedure (LEEP). Healthcare providers use fulguration to heat the tiny surgical wire in the LEEP tool.AdvertisementProcedure DetailsWhat happens before procedures using fulguration?Before your procedure is scheduled, your healthcare provider will explain how fulguration works and why they recommend using it to treat your specific medical condition.Most procedures involving fulguration are done on an outpatient basis. Since fulguration is used in different ways for different procedures, your healthcare provider will tell you what to do on the day of your procedure.You’ll receive local, regional or general anesthesia before the procedure.What happens during fulguration?Here’s what your fulguration procedure might entail:You’ll lie down on an exam table so healthcare providers can place a pad on your body. The pad has electrodes to move electric currents out of your body and back to the source.Healthcare providers use specially designed electrosurgical generators to access electrical current. The generator is modulated or set to high-frequency, short-wave currents.The generators send and receive electrical currents through two conduits or cords. One cord is attached to the tool or tip that carries electricity to your body. The other cord is attached to the return electrode on your body.Electrical currents from the generator pass through the tool or tip to the return electrode on your body.In fulguration, the tool or tip doesn’t touch your body. Instead, the tool or tip generates a spark that eventually creates enough heat in your body to break down the targeted growths. (In cystoscopic fulguration, the tool does touch the area of your body that’s being treated.)The currents then pass from your body through the return electrode, returning to the electrosurgical generator.What happens when fulguration is used to treat bladder problems or cervical cancer?Fulguration plays different roles to diagnose and treat bladder conditions, including bladder cancer, and cervical pre-cancer and cancer.How is fulguration used in bladder cancer surgery?In bladder surgery, healthcare providers use fulguration after they’ve removed tissue for examination. You’ll receive anesthesia before this procedure.Healthcare providers use a rigid instrument called a resectoscope to access your bladder and remove tumors without making incisions. The resectoscope has a tiny wire loop that can carry electrical currents. Providers use the loop to surgically remove your tumor and burn the tumor site, destroying any remaining cancer cells and preventing bleeding.How is fulguration used in cervical surgery?Healthcare providers use fulguration to remove abnormal cells in your cervix. Cervical surgery typically involves gently inserting a speculum into your vagina so your provider can see your cervix. After injecting or placing a numbing medication on your cervix, your healthcare provider uses the speculum to guide a loop made of thin, electrically charged wire to your cervix. The loop is passed over the cervix, cutting a thin layer of tissue containing abnormal cells.What happens after fulguration?Fulguration is used differently depending on the specific medical need. Fulguration typically involves anesthesia, though. Like any surgery that involves anesthesia, you’ll need some time to recover before leaving your healthcare provider’s office or healthcare facility. Your provider will tell you what to expect and what to do during your recovery.Risks / BenefitsWhat are the advantages of fulguration?Fulguration is a minimally invasive surgery that treats medical conditions without requiring healthcare providers to make large incisions or cuts in your body.What are the risks of fulguration?Electrosurgery, including fulguration, carries several specific risks. Healthcare providers who use fulguration complete specific training focused on reducing potential risks. Risks include:Electric shocks that might affect you and your healthcare providers.Electric or thermal burns from fire or explosions. Healthcare providers take preventive steps such as ensuring you don’t come in content with metal during your procedure and using nonflammable cleansers.Infections caused by toxic gases. Electrosurgery can generate surgical smoke and aerosolized blood droplets that can spread infections, viruses and bacteria. Healthcare providers prevent toxic gases by using smoke-evacuation systems, face masks, protective eyewear and surgical gloves.Recovery and OutlookWhat is the recovery time after fulguration?Fulguration is used for different procedures, from removing skin cancers to removing benign growths from your cervix to removing cancerous tumors from your bladder. Each procedure has different recovery times. Before your procedure, ask your healthcare provider what to expect after your procedure.When to Call the DoctorWhen should I see my healthcare provider?You should contact your provider any time you have the following symptoms:Fever above 101 degrees Fahrenheit (38.3 degrees Celsius).Unusually heavy bleeding from your surgical site.A note from Cleveland ClinicUsing electricity as medical treatment might sound like science fiction. But electrosurgery has been used for centuries. Fulguration is a medical mainstay that dates back to the early 1900s. Healthcare providers of that time named the process after the Latin term for lightning because fulguration creates sparks to generate healing heat that destroys abnormal cells in your body and helps stop bleeding.Healthcare providers understand and place a priority on safe ways to use fulguration and other electrosurgery. If your healthcare provider recommends fulguration, ask them for procedure details so you understand how electrosurgery can power your medical treatment.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/17/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"