"Functional Endoscopic Sinus Surgery (FESS): Procedure & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Functional Endoscopic Sinus Surgery (FESS)AdvertisementAdvertisementAdvertisementFunctional Endoscopic Sinus Surgery (FESS)Functional endoscopic sinus surgery (FESS) is minimally invasive surgery for serious sinus conditions. Healthcare providers use nasal endoscopes — thin tubes with lights and lens — to ease your sinus symptoms without making incisions in or around your nose. Studies show between 80 % and 90% of people who’ve had this surgery feel it solved their sinus issues.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewFunctional endoscopic sinus surgery (FESS) is a minimally invasive procedure that's used to unblock the sinus openings.What is functional endoscopic sinus surgery?Functional endoscopic sinus surgery (FESS) is minimally invasive surgery for serious sinus conditions. Healthcare providers use nasal endoscopes — thin tubes with lights and lenses — to ease your sinus symptoms without making incisions in or around your nose.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy do people call it functional endoscopic sinus surgery?Functional endoscopic sinus surgery is also called endoscopic sinus surgery. Some healthcare providers use the term “functional” because the surgery is done to restore how your sinuses work, or function.When would I need functional endoscopic sinus surgery?Your healthcare provider may recommend FESS if you have chronic sinus inflammation or a chronic sinus infection that doesn’t improve with medical treatments, such as antibiotics and medications to manage allergies.You develop sinusitis when the tissue that lines your sinuses begins to swell, trapping mucus that typically flows through your sinuses and out through your nose. The trapped fluid can grow bacteria that can cause infections. Healthcare providers may also recommend surgery if you have nasal polyps.AdvertisementHow does my healthcare provider decide if I need functional endoscopic sinus surgery?Your healthcare provider will review your medical history and do a physical examination. Tests they may use include:Nasal endoscopy. Your healthcare provider checks your nasal passages and your sinuses through an endoscope for signs of infection or inflammation.Computed tomography (CT) scan. This test helps your healthcare provider determine which parts of your sinuses are affected.Procedure DetailsWhat happens before this procedure?Your healthcare provider will let you know what to do before your surgery. Every person’s situation is different, but most healthcare providers recommend the following:If you smoke, stop smoking at least three weeks before your surgery. Smoking can make your sinus symptoms worse. Ask your healthcare provider for advice or resources to help with this.Don’t take aspirin for at least 10 days before your surgery. Even small amounts of aspirin can increase how much you bleed during and after your surgery.If your surgery involves general anesthesia, don’t eat or drink anything after midnight the day of your surgery.Your healthcare provider will administer general anesthesia just before your surgery begins.AdvertisementHow is functional endoscopic surgery performed?FESS is the standard procedure to treat serious sinus conditions. Healthcare providers continue to refine their approach. Here’s an overview of the process:Your healthcare provider puts decongestant medication in your nose.They do a follow-up nasal endoscopy.They inject a numbing solution into your nose.Using the endoscope, they gently enter your nose. They insert surgical tools alongside the endoscope to use the endoscope to remove bone, diseased tissue or polyps that may be blocking your sinuses.They may also use a small rotating burr to scrape out tissue.Finally, your healthcare provider may pack your nose with material to absorb any blood or discharge.How long does functional endoscopic surgery take?Everyone’s situation is different, but most functional endoscopic surgeries last about two hours.What happens after functional endoscopic sinus surgery?You’ll spend some time in a recovery room so your healthcare provider can monitor your condition. You won’t be able to drive after surgery, so you’ll need someone to take you home and stay with you that first night. Your healthcare provider will tell you what to expect after surgery. Here’s some general information:Avoid blowing your nose for at least seven days. If you need to sneeze, keep your mouth open or sneeze into your sleeve or a tissue.When you sneeze, you may blow out bloody discharge or mucus. This may go on for a few weeks while your sinuses heal.Take a break from strenuous activity for the next 10 days.Your healthcare provider may recommend you rinse your nose and sinuses with saline.Care at Cleveland ClinicSchedule Sinus SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are FESS complications?All surgeries come with potential complications and risks. For the most part, FESS has relatively few complications. Your healthcare provider will tell you about potential complications, but a few you may experience include:Losing your sense of smell. Some people report losing all or part of their sense of smell.Tearing eyes. FESS or sinus inflammation may cause your eyes to tear up.Unusually heavy bleeding. While there’s little risk of heavy bleeding with FESS, you may bleed more than usual. If that happens, your healthcare provider may place packing in your nose and recommend you stay in the hospital so healthcare providers can monitor your situation.Leaking cerebral spinal fluid (CSF). This is a rare complication that affects fluid surrounding your brain. If it leaks, you could develop meningitis or inflammation of your brain.Problems seeing. A few people have reported losing vision in one eye or having double vision after their surgery.Recovery and OutlookHow long does it take to recover from functional endoscopic sinus surgery?It can take a few months before you feel as if you’re back to normal. Most people go back to school or work in a week or so and resume their normal routine within two weeks.Does functional endoscopic sinus surgery work?FESS is the most common surgery for sinus conditions. Studies show between 80 % and 90% of people who have FESS for chronic sinusitis feel the surgery “cured” their problem. But everyone’s experience is different. Your FESS may not “solve” your sinus condition because it’s a chronic condition, but FESS can significantly ease your symptoms and limit how often your chronic sinus flares. You can help prevent recurring sinus problems by following your post-surgery care and giving your nose time to heal.When to Call the DoctorWhen should I see my healthcare provider?You should see your healthcare provider for follow-up visits a few weeks after your surgery so they can clean your nose and check on your progress. You may have other follow-up visits, depending on your situation.A note from Cleveland ClinicFunctional endoscopic sinus surgery (FESS) is standard surgery for chronic sinus problems that keep you from breathing with ease. Healthcare providers perform this surgery to treat chronic sinusitis and to remove nasal polyps. If you have chronic sinusitis and medical treatment hasn’t helped, ask your healthcare provider if FESS is an option.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/04/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Sinus SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"