"Salpingectomy: Purpose, Procedure, Risks & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/SalpingectomyAdvertisementAdvertisementAdvertisementSalpingectomyA salpingectomy is a surgical procedure where one or both of a woman's fallopian tubes are removed. It's performed to treat certain conditions of the fallopian tubes and ectopic pregnancies, and as a preventative measure for women at higher risk of developing ovarian cancer. A salpingectomy can be performed laparoscopically to reduce recovery time.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewA salpingectomy removes one or both of the fallopian tubes.What is a salpingectomy?A salpingectomy is a surgical procedure where one or both of your fallopian tubes are removed. The fallopian tubes are the pathway for the egg to reach the uterus when conception occurs. Your fallopian tubes are located on the top and on either side of your uterus, almost like a set of horns.When you have one fallopian tube removed, it's called a unilateral salpingectomy. However, if both fallopian tubes are removed, it's referred to as bilateral salpingectomy.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho gets a salpingectomy?Women who have certain health conditions associated with their fallopian tubes may get a salpingectomy. It's also recommended for women with a high risk of developing breast cancer and ovarian cancer due to BRCA gene mutations. Removing your fallopian tubes can help prevent women from getting these types of cancers because the most severe forms of ovarian cancer often begin in the fallopian tubes.Why does someone need a salpingectomy?A salpingectomy is performed to treat certain medical issues like:Ectopic pregnancy.Cancer of the uterus, ovaries, or fallopian tubes.Infection in the fallopian tubes.Endometriosis in the fallopian tubes.Blocked or damaged fallopian tubes.It can also permanently prevent pregnancy if you don't wish to become pregnant. If you're at higher risk for developing ovarian cancer, your healthcare provider may recommend a salpingectomy as a precaution.AdvertisementWhat are the types of salpingectomy I can get?You can have one or both of your fallopian tubes removed. The two main types of salpingectomy are:Unilateral salpingectomy. Only one fallopian tube is removed. This means you may still become pregnant since you still have one working fallopian tube.Bilateral salpingectomy. This is when both fallopian tubes are removed. You wouldn't be able to get pregnant naturally, but IVF (In Vitro Fertilization) is an option if you wish to become pregnant and still have a uterus.You may have part of the tube removed (partial salpingectomy) or the entire tube removed (total salpingectomy). For the purposes of sterilization, it is acceptable to perform either a partial or total bilateral salpingectomy. If the surgery is necessary for a health condition, then the entire fallopian tube is typically removed.Procedure DetailsHow do I prepare for a salpingectomy?Your healthcare provider will review the procedure with you and go over any instructions for pre-and post-operative care. Depending on the type of salpingectomy you're having, your age and other medical conditions, these instructions may vary. Make sure you understand the risks of a salpingectomy, the expected recovery time and how the procedure is performed.If you have an ectopic pregnancy, your salpingectomy procedure is considered a life-threatening emergency.AdvertisementWhat happens during a salpingectomy?There are two types of salpingectomy surgical methods:Laparoscopic salpingectomy. A minimally invasive surgery performed using a laparoscope, a thin instrument with a light and camera at the end. It's inserted through the abdomen using a small incision. Your abdomen is then inflated with gas to allow the surgeon to see your uterus and fallopian tubes in detail. Finally, surgical tools are inserted through other small incisions in your abdomen to remove the fallopian tubes. After removing excess blood and fluid, your surgeon will close the incisions with stitches or medical glue.Open abdominal salpingectomy. One large incision is made across your abdomen (called a laparotomy). Your surgeon will be able to access your fallopian tubes through this incision. Once your surgeon removes the fallopian tubes, they stitch or staple the incision closed.A laparoscopic approach is preferred because it's less invasive with a shorter recovery time and lower risk of complications. But an open approach may be necessary depending on other factors.What happens after a salpingectomy?After a salpingectomy, you're taken to a recovery room for monitoring. If your surgery was performed laparoscopically, you might be able to go home the same day. If you had an open salpingectomy, you typically remain in the hospital overnight. Your healthcare provider will help you manage any pain or discomfort.The exact recovery time varies. Everyone heals at a different rate, but it's best to assume you'll need several days of rest after surgery.Before leaving the hospital or surgical center, make sure you receive post-operative instructions on when you can resume day-to-day activities like showering, using stairs, taking medications, driving, and returning to work.Care at Cleveland ClinicFind Your Ob/GynMake an AppointmentRisks / BenefitsWhat are the advantages of getting a salpingectomy?Salpingectomy treats certain medical conditions and prevents ovarian cancers in women who are at higher risk. The main benefit of the procedure is to relieve symptoms caused by conditions of the fallopian tubes and lower your risk of developing cancer. A salpingectomy can also offer permanent contraception so you will never become pregnant.What are the risks of having a salpingectomy?As with most surgeries, there are risks associated with a salpingectomy:Bleeding at the surgery site.Reaction to general anesthesia.Blood clots.Damage to surrounding organs and tissues.Infection.If you notice any of these symptoms during recovery, contact your healthcare provider.Recovery and OutlookWhat is the recovery time after a salpingectomy?Most people will recover within a few days from a laparoscopic salpingectomy. However, it might take up to 14 days to resume your day-to-day lifestyle. You can return to work when you are able, although you might need modifications for a short time.Recovery takes longer if you had an open abdominal salpingectomy or additional procedures. You can expect a slower recovery that lasts four to six weeks. This is because your incision site may be sore or painful, making it a challenge to resume your normal activities. Talk to your healthcare provider about modifications you should be making during your recovery.Follow your healthcare provider's recommendations about activities to avoid after surgery, including things like sexual intercourse. You should avoid certain exercises, lifting heavy objects and anything that puts strain on your abdomen for at least two to six weeks, depending on the type of surgery you had.Can I get pregnant after a salpingectomy?It depends on what type of salpingectomy you had. If you have a unilateral salpingectomy (only one fallopian tube is removed), you'll be able to get pregnant, assuming the other fallopian tube is still functioning. If both fallopian tubes are removed (bilateral salpingectomy), you are unable to get pregnant naturally.If you've had a salpingectomy, you can pursue an IVF (In Vitro Fertilization) pregnancy. IVF is a process that involves fertilizing your eggs in a lab, then transferring them into your uterus.Will I get my period after a salpingectomy?The fallopian tubes aren't responsible for your periods, so you'll continue to have periods after salpingectomy.When to Call the DoctorWhen should I see my healthcare provider?If you've had one or both of your fallopian tubes removed, you should watch for these signs:Swelling or redness at the incision.Leaking fluid or pus from the incision.Pelvic pain.Swelling or pain in your legs (a sign of blood clots).Fever or chills.Painful urination.Contact your healthcare provider immediately if you experience these symptoms, as it could indicate complications from surgery.Additional DetailsCan my fallopian tubes grow back after getting a salpingectomy?No, your fallopian tubes can't grow back. Your fallopian tubes are formed during fetal development. They can't grow back after they are completely removed.What's the difference between a salpingectomy and a tubal ligation?Tubal ligation is commonly referred to as \"getting your tubes tied\" This is misleading, as nothing is actually tied during a tubal ligation. Tubal ligation is any procedure that interrupts the fallopian tubes. This includes partial or total salpingectomy, placing clips or bands on the tubes, or cauterizing the tubes to cause scarring.How is a salpingectomy different than an oophorectomy?An oophorectomy is the removal of one or both of your ovaries, while a salpingectomy removes one or both of your fallopian tubes. Depending on your condition, your healthcare provider may perform both procedures at the same time. When one ovary and one fallopian tube are removed, it's called unilateral salpingo-oophorectomy. If both fallopian tubes and both ovaries are removed simultaneously, it's called a bilateral salpingo-oophorectomy.How is a salpingectomy different than a hysterectomy?A hysterectomy is the surgical removal of your uterus. It may be performed to treat cervical or uterine cancer, fibroids, uterine prolapse, severe endometriosis and other conditions of the uterus. A woman can have both a hysterectomy and a salpingectomy performed as part of her treatment.A note from Cleveland ClinicYour healthcare provider may recommend a salpingectomy to treat a condition or reduce your risk of developing ovarian cancer. It's a safe surgical procedure with a positive outlook. Talk to them about any concerns you have about the procedure and what you can expect afterward.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/09/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind Your Ob/GynMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"