"Dental Sealants: How They Work800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/SealantsAdvertisementAdvertisementAdvertisementSealantsDental sealants are thin, protective coatings that shield the chewing surfaces of your back teeth from harmful, cavity-causing bacteria. Dentists or hygienists may place sealants as part of a preventive dental treatment plan.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewDentists may place sealants on the chewing surfaces of your molars and premolars. These teeth often have deep pits and grooves where food and bacteria become trapped.What are dental sealants?Sealants are thin, liquid coatings painted onto the chewing surfaces of your back teeth (premolars and molars). Once applied, a dentist cures and hardens the sealant material to shield and protect your teeth from harmful cavity-causing bacteria.What are dental sealants made of?Manufacturers use a couple different materials to make sealants, including medical-grade:Resins (plant or synthetic).Glass ionomers (glass powder combined with a water-soluble acid).What is the purpose of sealants?Dentists place sealants to protect your teeth from disease-causing bacteria. Your back teeth have deep grooves that help you grind up food when you chew. Food and bacteria can become trapped in these grooves, leading to tooth decay (cavities) over time. Sealants coat these areas so bacteria can’t reach them.Who needs dental sealants?Children and teenagers are popular candidates for dental sealants. But adults without decay or dental fillings in their molars can also benefit from this treatment. In general, anyone who’s prone to tooth decay on their back teeth should consider sealants.Typically, children should get sealants on their permanent molars and premolars as soon as these teeth come in. This way, the dental sealants can protect their teeth through the cavity-prone years (ages 6 through 14).In some cases, dental sealants may also be appropriate for primary (baby) teeth. For example, if your child has baby teeth with deep depressions and grooves, sealants can protect these areas. Because baby teeth play such an important role in holding space for adult (permanent) teeth, it’s important to keep these teeth healthy so they’re not lost too early.How common are sealants?Sealants are one of the most common preventive dentistry treatments performed today. In the U.S., approximately 42% of children aged 6 to 11 and 48% of adolescents aged 12 to 19 have dental sealants on their adult (permanent) teeth.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsDo I have to prepare for sealants?There’s nothing you need to do to prepare for dental sealants. Your dentist or hygienist will place them during a routine office visit.Before they apply the sealants, they’ll thoroughly clean your teeth. This helps prevent bacteria from becoming trapped between the sealant material and your tooth surfaces.How are dental sealants applied?Applying dental sealants is a simple and painless process. It only takes a few minutes for your dentist or hygienist to apply the sealant to each tooth. Your provider will:Clean your teeth thoroughly.Dry your teeth and place a piece of cotton gauze in the area to keep your teeth surfaces dry.Paint a small amount of an acid etching solution on the chewing surfaces of your teeth to roughen them up, which helps the sealants bond properly.Rinse and dry your teeth.Paint the sealant material onto your enamel, where it will bond directly to your tooth.Shine a curing light on the sealant material to harden it.Care at Cleveland ClinicGet Dental CareFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the benefits of dental sealants?While diligent oral hygiene removes plaque, food and debris from your teeth’s smooth surfaces, brushing and flossing can’t always get into all the nooks and crannies. Sealants shield these vulnerable areas from cavities by “sealing out” bacteria, plaque and food particles.Are there disadvantages?In most cases, the pros of dental sealants outweigh the cons. But here are a few things you should know:Sealants only last about five years. You’ll need to have them replaced every now and then.You can’t have dental sealants placed on teeth that have existing decay or dental fillings.If sealants aren’t placed properly, they can seal in bacteria and cause cavities.Ask your dentist if sealants are a good preventive option for you.AdvertisementRecovery and OutlookWhat is the recovery time?There’s no downtime after dental sealant placement. You should be able to go back to work or school immediately.How long do tooth sealants last?Sealants last up to five years. For best results, you’ll need to have your sealants replaced on a regular basis.When can I eat or drink?You can resume normal eating and drinking right after your appointment. However, it’s important to know that extremely hard, sticky or chewy foods can chip or erode your new sealants. It’s best to consume these foods in moderation.When to Call the DoctorWhen should I see my dentist?You should see your dentist for routine visits at least every six months. During these appointments, your dentist or hygienist will check the health of your teeth and gums and make any treatment recommendations. This is a good time to talk to your dentist about sealants. Ask them if this preventive treatment can help you maintain good oral health.Additionally, you should schedule an appointment with your dentist any time you notice a change in your oral health. Examples include toothaches, gum pain, bleeding gums, bad breath and other worrisome signs and symptoms.Additional DetailsAre dental sealants necessary?The short answer is: It depends.Sealants are a safe and effective way to reduce your or your child’s risk of cavities. Children aged 6 to 11 who don’t have dental sealants are three times more likely to develop tooth decay. In many cases, dental sealants are an excellent investment. They’re less costly than other treatments, and they reduce your chances of needing more invasive dental work in the future.But sealants aren’t for everyone. People with partially erupted (grown-in) teeth won’t benefit from sealants. Dentists also won’t place sealants on teeth that have fillings or crowns. In these cases, sealants aren’t only unnecessary, but they’re also unhelpful.To learn more about sealants and whether they’re right for you or your child, talk to your dentist or hygienist.A note from Cleveland ClinicDental sealants are a lot like raincoats for your teeth. In the same way a raincoat shields you from the elements, sealants shield your teeth from disease-causing bacteria. Sealants aren’t foolproof, but they can significantly reduce your risk for cavities, giving you the best chance for healthy teeth and gums.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/27/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Dental CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"