"Sedation Dentistry: Types, What It Is & What To Expect800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Sedation DentistryAdvertisementAdvertisementAdvertisementSedation DentistrySedation dentistry keeps you comfortable during dental procedures. It’s beneficial for people with dental anxiety or for those who are undergoing lengthy treatment. Options include nitrous oxide, oral conscious sedation and intravenous (IV) sedation. Dentists must have special certification to provide some forms of sedation dentistry.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorResourcesContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorResourcesOverviewWhat is sedation dentistry?Sedation dentistry helps you feel calm, relaxed and at ease during dental procedures. It’s a moderate level of sedation, so you’re still technically awake but feeling very carefree. It’s sometimes called conscious sedation dentistry or “twilight sleep” because it creates a state of short-term amnesia (forgetfulness) where you experience insensitivity to pain without the loss of consciousness.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs sedation dentistry?People of all ages can benefit from sedation dentistry, including children. Dentists often recommend this option for those with:Dental anxiety.A fear of visiting the dentist.An overly sensitive gag reflex.A fear of needles (aichmophobia).Extreme teeth sensitivity.Feelings of claustrophobia while in the dental chair.Decreased sensitivity to local anesthesia.Difficulty controlling movements.Special needs (including physical, cognitive or behavioral).What types of sedation are used in dentistry?There are varying levels of sedation dentistry based on your unique needs. Factors include your level of anxiety, the length of your procedure, your health history and personal preferences. The most common types of sedation dentistry include nitrous oxide, oral conscious sedation and intravenous (IV) sedation.Nitrous oxideNitrous oxide is commonly known as “laughing gas.” You inhale nitrous oxide through a mask or nosepiece, and calming effects begin within three to five minutes. Your dentist controls the amount of sedation you receive and adjusts dosages accordingly throughout your procedure. Once your treatment is over, your dentist gives you pure oxygen to flush the nitrous oxide out of your system. Because the laughing gas leaves your system so quickly, you’ll be able to drive yourself home after the procedure.Oral conscious sedationWith oral conscious sedation, your dentist gives you sedative medication (usually in pill form) about an hour before your procedure begins. Most dentists use triazolam (Halcion®), which is in the diazepam (Valium®) family. But your dentist might use other medications, too, including zaleplon and lorazepam. Dentists often used liquid sedation in pediatric dentistry, such as midazolam oral syrup.Oral sedation makes you quite groggy, and you may even fall asleep. But you’ll still be able to communicate with your dentist if necessary, and you’ll awaken with a gentle nudge. Because oral sedation temporarily affects your memory and motor skills, you’ll need a friend or family member to drive you home after your procedure.Intravenous (IV) sedationIV sedation dentistry is the deepest form of conscious sedation available in a dental office setting. Your healthcare provider delivers sedative medications directly to your bloodstream through an IV line. During your procedure, your dentist monitors your heart rate, blood pressure and oxygen levels. They can adjust your dosage at any point and can use reversal medications if necessary. Most people who receive IV sedation dentistry fall asleep and have little to no memory of their treatment when they wake up. This option is best for people with severe dental anxiety or those who are undergoing lengthy procedures.Is general anesthesia ever used in dentistry?Yes, in some cases. General anesthesia in a hospital or ambulatory surgery center may be necessary when treating young children, adults with special needs or people with severe dental anxiety. General anesthesia is a type of unconscious sedation. In other words, you’ll be completely unconscious during the procedure. To provide general anesthesia, your dentist must have advanced, specialized training. In most cases, an anesthesiologist provides this type of anesthesia.AdvertisementProcedure DetailsWhat happens before sedation dentistry?You’ll talk with your dentist about sedation options during your initial consultation. They’ll discuss your health history and ask about any medications or supplements you’re taking. Once they’ve gathered all the necessary information, they’ll make sedation recommendations based on your specific needs.In most cases, you shouldn’t eat or drink anything for at least six hours before your dental appointment. Unless otherwise noted by your dentist, you should take all routine medications without interruption.Be sure to tell your dentist if you’re taking any blood thinners, though, such as warfarin. They may ask you to skip these medications for a few days leading up to your procedure.What happens during sedation dentistry?Your dentist gives you sedative medications before beginning your procedure. You’ll still receive local anesthetic to numb your teeth and gums, but your dentist usually does this once you’re already feeling comfortable from the sedatives.AdvertisementWhat happens after sedation dentistry?Unless you choose nitrous oxide as your sedation option, you’ll need a trusted friend or family member to drive you home after your appointment. You should go straight home and rest while the sedative medication wears off.Note: Never take a taxi or rideshare home after sedation dentistry. You’ll need a trusted and familiar person to help you. Before leaving you alone, your driver should make sure you’re resting comfortably in bed or on your couch.Care at Cleveland ClinicGet Dental CareFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of sedation dentistry?Sedation dentistry eases anxieties and phobias, helping you remain calm and comfortable during dental procedures. Because your dentist can often work faster when you’re under sedation, it can result in fewer appointments. Finally, many people have so much dental anxiety that they avoid going to the dentist altogether. Sedation dentistry helps you feel more comfortable so you can receive the care you need and deserve.What are the risks or complications of sedation dentistry?Sedation dentistry is typically safe when administered by a licensed healthcare provider. However, there’s a small risk of complications. Possible short-term risks include:Lingering drowsiness.Can be difficult to predict the effect of oral sedation medications.Dry mouth (xerostomia).Nausea and vomiting.Headaches.Bruising from the IV.It can also be difficult to predict the effect of oral sedation medications. Rarely, people may have an allergic reaction. There are drugs available that can counteract these issues.Child sedation dentistry side effectsSedation dentistry is safe for kids. But as a parent, it can still be scary when your child takes unfamiliar medications. Child sedation dentistry side effects are usually short-lived, but they can include:Irritability.Snoring.Fever.Nausea and vomiting.Sometimes, your child can be slow to wake after sedation. If this happens, your dentist will monitor your child until they’re ready to go home. These side effects are normal and should go away on their own in a day or two. If you have specific questions or concerns, call your dentist.Can I have sedation dentistry if I’m pregnant?Generally, sedation dentistry isn’t recommended for people who are pregnant because some sedative medications can affect fetal development. Nitrous oxide may be given during the second trimester in some cases. But overall, most dentists wait until after pregnancy to administer sedation dentistry.Recovery and OutlookWhat is the recovery time?Recovery times vary. It depends on what type of sedation you choose and how your body responds to the medications. In general, people who have nitrous oxide recover within 15 to 30 minutes and can drive themselves home following their appointment. Those who choose oral conscious sedation or IV sedation typically need about 24 hours for full recovery.When can I go back to work or school?If you’ve had nitrous oxide, you can return to normal activities once you leave the dental office. However, if you’ve had oral or intravenous sedatives, you’ll need to wait at least one full day before returning to work or school. Some people may need longer. Your dentist can tell you what to expect in your situation.When can I drive?If you’ve had oral sedation or IV sedation, you’ll need to wait a full 24 hours before driving again. If you’ve only had nitrous oxide, you can drive once you’ve been released from the dental office.When can I eat?You can eat and drink immediately after your appointment; though, most people prefer to wait until the numbness from the local anesthesia wears off. It’s best to start with something light, like clear liquids, and progress from there to a smoothie or milkshake. If you’re feeling up to it, you can eat something more substantial after a couple of hours.Your dentist will provide you with a list of postoperative guidelines. These instructions will tell you which types of food you should avoid and which ones are safe to eat. For most dental procedures, you’ll be able to eat normally again within one week. It might take longer if you’ve had work done on both sides of your mouth.When to Call the DoctorWhen should I see my healthcare provider?If you’ve recently had sedation dentistry, it can take at least 24 hours for the effects to wear off. If you develop worrisome symptoms, such as nausea or vomiting, a fever above 101 degrees Fahrenheit (38.33 degrees Celsius) or pain that doesn’t improve with medication, call your dentist for further instructions.A note from Cleveland ClinicAnxiety shouldn’t keep you from receiving the quality dental care you deserve. If the thought of going to the dentist makes you fearful or anxious, sedation dentistry can help you get the care you need for long-lasting oral health. Talk to your dentist and find a sedation option that works for you.ResourcesFiorillo L. Conscious Sedation in Dentistry. Medicina (Kaunas). 2019 Dec 7;55(12):778. Accessed 1/12/2022.Knuf K, Maani CV. Nitrous Oxide. [Updated 2021 Jul 23]. In: StatPearls [Internet]. Treasure Island (FL): StatPearls Publishing; 2021 Jan-. Accessed 1/12/2022.Lim MAWT, Borromeo GL. The use of general anesthesia to facilitate dental treatment in adult patients with special needs. J Dent Anesth Pain Med. 2017;17(2):91-103. Accessed 1/12/2022.Ritwik P, Cao LT, Curran R, Musselman RJ. Post-sedation events in children sedated for dental care. Anesth Prog. 2013;60(2):54-59. Accessed 1/12/2022.Southerland JH, Brown LR. Conscious Intravenous Sedation in Dentistry: A Review of Current Therapy. Dent Clin North Am. 2016 Apr;60(2):309-46. Accessed 1/12/2022.Trieger N. Intravenous sedation in dentistry and oral surgery. Int Anesthesiol Clin. 1989 Summer;27(2):83-91. Accessed 1/12/2022.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/12/2022.Learn more about our editorial process.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Dental CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"