"Selective Estrogen Receptor Modulators (SERMs) 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Selective Estrogen Receptor Modulators (SERMs)AdvertisementAdvertisementAdvertisementSelective Estrogen Receptor Modulators (SERMs)Selective estrogen receptor modulators (SERMs) may help prevent certain types of breast cancer. Healthcare providers also prescribe selective estrogen receptor modulators to treat some breast cancers and osteoporosis.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat are selective estrogen receptor modulators (SERMs)?Selective estrogen receptor modulators (SERMs) are hormone therapies that manage how estrogen works in your body. SERMs such as tamoxifen (Nolvadex®, Soltamox®) and raloxifene (Evista®) are effective treatments for some types of breast cancer and osteoporosis.How do SERMs work?SERMs are medical multitaskers. They block estrogen from connecting with breast cancer cells, keeping the cells from multiplying. At the same time, SERMs act like estrogen, boosting estrogen levels in your bones and preventing osteoporosis.SERMs and breast cancerHealthcare providers use SERMs to treat hormone receptor (HR) positive or estrogen receptor (ER) positive breast cancer. ER-positive breast cancer occurs when estrogen connects with proteins inside cancer cells, causing the cells to grow. It may also happen when estrogen and another hormone, progesterone, connect with proteins inside cancer cells.Providers typically prescribe tamoxifen and/or raloxifene to:Help prevent breast cancer in women and people assigned female at birth (AFAB) who are at increased risk for ER-positive. (You may be at risk if you have a family history of the disease or if genetic tests show you inherited genetic mutations or changes that cause breast cancer.) Providers typically prescribe tamoxifen for women and people AFAB who haven’t gone through menopause. They may prescribe raloxifene for women and people AFAB who’ve gone through menopause and who are at increased risk of breast cancer.Reduce the risk of breast cancer recurrence in people who’ve had breast cancer surgery. SERMs also reduce the risk cancer will develop in the opposite (untreated) breast.Reduce the risk that ductal carcinoma in situ (DCIS) will come back.Treat people who have metastatic breast cancer.To treat men (and people assigned male at birth) who have breast cancer.SERMs and osteoporosisOsteoporosis affects approximately 8 million women and people AFAB in the U.S. SERMs may slow bone loss and reduce risk of fractures in women with osteoporosis.Are SERMs common treatments?Yes, they are. Healthcare providers typically prescribe SERMs to prevent and/or treat ER-positive breast cancer. ER-positive breast cancer represents 67% to 80% of breast cancer in women and people AFAB and 90% of breast cancer in men and people AMAB. (For context, the American Cancer Society estimates that in 2023, nearly 300,000 people in the U.S. will be diagnosed with breast cancer.)Are SERMs effective?Yes, they are. In particular, studies show tamoxifen reduces breast cancer risk by 40% in women and people AFAB who haven’t gone through menopause. Here are other examples:If you had breast cancer surgery on one breast, taking tamoxifen reduces your risk of developing cancer in your opposite breast by 50%.If you had breast cancer before going through menopause, tamoxifen reduces recurrence by 30% to 50%.If you have early-stage ductal carcinoma in situ (DCIS), tamoxifen reduces the risk cancer will spread by up to 50%.Studies show raloxifene may reduce the risk of spinal fractures in women and people AFAB who develop osteoporosis after going through menopause.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens during SERM therapy?That depends on your situation. People taking tamoxifen to prevent or treat breast cancer may take a pill or liquid medication every day for five years and then switch to another treatment, such as an aromatase inhibitor. Some people may be offered tamoxifen for up to 10 years. People who take raloxifene to reduce breast cancer risk take a pill every day for an indefinite period.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentRisks / BenefitsWhat are the potential benefits of this treatment?If you’re at high risk for breast cancer, taking SERMs may reduce that risk. Tamoxifen may keep cancer from coming back. It may also help to slow down cancer that’s spreading. Likewise, the raloxifene prevents and treats osteoporosis and may reduce breast cancer risk.AdvertisementWhat are the risks or complications of this treatment?Like most cancer treatments, SERMs have side effects, some of which may cause serious medical issues. Common tamoxifen side effects include:Hot flashes.Night sweats.Irregular periods or spotting (uterine bleeding).Loss of sex drive.Vaginal discharge.Vaginal dryness or itching.Changes in your menstrual cycle if you haven’t gone through menopause.Other less common tamoxifen side effects include:Blood clots in your large veins (deep venous thrombosis).Blood clots in your lungs (pulmonary embolism).Bone loss in people who haven’t gone through menopause.Cancer of the uterus (uterine or endometrial cancer).Cataracts.Stroke.Tamoxifen side effects in men and people AMAB may include:Hot flashes.Sexual issues.Fatigue.Less common side effects include:Blood clots (deep venous thrombosis).Raloxifene side effects include:Hot flashes (more common in the first six months of raloxifene therapy).Leg cramps.Swollen hands, feet, ankles or lower legs.Flu-like syndrome.Joint pain.Difficulty falling asleep or staying asleep.Recovery and OutlookIs there anything I can do to make this treatment easier on me?Women and people AFAB often develop symptoms similar to menopause, such as hot flashes, trouble sleeping and dry vaginas. Some suggested ways to ease menopause symptoms include:Eating fewer foods and beverages with caffeine may ease hot flashes.Adding plant estrogens (think soybeans, chickpeas and lentils) to your diet may also help with hot flashes.Exercise may help with sleep issues.Vaginal moisturizers may help with vaginal dryness.AdvertisementWhen to Call the DoctorWhen should I call my healthcare provider?Call your provider if common side effects like hot flashes or night sweats seem to be getting worse. Rarely, selective estrogen receptor modulators (SERMs) may cause serious side effects, including stroke and pulmonary embolism. Call 911 or seek immediate medical attention if you have symptoms including:Weakness on one side of your body or your face.Difficulty speaking.Sudden or severe headaches.Sudden shortness of breath.Unexplained sharp pain in your chest, arm, shoulder or jaw.Additional DetailsIs there a natural form of selective estrogen receptor modulators?Yes, natural phytoestrogens are a plant-based form of the SERM clomiphene citrate. Healthcare providers may prescribe clomiphene citrate (Clomid®, Serophene®) to boost ovulation in women and people AFAB. Soy-based foods contain phytoestrogens. Currently, there’s no evidence that eating soy-based foods reduces breast cancer risk.A note from Cleveland ClinicBreast cancer is the most common form of cancer affecting women and people assigned female at birth (AFAB). Osteoporosis affects about 8 million people in the U.S. For decades, selective estrogen receptor modulators (SERMs) have been making a difference for people living with one or both of these serious medical conditions.SERMs help prevent breast cancer in people at high risk for the disease, and ultimately help people to live longer. They may also help women and people AFAB who have osteoporosis by slowing bone loss and reducing the risk of fractures.If you’re at risk for breast cancer or you have osteoporosis, ask a healthcare provider to explain SERM benefits and risk factors. They’ll be glad to help you understand how selective estrogen receptor modulators work and if this treatment is appropriate given your situation.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/03/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"