"Self-Catheterization (Clean Intermittent Catheterization): How To800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Self-Catheterization (Clean Intermittent Catheterization)AdvertisementAdvertisementAdvertisementSelf-Catheterization (Clean Intermittent Catheterization)People with bladder control issues may need to perform self-catheterization to empty the bladder. Also called clean intermittent catheterization, the process involves using a catheter, or tube, to drain urine at regular intervals throughout the day. People with certain medical conditions may need self-catheterization.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewWhat is self-catheterization?Self-catheterization is a way to empty your bladder when you have difficulty urinating. As the name suggests, you perform the procedure yourself.Self-catheterization, also called clean intermittent catheterization (CIC) or intermittent self -catheterization (ISC), involves inserting a thin, hollow tube called a catheter into the bladder through the urethra (the tube from which the urine exits your body). Urine drains out of the catheter into a toilet or container. When your bladder is empty, you slip out (remove) the catheter. You repeat these steps at regular intervals (intermittently) several times a day.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the types of urinary catheterization?There are several ways to use a catheter to empty the bladder:Indwelling: A sterile tube called a Foley catheter stays in the bladder. The tube is inserted through the urethra, or in some cases directly into the bladder from the lower abdomen (supra-pubic catheter). The catheter attaches to a drainage bag that collects urine throughout the day and night. A balloon in the tip of the catheter keeps the catheter from slipping out of the bladder. Depending on your mobility and situation, the drainage bag may attach to a bed, your leg, or clothes.Condom: Males can slip a condom-like device over the penis. The device has a tube that drains urine into a bag.Self (clean intermittent): You or a caregiver insert a catheter into the bladder at regular intervals throughout the day. Urine drains through the catheter into a toilet, collection bag or container.Who might need self-catheterization?Certain health problems can make it difficult to empty your bladder. Bladder control issues that could require a catheter are more likely if you have:Bladder surgery.Central nervous system tumors (astrocytoma).Enlarged prostate (benign prostatic hyperplasia).Multiple sclerosis (MS).Neurogenic bladder caused by cerebral palsy, Parkinson’s disease, spina bifida or spinal cord injuries.Stroke.Urinary incontinence, urinary retention or urethral strictures, and urinary fistulas.Severe constipation.Procedure DetailsHow should I prepare for self-catheterization?Your healthcare provider will show you how to perform self-catheterization. The process gets easier with practice. Before performing self-catheterization, you should:Try to urinate the regular way.Wash your hands with soap and water.Wash your genitals with soap and water or an antiseptic towelette. This step lowers infection risk.Remove the catheter from its package being careful to keep it very clean.Apply a water-based lubricant on the tip and top two inches of the insertion end of the catheter if needed. Some catheters come pre-lubricated.AdvertisementHow do I perform self-catheterization?Regardless of gender, the steps for performing self-catheterization are generally the same. Females may find it helpful at first to use a mirror to find the urethral opening where urine comes out. To perform self-catheterization:Sit on the toilet (females may prefer to stand or squat over the toilet).Use firm, gentle pressure to insert the lubricated end of the catheter into the urethra.Hold the other end of the catheter over the toilet bowl or container.Slowly slide the catheter until it reaches the bladder and urine starts to flow out of the tube.Continue inserting the catheter another inch or two.Hold the catheter in place until the bladder empties.Slowly and gently slide out the catheter.What should I do after finishing self-catheterization?Cleanup is an important step to preventing infection. Always wash your hands when you finish in the bathroom. The catheters are all single-use, please dispose of it in the trash.AdvertisementHow often do I need to perform self-catheterization?Your healthcare provider can help determine how many times a day you need to empty your bladder. Most people complete the process four to six times a day or every four to six hours.Care at Cleveland ClinicBladder Disorders TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the potential risks or complications of self-catheterization?Inserting a catheter can raise the risk of introducing infection-causing bacteria into the body, but having an indwelling Foley catheter presents even a higher risk. So if possible, CIC is a better option than an indwelling Foley. With any type of catheter, you have a higher chance of having a:Bladder infection, perforation or spasms.Kidney infection.Urethral scarring and strictures.Urinary tract infection (UTI).When to Call the DoctorWhen should I call the doctor?You should call your healthcare provider if you experience:Bladder spasms (sudden painful cramps and unexpected leaking of urine).Blood in urine (hematuria).Difficulty inserting the catheter.Unusually small amounts of urine when emptying your bladder.Painful urination (dysuria).Signs of urinary tract infection (fever, pelvic pain, urinary leakage).Skin rash or sores at the site of insertion.A note from Cleveland ClinicSome people need self-catheterization for a short time. Depending on the cause of the bladder problem, medications or surgery may correct the problem. If you have a chronic problem or a condition that is expected to get worse over time, you may always need to use a catheter to urinate. Everyone’s situation is different. Talk to your healthcare provider about what you can expect.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/23/2020.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicBladder Disorders TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"