"Septostomy: Procedure Details and Outlook800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/SeptostomyAdvertisementAdvertisementAdvertisementSeptostomySeptostomy is a life-saving procedure that widens or creates a hole in your baby’s heart. This allows oxygen-rich blood to mix with oxygen-poor blood. It’s a temporary fix for babies with a heart defect that affects blood flow to their lungs, like dextro-transposition of the great arteries or tricuspid atresia. Your baby needs surgery soon after.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a septostomy?A septostomy is a procedure that helps babies with congenital heart defects stay alive until they have repair surgery. Septostomy is also known as balloon atrial septostomy or the Rashkind procedure. It’s called an “atrial” procedure because it involves the two upper chambers of your baby’s heart, known as the atria.This is a percutaneous procedure, meaning a healthcare provider uses a needle to puncture the skin and insert a catheter. The catheter contains a balloon that expands a naturally occurring hole in your baby’s heart. This hole serves as a passageway for oxygen-rich blood to mix with oxygen-poor blood. This partly oxygenated blood can then leave the heart and circulate through the baby’s body. Without this passageway, your baby would only have oxygen-poor blood circulating through their body.A septostomy isn’t open-heart surgery. Instead, it’s a short-term fix to fill the gap between birth and surgery. The septostomy procedure was developed by doctors in 1966 as a way to help babies with certain heart defects get more oxygen right away.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs to have a septostomy?Babies with some cyanotic heart defects may need a septostomy. These are defects that prevent oxygen-poor blood from traveling to your baby’s lungs to gain more oxygen. When this happens, tissues throughout your baby’s body can’t get enough oxygen. This lack of oxygen makes their skin turn blue (cyanosis). Severe cyanosis is very dangerous and needs urgent medical care.Babies with such defects may receive certain medications, such as prostaglandin E1, to help them get more oxygen. A septostomy is another option for babies who need more oxygen right away so they can survive until surgery.What conditions are treated with a balloon atrial septostomy?A septostomy can help babies who have cyanotic heart defects. It’s commonly used for babies with dextro-transposition of the great arteries or tricuspid atresia.Dextro-transposition of the great arteries (d-TGA)Babies with this defect have a “switched” pulmonary artery and aorta. These arteries are the two major roadways for blood to leave your heart.Usually, your pulmonary artery takes oxygen-poor blood from the heart to the lungs so it can gain oxygen. And usually, your aorta takes oxygen-rich blood from the heart to the rest of your body. So, when they’re switched, oxygen-poor blood gets sent out to your baby’s body, and oxygen-rich blood goes right back to your baby’s lungs, even though it doesn’t need any more oxygen.Tricuspid atresiaBabies with tricuspid atresia have a tricuspid valve that’s not formed correctly. This valve should let blood flow from a baby’s right atrium down to their right ventricle. But babies with tricuspid atresia instead have a piece of solid tissue that blocks blood flow.AdvertisementWhat is the foramen ovale?The “foramen ovale” (foh-RAY-mun oh-VAY-lee) is a small hole located in a fetus’s septum. The septum is the wall between the right and left sides of their heart. The foramen ovale serves as a passageway for blood to flow from the right side to the left side of the fetal heart.While in the womb, a fetus’s lungs don’t work yet. And they don’t have to. That’s because the fetus receives oxygen-rich blood from their parent’s placenta through the umbilical cord. This blood travels to the right side of the fetal heart, and then directly to the left side through the foramen ovale. From there, it’s sent out to the rest of the fetus’s body. It never goes through the fetal lungs at all.Once a baby is born, their lungs kick into action and start working. Blood starts flowing from the right side of their heart to their lungs to get oxygen. From the lungs, blood flows back into the left side of their heart and out to their body. So, the baby doesn’t need the foramen ovale anymore. It usually closes after birth.Why the foramen ovale is important in a septostomyThanks to the foramen ovale, babies with cyanotic heart defects can survive for a few days after birth. That’s because the hole allows some oxygen-rich blood to mix with the oxygen-poor blood and circulate through their body. Once the foramen ovale closes up, that passageway disappears, and a baby won’t get enough oxygen-rich blood to survive.However, some babies do manage to survive thanks to heart defects known as ventricular septal defects (VSD). These are holes in the septum that allow blood to pass between the lower chambers of the heart (ventricles). Some babies with d-TGA also have a VSD. And amazingly, a large enough VSD can be a helpful defect that keeps a baby alive until surgery.Otherwise, though, a baby who isn’t getting enough oxygen needs another intervention right away. Septostomy was a medical breakthrough in 1966 because it showed the foramen ovale can be life-saving.The septostomy procedure uses a balloon catheter to make the foramen ovale bigger and allow blood on both sides of the heart to mingle. So, oxygen-poor blood mixes with oxygen-rich blood. The procedure keeps the foramen ovale open long enough so the baby can have surgery.If a baby’s foramen ovale has already closed up, the septostomy procedure can create a new hole using a special blade catheter. Creating a new hole in a baby’s heart seems counter-intuitive. We’re used to hearing that a hole in the heart is a defect. But this hole is the only way some babies can get enough oxygen to survive.How common is the atrial septostomy procedure?A balloon atrial septostomy is common for infants who aren’t getting enough oxygen due to heart defects. About 28% of infants with transposition of the great arteries have a septostomy. This happens before their arterial switch operation. But it’s important to keep in mind that such defects aren’t common. For example, transposition of the great arteries affects 1 in 3,413 babies in the U.S.AdvertisementProcedure DetailsHow is an atrial septostomy done?An atrial septostomy is a procedure that takes place in a hospital’s catheterization lab or in the neonatal intensive care unit (ICU). An interventionist (who is a cardiologist with special training to do cardiac catheterization) punctures your baby’s skin with a needle to access a large vein. Usually, this is done in the groin area. In some instances, the access can obtained from the umbilical cord.The needle is then replaced by a catheter, which is a flexible tube that has a balloon at the tip. The interventionist uses echocardiogram imaging to guide the catheter through your baby’s blood vessels until it reaches their heart. The catheter then enters your baby’s right atrium. From there, the interventionist pushes it through the foramen ovale so that it enters their left atrium.At that point, the interventionist inflates the balloon at the tip of the catheter and pulls the balloon back into their right atrium. This motion makes the foramen ovale bigger. In some rare cases, the interventionist may need to use a catheter with a blade at its tip to make a hole in their septum before using the balloon.If your baby is having a septostomy, it’s important to talk with their healthcare provider to learn specific details. That’s because babies with congenital heart defects have unique needs and anatomy. Some babies have a combination of defects that impact their care. So, your baby’s provider will be able to share more information about preparations for the procedure and how success will be measured.How do you know if an atrial septostomy is successful?In general, an atrial septostomy is successful if any of these conditions are met:The amount of oxygen in your baby’s arteries increases by 10%.The hole in their septum is at least 33% wider than it was before the procedure.There’s minimal difference in blood pressure between their right and left atria.Care at Cleveland ClinicAdult Congenital Heart Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of a septostomy?A balloon atrial septostomy can save a baby’s life when a heart defect prevents them from getting enough oxygen. This is a proven method for helping a baby get more oxygen and survive long enough to have surgery.However, the advantages vary based on the individual. Healthcare providers consider many factors before deciding if a septostomy is needed. These include the risks of waiting for surgery and a baby’s overall condition.What are the risks of a septostomy?Babies with serious heart defects face risks with any procedure. Septostomy may be linked with strokes in infants, according to some research. However, it’s not clear whether the procedure causes the stroke. The lack of oxygen caused by the heart defect may be the main factor. Researchers need to investigate this more to fully understand the relationship between septostomy and strokes in babies.But babies who don’t receive treatment soon after birth could die. Without medications or septostomy, babies with d-TGA have a 70% chance of surviving one week after birth. That chance drops to 50% at 1 month and 10% at 1 year.Recovery and OutlookWhat is the outlook for babies who have an atrial septostomy?About 94% of babies who have a balloon atrial septostomy survive the procedure. They then must have surgery to repair their heart defects. Babies with d-TGA usually have the arterial switch operation (ASO) soon after birth. This surgery switches a baby’s pulmonary artery and aorta so they’re in the right spots. About 97% to 98% of babies who have ASO survive the surgery.Babies with critical congenital heart defects need ongoing care after their repair surgeries. This care includes follow-up appointments, imaging tests and monitoring. Each baby’s outlook is different depending on the defects they have and other health factors. If your baby has been treated for a congenital heart defect, talk to their provider about what to expect going forward.When to Call the DoctorWhen should I call my baby’s healthcare provider?Most babies are diagnosed with critical congenital heart defects before or shortly after birth. So, your baby will receive care in the hospital for some days or weeks after birth. Being away from your baby while they receive care is difficult. Your baby’s care team understands this and will do everything possible to make you feel comfortable and answer your questions. Call any time you have questions about medications, procedures or next steps for your baby’s care.A note from Cleveland ClinicCongenital heart defects affect 1 in 100 babies, but some types of defects are very rare. Learning your baby has a rare defect can feel overwhelming. There’s a lot to learn about your baby’s anatomy, treatments and what comes next.A septostomy may be an option that your baby’s care team recommends as an urgent life-saving procedure. It’s the first step in your baby’s care journey. Talk with your baby’s care team about treatment options and benefits and risks for each. Also, talk about what comes after the septostomy. If you don’t understand something, ask the care team to explain in greater detail or share resources with you.Keep in mind that other parents are in your shoes. Connecting with other parents whose babies have heart defects can help provide a supportive community. Many of these communities bring together people from around the country and world. Talk with your provider about support groups and how to connect with them.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/19/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicAdult Congenital Heart Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementCall Appointment Center 24/7 866.320.4573Questions 216.444.2200Request an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"