"Septal Myectomy800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Septal MyectomyAdvertisementAdvertisementAdvertisementSeptal MyectomyA septal myectomy is an open-heart procedure. Healthcare providers use it to treat hypertrophic cardiomyopathy, a thickened heart muscle. During surgery, your provider removes a portion of thickened heart tissue to improve blood flow through your heart. Septal myectomy successfully treats hypertrophic cardiomyopathy in most people.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is a septal myectomy?A septal myectomy is an open-heart surgery to treat hypertrophic cardiomyopathy, a thickened heart muscle. During the procedure, your surgeon removes a portion of thickened heart tissue. This allows blood to flow through your heart more easily.How does hypertrophic cardiomyopathy affect my heart?Hypertrophic cardiomyopathy makes it more difficult for your heart to circulate blood through your body.Your heart has four chambers:Left and right chambers on the top (atria).Left and right chambers on the bottom (ventricles).A band of muscle called the septum separates your two ventricles. In hypertrophic cardiomyopathy, the septum thickens and may bulge into your left heart ventricle. This bulging blocks blood flow, meaning your heart has to work harder to pump blood through your body. Hypertrophic cardiomyopathy can be a congenital heart disease, meaning you’re born with it. You can also develop it later in life.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho is a candidate for a septal myectomy?Healthcare providers usually recommend a septal myectomy for people who have hypertrophic cardiomyopathy and whose symptoms haven’t improved with medications. They may also recommend it for:People with severe thickening into their left ventricle.People with hypertrophic cardiomyopathy who want to become pregnant, even if they don’t have severe symptoms.Procedure DetailsWhat happens before a septal myectomy?Your healthcare provider will give you instructions to prepare for a septal myectomy. Most people don’t need to do anything special. You may need to stop taking certain medicines, such as blood thinners, before the operation. If you smoke, your provider may ask you to try to stop before surgery.Before surgery, you’ll have to have tests that check your heart health such as:Blood tests.Cardiac catheterization.Cardiac MRIs.Chest X-rays.EchocardiogramsElectrocardiograms.AdvertisementWhat happens during a septal myectomy?You’ll receive general anesthesia before the procedure starts. Anesthesia helps you remain in a deep sleep through the operation and not feel any pain.After you’re asleep, your surgeon:Makes a large incision down the middle of your chest and separates your breastbone (sternum) to reach your heart.Connects you to a heart-lung machine that takes over the work of your heart and lungs during surgery.Removes the thickened portion of your septum.Disconnects the heart-lung machine.Puts your breastbone back together and closes the incision with absorbable sutures.How long does a septal myectomy surgery take?A septal myectomy usually takes between three and four hours.AdvertisementWhat happens after a septal myectomy?You recover in the intensive care unit (ICU) immediately after a septal myectomy. You may have a urine catheter or chest drainage tube in place for 24 to 48 hours.You’ll start walking with help from a physical therapist after around 48 hours. Most people recover in the hospital for fewer than five days.Care at Cleveland ClinicHypertrophic Cardiomyopathy TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of a septal myectomy?A septal myectomy successfully treats hypertrophic cardiomyopathy. It relieves symptoms such as:Chest pain (angina).Shortness of breath (dyspnea).Syncope.What are the risks of a septal myectomy?Septal myectomy is generally a low-risk procedure but may cause complications of:Fluid around your heart or lungs.Atrial fibrillation.Heart blocks, disruptions in your heart’s electrical signals that lead to arrhythmia.These complications are more common in people with one or more risk factors, such as:Having multiple other heart conditions.Smoking or using tobacco.Over age 65.Recovery and OutlookHow will I feel after a septal myectomy?Most people experience symptom relief from hypertrophic cardiomyopathy days to weeks after surgery. You may have some minor chest soreness, but you shouldn’t have severe pain.You may run out of energy more quickly than usual after surgery. Most people are back to their typical energy levels in a few weeks.What is the success rate for septal myectomy?Septal myectomies have high success rates. In one study, 94% of people experienced symptom improvements after surgery. Long-term, people who had a septal myectomy had the same survival rates as the general population.When to Call the DoctorWhen should I see my healthcare provider?After a septal myectomy, call your healthcare provider if you experience any symptoms that could point to a complication, such as:Excessive redness, swelling or warmth around the incision site.Fever higher than 100.4 F (38 C).Weight gain of more than 5 lbs. in one week.Additional Common QuestionsHow serious is a septal myectomy?A septal myectomy is an open-heart procedure. These surgeries are complex and involve several weeks of recovery time. While a septal myectomy is a serious procedure, it is a highly effective treatment for hypertrophic cardiomyopathy.A note from Cleveland ClinicA septal myectomy is an open-heart surgery to remove a portion of thickened heart tissue. Healthcare providers use this surgery to treat hypertrophic cardiomyopathy. They usually recommend it for hypertrophic cardiomyopathy that hasn’t improved with medications. Septal myectomy has high success rates, with most people experiencing an improvement in symptoms after surgery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/16/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicHypertrophic Cardiomyopathy TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"