"Septoplasty: What It Is, Procedure & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/SeptoplastyAdvertisementAdvertisementAdvertisementSeptoplastySeptoplasty is surgery to fix a crooked (or deviated) septum. This procedure allows better airflow through your nose and may improve breathing. Septoplasty is usually an outpatient procedure, so most people can go home the day of surgery. Swelling may last two to three days, but full recovery may take up to three months.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is septoplasty?Septoplasty is surgery inside your nose to straighten a deviated septum. Your septum, about 7 centimeters long (2.5 to 3 inches) in adults, consists of cartilage and bone. It separates the inside of your nose into two chambers, or nostrils.A deviated septum is a septum that’s crooked or bent instead of straight. It can block one or both nostrils and interfere with airflow. Your septum can become deviated from an injury, but you can also be born with it.Is septoplasty a major surgery?No. Septoplasty is a minor, low-risk procedure. Recovery usually takes a few days and requires an average of a week of downtime. But, as with any surgery, septoplasty carries some risks, including bleeding, infection and numbness.Who needs septoplasty?People with a deviated septum and have nasal obstruction may need a septoplasty. In addition, healthcare providers may recommend septoplasty to:Remove nasal polyps.Treat chronic sinusitis.Stop recurrent (chronic) nosebleeds (less common).Address other conditions that block your nasal airway.While septoplasty is often performed as a stand-alone procedure, your provider may recommend septoplasty and turbinate reduction. During turbinate reduction, your surgeon reduces the size of the small, bony structures inside your nose.Septoplasty is most commonly performed in adolescents and adults. While it’s not generally done in young children, there are certain instances when your child’s provider may recommend it.How common is septoplasty?Septoplasty is one of the most common procedures performed by otolaryngologists (ear, nose and throat doctors, or ENTs). Surgeons in the U.S. perform about 260,000 septoplasties every year.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before septoplasty?You’ll meet with your healthcare provider to discuss your septoplasty. They’ll give you a list of preoperative instructions, which you should follow closely.Your provider will need to know about all medications you’re currently taking, including nonprescription drugs, supplements and herbs. Before surgery, you should stop taking drugs like aspirin, ibuprofen, naproxen and certain herbal supplements, which make it harder for blood to clot. You should also tell your provider if you have allergies or bleeding problems.What happens during septoplasty?Septoplasty is usually performed on an outpatient basis, so most people go home the day of their surgery. In most cases, a healthcare provider will place you under general anesthesia. This means you’ll be asleep during the operation. Local anesthesia, which numbs the part of the body targeted for surgery, might be an option.The procedure takes place entirely inside your nose. Your surgeon creates an incision (cut) on one side of your nose and lifts the mucosa (a thin membrane that covers and protects the septum). This allows your surgeon to reshape the septum’s bone and cartilage. Sometimes your surgeon will remove parts of the bone and cartilage, then reshape and reposition your nose’s underlying structures. Afterward, they’ll reposition the mucosa back over the septum. Your nose is not broken during surgery. The operation takes between 30 and 90 minutes.Afterward, your surgeon may insert splints or soft packing to hold nasal tissue in place, prevent nosebleeds and reduce the risk of scar tissue. Usually, the splints stay in one week. Sometimes, your surgeon might leave only dissolving stitches, which disappear on their own over time.How painful is a septoplasty?Following septoplasty, you can expect mild to moderate discomfort. Many people compare the feeling to a sinus infection — with some pain and pressure around the eyes, across the forehead and across the cheeks and upper teeth. These side effects are normal and generally fade within a few days.AdvertisementWhat happens after septoplasty?After your septoplasty, your medical team will keep a close eye on you while the anesthesia wears off. Once you’re awake and doing well, you’ll be able to go home.Your surgeon will give you a list of postoperative instructions, which will help you manage pain, bleeding and swelling after your septoplasty. You should avoid exercise and heavy lifting during your recovery. This is because an increase in your heart rate and blood pressure could lead to additional bleeding, pain and swelling. Your surgeon will tell you when it’s safe to resume your normal routines.(Note: Read more about postoperative care below, in the section “Recovery and Outlook”.)Care at Cleveland ClinicSchedule a SeptoplastyFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of septoplasty?Septoplasty can improve airflow through your nasal passages. This can result in a number of benefits. For example, septoplasty:Treats breathing problems caused by a deviated septum, nasal polyps or other similar conditions.Can reduce or eliminate snoring, giving you a better night’s rest.Allows your sinuses to drain better, resulting in fewer sinus infections.AdvertisementWhat are the risks or complications of septoplasty?Septoplasty complications are rare. But, like any surgical procedure, there are potential risks. These include:Excessive bleeding.Infection.Scarring (this usually isn’t visible since it’s inside your nose).A perforation (hole) in your septum.Numbness of your nose and teeth (usually temporary).Toxic shock syndrome (rare).Spinal fluid leak (rare).Recovery and OutlookWhat’s the septoplasty recovery timeline?Initial septoplasty recovery usually takes about one week or less. But, overall healing of the bone and cartilage will continue for several months to one year.How can I take care of myself after septoplasty?Initial healing time for septoplasty is about one week. Your surgeon will provide you with specific postoperative guidelines, which you should follow closely during this time. Below are some general instructions to help you recover quickly and comfortably.Activity levelAfter surgery, rest at home for several days. You can resume light activities after one week if you feel up to it. Avoid strenuous physical activity for one month. This includes going to the gym, swimming and contact sports.Avoid nose blowing, and sneeze with your mouth open for the first week.If your provider packed your nostrils with splints, avoid getting the splints wet in the shower. (It’s OK to rinse them with saline.) Your provider will remove them in approximately one week. If you don’t have splints, you can bathe the day after surgery.DietUnrestricted. Resume your normal diet as tolerated.Pain controlTake over-the-counter pain relievers, such as acetaminophen (Tylenol®) and ibuprofen (Advil®, Motrin®).If necessary, you can alternate acetaminophen (Tylenol®) and ibuprofen (Advil®, Motrin®) every three hours to control your discomfort.FeverIf you develop a low-grade fever (101 degrees or less), take acetaminophen.If you have a high fever (over 102 degrees) — or if your fever lasts for more than two days — call your healthcare provider.AntibioticsYour provider may give you antibiotics. You should start these the day of your surgery and complete the entire course (unless your provider tells you otherwise).Surgical dressingYour surgeon will place gauze under your nose after the procedure. You should leave this in place until the drainage stops — usually after 48 hours. You can switch out the gauze as needed.If you have excessive bleeding that requires changing the gauze every hour, call your provider for further instructions.Your surgeon may also place soft splints or packing inside your nose. Typically, packing dissolves on its own. But, if they’re still present, your provider will remove them at your first follow-up visit (usually after one week). (Note: If the packing falls out when you sneeze, you don’t need to replace them.)Keeping the surgical site cleanYou’ll need to rinse the inside of your nose with saline. Your provider will tell you how to do this.If you develop crusting around your nostrils, dip a cotton swab in half-strength hydrogen peroxide (equal amounts of peroxide and water). Then gently clean the area, being careful not to insert the cotton swab into your nostrils.What’s the outlook for people who have septoplasty?The outlook after septoplasty is generally good, with success rates up to 85%. But, about 15% of people who have septoplasty don’t notice a significant improvement in symptoms.When to Call the DoctorWhen should I see my healthcare provider?If you have constant trouble breathing through your nose, schedule a visit with your healthcare provider. Your may have nasal blockage due to a deviated septum, nasal polyps or other conditions. Septoplasty may be a good treatment option for you.If you’ve recently undergone septoplasty, you should call your provider if you experience:Trouble breathing.A heavy, uncontrollable nosebleed.Pain that worsens and doesn’t improve with medications.High fever.Chills.Headaches.Disorientation.Neck stiffness.Additional DetailsIs a septoplasty the same as rhinoplasty?No. While rhinoplasty focuses on changing the external appearance of your nose or focuses on the structural support of your nose, septoplasty targets the structures inside your nose. Rhinoplasty is generally a cosmetic surgery procedure, while septoplasty restores function.Does septoplasty change nose shape?No. Septoplasty itself doesn’t change the shape of your nose. But, if you want to change the shape of your nose in addition to correcting your deviated septum, your surgeon may be able to combine septoplasty with rhinoplasty. Ask your healthcare provider about your treatment options.A note from Cleveland ClinicSeptoplasty is a minor surgery that offers major benefits for many people. It can open your nasal passages and improve your breathing. While septoplasty is a common procedure, it might not be right for everyone. So, if you have difficulty breathing through your nose, your healthcare provider will need to determine why. If you have nasal polyps or nasal septum deviation, septoplasty could ease your symptoms and improve your quality of life.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/19/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule a SeptoplastyFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"