"Serotonin Antagonist: What It Is, Uses, Side Effects & Risks800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Serotonin AntagonistAdvertisementAdvertisementAdvertisementSerotonin AntagonistSerotonin antagonists (also called 5HT3 receptor antagonists) are medications that help prevent nausea. Healthcare providers prescribe these medications to people undergoing chemotherapy or radiation therapy. They also prescribe them to prevent nausea related to anesthesia effects after a procedure.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewWhat are serotonin antagonists?Serotonin antagonists are a class of prescription medications that help prevent and treat nausea and vomiting. They’re a type of anti-nausea medication called antiemetics.Other names for this drug class include:Serotonin-receptor antagonists.5HT3 receptor antagonists.Serotonin blockers.List of serotonin antagonistsSerotonin antagonists include:Ondansetron (Zofran®).Granisetron (Kytril®).Dolasetron (Anzemet®). This medication is no longer available in the United States.Palonosetron (Aloxi®).These medications come in the form of oral pills and injections.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are serotonin antagonists used for?The U.S. Food and Drug Administration (FDA) approves serotonin antagonists for preventing nausea and vomiting related to the effects of:Chemotherapy.Radiation therapy.Anesthesia (after a procedure or surgery).They’re approved for both children and adults.Healthcare providers sometimes prescribe these medications for other conditions. This is an off-label, or non-FDA-approved, use of the medication. Non-FDA-approved uses of serotonin antagonists include:Treatment of postoperative nausea and vomiting.Nausea and vomiting during pregnancy (morning sickness) that’s severe or difficult to manage (refractory).How common are serotonin antagonist prescriptions?Serotonin antagonists are common prescriptions. Ondansetron (Zofran) specifically is one of the most common medications healthcare providers prescribe to prevent or treat nausea.AdvertisementProcedure DetailsHow do serotonin antagonists work?To understand how serotonin antagonists work, it helps to understand how serotonin receptors and serotonin function.There are several types of serotonin receptors in your body. The highest concentration is in your gastrointestinal system. Serotonin antagonists work to block the 5-HT3 (serotonin) receptors in your gastrointestinal (GI) system and the chemoreceptor trigger zone (CTZ). The CTZ is an area of your medulla oblongata that plays a role in initiating vomiting.Serotonin is a neurotransmitter that also acts as a hormone. About 90% of your serotonin is in the cells that line your gastrointestinal tract. Serotonin has several roles, including regulating your mood, digestion, sleep and more.Nausea happens when your body releases serotonin into your gut faster than it can digest it. Your brain then receives a chemical message, which you perceive as nausea.Serotonin antagonists fit into 5-HT3 receptors but don’t activate them. Instead, they don’t let serotonin act on the receptors. This can prevent or treat nausea.How long do I need to take a serotonin antagonist?It’s easier to prevent nausea and vomiting than it is to stop them once they start. Because of this, healthcare providers usually have people who are undergoing chemotherapy and/or radiation therapy take serotonin antagonist medication on a strict schedule around the clock.Your provider will be able to give you more specific information and instructions.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdvertisementRisks / BenefitsWhat are the side effects of serotonin antagonists?Relatively common side effects of serotonin antagonists include:Headache.Fatigue.Constipation.How well do serotonin antagonists work?Serotonin antagonists generally work well to prevent nausea. But everyone is different, so the results can vary. Some medications may work better for you than others.What are the risks or complications of serotonin antagonists?Serotonin antagonists are generally safe for most people. There are a few considerations to keep in mind before you start taking this medication.Heart issuesPeople who have certain heart conditions may be extra sensitive to serotonin antagonists, which can be dangerous. It’s important to let your healthcare provider know if you have any of the following conditions if they’re going to prescribe you an anti-nausea medication:Long QT syndrome.Ventricular arrhythmia.Heart disease.Serotonin syndromeTaking serotonin antagonists alongside other medications that affect your serotonin levels can lead to serotonin syndrome, a potentially life-threatening drug reaction. This occurs because when the 5-HT3 receptors are blocked, there’s more serotonin circulating in your bloodstream.Other medications that affect your serotonin levels include:SSRIs.SNRIs.Mirtazapine.Monoamine oxidase inhibitors (MAOIs).Be sure to tell your provider if you take any of these medications.Symptoms of serotonin syndrome, listed from mild to severe, include:Nervousness.Nausea and vomiting.Diarrhea.Dilated pupils.Tremor.Agitation, restlessness.Muscle twitching, involuntary muscle contractions, muscle spasms, muscle rigidity.Sweating, shivering.Side-to-side eye movements.Confusion, disorientation or delirium.Rapid heart rate.High blood pressure.High body temperature (greater than 101.3 degrees Fahrenheit [38.5 degrees Celsius]).Seizures.Loss of consciousness.If you have these symptoms, call 911 or get to an emergency room as soon as possible.PregnancySerotonin antagonists aren’t associated with a high risk of congenital conditions during pregnancy. But there’s a small increased risk of septal birth defects and cleft palate.When to Call the DoctorWhen should I call my healthcare provider?You should have regular appointments with your healthcare provider when you’re taking a serotonin antagonist long-term to assess how well it’s working.Otherwise, talk to your healthcare provider in the following situations:If you develop bothersome side effects.If your nausea and vomiting aren’t improving or if they’ve gotten worse.If you’re thinking of stopping the medication.A note from Cleveland ClinicExperiencing nausea often is no fun. The good news is that there are prescription medications, including serotonin antagonists, that can help. If you’re receiving chemotherapy or radiation therapy or have intense morning sickness, talk to your healthcare provider about your nausea and vomiting prevention options. They’re available to help you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/04/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"