"Shock Symptoms & First Aid Treatment800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Shock First Aid TreatmentAdvertisementAdvertisementAdvertisementShock First Aid TreatmentShock first aid treatment is first aid given to a person suffering from shock. Shock is a serious condition that occurs when your body doesn’t get enough blood flow. Symptoms of shock include low blood pressure, rapid heartbeat, shallow breathing, anxiety and fatigue. The first step in shock first aid treatment is calling 911.ContentsArrow DownOverviewProcedure DetailsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsWhen to Call the DoctorOverviewWhat is shock first aid treatment?Shock first aid treatment involves giving first aid to someone who has suffered from shock. Shock requires immediate treatment. As many as 1 in 5 people who get shock die from it. Hospital emergency departments in the United States report more than 1 million cases of shock each year.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is shock?Shock is a serious, life-threatening condition that happens when your body doesn’t get enough blood flow. Lack of blood flow to your organs means they won’t get enough oxygen, which can cause them to fail. Shock may also lead to a lack of oxygen in your body’s tissues (hypoxia) and can cause your heart to stop (cardiac arrest).What causes shock?Several medical conditions may cause shock, including:Low blood volume.Inadequate pumping action in your heart.Excessive widening (dilation) of your blood vessels.Certain medications that reduce heart function.Damage to your nervous system.AdvertisementWhat are the four main types of shock?There are several different types of shock. These include hypovolemic shock, cardiogenic shock, obstructive shock and distributive shock.Hypovolemic shockHypovolemic shock occurs due to low blood volume. Low blood volume means the amount of blood entering your heart with every heartbeat is lower than normal. So, the amount of blood pumped out to your body is lower than normal. Hypovolemic shock may be caused by:Excessive external bleeding due to cuts or other injuries.Severe internal bleeding due to an ulcer, a ruptured blood vessel or a ruptured pregnancy outside of your uterus (ectopic pregnancy).Loss of other bodily fluids due to major burns, inflammation of your pancreas (pancreatitis), a hole in your intestinal wall, severe vomiting or diarrhea, certain kidney disorders, excessive use of diuretics (medications that rid your body of salt and water) or untreated diabetes.Severe dehydration.Cardiogenic shockCardiogenic shock occurs when damage to your heart leaves it unable to pump as much blood as your body needs. The most common causes of cardiogenic shock include:Heart attack (myocardial infarction).Malfunction of a heart valve.Abnormal heart rhythm (arrhythmia).Heart muscle rupture or infection (myocarditis).Heart valve tear or infection (endocarditis).Obstructive shockObstructive shock occurs due to a blockage in your heart, arteries or veins which prevents blood from flowing properly. It can also occur due to a buildup of fluid in your chest cavity. Causes of obstructive shock include:Blood clot in your lungs (pulmonary embolism).Air trapped between your lung and chest wall (tension pneumothorax).Blood or fluid buildup in the space between your heart muscle and outer heart sac (cardiac tamponade).Distributive shockDistributive shock occurs due to excessive widening (dilation) of your blood vessels. When this happens, your blood pressure lowers and your organs don’t receive enough blood flow and oxygen. There are several types of distributive shock. These include:Anaphylactic shock: Occurs due to a severe allergic reaction (anaphylaxis).Septic shock: Occurs due to a severe bacterial infection in your bloodstream.Neurogenic shock: Occurs due to damage to your nervous system, caused by a spinal cord injury.Distributive shock may also occur due to drug overdoses, brain injuries and certain endocrine disorders (such as Addison’s disease).How long does shock last?The amount of time shock lasts depends on the type of shock and how quickly you receive treatment. Shock may have long-term effects.AdvertisementWhat are the signs and symptoms of shock?The symptoms of shock depend on the cause and type of shock. Extremely low blood pressure is one of the most common signs. Other signs and symptoms of shock may include:Dizziness, lightheadedness or faintness.Anxiety.Blue or gray lips and fingernails.Confusion.Excessive sweating.Low or no urine (pee).Pale, cool or clammy skin.Fatigue.Rapid but weak heartbeat.Shallow breathing.Procedure DetailsThe most important step in shock first aid treatment is calling 911. Shock requires urgent medical care.What is the first aid treatment for shock?If you think someone is suffering from shock, the first thing you should do is call 911 or your local emergency department to request immediate medical help.While waiting for help to arrive, check to see if the person is breathing. If they’re not breathing, start rescue breathing and CPR if you know how to do so. If the person is breathing, check their breathing every five minutes until help arrives.If the person is awake and doesn’t have a head, neck, spine or leg injury, lay them down on their back with their feet elevated about 12 inches. Don’t elevate their head. If raising their legs causes pain, lay them flat. Make sure the person is warm and comfortable, and loosen any tight clothing. If the person has any visible wounds and you know how, give appropriate first aid and try to control any bleeding.If the person starts to vomit, drool or bleed from their mouth, turn their head to the side to prevent choking (as long as they don’t have a spinal injury). If you suspect they have a spinal injury, perform a “log roll” instead: keep the person’s head, neck and back in line, and then roll their body and head together as a unit.Some things you should not do as part of first aid shock treatment include:Do not give the person anything by mouth, including food or drink.Do not move the person if you suspect they may have a spinal injury.Do not move the person unless they’re in danger.Do not wait for mild shock symptoms to worsen before calling for help.What are the effects of shock first aid?If left untreated, shock can be fatal. By providing shock first aid treatment, you may be able to help stabilize a person suffering from shock until help arrives. The long-term effects of shock depend on the cause, type and amount of time that passed before treatment started.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentWhen to Call the DoctorWhen should I call 911?If you think someone is suffering from shock, the first thing you should do is call 911 or your local emergency number to request immediate medical help. Follow shock first aid treatment until help arrives.A note from Cleveland ClinicShock is a serious, life-threatening medical condition that occurs when your body doesn’t get enough blood flow. Lack of blood flow means your organs don’t get enough oxygen to work correctly. Shock is one of the main causes of death in severely ill or injured people. Shock requires immediate first aid treatment. If you think someone might be suffering from shock, call 911 as soon as possible. Learn the steps of shock first aid treatment so you can assist until help arrives.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/24/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementQuestions 216.444.2538Appointments & LocationsRequest an AppointmentFind a Primary Care ProviderFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"