"Shoulder Replacement: Surgery & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Shoulder ReplacementAdvertisementAdvertisementAdvertisementShoulder ReplacementYour shoulder is an important joint that rotates with a greater range of motion than any other joint in your body. If it’s causing you pain to the point that you can’t reach into a cabinet, can’t sleep well, or experience other symptoms, your healthcare provider might consider replacement surgery. This procedure can relieve your pain and increase mobility.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorResourcesContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorResourcesOverviewEducational video describing total shoulder replacement surgery.What is a shoulder replacement?A shoulder replacement is a procedure that tries to eliminate the source of pain and dysfunction by replacing damaged parts of the shoulder joint with artificial components called prostheses. The most common reasons for a shoulder replacement surgery are osteoarthritis, rotator cuff tear arthropathy, avascular necrosis or rheumatoid arthritis. The procedure is meant to relieve your pain, improve your strength, increase your range of motion and enable you to use your shoulder and arm.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow does your shoulder work?Similar to the hip joint, your shoulder is a large ball and socket joint. It can rotate through a greater range of motion than any other joint in your body. The shoulder joint is made up of bones, tendons, muscles and ligaments which hold the shoulder in place and allows for its movement. Bones of the shoulder joint include the Clavicle (collar bone), Scapula (large flat triangular bone called shoulder blade) and Humerus (upper arm bone).Your clavicle connects with the shoulder blade at the acromioclavicular joint, or A.C. joint. The clavicle attaches your shoulder to your rib cage and holds it out and away from your body. The rounded head of the humerus, or upper arm bone, rests against the socket in the shoulder blade. The surfaces of the bones where they touch are covered by a smooth substance called cartilage that protects your bones and enables them to glide and move easily. The muscles and tendons that surround the shoulder provide stability and support. A thin, smooth tissue called the synovial membrane covers all remaining surfaces inside the shoulder joint. In a healthy shoulder, this membrane makes a small amount of fluid that lubricates your cartilage and eliminates almost any friction in your shoulder.Rotator cuff muscles are a group of four muscles that surround the shoulder joint and their tendons attach to the end of the arm bone. The function of the rotator cuff is to keep the ball and socket joint together and help with its movement. That is why when rotator cuff tendons tear, patients experience pain, instability and loss of function. Trauma from a fall in an elderly patient or injury from a contact sport may lead to rotator cuff tear. Depending of the size and location of the tear and patient’s age, duration of symptoms, overall health, range of motion and desired level of activity, rotator cuff tears can be treated with physical therapy or occasional cortisone injection and when these approached fail, you may need surgery.How common are shoulder replacement surgeries?More than 70,000 people in the United States have this procedure done every year.AdvertisementWhat are the prostheses made of?A metal ball is used to replace the humeral ball which is made out of a special type of stainless steel which is attached to a stem that is usually made out of titanium and keep the ball attached to your arm while a polyethylene cup replaces the glenoid socket.Why is a shoulder replacement done?Shoulder replacement surgery is an option given to patients who suffer from joint dysfunction. This is usually the result of osteoarthritis, rotator cuff tear arthropathy, avascular necrosis, or rheumatoid arthritis, or (rarely) for those who have sustained a severe fracture from a trauma or fall. Generally, all other modes of treatment are considered first, such as physical therapy and medications.You may be a candidate for shoulder replacement surgery if you have the following symptoms:Your shoulder pain is so severe that you struggle with everyday activities such as washing, getting dressed and reaching into a cabinet.You have loss of motion in your shoulder.You have weakness in your shoulder.You have pain that’s so bad that it prevents you from getting a good night’s sleep.You’ve tried anti-inflammatory medications, cortisone injections and physical therapy with no relief.You have prior arthroscopic surgery, rotator cuff or fracture repair that failed to relieve your symptoms.AdvertisementWhat are the types of shoulder replacements?Your surgeon will have a conversation with you regarding what type of shoulder replacement you may need. There are four options:Hemiarthroplasty: In this procedure only the ball and stem are replaced. The stem is connected to the ball and articulated with your natural socket.Resurfacing Hemiarthroplasty: This involves replacing the joint surface of the humeral head with a cap-like prosthesis, without a stem.Anatomic Total Shoulder Replacement: The arthritic joint is replaced with a highly polished metal ball attached to a stem on the humeral side, and a plastic cup on the glenoid socket.Stemless Total Shoulder Arthroplasty: This is a bone-preserving version of the total shoulder arthroplasty where the metallic ball is attached to the upper arm without a stem.Reverse Total Shoulder Replacement: In the reverse total shoulder replacement, the joint is literally reversed meaning the metal ball is placed where the glenoid socket was and a plastic cup is attached to the stem and is moved to the upper arm bone (humerus).What happens at the first appointment for a shoulder replacement surgery?Your consultation visit and initial appointment with the orthopedic surgeon will include a series of x-rays, a physical examination and a thorough review of your medical history.The physical exam will help the surgeon determine the source of pain and also the decrease in range of motion.X-rays reveal bone spurs, damaged joint surfaces and any narrowed joint spaces. If there was a trauma or injury to the shoulder, the x-ray will assist your healthcare provider with evaluating whether the fracture can be fixed or if your shoulder will need to be replaced.Detailing a history of your shoulder problem includes describing for the surgeon the degree of pain with activity, limited use, loss of motion and pain at rest, prior treatments including medications, injections, physical therapy and previous surgeries.With this information and, together with your family, you and your orthopedic surgeon will determine the next best steps.Procedure DetailsHow do I prepare for shoulder replacement surgery? What happens before the procedure?Unless there is an emergency, your surgery will be scheduled in advance. Knowing the date of your operation, you will have enough time to prepare and plan for any special help you might need following discharge from the hospital. It is important to have a partner to assist you with your home exercises following discharge. Your partner should accompany you to physical therapy at least once or twice during your hospital stay. Shoulder replacement can be done as an outpatient procedure but on average, you will be staying one night in the hospital after surgery to make sure your pain is well managed and you’re medically stable before leaving the hospital.A series of pre-operative tests will be scheduled one to two weeks before surgery. They usually include: some blood tests, an electrocardiogram (EKG) that evaluates the electrical activity of your heart and a visit with a healthcare provider to make sure you are medically cleared to undergo surgery. Some medications may be discontinued because they will complicate surgery and other medications you may need to continue. You should discontinue use of any anti-inflammatory medication, including aspirin, one week before surgery unless instructed otherwise. You will be given instructions regarding your daily medications in this visit.Most patients spend the night before surgery either at home or in a hotel nearby. They are then admitted to the hospital the next morning. You will be informed via a phone call the day before about the exact time and location to go on the day of the surgery. You may not eat or drink anything after midnight the day before your surgery.Your physician and the anesthesiologist will discuss the type of anesthetic that is most appropriate. The most frequent form is general anesthesia by giving you medications through your IV which will keep you relaxed, comfortable and sedated. You will also be given a choice to supplement your anesthesia with a regional or block anesthetic to minimize your postoperative pain.After surgery, most patients are able to eat a regular dinner and walk to the bathroom. Regional anesthesia offers prolonged pain relief after the operation. A family member may remain with you until the time of your surgery (depending on hospital visitation rules). Any nail polish should be removed prior to admission. You will be asked to remove all jewelry, glasses, dentures, wigs and contact lenses. No rings may be worn on either hand and any articles of value should be left home or given to your family members.The nurses will prepare you for surgery by taking your blood pressure, pulse, temperature and administering pre-operative medications. These medications may cause drowsiness and a dry mouth. An IV or intravenous line for fluid, medication and antibiotics will then be inserted in your arm before going to the operating room.You will be transported to surgery on a cart. Different hospital staff will be asking your name, verifying your identification bracelet and asking you which shoulder will be operated on, right or left.Your family may wait in the designated area, where they can check in with the receptionist. As soon as your surgery is over, your surgeon will call the waiting area and ask to speak with your family. If surgery gets prolonged for any reason, your surgeon will usually give periodical updates to your family members and keep them informed about the progress.What happens during the shoulder replacement surgery?In the operating room, you will meet nurses, physicians, technicians and anesthesiologists. The operating room will be bright and very cool. Blankets are available to keep you warm. Because of the number of people working, the room will seem very busy and somewhat noisy. You will then be moved to the operating table and made comfortable. Sterile surgical draping will be hung to shield and protect the surgical site. The anesthesiologist will remain by your head, monitoring your condition throughout the surgery.How long will the shoulder replacement surgery last?The surgery will last approximately two hours. It will be longer for your family members because it takes about an hour after your say goodbye to them for surgery to start and it will be approximately one to two hours after surgery for you to completely recover from general anesthesia and be able to see them again.Will I be unconscious during the shoulder replacement surgery?Yes. You will be under general anesthesia to keep you asleep.What should I expect after the procedure?After surgery, you will be transported to the Post Anesthesia Recover Unit (PACU), where you will be cared for by skilled nurses and members of the anesthesiology team. They will monitor your vital signs (blood pressure, pulse and breathing) frequently while you are recovering from the effects of anesthesia. When you wake up, you will have a dressing on your shoulder. An x-ray of your shoulder will be done during your stay in the recovery room.The minimum stay in a PACU is at least one hour. The length of your stay depends on many factors including the effects of anesthesia. Your physicians and nurses will evaluate your condition and determine the best time for you to be released to a hospital room. Your family will not be permitted in the PACU, but may visit when you are assigned to a hospital room.After being transported to your room and assisted into your bed, your nurse will evaluate your condition — checking your vital signs, shoulder dressing and the movement and sensation of your hand. Your arm may be placed in a sling for the first 24 hours following surgery.Because shoulder surgery is painful, pain control is very important. Your regional nerve block should mask most of the pain but at times, the block may not work 100% and you may need to take oral pain medication to remain comfortable.During your hospitalization, you are encouraged to get out of bed and move around. Bring loose-fitting clothing with you, as this will make dressing easier. You’ll be able to shower after 48 hours.The physical therapist will help you learn specific restrictions and exercises and how to continue them at home. You will also be given written instructions upon your discharge. These exercises are fairly simple and usually require only a short amount of time.A successful outcome to your total shoulder joint replacement depends heavily on the meticulous performance of your exercises. Through this structured exercise program, your muscles will be methodically and progressively stretched and strengthened over one year's time. The desired effect is the optimal function of your new total shoulder replacement. Most patients, do not require physical therapy but, in certain situations, formal outpatient physical therapy after hospital discharge may be required. Your surgeon will discuss this with you in your follow up office visits based on your progress with the self-directed exercises.An occupational therapist will visit you at least once in the hospital before you are discharged. Your therapist will provide instruction and assistive devices to help you maintain your independence and protect your new shoulder from injury.Care at Cleveland ClinicGet Orthopaedic CareMake an AppointmentRisks / BenefitsWhat are the advantages of shoulder replacement surgery?Pain relief and improved range of motion and function.Are there any complications of shoulder replacement surgery?All surgeries come with some risk. There are several possible complications that follow shoulder replacement surgery:Infection: Minor infections in the wound area are treated with antibiotics while major infections may require additional surgery.Dislocation: In case of reverse total shoulder replacement, implant may dislocate which requires closed reduction or surgery to reduce or revise the implant.Other prosthesis problems: Prostheses can wear down and sometimes the components can get loose. More surgery is sometimes needed.Nerve injury: Nerves can be damaged during surgery.There is an increased risk of complications if you have diabetes. Patients with diabetes may get wound complications and infections.Recovery and OutlookHome going instructionsCheck the incision daily for increased swelling or drainage.Keep the dressing intact. Your dressing is sealed and will allow you to bathe and shower. Let the water trickle over it and pad it dry afterward. Your dressing will be removed at your first follow up appointment.At discharge, you will be given a return appointment, 10 to 14 days later for removing your dressing as well as a prescription for pain medication.Your healthcare provider will advise you of specific precautions and the limitations of activity.General instructions include the following:Drive as instructed by your healthcare provider. You will, however, need a driver available to take you home at the time of discharge.Limit lifting anything heavier than a glass of water for the first two to four weeks.Limit lifting heavy objects for two months.Resume active movement of arm within limits of pain.Continue exercises at home as instructed by your physical therapist and other healthcare providers. Be careful – don’t overdo it!Don’t use your operative arm to push yourself up from a bed or chair.Don’t do any repetitive heavy lifting. Don’t play contact sports.Avoid placing your arm in any “extreme position” for the first six weeks after surgery. An example is to not stretch your arm straight out to the side or behind your back.After dischargeYour rehabilitation will be ongoing and progressive. It may take six months to one year to achieve the optimal benefit. It is important to realize that progress is sometimes slow and not always steady. You must persevere through your therapy program, performing your exercises several times a day for five to 10 minutes each. Don’t lift anything heavier than five pounds during the first month following surgery. Also, refrain from using your arm to lift, reach, push or pull above waist level (for six weeks). After about six weeks you’ll begin physical therapy where you’ll use gym-type equipment to strengthen your muscles. The healthcare provider will monitor your progress during visits at intervals of six weeks for the first four to five months, and then less frequently for one year.Please note that any healthcare provider or dentist contemplating a future operative or invasive procedure, including dental work, must give you antibiotics preoperatively and postoperatively to prevent infection. This includes all surgeries, minimally invasive (or \"oscopy\") procedures, tooth extractions and root canals. Any infection, such as a urinary tract infection, must be treated promptly with antibiotics, as bacteria can spread to the replaced joint. When receiving any medical treatment, notify the person in charge that you have had a total shoulder replacement.Return to work depends on your progress with therapy and your job demands. People who do not have a physically demanding job can usually go back to work after two months. If your job involved heavy lifting or doing repetitive overhead activity, you may have to make changes to your work environment. If you have a highly demanding job, you should maximize your therapy exercises including strengthening and discuss the best time to return to work with your surgeon. People who have undergone a shoulder replacement are able to participate in sports such as golf, swimming and tennis. Discuss your goals with your surgeon and therapist before so you can plan your rehabilitation and sport activities accordingly.How long does it take to recover from shoulder replacement surgery?The recovery period varies from person to person and also depend on the type of surgery you had. Typically, you should use your arm for waist-level activities on day one following surgery. You should dress and feed yourself within the first week. Be careful with driving. Only resume driving when you’re certain that you can do so safely.When to Call the DoctorWhen to contact your healthcare provider:If you are experiencing any problems or have questions and concerns, call your surgeon's office. Any symptoms such as fever, increased drainage, redness, swelling or a sudden and significant increase in pain or change in sensation or movement of the arm after your nerve block is cleared should be reported promptly.ResourcesDownload Treatment GuidesDownload a Free Guide on Shoulder PainMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/04/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Orthopaedic CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2606Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"