"Sitz Bath: Definition & Benefits800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Sitz BathAdvertisementAdvertisementAdvertisementSitz BathA sitz bath is a warm water bath you sit in to relieve discomfort in your perineal region. Soaking this area in warm water relaxes your anal sphincter, which helps increase blood flow through your anal tissues. This promotes healing and reduces the pain, itching and irritation felt due to various health conditions.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewWhat is a sitz bath?A sitz bath is a warm, shallow bath you sit in to relieve pain, burning or itching in your perineum. Your perineum is the area between the opening of your butt (anus) and your external genitals (scrotum or vulva). Soaking your perineal area in warm water reduces muscle spasms by relaxing your anal sphincter (the ring of muscles that open and close at the bottom of your anus). Relaxing these muscles improves the blood circulation in your anal tissues, which promotes healing and reduces pain.The first documented use of a sitz bath in the United States was in 1859. Initially, a sitz bath was a metal half bathtub. People soaked the lower half of their bodies in a reclining position. By the late 1880s, sitz baths were considered spa treatments. Today, healthcare providers commonly prescribe sitz baths for a variety of reasons, including hemorrhoid relief and as a treatment for anal fissures and other health conditions.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is a sitz bath used for?You can use a sitz bath to relieve discomfort due to several common health conditions and medical procedures. The warm water increases blood flow to your perineal area, which promotes faster healing.Sitz bath for hemorrhoidsHemorrhoids are swollen veins located in your lower rectum and anus. They occur for many reasons, including constipation, pregnancy and childbirth. Sitz baths can help reduce pain and swelling caused by hemorrhoids. If you’ve recently had hemorrhoids removed, sitz baths can also help with any discomfort you may feel after surgery.Sitz bath for postpartum recoveryAfter childbirth (postpartum), you may experience soreness and swelling in your perineal area. This can occur whether you have a vaginal delivery or a C-section. Sitz baths can help relieve any pain and swelling, as well as promote healing in the area.Sitz bath for Bartholin cystsA Bartholin cyst is a type of cyst that can form on your labia near the opening of your vagina. It can happen when a blockage occurs at the opening of one of your Bartholin glands, which produce fluid that helps lubricate your vagina. A sitz bath may help a Bartholin cyst burst and drain on its own.Sitz bath for anal fissuresAn anal fissure is a tear located in the lining of your anus or anal canal. The pain you feel before or immediately after pooping (a bowel movement) comes from muscle spasms caused by the anal fissure. Sitz baths can help those muscles relax, which can help the anal fissure heal over time.A sitz bath can also help relieve symptoms or promote healing in people with other health conditions, including:Perianal abscesses.Anal fistulas.Recent anal, vaginal or vulvar surgery.Anal diseases.You may also choose to use a sitz bath to help keep your perineal area clean or to relieve discomfort during bowel movements.Procedure DetailsHow to use a sitz bath kit to relieve pain, burning or itching in your perineum.How do you use a sitz bath?You can take a sitz bath in your bathtub or make a sitz bath using a small plastic tub that fits over your toilet.A sitz bath for your toilet may come in a kit. The kit includes a shallow basin that’s slightly larger than your toilet bowl. It may also come with a plastic bag that has a long tube on one end. You fill the bag with warm water and it runs through the tube to fill the tub. Sitz bath kits are available online and in many stores.Whether using your bathtub or a sitz bath kit, clean and rinse the tub thoroughly before using it. If using a plastic tub, place it on your toilet bowl, and cover it with your toilet seat.Fill your bathtub or the plastic tub with enough warm water to cover your perineum (3 to 4 inches). The water should be warm. A good average temperature is 104 degrees Fahrenheit (40 degrees Celsius). Make sure the water isn’t too hot. If the water is too hot, you could burn your skin.If you’re using a plastic tub, you can pour the water directly into it before you sit down. Or you can fill the tub using the plastic bag and tubing after your sit down. As the original water starts to cool, you can add new warm water from the plastic bag.Soak your anal area in the tub for 15 to 20 minutes. You don’t need any Epsom salt for a sitz bath. Warm water alone works. Salts, oils and other substances may cause inflammation. Your healthcare provider may prescribe a sitz bath with medication depending on your condition. Only add salt or other substances to your sitz bath as directed by your provider.After your sitz bath, pat dry your buttocks and perineal area with a clean towel. To avoid irritating the area, don’t rub or scrub. Dispose of the water, and clean the bathtub or plastic tub.Your provider may recommend you take three to four sitz baths a day if they’re working to provide relief for pain, itching and discomfort.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdvertisementRisks / BenefitsWhat are the advantages of sitz baths?Sitz baths are a noninvasive treatment option that may provide relief for the pain, itching and discomfort that comes with many common health conditions. They’re relatively easy to use and free (if you use your own bathtub) or low-cost (if you buy a kit).What are the risks or complications of using a sitz bath?There’s very little risk involved in the use of a sitz bath. That’s because it’s considered a noninvasive treatment. Rarely, an infection could develop in your perineal area. This could occur if you haven’t cleaned the sitz bath carefully before use. Don’t share your plastic sitz bath with others. Infection may also occur if you had recent surgery in your perineal area.If your pain worsens or your perineum gets red and puffy, stop using the sitz bath immediately. Call a healthcare provider for additional guidance.AdvertisementWhen to Call the DoctorWhen should I see my healthcare provider?If your perineal pain hasn’t started to improve after two or three sitz baths, call a healthcare provider. You may have developed an infection or be experiencing pain for another reason.If you’re pregnant or recently had a baby, ask your provider before starting sitz baths. They’ll give you specific instructions on timing and how to take them.A note from Cleveland ClinicA sitz bath is a warm, shallow bath you sit in to relieve discomfort in your perineal region. Soaking this area in warm water relaxes your anal sphincter, which helps increase blood flow through your anal tissues. This promotes healing and reduces the pain, itching and irritation felt due to various health conditions. Using a sitz bath offers many benefits and very little risk. Ask your healthcare provider if you should try sitz baths to treat your condition.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/11/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementCall Appointment Center 24/7 866.320.4573Questions 216.444.2200Request an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"