"Small Bowel Resection Surgery: Procedure & Purpose 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Small Bowel ResectionAdvertisementAdvertisementAdvertisementSmall Bowel ResectionIf you have a severe gastrointestinal disorder or injury, you may need small bowel resection surgery. This procedure removes the damaged or diseased portion of your small bowel (intestine) and typically doesn’t affect digestive system functioning. It’s for people with advanced Crohn’s disease, congenital malformations, hernias and more.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a small bowel resection?A resection removes the damaged or diseased portion your small bowel (intestine). The procedure is also known as a small intestine resection. Some surgeries remove a small part, while other resections are more extensive sections.Your small bowel is 20 to 30 feet long. It consists of many tissue layers that twist and fold. This organ is where your body absorbs nutrients from the foods you eat. Removing a section of tissue typically doesn’t affect intestinal functioning.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho is small bowel resection surgery for?This procedure is for people with severe gastrointestinal (GI) conditions. They include:Abnormal growths, such as small intestine cancer, tumors and polyps.Congenital GI disorders, such as Meckel’s diverticulum and malrotation. (Congenital means you’ve had it from birth.)Chronic inflammatory GI issues, like Crohn’s disease, that cause intestine narrowing (stricture).Incarcerated abdominal hernia, which in severe cases can affect blood flow to your intestines.Necrotizing enterocolitis, a complication of prematurity that causes intestinal tissue to die.Small bowel obstruction, including intussusception and related conditions, such as intestinal pseudo-obstruction.Trauma, including accidents that leave a hole (perforation) in your small intestineWhen is this procedure necessary?You may need a resection if the GI condition doesn’t respond to conservative treatments. These include medications or a special diet. In life-threatening cases, like an obstruction, immediate surgical treatment is necessary.You may need a similar procedure called a colectomy for illnesses and injuries affecting your large intestine (colon).AdvertisementHow can a small bowel resection help me?By removing the diseased or damaged part of your small bowel, you can restore its function and prevent complications like malnutrition.Is the small intestine the only thing that’s removed?For advanced gastrointestinal disease or injuries, you may also need nearby tissue removed. For example, people with Crohn’s disease complications may need an ileocecal resection.This procedure may remove part of your:Ileum, the last and longest section of your small intestine, which ends at your large intestine.Cecum, the junction between your small and large intestine.Appendix, the small tube that sticks out from your large intestine.AdvertisementProcedure DetailsWhat type of surgeon performs a small bowel resection?Depending on why you need a resection, a general or colorectal surgeon may perform the procedure.General surgeons often perform resections, making them a safe choice for people with a variety of needs. These include emergency surgery for intestinal obstructions, traumatic injuries and hernias.Colorectal surgeons care for people with rare and complex conditions. People with congenital disorders or advanced GI disease may be better served by this specialist.What are the different procedure options?Many surgical techniques are available:Laparoscopic surgery involves small incisions through which your surgeon passes thin tubes with instruments and a camera at the tip.Robotic surgery enables surgeons to safely carry out procedures in hard-to-reach areas. Your surgeon uses robotic technology to enhance the reach and precision of their hands.Open surgery uses one large incision in the mid-abdomen to access your small bowel. This approach may be necessary if you aren’t eligible for a robotic or laparoscopic procedure.What happens before a small bowel resection?If it isn’t an emergency, preparing for small bowel resection surgery includes labs and imaging studies to ensure you’re healthy enough for the procedure. You’ll need to stop certain daily medications, like blood thinners, aspirin or anti-inflammatories.In the days leading up to surgery, you’ll also need to clear your bowels. This starts with eating high-fiber foods and drinking plenty of water to encourage bowel movements. As the procedure gets closer, you’ll need to switch to a clear liquid diet. You may also need an enema or laxatives.What happens during small bowel resection surgery?Here’s what to expect during your procedure:You receive general anesthesia medications that put you to sleep and temporarily block sensation.If it’s a laparoscopic or robotic procedure, your surgeon makes one or more small incisions. For an open procedure, your surgeon makes one large incision.Your surgeon accesses the affected section of your small bowel.They put clamps on either side of the diseased tissue and then remove it.For an obstruction, blood vessel repair (revascularization) may be necessary to restore blood flow to your intestines.When the procedure is complete, your surgeon closes the incision and places a dressing over it.What happens after my surgeon removes the dead tissue?The next steps of your procedure may include:Anastomosis: Connecting the healthy ends of intestinal tissue with either sutures or staples.Ileostomy: If there isn’t enough tissue to connect the ends, your surgeon creates an opening on the external surface of your abdomen. Your small intestine empties through this hole and into a special bag that attaches to your skin.Care at Cleveland ClinicSchedule General SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of a small bowel resection?Resection surgery may prevent severe gastrointestinal issues from worsening. This can help you avoid more extensive treatments like a larger resection. Preserving as much intestinal tissue as possible can help you avoid life-altering complications like short bowel syndrome.What are the side effects of small bowel resection surgery?The procedure has many risks, including:Anastomotic leak, when stitches or staples securing the remaining tissue come loose. This is a life-threatening condition.Chronic anemia.Damage to nearby organs, such as your liver or pancreas.Diarrhea that lasts a few weeks.Hernia, when intestinal tissue bulges through the incision.Stricture.Small bowel obstructions.Why might I have diarrhea after a small bowel resection?Intestinal tissue is very delicate. Significant changes, like removing tissue, disrupt nerves and muscles that help it function. Your body may move nutrients along faster than usual. Or your intestines may need time to adjust the digestive process to bowels that are now shorter.Recovery and OutlookWhat can I expect after a small bowel resection?You’ll stay in the hospital for a few days. At the start of your recovery, the intestines will need to rest, so you won’t be able to consume food by mouth. Instead, you receive nutrients through tube feeding (enteral nutrition). As you start feeling better, you can consume fluids and soft foods by mouth.After discharge, you should continue resting for a few days. It’s essential to get out of bed periodically and walk to prevent blood clots. Care may also include follow-up appointments with your surgeon to ensure your recovery is on track.How long does it take to recover from a small bowel resection?Recovery typically takes a few months. However, most people feel well enough to resume daily activities within a few weeks.What is the prognosis after a small bowel resection?A resection provides long-lasting relief. For traumatic injuries and congenital conditions, the procedure can be curative. But it isn’t always a permanent fix. Conditions like hernias and Crohn’s disease can come back, sometimes requiring an additional resection.When to Call the DoctorWhen should I contact my healthcare provider after small bowel resection surgery?Contact your healthcare provider if you experience:Difficulty having a bowel movement.Frequent nausea and vomiting that make it difficult to keep food or fluids down.Oozing of pus or blood from the incision.Pain that doesn’t get better with medications.Signs of infection, like fever or skin near the incision that’s warm to the touch.A note from Cleveland ClinicSmall bowel resection is a surgery that removes the damaged or diseased portion of your small bowel (intestine). It may be an open, robotic, or laparoscopic procedure. Sometimes it’s necessary to remove or repair tissue from nearby organs, as well. Although it might be hard to imagine life without a section of your small bowel, it’s 20 to 30 feet long. Once your body adjusts, it’s likely that you won’t miss it.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/10/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule General SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"