"SNRIs (Serotonin and Norepinephrine Reuptake Inhibitors): Uses800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/SNRIs (Serotonin and Norepinephrine Reuptake Inhibitors)AdvertisementAdvertisementAdvertisementSNRIs (Serotonin and Norepinephrine Reuptake Inhibitors)SNRIs (serotonin and norepinephrine reuptake inhibitors) are medications that are FDA-approved to treat depression symptoms, as well as other conditions like fibromyalgia and generalized anxiety disorder. They work by keeping certain chemical messengers active in your brain. They’re one of the most commonly prescribed types of antidepressants.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat are SNRIs?SNRIs (serotonin and norepinephrine reuptake inhibitors) are a class of antidepressants that mainly help treat depression symptoms. Healthcare providers prescribe them for other conditions as well.What are the types of SNRIs?SNRIs (and their brand names) that healthcare providers currently prescribe in the United States include:Desvenlafaxine (Khedezla®, Pristiq®).Duloxetine (Cymbalta®, Drizalma®, Irenka®).Levomilnacipran (Fetzima®).Milnacipran (Savella®).Venlafaxine (Effexor®).What conditions do SNRIs help treat?The U.S. Food and Drug Administration (FDA) has approved different SNRIs for different conditions, such as mental health conditions and pain-related disorders.The following SNRIs are FDA-approved to treat symptoms of major depressive disorder:Desvenlafaxine.Duloxetine.Levomilnacipran.Venlafaxine.Milnacipran is only FDA-approved to treat symptoms of fibromyalgia.Duloxetine is also FDA-approved to help treat:Generalized anxiety disorder (GAD).Pain from diabetes-related neuropathy.Fibromyalgia.Chronic musculoskeletal pain.Venlafaxine is also FDA-approved to help treat:Generalized anxiety disorder.Social anxiety disorder.Panic disorder.Off-label usesHealthcare providers sometimes prescribe SNRIs for other conditions. This is considered an off-label, or non-FDA-approved, use of the medication. Examples of off-label uses include:Anxiety disorders.Hot flashes and night sweats associated with menopause.Peripheral neuropathy due to chemotherapy.Urinary incontinence.Attention-deficit/hyperactivity disorder (ADHD).Obsessive-compulsive disorder (OCD).Migraine prevention.How common are SNRIs?SNRIs — and antidepressants in general — are a common prescription in the United States. Duloxetine (Cymbalta®) in particular is one of the most commonly prescribed medications annually in the U.S.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow do SNRIs work?SNRIs work by increasing serotonin and norepinephrine levels in your brain. Serotonin and norepinephrine are neurotransmitters (chemical messengers).Both neurotransmitters play important roles in regulating your mood, sleep-wake cycle and memory. Serotonin also affects your appetite, social behavior and sexual desire. Norepinephrine also increases alertness, arousal and attention.After these neurotransmitters carry out their messages, nerve cells in your brain usually reabsorb them (known as reuptake). As its name — serotonin and norepinephrine reuptake inhibitors — suggests, SNRIs work by blocking (inhibiting) the reuptake of these chemicals. This means that more serotonin and norepinephrine are active in your brain.Each type of SNRI affects the balance of serotonin and norepinephrine differently.What’s the difference between SNRIs and SSRIs?SNRIs and SSRIs (selective serotonin reuptake inhibitors) are both classes of antidepressants, but they work in different ways.SSRIs work by blocking only serotonin reuptake, which increases serotonin levels in your brain. SNRIs increase both serotonin and norepinephrine levels. Because the two medications work differently, they have different side effects.Researchers originally designed SNRIs to be more effective in treating depression symptoms than SSRIs. But studies haven’t conclusively confirmed that they are, in fact, more effective.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentRisks / BenefitsWhat are the side effects of SNRIs?Each type and brand of SNRI has its own side effects. Be sure to talk to your healthcare provider or pharmacist about possible side effects to look out for.In general, common side effects of SNRIs include:Nausea and vomiting.Dry mouth (xerostomia).Constipation.Fatigue and drowsiness.Dizziness.Excessive sweating (diaphoresis).Sexual dysfunction.Side effects of SNRIs are usually mild and improve with time. Talk to your provider if you experience unpleasant side effects. They may recommend adjusting your dose or trying a different medication.AdvertisementWhat are the risks or complications of SNRIs?Possible complications associated with SNRIs include:Risk of suicidal thoughts or behavior.Serotonin syndrome.Antidepressant discontinuation syndrome.Suicidal thoughts or behaviorChildren, teens and adults under the age of 25 may experience an increase in suicidal thoughts or behavior when taking SNRIs, especially when they first start them or when they take a different dose.If you or your child have suicidal thoughts or behavior, call your healthcare provider who prescribed the medication immediately. You can also dial 988 on your phone to reach the Suicide and Crisis Lifeline.Serotonin syndromeSerotonin syndrome is a potentially life-threatening drug reaction that results from having too much serotonin in your body.Serotonin syndrome is rare, but it can happen when you take a new SNRI, an increased dose or multiple medications that act on the serotonin system. The syndrome most often happens when you take an SNRI in addition to other medications that increase your serotonin levels, such as MAOIs or linezolid.Always tell your healthcare provider which medications and supplements you’re currently taking before starting a new medication. And always take your medications as prescribed. These steps can help prevent serotonin syndrome.Symptoms of serotonin syndrome include:Nervousness.Nausea and vomiting.Diarrhea.Dilated pupils.Muscle issues, like twitching, involuntary contractions, spasms and rigidity.Sweating and shivering.Side-to-side eye movements.Severe symptoms include:Confusion or delirium (altered mental status).Rapid heart rate (tachycardia).High blood pressure.Fever.Seizures.Loss of consciousness.Get immediate medical help if you’re experiencing these symptoms. Serotonin syndrome can be fatal if it’s not treated in time.What is SNRI withdrawal?SNRI “withdrawal” is actually called “antidepressant discontinuation syndrome.” It can happen if you suddenly stop taking an SNRI if you’ve taken it for at least six weeks.Symptoms of antidepressant discontinuation syndrome include:Flu-like symptoms, such as fatigue, headache, achiness and sweating.Insomnia.Nausea.Dizziness and lightheadedness.Sensory issues, such as burning, tingling, “buzzing” or mild electric shock-like sensations.Anxiety, irritability and agitation.These symptoms are usually mild, but they can be unpleasant. Never stop taking your SNRI without first talking with your healthcare provider. The safest way to stop taking an antidepressant is to do so slowly, under your provider’s guidance.Antidepressant discontinuation syndrome isn’t technically withdrawal because antidepressants aren’t addictive medications. You can’t become physiologically dependent on antidepressants like you can on other substances, such as opioids, alcohol or nicotine.Recovery and OutlookHow long does it take SNRIs to work?It usually takes six to eight weeks to feel the full effect of SNRIs and notice an improvement in your symptoms. Talk to your healthcare provider if you don’t feel better after this time.AdvertisementWhen to Call the DoctorWhen should I call my healthcare provider?You should have regular appointments with your healthcare provider when you’re taking an SNRI to assess how well it’s working.Otherwise, talk to your healthcare provider:If you develop bothersome side effects.If your symptoms aren’t improving or if they’ve gotten worse.If you’re thinking of stopping the medication.When should I seek emergency care?If you have symptoms of serotonin syndrome or are having suicidal thoughts, call 911 or go to the nearest emergency room.A note from Cleveland ClinicSNRIs (serotonin and norepinephrine reuptake inhibitors) are common prescription medications that can help treat depression and other conditions. It can take time to find the right SNRI or antidepressant that works best for you. Talk to your healthcare provider about any concerns or questions you have. They’re available to help.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/05/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"