"Splenectomy (Spleen Removal): Reasons, Procedure, Risks & Outcome800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/SplenectomyAdvertisementAdvertisementAdvertisementSplenectomyThe spleen is the fist-sized organ that helps fight infection in the body by filtering the blood and keeping blood flowing to the liver. When the spleen has to be removed -- because of cancer or other diseases -- a surgeon performs a splenectomy.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a splenectomy?A splenectomy is the surgical removal of your spleen.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhere is my spleen and what does it do?Your spleen is an organ that is located in the upper left side of your abdomen. About the size of a fist, the spleen has several functions.Your spleen:Removes (filters) old and damaged blood cells.Produces antibodies that help fight infection.Stores blood cells.Why would I need to have my spleen removed?Your spleen may be removed for a number of diseasesCertain cancers: Lymphoma (Hodgkin’s lymphoma and non-Hodgkin’s lymphoma) is the main such conditions for which your spleen might be removed. Other less common diagnoses, such as chronic lymphocytic leukemia, hairy cell leukemia and cancers that have spread to the spleen can also be other reasons for having your spleen removed.Blood disorders: When medical treatment isn’t successful, certain conditions may be treated by removing your spleen. These disorders mainly include idiopathic thrombocytopenic purpura and autoimmune hemolytic anemia.Enlarged spleen (splenomegaly): Splenectomy may be needed to determine the cause of the enlarged spleen or to treat symptoms such as pain and early satiety (feeling full after eating only a small amount of food).Hypersplenism: An enlarged spleen may become overactive, destroying too many blood cells and platelets.Trauma: Although many cases can be treated without removal, splenectomy can be necessary if bleeding can't be controlled.Infection: Abscess of the spleen is very rare, but can be a reason to remove your spleen.AdvertisementHow are spleen disorders diagnosed?Spleen disorders are diagnosed with:Blood tests, including complete blood count.Physical examination (an enlarged spleen may be felt by your healthcare provider).Imaging tests such as ultrasound or computerized tomography (CT) scans.Bone marrow tissue biopsy.Procedure DetailsHow is my spleen removed?In most cases, a splenectomy can be performed laparoscopically if the spleen is not massively enlarged. Under general anesthesia, the abdomen is inflated with carbon dioxide to allow your surgeons to see the operative area. Through small incisions, a camera (laparoscope) is placed into the abdomen and the picture is sent to video monitors for the surgeons to watch. Further small operating instruments are used to perform the operation. Your surgeon frees the spleen from all of its surrounding attachments. One incision is eventually extended to approximately 2 cm to place the “stapler” to control the blood supply (splenic artery and vein) of the organ. The now free spleen is placed inside a special bag with a drawstring, which is brought through the largest incision. Using a finger inside the bag, your spleen is broken into smaller pieces. The fragments of your spleen are then sent to pathology for analysis and the bag is removed.If your spleen is too large for laparoscopic removal, it will be removed using an open approach with a single large incision. In addition to spleen size, scar tissue from previous operations may lead your surgeon to choose the open approach. This decision may be made before or during surgery. Indeed, it is always possible that a laparoscopic case may need to be converted to open if there are bleeding problems.Care at Cleveland ClinicSchedule General SurgeryFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the possible complications of splenectomy?Possible complications include the usual risks of all surgeries, including bleeding, infection, and injury to the surrounding abdominal organs.What are the long-term risks of a splenectomy?One particular risk associated with splenectomy is overwhelming post-splenectomy infection. Fortunately there are vaccines available to protect against the main types of bacteria. Preoperatively, and then again two months later, your physician will order three shots to optimize your immune system. Booster shots are then given five years later. You should also get your yearly flu shot. Splenectomy patients can get sick and be around sick people. However, if you develop an illness, as noted by a high fever, you should contact your provider immediately and antibiotics will be prescribed.Recovery and OutlookWhat can I expect after I’ve had my spleen removed?Once you are able to tolerate a regular diet, move about without difficulty and your pain is under control, you will be discharged home. This usually occurs within two to three days with the laparoscopic technique and five to seven days with an open incision.You may take a shower or bath right away as your incisions will be closed with dissolving sutures and skin glue. You may drive when you are not requiring narcotic pain pills nor are having any distracting pain. Although each patient is unique, the hope is that you can return to your everyday activities quickly. You should then slowly increase your activities as tolerated. Indeed, this process is slower with the open approach. Young children who have had their spleen removed may be prescribed antibiotics to prevent serious infections.Can I live without my spleen?Yes, you can live without your spleen. Your liver will take over many of the functions of your spleen. As mentioned, you may be at increased risk of infection, though the likelihood is quite low. Still it is important to be vigilant and obtain immediate medical attention if you develop an illness with a high fever after your spleen has been removed.When to Call the DoctorWhen should I call my healthcare provider if I’ve had a splenectomy?Call your healthcare provider or surgeon if you experience:Ongoing fever over 101 °F (38.5 °C).Chills.Swelling in your abdomen.Pus/drainage from your incisions.Redness around your incision that is worsening or getting larger.Cough or shortness of breath.Bleeding.Nausea and vomiting.Pain not relieved with medication.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/23/2020.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule General SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"