"SSRIs (Selective Serotonin Reuptake Inhibitors): Uses800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/SSRIs (Selective Serotonin Reuptake Inhibitors)AdvertisementAdvertisementAdvertisementSSRIs (Selective Serotonin Reuptake Inhibitors)SSRIs (selective serotonin reuptake inhibitors) are medications that are FDA-approved to help treat several conditions, including depression, anxiety and bulimia. They work by keeping certain chemical messengers active in your brain. They’re the most commonly prescribed type of antidepressant.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat are SSRIs?SSRIs (selective serotonin reuptake inhibitors) are a class of antidepressants that help treat depression symptoms. Healthcare providers prescribe them for many other conditions, as well.There are several different classes of antidepressants. SSRIs are usually the first option providers prescribe for depression because they generally have fewer and less severe side effects compared to other antidepressants.What are the types of SSRIs?SSRIs (and their brand names) that healthcare providers currently prescribe in the United States include:Citalopram (Celexa®).Escitalopram (Lexapro®).Fluoxetine (Prozac®).Fluvoxamine (Luvox®).Paroxetine (Paxil, Pexeva®).Sertraline (Zoloft®).Vilazodone (Viibryd®).What conditions do SSRIs help treat?SSRIs are approved by the U.S. Food and Drug Administration (FDA) to treat the following conditions:Clinical depression (major depressive disorder).Generalized anxiety disorder (GAD).Bulimia nervosa.Depressive episodes of bipolar disorder.Obsessive-compulsive disorder (OCD).Panic disorder.Premenstrual dysphoric disorder (PMDD).Post-traumatic stress disorder (PTSD).Social anxiety disorder (social phobia).Healthcare providers sometimes prescribe SSRIs for other conditions. This is considered an off-label, or non-FDA-approved, use of the medication. Examples of off-label uses include:Binge eating disorder.Body dysmorphic disorder.Chronic pelvic pain syndromeRheumatoid arthritis.Premature ejaculation.How common are SSRIs?SSRIs are a very common prescription medication. More than 1 in 10 people in the United States takes an antidepressant, and SSRIs are the most commonly prescribed type of antidepressant.What is the most popular SSRI?Fluoxetine (Prozac®) is probably the most well-known SSRI.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow do SSRIs work?SSRIs work by increasing serotonin levels in your brain.Serotonin is a neurotransmitter (a chemical messenger) that plays an important role in regulating your mood, appetite, sleep, memory, social behavior and sexual desire.After serotonin has carried its message, nerve cells in your brain usually reabsorb the serotonin (known as reuptake). As its name — selective serotonin reuptake inhibitors — suggests, SSRIs work by blocking (inhibiting) reuptake. This means that more serotonin is active in your brain.Unlike other classes of antidepressants, SSRIs have little effect on other neurotransmitters, such as dopamine or norepinephrine. This may be why SSRIs cause fewer side effects compared to other antidepressants.What’s the difference between SNRIs and SSRIs?SNRIs and SSRIs are both classes of antidepressants.SSRIs work by blocking serotonin reuptake, which increases serotonin levels in your brain. SNRIs (serotonin and norepinephrine reuptake inhibitors) work by blocking the reuptake of both serotonin and norepinephrine. This increases the levels of serotonin and norepinephrine in your brain.Because they work differently, SNRIs and SSRIs have different side effects. But they’re both effective in treating depression symptoms.How do you take SSRIs?You can take SSRIs orally (by mouth) in multiple forms, including tablets, capsules or liquid solutions. You usually take them once a day. Your healthcare provider will prescribe a certain dose and provide instructions for taking the medication.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdvertisementRisks / BenefitsWhat are the side effects of SSRIs?Each type and brand of SSRI has its own side effects. Be sure to talk to your healthcare provider or pharmacist about possible side effects to look out for.In general, common side effects of SSRIs include:Sexual dysfunction (difficulty reaching orgasm).Headache.Sleep disturbances.Weight changes.Worsened anxiety.Dizziness.Gastrointestinal issues like nausea and vomiting.Dry mouth (xerostomia).What are the risks or complications of SSRIs?Possible complications associated with SSRIs include:Risk of suicidal thoughts or behavior.Serotonin syndrome.Antidepressant discontinuation syndrome.SSRI overdose or toxicity is uncommon and it very rarely causes death. Always take your medication as prescribed.Suicidal thoughts or behaviorChildren, teens and adults under the age of 25 may experience an increase in suicidal thoughts or behavior when taking SSRIs, especially when they first start them or when they take a different dose.If you or your child has suicidal thoughts or behavior, call your healthcare provider who prescribed the medication immediately. You can also dial 988 on your phone to reach the Suicide and Crisis Lifeline.Serotonin syndromeSerotonin syndrome is a potentially life-threatening drug reaction that results from having too much serotonin in your body.Serotonin syndrome can happen when you either take a new SSRI or take an increased dose. But the syndrome most often happens when you take an SSRI in addition to other medications that increase your serotonin levels, such as MAOIs or linezolid.Always tell your healthcare provider which medications and supplements you’re currently taking before starting a new medication. This can help prevent serotonin syndrome.Symptoms of serotonin syndrome include:Nervousness.Nausea and vomiting.Diarrhea.Dilated pupils.Muscle issues, like twitching, involuntary contractions, spasms and rigidity.Sweating and shivering.Side-to-side eye movements.Severe symptoms include:Confusion or delirium.Rapid heart rate (tachycardia).High blood pressure.Fever.Seizures.Loss of consciousness.Get immediate medical help if you’re experiencing these symptoms. Serotonin syndrome can be fatal if it’s not treated in time.What is SSRI withdrawal?SSRI “withdrawal” is actually called antidepressant discontinuation syndrome. It can happen if you suddenly stop taking an SSRI if you’ve taken it for at least six weeks.Symptoms of antidepressant discontinuation syndrome include:Flu-like symptoms, such as fatigue, headache, achiness and sweating.Insomnia.Nausea.Dizziness and lightheadedness.Sensory issues, such as burning, tingling, “buzzing” or mild electric shock-like sensations.Anxiety, irritability and agitation.These symptoms are usually mild, but they can be unpleasant. Never stop taking your SSRI without first talking with your healthcare provider. The safest way to stop taking an antidepressant is to do so slowly, under your provider’s guidance.Antidepressant discontinuation syndrome isn’t technically withdrawal because antidepressants aren’t addictive medications. You can’t become physiologically dependent on antidepressants like you can on other substances, such as opioids, alcohol or nicotine.AdvertisementRecovery and OutlookHow long does it take SSRIs to work?It may take up to six to eight weeks to feel the full effect of SSRIs and notice an improvement in your symptoms. Talk to your healthcare provider if you don’t feel better after this time.When to Call the DoctorWhen should I call my healthcare provider?You should have regular appointments with your healthcare provider when you’re taking an SSRI to assess how well it’s working.Otherwise, talk to your healthcare provider:If you develop bothersome side effects.If your symptoms aren’t improving or if they’ve gotten worse.If you’re thinking of stopping the medication.When should I seek emergency care?If you have symptoms of serotonin syndrome or are having suicidal thoughts, call 911 or go to the nearest emergency room.Additional DetailsCan I drink alcohol while on an SSRI?Healthcare providers generally don’t recommend drinking alcohol while taking any kind of antidepressant, including SSRIs. This is because alcohol (a depressant substance) can counteract the benefits of antidepressants and make depression symptoms worse.Talk to your healthcare provider if you’re concerned about changing your drinking patterns.What is post-SSRI sexual dysfunction?Post-SSRI sexual dysfunction (PSSD) is a condition in which you continue to have sexual dysfunction side effects after stopping the use of an SSRI. This is a relatively new finding, and researchers are still trying to determine the cause and how common it is.Common PSSD symptoms include:A decrease in or loss of pain, pressure and touch sensations in your vulvovaginal area or penis (genital anesthesia).Pleasure-less or weak orgasms.Decreased sex drive.Erectile dysfunction.A note from Cleveland ClinicSSRIs are a very common prescription medication that can help treat depression and other conditions. It can take time to find the right SSRI or antidepressant that works best for you. Talk to your healthcare provider about any concerns or questions you have. They’re available to help.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/05/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"