"Statins: Types, Uses & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/StatinsAdvertisementAdvertisementAdvertisementStatinsStatins help millions of people manage their high cholesterol. Most people can take statins without bad side effects and generic, lower-cost versions of the medicines are available. Your healthcare provider will look at your specific situation and decide if a statin is right for you.ContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat are statins?Statins (HMG CoA reductase inhibitors) are prescription medicines that people take to bring their cholesterol down to normal levels. Some statins can decrease your LDL (bad) cholesterol by 50% or more. Different brands of statins are on the market, as well as generic statins, which cost less.Statins are tablets or capsules that you swallow whole once a day. The label on your medicine bottle will tell you if you need to take your statin at a certain time of day and if you need to take it with food.Types of statin drugsAtorvastatin.Fluvastatin.Lovastatin (Mevacor® or Altoprev™).Pitavastatin (Livalo® or Zypitamag®).Pravastatin.Rosuvastatin (Crestor® or Ezallor Sprinkle®).Simvastatin (Flolipid® or Zocor®).Sometimes, statins are put together with another medicine in one pill, such as:Simvastatin with ezetimibe or niacin.Atorvastatin with ezetimibe or amlodipine.Lovastatin with niacin.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat do statins do?Statins decrease your LDL (low-density lipoprotein) or bad cholesterol and may increase your HDL (high-density lipoprotein) or good cholesterol. LDL is bad because it builds up inside your arteries. HDL is good because it brings cholesterol to your liver, which gets it out of your body.How do statins work?Statins get in the way when your liver is trying to make cholesterol. Like a good basketball player who doesn’t let an opponent get the ball, statins don’t let your liver have an enzyme it needs to create cholesterol. Your body makes 75% of your cholesterol, so helping it make less can make a big difference. The rest of your body’s cholesterol is from what you’re eating.Statins also help your liver get rid of more cholesterol.AdvertisementWhy do I have high cholesterol if I eat healthy foods?You can get genes from your parents that tell your body to make more cholesterol than you need or not to absorb the cholesterol it needs.Who needs to take statins?Your healthcare provider will look at your individual situation when deciding if you should take a statin. Having diabetes, high blood pressure or high cholesterol and using tobacco products are all risk factors for getting heart disease. Your provider will also consider your age, sex and race when deciding if you need a statin.Providers prescribe statins for people who:Have high cholesterol (LDL above 190 mg/dL) that exercise and diet changes couldn’t reduce.Had a stroke, heart attack or peripheral artery disease.Have diabetes and an LDL of at least 70 mg/dL and are 40 to 75 years old.Have an LDL of at least 70 mg/dL and a high risk of getting heart disease and are 40 to 75 years old.AdvertisementWhy are statins used?Statins bring down your cholesterol level to make you less likely to have a heart attack or stroke. Your body uses cholesterol when it makes vitamin D, hormones and the acid you use to digest food. But if you have too much cholesterol in your blood, it can collect inside your arteries. This creates obstacles that make it harder for your blood to get through your blood vessels.If cholesterol keeps building up in your arteries, it can do more than just make them narrow. The plaque (obstacles) in your blood vessels can become unstable and break open, leading to a heart attack.How common are statins?Statins are the most common drug class of prescriptions in America. More than 40 million adults take them.Risks / BenefitsWhat are the advantages of statins?Statins decrease your risk of having a stroke or heart attack because they cut down the amount of bad cholesterol in your blood. That cholesterol can make your arteries narrow (atherosclerosis), making it hard for your blood to circulate and putting you at risk for a heart attack or stroke.What are the side effects of statins?Statins may cause mild side effects, including:Headache.Nausea.Dizziness.Gas.Diarrhea.Constipation.Achy muscles or joints.Rarely, statins may cause bad side effects, including:Confusion.Memory loss.Damage to your kidneys.Damage to your liver.Bad problems with your muscles.Type 2 diabetes or high blood sugar.Adults and teens can take statins. Most people don’t have side effects from statins, but you shouldn’t take them if you’re pregnant, nursing or have certain types of liver disease. Let your provider know if you have diabetes. If you’re already at risk for diabetes, statins can add to your risk of getting it.Some people have an interaction with another medicine while taking statins. Whenever your provider considers prescribing medication for you, it’s important to tell them what else you’re taking. That includes other prescription drugs, medicines you buy without a prescription, vitamins, herbs, supplements and recreational drugs.If one type of statin gives you side effects, ask your provider if they can switch you to a different one. You may also want to ask your provider if you need to avoid grapefruit or pomegranate or their juices or if it’s ok to have a small amount. These foods can make it hard for your body to break some statins down, allowing too much of the drug to accumulate in your body and giving you more side effects.Recovery and OutlookWhat happens if you stop taking statins?Your cholesterol level will go back up if you stop taking statins. You’ll probably need to keep taking them for years to come.What happens if I keep taking statins?Your total cholesterol and LDL (bad cholesterol) numbers should come down, as well as your risk for heart attack and stroke.When to Call the DoctorWhen should I see my healthcare provider?While you’re taking statins, you should contact your provider if your muscles or joints hurt or if you feel weak, have a fever or your urine is dark.A note from Cleveland ClinicStatins can help you reduce your risk of a heart attack or stroke, but they aren’t a cure for high cholesterol. You should keep exercising and eating healthy even if you’re taking statins. And have your cholesterol checked regularly so you’ll know if the statin is managing it well.Care at Cleveland ClinicCardiology CareMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/14/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicCardiology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"