"Stem Cell Transplant (Bone Marrow Transplant)800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Stem Cell Transplant (Bone Marrow Transplant)AdvertisementAdvertisementAdvertisementStem Cell Transplant (Bone Marrow Transplant)Healthcare providers may use stem cell transplants (bone marrow transplants) to treat blood disorders and certain kinds of cancer or autoimmune diseases. The transplants replace unhealthy stem cells with healthy stem cells. If you receive a transplant, your provider may use your own healthy stem cells, donated blood or bone marrow stem cells.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewIn autologous stem cell transplants, healthy blood stem cells that will replace damaged or destroyed stem cells are collected and stored for infusion.What is a stem cell transplant?Stem cell transplants are procedures to replace cancerous, abnormal or damaged stem cells with healthy ones. This procedure may be called a bone marrow transplant. Most transplants use peripheral blood stem cells, which are immature stem cells in your bloodstream, but some use bone marrow or umbilical cord blood stem cells. If you receive a stem cell transplant, your provider may use your own healthy stem cells or donated stem cells. Healthcare providers use this procedure to treat certain kinds of cancer, blood disorders and autoimmune diseases.Are stem cells transplants common?The Center for International Blood and Marrow Transplant Research collects data from transplant centers. According to the most recent data, there were 22,000 stem cell transplants in 2020. Procedures using peripheral blood stem cells were more common than procedures done with bone marrow and cord blood.What are types of stem cell transplants?The two types are allogeneic, which uses donated stem cells, and autologous, which uses your own healthy stem cells. Autologous stem cell transplants are slightly more common than allogeneic stem cell transplants.Who might need this treatment?Each year about 18,000 people in the United States learn they have a disease that a stem cell transplant could cure. People typically have stem cell transplants when other treatments aren’t effective or if their condition comes back after treatment. Healthcare providers may do stem cell transplants to treat different kinds of cancer, including some tumors and blood cancers, blood disorders and some autoimmune diseases.Blood cancersHealthcare providers may use stem cell transplants if other treatments aren’t effective or a blood cancer comes back (recurs). For example, providers may use this procedure to treat the following blood cancers:Multiple myeloma.Hodgkin lymphoma and non-Hodgkin lymphoma.Acute myeloid leukemia.Acute lymphoblastic leukemia.Myelodysplastic syndrome.Chronic myeloid leukemia and chronic lymphocytic leukemia.Myelofibrosis and polycythemia vera.Blood disordersBlood disorders are conditions that keep parts of your blood from doing their jobs. Healthcare providers may use stem cell transplants to treat:Aplastic anemia.Sickle cell anemia.Severe combined immunodeficiency syndrome.Thalassemia.Other conditionsProviders may use stem cell transplants for the autoimmune disease relapsing-remitting multiple sclerosis or testicular germ cell tumors that come back after chemotherapy.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho is a candidate for a stem cell transplant?Healthcare providers typically use stem cell transplants to treat life-threatening cancer or blood diseases. Unfortunately, not everyone who has those conditions can have the procedure. Here are factors providers take into consideration:Your general health. For example, people who have stem cell transplants go through intensive chemotherapy before treatment. This is conditioning. Providers will evaluate whether you’re able to manage conditioning side effects. They’ll also consider whether you’ll be able to manage stem cell transplant side effects.Your medical condition. Not all cancers or blood diseases respond to stem cell transplants.Your earlier treatments. Some medical treatments may affect successful transplants.The healthy stem cells’ source. If providers can’t do an autologous stem cell transplant using your own healthy stem cells, they’ll search for donors with stem cells that are a perfect or close match. That search starts with your immediate family members. Providers may check stem cell registries, internet databases that allow providers to look for matching stem cells donated by the public. If they can’t find enough donated cells, they can’t use a stem cell transplant to treat your condition.Procedure DetailsWhat happens before a stem cell transplant?If you’re a candidate for a stem cell transplant, your healthcare provider will perform the following tests to confirm you’re physically able to manage transplantation processes, including pre-treatment chemotherapy called conditioning and transplantation side effects:Electrocardiogram (EKG).Echocardiogram (Echo).Computed tomography (CT) scan.Complete blood count (CBC).Blood tests including liver function or kidney function.Biopsy to study cancerous cells.Before your blood tests, your provider may place a central venous catheter (CVC) in one of the large veins in your upper chest. CVCs eliminate repeated needle sticks to draw blood or insert intravenous tubes throughout the transplant process.If you’re receiving your own stem cells, your provider may give you medication to boost your stem cell production. They’ll do follow-up blood tests to check on stem cell production.If you’re receiving your own stem cells, your providers will take blood from you so they can remove healthy stem cells for transplant. Here’s how that works:Providers connect veins in both of your arms to a cell separator machine.The machine pulls blood from veins in one arm.Blood flows into the cell separator machine, which filters out stem cells.Blood flows back into veins in your other arm.The process doesn’t hurt but can take three to four hours.Your providers may need to take blood more than once to be sure they have enough stem cells to transplant.AdvertisementWhat happens during a stem cell transplant?Whether you’re receiving donated stem cells or your own stem cells, the process may look and feel a lot like receiving medication or a blood transfusion via an intravenous catheter (IV) tube. First, your provider may give you fluids and medication to help prevent side effects or reduce the chance your body may reject the new stem cells. Then they’ll start infusing stem cells. The process may take several hours. While you’re receiving new stem cells, your provider will frequently check for signs of fever, chills and other potential side effects.What happens after a stem cell transplant?Your new stem cells will need time to produce new blood cells. If you received donor stem cells, your transplanted stem cells will replace unhealthy stem cells and begin to build a new immune system. This process is engraftment.Either way, you may need to stay in or close to the hospital for several months so your healthcare providers can support your recovery and check on your progress, including how many new blood cells your stem cells are making. Here’s what you can expect after your stem cell transplant:Pre-treatment chemotherapy (conditioning) affects your immune system’s ability to protect you from infections. To reduce that risk, you’ll be alone in a carefully cleaned room with very limited physical contact with other people.Some people have nausea, vomiting and diarrhea after their transplant. Your providers will give you medication to ease those symptoms and fluids to replace what you lost.If you received donor cells, you’ll receive immunosuppressant medication to reduce the chance your body will reject the donor cells.You may need blood transfusions to replace red blood cells and platelets.Care at Cleveland ClinicBlood and Marrow Transplant and Cellular TherapiesFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of stem cell transplants?Stem cell transplants may help to cure or slow certain blood cancers or blood disorders that didn’t respond to other kinds of treatment.AdvertisementWhat are the risks of stem cell transplants?The greatest risk is that you’ll go through the procedure and your transplanted stem cells can’t slow or eliminate your illness.What are complications?Potential complications will vary based on your overall health, age and previous treatment, including pre-transplant chemotherapy (conditioning). If you’re considering a stem cell transplant, your healthcare provider will outline potential complications so you can weigh those risks against potential benefits. Allogeneic stem cell transplants are more likely to cause complications, such as:Graft vs. Host Disease (GvHD).Infection.Recovery and OutlookHow long does it take to recover from a stem cell transplant?It can take several months up to a year to fully recover from a stem cell transplant. Your healthcare provider may recommend you stay in or near the hospital or transplant center for the first 100 days after your procedure.When can I go back to work or school?That depends on your situation. People who have autologous stem cell transplants may be able to return to onsite work or school within four months. But if you had an allogeneic stem cell transplant, it may be a full year before onsite work or school makes sense. As you recover, ask your healthcare provider about recommendations for returning to onsite work or school.How can I take care of myself after a stem cell transplant?A successful stem cell transplant can change your life, curing your condition or slowing its growth. But it’s not an overnight transformation. It can take a year or more for you to recover. Here are some challenges and ways to overcome them:Protect yourself from infections: Wash your hands, stay away from people who are sick and ask your healthcare provider what vaccinations you should have.Eat nutritious meals: Focus on lean protein, a variety of fruits and vegetables, whole grains and low-fat dairy. Avoid undercooked meat and fish, unwashed fruits and vegetables and non-processed dairy.Take it easy: You may have days when you feel exhausted and days when you feel fine. A hard day doesn’t mean you’re not doing well. It means you need to give yourself a break.Baby your skin: Your skin may be more sensitive after transplant. Use mild soap and shampoo when you bathe or shower, remember to moisturize and protect your skin from sunlight.Take care of your teeth: See a dentist every six months and use good oral hygiene.Support your mental health: You may find yourself on an emotional rollercoaster. You may feel confident and optimistic about your healthy future and then worried about your condition coming back. Studies show regular, appropriate exercise may help to ease your anxiety along with boosting your immune system. Talk to your healthcare provider about exercise programs that may make sense for you.What’s the success rate for stem cell transplants?It’s difficult to calculate an overall success rate. That said, the most recent data show the highest number of stem cell transplants involved people with multiple myeloma or Hodgkin and non-Hodgkin lymphoma who received autologous stem cell transplants. Here’s information on three-year survival rates:Multiple myeloma: Data show 79% were alive three years after transplant.Hodgkin lymphoma: About 92% of people who had stem cell transplants were alive three years after treatment. (Most people have transplants because Hodgkin lymphoma came back after chemotherapy.)Non-Hodgkin lymphoma: Like Hodgkin lymphoma, most people have stem cell transplants because their condition came back. Of those, 72% were alive three years after diagnosis.When to Call the DoctorWhen should I see my healthcare provider?You’ll have regular follow-up appointments with your provider. But it’s important to remember your immune system will likely be weak for a year or so after your transplantation. Contact your provider right away if you develop any of the following symptoms:Fever (100.4 degrees Fahrenheit, 38 degrees Celsius.).Chills.Shortness of breath (dyspnea).Coughing, sneezing or runny nose.Frequent urination or painful urination (dysuria).Rash.Lightheadedness/dizziness.Additional Common QuestionsWhy are blood stem cell transplants more common than bone marrow transplants?For more than 40 years, healthcare providers relied on donated bone marrow to get the healthy stem cells they needed to do stem cell transplants. Now, nearly all transplants use stem cells obtained from people’s blood, which is a less complicated process.A note from Cleveland ClinicIf you’ve been coping with cancer or a blood disease, a stem cell transplant can be a new lease on life. It can mean hope for a cure or remission when other treatments haven’t worked. But stem cell transplants come with demanding physical challenges and significant risks. Not everyone who has cancer or blood disorders is a candidate for a stem cell transplant. Unfortunately, not everyone who’s a candidate but needs donor stem cells finds a donor. If you’re considering a stem cell transplant, talk to your healthcare provider about potential risks and benefits. They’ll evaluate your situation, your options and potential outcomes.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/15/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicBlood and Marrow Transplant and Cellular TherapiesFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"