"Stent: What They Are, Purpose and Risks800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/StentAdvertisementAdvertisementAdvertisementStentA stent is a tiny metal tube that keeps your artery open to allow blood to go through better. Your healthcare provider can put in a stent after doing an angioplasty, which pushes aside a collection of plaque inside your artery. Stents are permanent and can keep your artery from getting too narrow again.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a stent?A stent is a very small tube your healthcare provider can put inside your artery to keep it open after they move plaque (cholesterol and fat) out of the way. This helps your blood get through your artery more easily.Types of stentsStents are tube-shaped devices that stay inside your artery permanently. They look like tiny fishing nets made of metal instead of organic or man-made fiber.A bare metal (nickel-titanium alloy or stainless steel) stent keeps your artery open after angioplasty has pushed a buildup of plaque to the artery walls.A drug-eluting stent does the same thing as a bare-metal stent, but it has medicine on it to help prevent your artery from getting narrow again.Researchers are experimenting with biodegradable stents, although these aren’t currently available in clinical practice.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is a stent used?Healthcare providers use stents to keep an artery from getting too narrow or blocked, which keeps blood from going through easily. You may need one if you’ve had a heart attack or if you have atherosclerosis (plaque collecting inside your artery).What does a stent treat?Stents help your blood vessels work better after your provider moves aside an accumulation of plaque inside them. This collection of plaque can happen when you have:Peripheral (legs) artery disease.Carotid (neck) artery disease.Renal (kidney) artery disease.Coronary (heart) artery disease.Stents also help when you have deep vein thrombosis (a blood clot in your leg, arm or pelvis) or an abdominal aortic aneurysm or another type of aneurysm. Stents aren’t limited to use in blood vessels. They can help with blockages in airways, bile ducts or ureters.AdvertisementHow common are stents?Each year, healthcare providers worldwide put in more than three million stents.Procedure DetailsInserting a stent to push plaque aside and restore good blood flow.What happens before stent placement?Your healthcare provider will probably tell you not to have anything to eat or drink for six to eight hours before getting your stent. They’ll want to know what medicines you’re taking and what allergies you have. They’ll give you medications to keep your blood thinner — for example, aspirin and clopidogrel (Plavix®) — before you have your procedure.Your provider will give you intravenous (IV) medication to relax you, but you’ll still be alert enough to respond to questions. Blood thinners in your IV will help keep you from getting blood clots during your stent procedure.While you’re lying down, your provider will put a thin tube called a catheter through your skin and into one of the arteries in your groin or arm. They’ll use X-ray images as a guide to find the artery that has too much plaque in it. Dye that’s put into your catheter will make it easier to see your arteries on the X-rays.Your provider will put another catheter with a balloon at the end into your blocked or narrow artery. They’ll inflate the balloon, which acts as a trash compactor on the plaque and pushes it to the walls of your artery. This makes room for the stent, which may be put in at the same time that the balloon is smashing the plaque.AdvertisementWhat happens during stent placement?With the artery open after angioplasty, your provider can put in a stent made of wire mesh. They’ll inflate a balloon catheter, which will push open the stent inserted at the same time. Your provider will deflate the balloon catheter and remove it, leaving the stent in place.What happens after stent placement?You’ll recover at the hospital for a few hours or overnight before going home. You may get medicine to bring your cholesterol level down. You’ll need to take medications to keep your blood from clotting too easily, such as aspirin and clopidogrel (Plavix®). Your doctors will go through this with you before you go home.Care at Cleveland ClinicCardiology CareMake an AppointmentRisks / BenefitsWhat are the advantages of stents?Advantages of stents include:They help blood flow better through the artery where they’re placed.Along with angioplasty, they can stop a heart attack.They improve your symptoms, such as shortness of breath and chest pain (when your provider places a stent in your coronary artery).They may keep your artery from getting too narrow again.People who have a heart stent put in recover faster than those who have coronary artery bypass surgery (CABG).What are the risks or complications of stent placement?Serious complications rarely happen during angioplasty and stent placement. Risks include:A blood clot inside your stent.A reaction to the stent itself or to the drug coating on it.Bleeding.A tear inside your artery.Restenosis (your artery gets narrow again later).Stroke.Recovery and OutlookWhat is the recovery time after a stent placement?It’ll take about a week to recover from stent placement. Check with your provider to find out how active you’re allowed to be for the next few days. The instructions vary depending on whether you had a catheter in your arm or your groin area.Your provider will prescribe antiplatelet drugs for you to take to prevent blood clots in your stent. You’ll take aspirin and/or clopidogrel, ticagrelor or prasugrel. Depending on your risk of bleeding, you may take these medicines for a month, several months or a year or more. It’s very important that you take these medicines to keep blood clots from happening.When can I go back to work or drive?You should be able to return to work or drive after a week. If your job involves heavy lifting, you’ll need three or four weeks to heal before going back to work.When to Call the DoctorWhen should I see my healthcare provider?Contact your provider when:You have bleeding, swelling, discharge or numbness where the catheter went into your skin.You have a fever or chills.You faint or get dizzy.Your pulse isn’t normal.You have chest pain.A note from Cleveland ClinicAlthough your angioplasty and stent will help your blood circulate better, you’ll still need to do your part and live a healthy lifestyle. That means eating healthy foods, exercising and avoiding tobacco products. You’ll also feel your best when you keep taking the medicines your provider prescribed and keep going to your follow-up appointments.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/13/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicCardiology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"