"Stereotactic Body Radiation Therapy (SBRT): Procedure800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Stereotactic Body Radiation Therapy (SBRT)AdvertisementAdvertisementAdvertisementStereotactic Body Radiation Therapy (SBRT)Stereotactic body radiation therapy (SBRT) is different from conventional radiation treatment. SBRT targets small tumors with large radiation doses without damaging nearby healthy tissue and organs. Healthcare providers use SBRT to treat small, isolated tumors that haven’t spread elsewhere in your body.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is stereotactic body radiation therapy (SBRT)?Stereotactic body radiation therapy (SBRT) is a technological advancement in the field of radiation therapy. It’s different from conventional radiation therapy because it delivers very concentrated radiation over a short period of time (days, not weeks). SBRT is used to treat small cancers that haven’t spread to other organs. It delivers large radiation doses while limiting the amount of radiation going to nearby healthy tissue and organs that could cause damage.What cancers are treated with SBRT?Stereotactic body radiation therapy is used to treat several kinds of cancer, including:Lung cancer.Prostate cancer.Liver cancer.Pancreas cancer.What’s the difference between SBRT and conventional radiation therapy?Both treatments help treat cancer. The differences are the amount of time spent in treatment and the radiation doses delivered on a daily basis:Healthcare providers use conventional radiotherapy to treat larger targets such as the cancer and the areas where it has spread. They use SBRT to treat small cancers that haven’t spread. SBRT treatment is very focused.With conventional radiation therapy, you may have daily treatment for several weeks. Healthcare providers use smaller doses of radiation. With SBRT, healthcare providers use larger radiation doses in one to five treatments done over one to two weeks.Some people have fewer side effects from SBRT than conventional radiation therapy.What’s the difference between IMRT and SBRT?Intensity-modulated radiation therapy (IMRT) is a form of delivering external radiation that helps shape the radiation beam in a particular way. It’s often used for people receiving conventional radiotherapy. This treatment uses technology to shape the radiation beam to tightly fit around normal body parts. Healthcare providers typically use IMRT to treat head and neck cancer. People receiving SBRT may also receive IMRT. Your healthcare provider will decide what works best for you.They may also use other ways to deliver external radiation, like:Three-dimensional conformal radiation therapy (3D-CRT): Healthcare providers use computed tomography (CT) scans to create 3-dimensional (3D) images of the tumor when they’re planning radiation therapy. Armed with these 3D images, healthcare providers can figure out how to treat the cancer while preserving healthy tissue. All modern radiation treatments, including IMRT and SBRT, involve 3D planning.Image-guided radiation therapy (IGRT): Healthcare providers take daily images of the area being treated and compare them with images made before therapy started. They can make adjustments based on these images to make sure the treatment is precisely delivered.Proton therapy: This is another way to deliver radiation. Unlike X-rays, which are a form of light, this therapy uses protons, which are positively charged particles.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before SBRT?Everyone’s experience may be a bit different, depending on the type of tumor being treated. But a general outline of what takes place before you receive SBRT is:Your healthcare provider, known as a radiation oncologist, reviews your medical records and a physical examination. They may order additional tests.They’ll ask questions about your overall health. Tell your healthcare provider if you’re pregnant or breastfeeding. They’ll want to know if you take oral medication for diabetes, if you have an implanted medical device or allergies, or if you have claustrophobia.They’ll explain the proposed treatment, including risks and benefits.You’ll be asked to sign an informed consent form. Signing this form means you were given treatment options to consider, that you chose this therapy and your healthcare provider has your permission to provide the therapy.Next is treatment simulation. This session is your healthcare provider’s chance to map out the area to be treated and start designing the target. You may have CT scans, MRIs and X-rays to pin down the tumor’s precise location.Your simulation session is a great opportunity to talk about the mapping process, like whether you’re in a comfortable position or if being immobilized makes you feel anxious.Your healthcare provider might make marks on your skin to help them aim the radiation beam. You may be fitted for an immobilization device to help you stay still during treatment.They may make a special mold or cast of the part of your body where your tumor is located. These molds or casts help you stay still during treatment and make sure you’re in the same position each time you’re treated.After the simulation, your healthcare provider will share specific instructions, including how much time treatment may take, whether you’ll need someone with you and whether you can eat and drink after midnight the night before treatment.They’ll remind you to wear comfortable clothes that are easy to take off and put back on if you need to undress for the treatment.Depending on your situation, your healthcare provider may provide anti-nausea, anti-inflammatory or anti-anxiety medication.Thinking about my treatment makes me anxious. What can I do to manage my anxiety?Cancer creates stress, whether you’re anticipating test results or waiting to be called in for treatment. Always feel comfortable talking to your healthcare provider about how you’re feeling and what might be causing anxiety. As you understand what you’re going through better, it may help lift the stress. If your upcoming SBRT has your stomach in knots, keeping busy while you wait may help. Here are some suggested activities:Read a book or magazine.Work on crossword puzzles or needlework.Use headphones to listen to music or recorded books.Meditate, breathe deeply, pray or use imagery to relax.Ask your healthcare provider for suggestions about managing pre-treatment stress. They may prescribe medication to help you relax before treatment or suggest other steps you can take.What happens during SBRT?Stereotactic body radiation therapy doesn’t hurt and is much like having an X-ray. Your healthcare provider will want you to be as comfortable as possible during treatment. It’s important to remember you can stop the treatment session any time you begin feeling anxious or uneasy. Here are steps that may take place during your treatment:Depending on the area being treated, you might need to undress, so wear clothes that are easy to take off and put on.You’ll lie down on the same treatment table you used for simulation.Treatment sessions can last between 15 minutes to more than an hour, so your healthcare provider will make sure you’re comfortable as they position you for treatment.Technicians under the supervision of your healthcare provider operate the radiation machine from a shielded room so they aren’t exposed to radiation. They can see you on a TV screen and hear you over an intercom.The linear accelerator, which delivers the beam (or multiple beams) of radiation, won’t touch you. The radiation will come from a wide arm that hangs over you as you lie on the treatment table.You’ll have to lie still during treatment.Your healthcare provider may move the machine arm to different spots around the table. They do that to change the angle of the radiation beam.You won’t feel anything, but you may hear some noise from the machine as it moves.AdvertisementWhat happens after SBRT?The technicians will help you up from the treatment table. They may ask you to wait about 15 minutes before leaving so they can check you for any signs of side effects.What are some typical SBRT side effects?Treatment side effects are different for each person, depending on the type of cancer and overall health. Common side effects for several cancer types include:Lung cancer: People who have lung SBRT generally don’t feel anything unusual. They don’t have breathing changes and they don’t feel sick. In the first weeks after treatment, some people feel very tired, have mild coughs and bring up phlegm. Talk to your healthcare provider right away if you have any sudden or unexpected breathing changes.Prostate cancer: You may feel an urgent need to pee soon after treatment. Ask your healthcare provider for help managing this problem. Talk to your healthcare provider if you notice changes in when and how you poop or if it hurts to poop.Liver and pancreas: You may feel nauseated and have diarrhea. Your healthcare provider will have suggestions for medication and other steps, like changing your diet, so this side effect has less impact on your daily life.AdvertisementRisks / BenefitsWhat are SBRT benefits?Studies show SBRT is an effective treatment for some cancers. SBRT lets healthcare providers target tumors while limiting radiation impact on nearby organs and tissues. SBRT also requires fewer treatments than conventional radiation treatment.What are SBRT risks?All radiation therapy comes with very small potential that you’ll develop cancer from your treatment. One of the benefits of being treated with SBRT is the treatment limits radiation impact on healthy organs and tissues. Your healthcare provider will check you regularly for any new or recurring cancer.Recovery and OutlookWhat is the recovery time?Most people can go back to work or resume other daily activities one or two days after treatment.When to Call the DoctorWhen should I see my healthcare provider?SBRT side effects are different based on the kind of cancer treated. Generally speaking, you’ll have a routine schedule of follow-ups after your treatment, so your healthcare provider can update you on how your cancer is doing and you can let them know about your experiences after treatment. You should call your healthcare provider if your side effects are different from what you expected. Contact your healthcare provider right away if you suddenly feel short of breath after SBRT for lung cancer.A note from Cleveland ClinicHealthcare providers constantly seek better ways to treat cancer. Sometimes, that means using treatment intended for one cancer type to treat another cancer type. Stereotactic body radiation treatment (SBRT) is an example of that approach. SBRT is an effective way to treat small, isolated tumors in your lungs, prostate and liver while limiting damage to nearby vital organs. Not everyone will benefit from SBRT, so talk to your healthcare provider about your radiation treatment options. They’ll be glad to discuss your options and their recommendations.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/19/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"