"Stereotactic Spine Radiosurgery (SRS)800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Stereotactic Spine Radiosurgery (SRS)AdvertisementAdvertisementAdvertisementStereotactic Spine Radiosurgery (SRS)Stereotactic spine radiosurgery (SRS) delivers non-invasive, precisely targeted treatment to spinal tumors.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsAdditional DetailsOverviewWhat is stereotactic spine radiosurgery (SRS)?Stereotactic spine radiosurgery (SRS) is an innovative, non-invasive treatment option for both malignant and benign tumors located on the spine.Spine tumors can develop in the bones, nerves, and other tissues that make up the spinal column and cord. They can be benign (non-cancerous) tumors, low-grade malignant (cancerous) tumors that grow slowly, or high-grade tumors that grow aggressively. More than 90 percent of spine tumors are metastatic — they arise from cancers that begin in a different part of the body and can result in painful symptoms requiring invasive treatment procedures.Stereotactic spine radiosurgery can provide pain relief using a non-surgical, non-invasive procedure that delivers precise radiation to the tumor using a three-dimensional targeting system. This is often the treatment of choice for spine tumors, and can also be part of an integrated treatment plan.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the potential effects of spine tumors?If left untreated, spine tumors can destroy the bones of the spine, which leads to a loss of stability of the spinal column, and often compression of the spinal cord or nerves. This can cause disabling pain, injury to nerves or the spinal cord and ultimately paralysis.A new treatment optionEarly management is essential due to the serious consequences of spine tumors. Beyond analgesics (medications that reduce or eliminate pain), traditional options include surgery, conventional radiation therapy over days or weeks, and chemotherapy. Stereotactic spine radiosurgery can be used as a stand-alone procedure for spine tumors, or in conjunction with other treatments.Procedure DetailsHow does stereotactic spine radiosurgery work?Stereotactic spine radiosurgery uses technology that delivers a high dose of radiation to the tumor(s). SRS targets the tumor very precisely using narrow radiation beams, thereby ensuring the radiation dose to the tumor is maximized while minimizing exposure to nearby normal tissue. This highly selective radiation dose often results in effective pain and/or tumor control. The treatment can be as simple as one session given on an outpatient basis.AdvertisementWhat happens after the stereotactic spine radiosurgery (SRS) procedure?Following your stereotactic spine radiosurgery, an MRI scan and a follow-up appointment will be scheduled with your neurosurgeon or radiation oncologist. Routine follow-up appointments and regularly scheduled imaging studies may be necessary, depending on your condition.What are typical results after the stereotactic spine radiosurgery (SRS) procedure?The success rate depends on the type of tumor being treated. In general, 85 to 90 percent local pain relief can be achieved in patients within one month or less of treatment. Local tumor growth rates are normally between 80 and 90 percent.AdvertisementRisks / BenefitsWhat are the advantages of stereotactic spine radiosurgery?Stereotactic spine radiosurgery requires virtually no recovery time. It often results in rapid pain control that can significantly improve functionality.Stereotactic spine radiosurgery can be used for:Pain reliefFirst line of treatment for spine tumorsTreatment of residual tumor(s) after surgeryTumor recurrence following conventional treatment(s)Alternative option when other treatments haven’t been successfulAdditional DetailsFrequently asked questions about the stereotactic spine radiosurgery (SRS) procedureWill the treatment hurt? Patients have described the experience as similar to having a chest X-ray. There may be some temporary, mild discomfort after the treatment, but for the majority of patients there are no symptoms related to the procedure. There is no incision required.What is the recovery time? This is an outpatient procedure with essentially no recovery time, and you can resume normal activities as soon as you feel able.How will I be limited after treatment? There are generally no limitations to your normal level of activity because of the treatment. Any restrictions will be discussed with you by your physician.What special instructions will I have to follow before and after treatment? There are no special instructions. If your symptoms change at any time following the procedure, notify your radiosurgery treatment team immediately.Can I receive (or will I need) the treatment more than once? You can potentially receive the treatment more than once. This will be determined based on your clinical condition and MRI scans.What if I am claustrophobic? Your doctor should be able to recommend strategies to help you manage your claustrophobia.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/31/2019.Learn more about our editorial process.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"