"Strabismus Surgery: Procedure Details & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Strabismus SurgeryAdvertisementAdvertisementAdvertisementStrabismus SurgeryStrabismus surgery, or eye muscle surgery, treats misaligned eyes that haven’t responded to other treatments. Your surgeon may shorten or tighten the muscles by cutting them or folding them over. In some cases, your surgeon may move the muscle to make it looser.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewStrabismus surgery on your eye muscles may be suggested as a treatment for strabismus, which is also called crossed eyes.What is strabismus surgery?Strabismus surgery is eye muscle surgery to treat crossed eyes (strabismus). This procedure makes your eye muscles either tighter or looser and aligns the position of your eyes so they’re centered and can work together.Who needs strabismus surgery?About 5% of the population has strabismus. If your eyes are misaligned, and other treatments haven’t worked, an eye care provider may suggest strabismus surgery. Most often, children have strabismus surgery, but adults can have it, too.You may need eye muscle surgery if you have:Exotropia: One or both of your eyes turn outward toward your ears.Esotropia: One or both of your eyes turn inward toward your nose.Hypertropia: One eye turns upward as compared to your other eye.Hypotropia: One eye turns downward as compared to your other eye.Stroke: Sometimes, you may develop eye problems after a stroke.Nystagmus: This is the term for an eye that wiggles or moves erratically.Are there types of strabismus eye surgery?You can have strabismus surgery on one or both eyes. Bilateral strabismus surgery is the term for when you have the surgery on both eyes.Resection is the term for making the muscle shorter by cutting it.Plication is the term for making the muscle shorter by folding it over.Recession is the term for moving the muscle back to make it less tight.You may have adjustable surgery, where a provider can adjust the muscle sutures to correct for remaining misalignment in the recovery area or clinic soon after strabismus surgery in the operating room.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before strabismus surgery?Before surgery, your provider will want to know:Your medical history, including past and current medical conditions and procedures.If you have a history of prior eye muscle surgery, they’ll want to review your past operative reports.What medicines and supplements you take, especially any blood thinners.If you or any other person in your family has had any issues with anesthesia.If you have any allergies to medications.At your pre-anesthesia visit, the provider will tell you when to stop eating and drinking before surgery. Usually, you’re not supposed to take anything by mouth after midnight. They’ll also tell you if you need to stop taking any of your medications before the surgery.You’ll have another eye exam to clarify which muscles need to be changed.What happens during strabismus surgery?You’ll get medicine through a vein, or intravenously (IV). All children and most adults will get general anesthesia. Some adults may get eye numbing and light sedation. Other things you can expect include:Your surgical team will monitor your vital signs during the procedure.Your surgical team will use an eye speculum to hold your eye open.Your surgeon will cut into the outer white covering of your eye (conjunctiva).Your surgeon will pull up the muscles that need surgery with a hook. They’ll then move the muscle as needed.Your surgeon will attach the muscles and close your eye with stitches (sutures) that dissolve.A member of the team will take away the speculum and put eye drops or ointment into your eye.The surgery takes anywhere from about 30 minutes to two hours.AdvertisementWhat happens after strabismus surgery?You’ll go to a recovery room after surgery. Your team will keep monitoring your vital signs until you go home.A responsible adult will need to drive you home and stay with you for 24 hours. You may need to rest and take it easy for up to a week.Your provider will prescribe eye drops or ointment for you to take at home.Your provider may recommend acetaminophen, or sometimes oral nonsteroidal anti-inflammatory drugs (NSAIDs) like ibuprofen, for pain.Ask your provider for information about what you should look out for after surgery and when you would need to call them.Care at Cleveland ClinicEye CareFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of strabismus surgery?Strabismus surgery can improve the way your eyes work together with stereo (3D) vision. This is especially true for children.Having strabismus surgery corrects alignment but may not improve vision. However, many people who’ve had the surgery think the surgery is worth it because they have improved self-confidence and a better appearance.AdvertisementWhat are the risks or complications of strabismus surgery?Strabismus surgery is very safe, but all operations have risks. Risks or complications of strabismus surgery include:Recurrent misalignment. Eyes may go back to crossing or wandering in the same direction as they did before your surgery or may over-correct and cross or wander in the opposite direction.Getting an infection.Bleeding.Being allergic to medications or anesthesia.Developing double vision (diplopia).Scarring.Ptosis (eyelid drooping).Piercing the sclera (the white of the eye).Recovery and OutlookWhat is the recovery time after strabismus surgery?You’ll need anywhere from a few days to weeks of rest after your surgery. Your eyes could be red for weeks and may feel sore or scratchy. They won’t fully heal for about three to 12 weeks.Don’t drive until your provider tells you that it’s OK to do so.Don’t go into swimming pools, saunas or hot tubs for two weeks after the procedure. This will reduce your chances of infection.When to Call the DoctorWhen should I see my healthcare provider?Contact your healthcare provider if you have:Eye pain that gets worse instead of better.Vision that gets worse.Signs of infection like fever, discharge, increased redness of the white part of eyes, or redness or swelling of the eyelid.A growth of scar tissue or a red bump.Any symptom that worries you.Additional Common QuestionsHow long does double vision last after strabismus surgery?You may have double vision for a few days after strabismus surgery. It can take longer than that for some people. Contact your eye care provider if you have concerns about double vision after surgery.Can strabismus come back after strabismus surgery?You may need more than one surgery to correct strabismus. This is more often true with children who have the surgery.Will I still need to wear my glasses after surgery?Yes, you’ll still need to wear your glasses after surgery. Strabismus surgery doesn’t typically change your glasses prescription and won’t change the clarity of your vision.A note from Cleveland ClinicStrabismus, often called crossed or wandering eyes, happens when your eyes don’t line up correctly. Strabismus can affect the way your eyes move in any direction. An eye care provider may suggest you have surgery to correct the alignment when other measures don’t work. The surgery is more than just cosmetic and is generally very safe. Many people who’ve had the surgery appreciate increased self-confidence.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/29/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicEye CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2020Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"