"Buried Penis & Scrotal Lymphedema Surgery: Treatment800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Surgery for Buried Penis and Scrotal LymphedemaAdvertisementAdvertisementAdvertisementSurgery for Buried Penis and Scrotal LymphedemaSurgery may be needed for buried penis when your penis is normal size but hidden under the skin of your abdomen, thigh or scrotum. It can happen in both children and adults. Scrotal lymphedema is a buildup of fluid that causes swelling in the soft tissues of your genital area. Sometimes surgery is needed for both conditions in a complicated procedure.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewWhat is buried penis?Buried penis is a condition that can affect children and adults. In this condition, your penis is of normal size but is hidden under the skin of your abdomen, thigh or scrotum (sac beneath your penis that holds your testicles). Your penis is concealed in tissue above your pubis as a result of poor fixation of your skin at the base of your penis. Obesity is the main cause of buried penis.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is scrotal lymphedema?Scrotal lymphedema is a buildup of fluid that causes swelling in the soft tissues of the genital area. It’s caused by a blockage or damage to the lymphatic system, which is the system that helps to remove waste and toxins from your body. Often the damage is related to cancer treatments or surgeries.Procedure DetailsHow is surgery for buried penis and scrotal lymphedema done?Surgery for buried penis and scrotal lymphedema is a complicated process. It’s done after other less invasive treatments have been tried. These include weight loss in adults with obesity or compression strategies for lymphedema. Depending on the severity, surgery may be done by a team including both a urologist and plastic surgeon.The surgery is done under general anesthesia and usually requires a hospital stay. In people with overweight/obesity, it may also include a procedure to remove fatty abdominal tissue.The surgery usually begins with a catheter (thin, flexible tube) being inserted into your urethra to stabilize your penis and protect your urethra (tube that carries urine out of your body). The shaft of your penis is then separated from surrounding tissues (degloved). Infected or scarred tissue is then removed. Surgery can involve:Detaching the ligament that attaches the base of your penis to your pubic bone.Suction lipectomy, or the removal of fat cells using surgical suction catheters inserted through tiny incisions.Panniculectomy, or the removal of the pannus (excess skin and fatty tissue that hangs down over your genitals and/or thighs).Escutheonectomy, or the removal of the fat pad above your pubic area.Skin grafts are then done, if needed, to cover your penile shaft that has been separated from surrounding tissues. Skin for the graft is usually taken from your thigh. In people with buried penis caused by scrotal lymphedema, skin grafts also may be needed. However, there is usually enough uninvolved skin to rebuild your scrotum without grafting.Care at Cleveland ClinicUrology CareMake an AppointmentAdvertisementRisks / BenefitsWhat are the risks of surgery for buried penis or lymphedema?Surgery for buried penis and lymphedema is often successful, with little to no reoccurrence of the condition. Most people who have had surgery for buried penis or lymphedema have normal urination and sensation in the genital area after surgery. However, possible complications include:Swelling of your penis.Painful erections.Less sensitivity in your genital area.Poorly healed skin grafts.If you notice any of these symptoms in your child or yourself, talk to your healthcare provider.Recovery and OutlookWhat happens after surgery for buried penis or scrotal lymphedema?A course of antibiotics is usually prescribed for a week, sometimes longer. Adults are able to go home three or four days after surgery, but must return for a graft check and catheter removal after a week. Children are typically able to go home following surgery and don’t require the use of antibiotics. You'll see your provider as an outpatient within four to six weeks, and you'll need checkups with a healthcare provider for at least a year.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/22/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicUrology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"