"SVT Ablation800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/SVT AblationAdvertisementAdvertisementAdvertisementSVT AblationSVT ablation is a procedure that heats or freezes heart tissue that’s sending irregular heartbeat signals. Damaging these cells keeps them from sending signals that make your heart beat too fast. Success rates are high for SVT ablation, but the issue can happen again in some people after treatment.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewSVT ablation involves using a catheter to create scar tissue that stops irregular signals in your heart.What is SVT ablation?SVT (supraventricular tachycardia) ablation is a procedure that damages cells in your heart’s upper chambers because they’re causing an issue with your heartbeat’s electrical signals. Performing an ablation for SVT creates scars that stop these disruptive cells from sending irregular signals that make your heart beat too fast.A provider can use ablation if medicine isn’t helping you or is giving you side effects. Sometimes, ablation is a provider’s first-line (first choice) treatment. The choice depends on the arrhythmia, other conditions you have and the burden of symptoms.Normally, cells send regular signals to your heart’s chambers to beat. The normal heart’s electrical system consists of a series of living “wires” or fibers that transmit electricity, which regulates your heart’s rhythm. In some people, these fibers can form into a small loop, which creates a short circuit that can disrupt the normal rhythm.An ablation is a procedure that uses specialized catheters to go into the heart, find this loop and administer a controlled amount of damage to interrupt the loop. This stops it from disturbing the heart’s rhythm. Some catheters use radiofrequency to heat up the loop and create a small scar. Others use cold nitric oxide to freeze the loop, which also creates a small scar.How common is SVT ablation?There are about two cases of SVT for every 1,000 people. Since medicines help 60% to 80% of people with SVT, the others may seek ablation.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before SVT ablation?You’ll need to fast (avoid eating and drinking) for six to eight hours before an SVT ablation. Your provider may ask you to stop taking certain medicines before your procedure.What happens during SVT ablation?In an electrophysiology lab, a provider will:Give you pain medicine through an IV in your arm.Pierce your skin in your groin area and put a catheter (tube) into a blood vessel.Insert an electrode catheter and push it to your heart.Send signals through the electrode catheter to find the abnormal cells.Apply radiofrequency energy to the cells that are causing the issue.Are you awake during SVT ablation?Typically, you’ll have conscious sedation for SVT ablation. In some rare cases, you may need general anesthesia. Providers decide this on a case-by-case basis.How painful is SVT ablation?The radiofrequency energy doesn’t hurt. A provider will numb the area where a catheter goes through your skin. There’s a small amount of pain during catheter placement into the vein because of a lidocaine (local anesthetic) injection.AdvertisementWhat happens after SVT ablation?Once a provider removes everything from your blood vessel, they’ll press on the area where the catheter went through. Sometimes the procedure team uses manual pressure alone. However, it’s common to place a vascular closure device that helps prevent the vein from bleeding. You’ll need to keep your leg stretched out for six to eight hours after that.Care at Cleveland ClinicCardiology CareMake an AppointmentRisks / BenefitsWhat are the advantages of SVT ablation?SVT ablation has a 90% to 95% success rate for most types of SVT. However, SVT can happen again in 2% to 11% of people who have an ablation.AdvertisementWhat are the side effects of SVT ablation?Rarely, you may bleed or get an infection after SVT ablation. This risk is from the catheters providers use for the SVT ablation procedure.Other risks include:Hematoma (blood pooling).Blood clots.Reaction to anesthesia.Cardiac tamponade.On rare occasions, you may have damage to the normal parts of the conduction system, which results in the need for a pacemaker.Recovery and OutlookHow long does it take to recover from an SVT ablation?The day after you go home, you should be able to go back to doing things you normally do. However, you should wait three days before doing things that are more physically demanding.When to Call the DoctorWhen should I see my healthcare provider?Get emergency help if your wound suddenly swells up or the bleeding won’t slow down.Contact your provider if you have:Wound swelling or bruising.Shortness of breath.Chest pain.A heartbeat that doesn’t seem normal.Dizziness.Fever.Upset stomach.Numbness in your leg with the wound.A note from Cleveland ClinicHaving irregular heart rhythms can be unnerving, but treatments can help. Success rates for SVT ablation are very high. Talk with your provider to see if this treatment makes sense for your situation.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/12/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicCardiology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"