"Vacuum Extraction Delivery: What to Expect & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Vacuum Extraction DeliveryAdvertisementAdvertisementAdvertisementVacuum Extraction DeliveryVacuum extraction is one kind of assisted delivery procedure that can help get your baby through the birth canal when labor is stalled in the second stage. The vacuum extractor applies suction and traction to the baby’s head to help pull it out while you push. Vacuum extraction is only recommended under certain conditions.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewThe suction cup applies gentle traction to baby’s head.What is vacuum extraction delivery?During the second stage of labor, when you’re actively trying to push your baby out, sometimes the process of childbirth seems to stall. You’re trying, but the baby isn’t coming. This can go on for hours. While you’re in labor, your healthcare team will monitor your vital signs and your baby’s heart rate to stay alert to any signs of fetal distress. If you or your baby’s health is in danger from prolonged labor, and labor isn’t progressing, your healthcare team will look for ways to assist you in delivering your baby.Vacuum extraction is one way they can assist. If certain conditions are met — your baby’s head is low enough in the birth canal and they’re in an appropriate position — a vacuum extractor may be able to help guide them out. The vacuum extractor consists of a suction cup attached to a mechanical or electric pump. The cup is applied to your baby’s head and the pump provides traction to pull while you push. It's not always the solution you need, but sometimes it does the trick.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is vacuum extraction used during delivery?Vacuum extraction, or “ventouse,” is one method healthcare providers use to help get your baby out when they aren’t coming out on their own. There are other methods, including forceps delivery and c-section. Usually, surgery is considered a last resort. Vacuum extraction and forceps delivery offer additional ways for healthcare providers to assist laboring mothers before resorting to c-section delivery.Vacuum extraction and forceps delivery are similar in their advantages and disadvantages, and often the choice between them comes down to the training and experience of your healthcare provider. Both methods carry some risk, but healthcare providers recommend them when the risks of not helping appear to be greater. This might be because either you or your baby are suffering from prolonged labor.How common is vacuum-assisted delivery?In the US, vacuum extraction accounts for about 2.5% of vaginal births. Overall, rates of both vacuum extraction and forceps delivery have been falling while cesarean rates have been climbing. Assisted vaginal delivery is only indicated under specific conditions. If those conditions aren’t met, your provider might recommend a cesarean instead.AdvertisementProcedure DetailsWhat are the indications for vacuum extraction delivery?Vacuum extraction might be indicated if:Labor is prolonged or stalled in the second stage, andThe baby’s heart rate is considered “non-reassuring” orThe mother can't push anymore, either due to exhaustion or a health condition.What does a “non-reassuring” fetal heart rate mean?Healthcare providers see an abnormal fetal heart rate as a sign that the baby isn’t getting enough oxygen during labor. It’s normal for oxygen to be restricted temporarily during labor, but if it goes on for too long, it’s dangerous to the health of the baby.Your baby’s heart rate might be considered non-reassuring if:It’s abnormally high.It’s abnormally low.It has a pattern of abrupt decreases.It takes too long to return to the baseline rate after a contraction.AdvertisementWhat can we try first before vacuum extraction?If your baby’s heart rate indicates possible distress, your healthcare team might first try to compensate by:Giving you oxygen through a mask.Giving you fluids through a vein in your arm.Changing your position to facilitate faster delivery.If these interventions don’t improve your baby’s heart rate or advance labor, your healthcare team may recommend an operational procedure such as vacuum extraction.What are the contraindications for vacuum extraction?Sometimes you might need assistance, but vacuum extraction isn’t the right choice. This might be true if your baby:Is premature.Has not progressed low enough in the birth canal.Might not fit through the birth canal.Is not positioned headfirst.Needs to be rotated.Has a bleeding disorder.What happens during a vacuum extraction delivery?Before the procedure, you’ll be informed of the risks and benefits of vacuum assistance and asked for your consent. You’ll be offered pain relief if you haven’t had it already. In some cases, your delivery assistant may need to perform an episiotomy — an incision between the birth canal and the anus — in order to widen the opening of the birth canal. They may also break your water and drain your bladder.Your delivery assistant will carefully position the cup of the vacuum (ventouse) in just the right spot on your baby’s head, making sure not to trap any vaginal tissues under it. On your next contraction, they will apply traction with the mechanical or electric pump. The idea is to add the force of the vacuum to the force of your contraction, pulling when you push, and pausing when you pause.The delivery assistant is trained in how to apply just the right amount of suction to the vacuum. Too much suction can cause scalp injury to the baby, but too little can cause the cup to detach from the baby’s scalp. While applying suction with one hand, they will grasp the cup with the other hand to try and guide the baby’s head through the birth canal.If the cup detaches repeatedly from the baby’s head, or if there is any sign of bruising to the baby’s scalp, your delivery assistant will abandon the vacuum extractor. If the vacuum is successful, your delivery assistant will detach it as soon as your baby’s head is safely out. Now they can use their hands to help deliver the rest of the baby.When should attempted vacuum extraction be abandoned?When it’s been attempted for 20 minutes.When the cup has detached from your baby's head multiple times.When there is any sign of trauma to the baby’s scalp.What happens after this procedure?Once your baby has been completely delivered, your healthcare team will check you and your baby out for any signs of wounding from the procedure. If you had a tear or an episiotomy, they’ll repair it for you. They’ll continue to monitor your baby for any signs of complications that might arise. Some complications may take several hours to present. If no complications arise within 10 hours, you and your baby can go home and recover normally.If vacuum extraction is unsuccessful, your healthcare team may recommend a c-section next.Risks / BenefitsWhat are the advantages of vacuum extraction?When conditions are favorable, vacuum extraction can help deliver your baby from an oxygen-deprived environment without putting you through surgery. It's also faster than surgery, which is sometimes very important.What are the risks or complications of vacuum extraction delivery?Risks to the mother from vacuum-assisted delivery are comparable to the risks of childbirth in general. They include:Vaginal tears.Postpartum bleeding.Difficulty urinating or incontinence.Short-term side effects of vacuum extraction for the baby can include:Caput succedaneum. Also called scalp edema, this is a swelling of the scalp that can produce a cone-headed appearance. It usually resolves in a few days.Bruising / Jaundice. The vacuum extractor can cause bruising of the scalp, which increases the risk of neonatal jaundice. This common condition produces a temporary yellowing of the baby’s skin due to increased bilirubin from the breakdown of red blood cells. It usually goes away in a few weeks.Cephalohematoma. This is a collection of blood between the baby’s scalp and skull, caused by damaged blood vessels. Because the pooled blood is on the outside of the skull, it doesn’t affect the brain and is considered a minor injury. It will resolve in one or two weeks.Serious complications for the baby are rare. They can include:Skull Fracture. Newborn skulls are soft and easier to injure. Most fractures are small, heal on their own and cause no long-term damage. However, more severe fractures can cause brain bleeding, which can be damaging. Some fractures may require surgery to correct.Intracranial Hemorrhage. This is bleeding either in or around the brain. Brain bleeds are rare but can be serious. Common side effects are apnea and seizures. Less commonly, the bleeding can put pressure on the brain, causing brain damage.Subgaleal Hemorrhage. This occurs when the emissary veins in the baby’s head are ruptured and blood accumulates within the connective tissue between the skull and the scalp. Because of the volume of blood that can accumulate there, this condition can cause hemorrhagic shock and death if it’s not identified and treated soon enough. It usually develops gradually over the days following delivery. SGH occurs in roughly .6% of vacuum-assisted deliveries.Recovery and OutlookHow long does it take to recover from a vacuum-assisted delivery?If there are no serious complications, you’ll recover normally over the next six weeks. You might need to wear a pad for normal vaginal bleeding. You can manage your pain with over-the-counter medications while you heal. If there are any stitches, they will dissolve on their own.If your baby has any of the common short-term side effects of vacuum delivery, such as bruising, jaundice or scalp swelling, these will resolve over the next few weeks. Take extra care to protect your baby’s head while it heals and make sure to bring them in for follow-up checkups.A note from Cleveland ClinicMany mothers hope and plan for a simple vaginal birth, but the course of childbirth can have its twists and turns. When difficulties arise, it's good to know the options available to you. Vacuum extraction is one strategic tool that you and your healthcare provider might choose to help deliver your baby under certain conditions. As you plan for your childbirth, you can discuss interventions like vacuum extraction with your healthcare provider in advance. They’ll help you understand the risks and benefits and make a plan for how to proceed if you need help delivering your baby.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/28/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"