"Vaginectomy: What to Expect, Procedure & Results800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/VaginectomyAdvertisementAdvertisementAdvertisementVaginectomyVaginectomy is surgery to remove all or part of the vagina. It’s an effective treatment for vaginal cancer that can’t be treated with radiation and chemotherapy. It can also help transgender men who want to have gender affirmation surgery. Talk to your provider about your goals, including whether you hope to have vaginal intercourse in the future.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is vaginectomy?Vaginectomy is a surgical procedure to remove all or part of the vagina. Healthcare providers perform this surgery to treat vaginal cancer that doesn’t respond to other treatments. Some transgender men choose to have this procedure as part of gender affirmation surgery.Recovery time varies depending on how much of your vagina your provider needs to remove and whether you need other surgeries, too. Talk to your provider about what you can expect during recovery.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy do providers perform vaginectomy?You may need vaginectomy if you have vaginal cancer. Your provider will usually try other treatments first. These may include radiation therapy, surgery or chemotherapy. If those treatments don’t work, your provider may recommend vaginectomy.Part of the female reproductive system, the vagina is a tube made of muscle. It starts at the vulva (the external genitals) and extends to the cervix (the opening of the uterus). Depending on the location and size of the tumors, the stage of cancer and whether it has spread, your provider may recommend:Partial vaginectomy, to remove the upper portion of the vagina.Total vaginectomy, to remove the entire vagina.Radical vaginectomy, which removes the entire vagina as well as the tissue around it.Some transgender men get vaginectomy as part of gender affirmation surgery. Providers also call this female-to-male (FTM) “bottom surgery.” The procedure usually happens before metoidioplasty or phalloplasty. These are surgeries to create a penis.How common is vaginectomy?This procedure is relatively uncommon. Providers can usually treat most vaginal cancer with radiation and chemotherapy. So, vaginectomy isn’t often necessary.Vaginal cancer is rare. Less than 2% of cancers in the female genital tract are vaginal cancer.AdvertisementProcedure DetailsWhat happens before vaginectomy?Before surgery, your provider will examine you and ask about your medical history. They may tell you to stop taking certain medications, such as blood thinners, before the procedure. If you smoke or use tobacco products, ask your provider about quitting before surgery. Smoking and tobacco use can slow the healing process.You’ll need to avoid eating or drinking anything the night before the surgery. Your provider will give you details about the procedure and how to prepare.What happens during vaginectomy?Your provider will give you general anesthesia through a vein in your arm. You will be asleep throughout the procedure and won’t feel pain during surgery. Your surgeon may perform this procedure vaginally (through your vaginal opening). They make several small incisions (cuts) to separate the vaginal tube from the tissues surrounding it. Depending on the technique, your provider may close or leave the vaginal opening.Your provider may do this procedure laparoscopically. This means they use a long, thin instrument that looks like a telescope. Instead of going through your vaginal opening, your provider may make several small incisions in your abdomen. If you need other surgeries, your provider may do that surgery while you’re under general anesthesia. These additional procedures may include a hysterectomy to remove your uterus.Some women choose to have a vaginoplasty following a vaginectomy. This is surgery to reconstruct a vagina. A vaginoplasty procedure allows women to have vaginal intercourse. If you’re interested in this procedure, talk to your provider. They will discuss your options, including when to get this additional surgery.AdvertisementWhat happens after vaginectomy?You’ll need to stay in the hospital after the procedure, usually for a few days but up to a week. The length of stay depends on the type of vaginectomy you had and whether you had other surgeries as well. While you’re in the hospital, your provider will monitor you and give you medications to relieve pain. These medications also reduce swelling and lower the risk of infection.When you’re able to go home, your provider will tell you how to care for yourself and how to take care of your incisions. Follow your provider’s instructions carefully. You should limit physical activity for at least a few weeks. You’ll need to avoid lifting or carrying anything heavy. Your provider will tell you how long you should rest.Care at Cleveland ClinicVaginal Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of vaginectomy?Vaginectomy is an effective procedure to treat vaginal cancer. This surgery has a 95% survival rate two years following the procedure.This procedure helps trans men live in a body that aligns with the gender with which they identify. Trans men who choose this procedure are generally very happy with the outcome.Most transgender people who choose gender affirmation surgery are happy with the outcome. Depending on the procedure, studies show that 94% to 100% of people report satisfaction with their results.What are the risks or complications of vaginectomy?As with any surgery, there is a risk of complications. They include:Excessive bleeding.Infection.Problems with defecating (pooping) or leaking stool.Vaginal fistula (a hole between the vaginal area and other internal organs, such as the bladder).Urinary retention.In recent years, more transgender men have chosen to have this procedure. While the risk of complications used to be higher, the procedure is safer than ever before. There is a lower risk of complications now.Recovery and OutlookWhat is the recovery time after vaginectomy?You can expect to have some pain in the first week or so following surgery. Talk to your provider about your pain relief options and what activities to avoid.Your recovery time depends on your overall health and the type of surgery or surgeries you had. You’ll probably need to avoid physical activity for several weeks. This may include intense exercise, all sexual activity and any heavy lifting.When to Call the DoctorWhen should I see my healthcare provider after vaginectomy?After this procedure, call your provider right away if you have:Bleeding or swelling in your abdominal area.Fever, redness and swelling near the incision (these are signs of infection).Severe abdominal pain.Urinary incontinence or fecal incontinence.If you had vaginal reconstruction surgery following vaginectomy, call your provider if you feel pain during sex. Painful sex can be a sign of a fistula or other complications.A note from Cleveland ClinicVaginectomy is an effective treatment for vaginal cancer. The procedure also helps transgender men who choose to have gender affirmation surgery. Before getting this surgery, have an open and honest discussion with your provider about what you can expect. Tell your provider if you want to have vaginal intercourse in the future. If so, you may want to consider vaginal reconstruction surgery. Be sure to follow your provider’s instructions during recovery to avoid complications.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/28/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicVaginal Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"