"Vaginal Seeding: Procedure, Benefits, Risks & What to Expect800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Vaginal SeedingAdvertisementAdvertisementAdvertisementVaginal SeedingVaginal seeding is the practice of wiping a baby’s mouth, face and skin with its mother’s vaginal fluids after C-section. This process transfers vaginal microbes to the baby to help establish the baby’s own microbiome to promote good health and fight disease. But the practice has some risks, and healthcare providers don’t recommend it.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is vaginal seeding?Vaginal seeding is wiping a baby’s mouth, face and skin with its mother’s vaginal fluids right after a cesarean birth (C-section). Vaginal seeding is sometimes called microbirthing. There isn’t a lot of data about how safe or effective vaginal seeding is. Vaginal seeding can introduce bacteria or viruses that can make your baby sick. For that reason, the American College of Obstetricians and Gynecologists (ACOG) doesn’t recommend it at this time outside of clinical trials.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is vaginal seeding done?Some bacteria and other organisms (microbes) that live in our bodies and skin can help keep us healthy. Vaginal seeding exposes babies born by C-section to microbes that live inside their mother’s vagina.What are microbes and the microbiome?You have many organisms (microbes) that live on you and inside you. Microbes include bacteria, fungi and viruses. These microbes live:On your skin and teeth.In your genitals.In your gut (gastrointestinal tract).All these microbes in and on your body form your microbiome. Microbiome is the name for all the microbes that work together to help keep you healthy and fight disease.AdvertisementWhy is vaginal seeding done for babies born via C-section?Babies get some of the microbes that form (seed) their microbiome from their mother. During vaginal delivery, vaginal fluids cover your baby. These fluids contain your vaginal bacteria (vaginal flora).Babies born vaginally use microbes from their mother’s vagina (her vaginal microbiome) to help grow bacteria in their gut. These bacteria can help keep them healthy and fight disease.If your baby is born by C-section, they don’t receive the vaginal flora during delivery. You may choose vaginal seeding to help your baby get these bacteria to help grow their microbiome.Who invented vaginal seeding?Researchers at New York University first wiped (swabbed) babies born by C-section with their mother’s vaginal fluids. They wanted to see if the babies would develop the same microbes that they would have developed after vaginal birth.AdvertisementDo C-section babies have health issues?Some research indicates an increased risk of obesity in children delivered by C-section. Research also shows that babies born by C-section have an increased risk of developing:Allergies.Asthma.Celiac disease.Eczema.Food allergies.Inflammatory bowel disease.Some people think vaginal seeding could help reduce the risk that babies born by C-section will develop these conditions. Supporters believe that exposing babies to vaginal bacteria helps them grow a healthy microbiome that fights these conditions.But researchers don’t know if the reason babies born by C-section have an increased risk for these conditions is because they have different microbiomes. Experts need to do more studies to learn more.Do C-section babies need vaginal seeding to get a healthy microbiome?If you have your baby by C-section, they won’t get the same microbes that they would if you delivered vaginally. But you don’t need to do vaginal seeding. There are other ways to give your baby healthy microbes, including:Breastfeeding.Skin-to-skin contact.Procedure DetailsWhat happens before vaginal seeding?About an hour before the C-section, your healthcare provider takes a piece of sterile cotton (gauze) and places it inside your vagina. During this time, fluid collects on the gauze.What happens during C-section?Before C-section begins, your healthcare provider removes the gauze and puts it in a sterile container. This container protects the vaginal fluids and microbes during C-section surgery.Right after delivering the baby, your healthcare provider performs vaginal seeding.What happens during vaginal seeding?After your baby is born, your healthcare provider removes the gauze from the container. Then they use it to swab your baby’s:Mouth.Face.Entire body.What happens after vaginal seeding?Vaginal seeding is a quick procedure. After your healthcare provider completes the swab, your baby receives newborn care in the hospital.Risks / BenefitsWhat are the advantages of vaginal seeding?Vaginal seeding may have some benefits. Researchers think vaginal seeding might reduce the risk of immune-related disorders in these babies. But they don’t know for sure.Researchers also don’t know how long any benefits of vaginal seeding last after the baby is born.What are the risks of vaginal seeding?Not all microbes in your vagina are healthy for your baby. Sometimes, harmful bacteria can spread to the baby during vaginal delivery.Vaginal seeding can also spread these harmful bacteria to your baby, including:Chlamydia.Genital herpes (HSV-2).Gonorrhea.Group B streptococcus.Recovery and OutlookShould my baby have vaginal seeding?Healthcare providers don’t know enough about the long-term benefits and risks of vaginal seeding to recommend it for babies. The American College of Obstetricians and Gynecologists, a national group of providers who care for women and babies, doesn’t recommend vaginal seeding.But that could change in the future. Researchers are studying the practice in a clinical trial of babies to see if vaginal seeding improves:Immune development.Obesity rates (metabolic outcomes).Microbiome development.When to Call the DoctorWhen should I contact my provider about vaginal seeding?Healthcare providers don’t recommend vaginal seeding, but some mothers may choose to swab their babies on their own. If you swab your baby, let your provider know.Make sure to watch for signs of infection. Tell your provider right away if your baby has any of these symptoms:Coughing.Fever or a temperature that’s lower than normal.Pink eye (conjunctivitis).Poor feeding.Rapid breathing.Skin rash.Sluggishness (lethargy).Additional Common QuestionsHow can I help my baby get healthy microbes without vaginal seeding?If you’re having a C-section, plan to breastfeed your baby for the first six months. Healthy microbes live on the skin of your nipple.Healthy microbes also live in your breast milk. These microbes can help seed your baby’s microbiome. There are many additional benefits of breastfeeding for you and your baby as well.After delivery, you can also help your baby get healthy microbes through skin-to-skin contact. Shortly after birth, you or your partner can unwrap your baby for a cuddle while your baby adjusts to life in the outside world.A note from Cleveland ClinicVaginal seeding is a way to make sure babies born by C-section get the microbes they need to establish a healthy microbiome. But this practice has some risks because it may expose babies to harmful bacteria. Talk to your healthcare provider about the best ways to help your baby get healthy microbes without this risk.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/04/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"