"Vaginoplasty: Procedure Details, Risks, Benefits & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/VaginoplastyAdvertisementAdvertisementAdvertisementVaginoplastyVaginoplasty is a procedure to construct or repair a vagina. It treats various medical issues, including vaginal injury due to childbirth and pelvic floor disease complications. It’s also for creating a transgender vagina, which can help affirm your gender.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is vaginoplasty?Vaginoplasty can mean a lot of different things, but in general, it's a procedure to construct or repair the vagina.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat happens during vaginoplasty?The details of the procedure depend on your goals or medical needs and include reconstruction or recreation of the vagina using various surgical techniques.Who needs vaginoplasty?Individuals seeking repair of childbirth defects or trauma to improve sexual function.Women who need vaginal reconstruction after undergoing radiation or excision of the vagina to treat cancer or other conditions.Transgender individuals undergoing gender affirmation surgery.Women born with congenital abnormalities (issues present from birth) affecting the development of the vagina.AdvertisementIs vaginoplasty the same as vaginal rejuvenation?Vaginoplasty is one type of procedure to improve the vagina’s appearance or function.Other vaginal rejuvenation procedures include:Labiaplasty, which evens out or decreases the size of the labia — the fleshy lobes of the vagina.Vulvoplasty, which reshapes the outer part of the vagina.Procedure DetailsWhat happens before vaginoplasty?You undergo assessments and testing to prepare for surgery. These tests may include:Physical exam to assess your health and learn more about your medical history.Patient education about risks, benefits and postsurgical care requirements.Recommendations that lower your risk of complications, including quitting smoking.For transgender women undergoing vaginoplasty for gender affirmation, specific pre-operative requirements exist including genital hair removal and the need to meet the requirements set by the World Professional Association for Transgender Health.AdvertisementWhat happens during vaginoplasty performed for women with childbirth injuries?When vaginoplasty is done to repair injuries after childbirth, the procedure involves:Removing extra skin.Using stitches to secure loose tissue in part or the full depth of your vagina.Reducing the opening size of your vagina.Vaginoplasty to repair congenital defects (an issue you’re born with) may include:Creating a functional vagina.Removing excess tissue or abnormal structures.Preventing blood from pooling during menstruation.What happens during vaginoplasty as part of gender affirmation surgery?During a vaginoplasty as part of gender affirmation surgery, the male external genitalia are partially removed and reconfigured. The skin of the penis and scrotum are used to create a vaginal canal and labia.Risks / BenefitsWhat are the risks and benefits of vaginoplasty for vaginal reconstruction after childbirth?Risks after vaginoplasty for childbirth injuries can include:Dyspareunia (painful intercourse).Numbness or loss of sensation.Benefits after surgery can include:Improved sexual satisfaction and self-esteem.What are the risks and benefits of vaginoplasty for gender affirmation?One of the main benefits is relief from gender dysphoria. After surgery, individuals achieve better consistency with the gender they identify with. This has enormous benefits on people’s mental health and improves their quality of life.Risks of vaginoplasty for gender affirmation can include:Vaginal stenosis.Inadequate depth of the vagina.Vesicovaginal fistula (an abnormal connection between the vagina and the urinary tract ) or rectovaginal fistula (an abnormal connection between the vagina and rectum).Nerve injury.Poor cosmetic result.Recovery and OutlookWhat is recovery like after vaginoplasty?Recovery may last anywhere from a few weeks to a few months, depending on the extent of surgery. Postsurgical care after vaginoplasty depends on the type of vaginoplasty performed.Will I need to use a vaginal dilator?Your healthcare provider may recommend the use of a dilator. This device gently stretches the inside of your vagina in order to maintain the depth and caliber of your vagina. You may or may not need to use a dilator following vaginoplasty.When to Call the DoctorWhen should I contact my healthcare provider after vaginoplasty?Your care should include follow-up appointments to track your recovery. Contact your healthcare provider immediately if you experience complications.These may include:Blood-soaked dressings, which can be a sign of excessive bleeding.Infections, which can cause a fever or yellowish discharge from the incision.Pain that does not respond to medications.Signs of blood clots, such as abnormal swelling in your groin or lower leg.Vomiting and not being able to keep fluids down.A note from Cleveland ClinicVaginoplasty is done for many reasons, and the technique varies depending on why you’re having the procedure. It’s performed for people who've had a childbirth injury, undergone treatments for cancer or have congenital anomalies, and for gender affirmation. Risks associated with the surgery and the recovery process depend on the type of vaginoplasty performed.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/28/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"