"Valsalva Maneuvers: What They Are and How to Do Them800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Valsalva maneuverAdvertisementAdvertisementAdvertisementValsalva maneuverThe Valsalva maneuver is a drug-free way to quickly return an abnormal heart rhythm to normal. It may work for specific types of fast heart rhythms, and it doesn’t work every time. If the Valsalva maneuver fails, you’ll need cardioversion to get your heart back into a normal rhythm.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is the Valsalva maneuver?The Valsalva maneuver is a quick, noninvasive method for a fast heart rhythm called supraventricular tachycardia (SVT). It’s sometimes the first choice of treatment before trying medicine or another procedure to get your heart rhythm back to normal. To do the Valsalva maneuver, you push air out, but with your nose and mouth closed (like having a bowel movement).You should do the Valsalva maneuver after your provider gives you instructions. They’ll also know if you have the type of abnormal heart rhythm that responds to this maneuver.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is the Valsalva maneuver used?Your healthcare provider can use the Valsalva maneuver to diagnose you or treat you. The Valsalva maneuver can:Slow down your heart rate and stop supraventricular tachycardia (SVT), an abnormal heart rhythm.Help your provider decide which kind of heart murmur you have.Tell your provider if you have heart failure.Help diagnose other problems, such as venous (vein) disease or a varicocele (a swollen vein in your scrotum).Help diagnose an issue with your autonomic nervous system (which controls your heartbeat, breathing and other functions without you thinking about it).Get something out of your middle ear that shouldn’t be there.Who should avoid the Valsalva maneuver?Because the Valsalva maneuver increases pressure in your eyes and belly, you shouldn’t do this maneuver if you have retinopathy (a problem with blood vessels in the retina of your eye) and intraocular lens implants in your eyes, such as after cataract surgery.You need to be careful with the Valsalva maneuver if you have:Heart valve disease.Coronary artery disease.Congenital (since birth) heart disease.AdvertisementProcedure DetailsHow to do the Valsalva maneuver to help with supraventricular tachycardia.What happens before the Valsalva maneuver?Your healthcare provider may give you a mouthpiece that connects to a device that measures pressure. You may need to blow into the mouthpiece to make a plunger in the device float and reach a certain level. When making a diagnosis, your provider will want to see a pressure of 40 mm Hg during the Valsalva maneuver.How to perform the Valsalva maneuverSit down or lie on your back.Take a breath.Push that breath out against your closed mouth and nose while straining as if you’re trying to poop. Hold for 15 to 20 seconds.Open your nose or mouth and breathe out.Two versions of the Valsalva maneuver can help with supraventricular tachycardia (SVT):In the modified Valsalva maneuver, your provider raises your legs right after you stop straining. This version may work better than the standard Valsalva maneuver. One study found the standard method worked for 16% of people, while the modified version worked for 46% of people. It may work better because having your legs up helps more blood come back to your heart.In the reverse Valsalva maneuver, you sit and inhale for 10 seconds with your nose and mouth closed.Valsalva maneuver phases:When you’re straining, your blood pressure goes up briefly.Your blood pressure and the amount of blood your heart pumps go down. Less blood is coming back to your heart, causing your heart rate to speed up. Your heart starts pumping out more blood and your blood pressure goes back to normal.Your blood pressure drops after you stop straining.Your blood pressure goes higher than before starting the maneuver. Your heartbeat slows and your blood pressure goes back to normal.AdvertisementWhat happens after the Valsalva maneuver?If the Valsalva maneuver is successful, which happens 5% to 20% of the time, your fast heart rate will slow down in about one minute. If it doesn’t stop your supraventricular tachycardia after three tries, your healthcare provider will proceed with the next steps in treatment. These steps may include carotid massage, medications or electric cardioversion depending on your symptoms, vital signs and the type of supraventricular tachycardia.Care at Cleveland ClinicArrhythmia TreatmentsFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of the Valsalva maneuver?The Valsalva maneuver is a fast, drug-free way to stop a supraventricular tachycardia (SVT). If it works, you can avoid medications or cardioversion.What are the risks or complications of the Valsalva maneuver?Most people can do the Valsalva maneuver safely and not have complications.Side effects don’t usually happen with the Valsalva maneuver, but some people experience:Chest pain.Fainting.Abnormal heart rhythms.Stroke.Recovery and OutlookWhat is the recovery time?The recovery time for the Valsalva maneuver itself is very quick. However, if it didn’t work and you’re still having supraventricular tachycardia (SVT), your healthcare provider will need to do other maneuvers or perform electrical or medication-based cardioversion.When to Call the DoctorWhen should I see my healthcare provider?Contact your provider if they taught you the Valsalva maneuver and told you to use it for SVT and it didn’t work. They can help you get your heart back into a normal rhythm with medicine or electrical cardioversion.A note from Cleveland ClinicThe Valsalva maneuver can be a useful tool in getting your SVT back to a normal heart rhythm. However, since it doesn’t work every time, it’s best to have a plan for your next step. Talk with your healthcare provider about what they recommend.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/09/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicArrhythmia TreatmentsFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"