"Valvuloplasty: Types, Procedure and Outlook800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/ValvuloplastyAdvertisementAdvertisementAdvertisementValvuloplastyA valvuloplasty is a treatment to open a narrowed heart valve. With a valvuloplasty, your healthcare provider reaches your heart with a small, hollow tube (catheter) that is used to inflate a balloon instead of surgical incisions. This minimally invasive approach can lead to a quicker recovery and less pain. It’s also called balloon valvuloplasty.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewValvuloplasty opens a narrowed heart valve and improves blood flow.What is a valvuloplasty?A valvuloplasty is a procedure to open a narrowed heart valve and improve blood flow. The heart valves control how blood moves through your heart. If one of your heart valves stiffens or narrows, your heart may not pump blood efficiently.Another name for valvuloplasty is balloon valvuloplasty. Your healthcare provider uses a small, hollow tube (catheter) to place a deflated balloon in your heart valve. When the balloon inflates, it opens your heart valve.Is valvuloplasty surgery?A valvuloplasty is a minimally invasive interventional procedure. Instead of a surgical incision, it uses a catheter through an artery in your groin. Less commonly, your provider may place the catheter through an artery in your shoulder or arm.Compared to open surgery, which requires incisions, a minimally invasive approach often leads to quicker recovery and less pain.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs to have a valvuloplasty?Valvuloplasty may be an option to open a narrowed heart valve (stenosis). Your provider may recommend valvuloplasty to treat these types of heart valve disease:Mitral valve stenosis.Pulmonary valve stenosis.Tricuspid valve stenosis.Less commonly, providers may use valvuloplasty for aortic valve stenosis. Valvuloplasty can be effective for congenital (present at birth) aortic stenosis in children and young adults. However, in adults with aortic valve stenosis, the aortic valve often narrows again after valvuloplasty. Your provider may use aortic valvuloplasty as a temporary treatment before aortic valve surgery or transcatheter aortic valve replacement (TAVR). But valvuloplasty isn’t a substitute for a heart valve replacement.What is the difference between a valvuloplasty and valvotomy?There’s no difference between a valvuloplasty and a balloon valvotomy. Balloon valvotomy is another name for valvuloplasty.When healthcare providers use the term “valvotomy,” they sometimes mean “surgical valvotomy.” A surgical valvotomy is an open heart surgery to cut the valve leaflets, the tissue flaps that open and close to control blood flow.AdvertisementProcedure DetailsWhat happens before a balloon valvuloplasty?Your healthcare provider will give you detailed instructions to prepare for a valvuloplasty. Usually, you’ll need to fast (not eat or drink) starting the night before the procedure. If you take blood-thinning medications (anticoagulants), you may need to stop taking them for a period.On the day of the procedure, don’t wear any metal, such as jewelry or removable retainers. When you arrive at the hospital, your healthcare team gives you a sedative medication (anesthesia) to help you relax. You usually are awake during the procedure.What happens during a balloon valvuloplasty?A cardiologist (doctor specializing in the heart) performs valvuloplasty. During the procedure, your cardiologist:Inserts a small, hollow tube called a sheath through a blood vessel in your groin, arm or shoulder.Threads a catheter with a deflated balloon through the sheath.Injects a contrast dye and uses X-rays to guide the catheter to your heart valve.Inflates the balloon to open the narrowed heart valve.Removes the catheter and closes the insertion site with small stitches or a special surgical glue.Sometimes, your cardiologist leaves the sheath in place for up to six hours. They may choose to do this if you have bleeding risks or need to wait for blood-thinning medicine to wear off.AdvertisementWhat happens after a balloon valvuloplasty?After the procedure, you go to a recovery area. If the catheter went through your groin, you’ll need to wait a few hours before bending your leg. You may lie in bed for about two to six hours, depending on several factors.You’ll need to drink plenty of water to flush the contrast dye from your body. While on bed rest, you’ll need to use a urinal or bedpan. You can usually get up and move several hours after a valvuloplasty. Most people return home the next day.Care at Cleveland ClinicHeart Valve CareFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of a valvuloplasty?Valvuloplasty increases blood flow and helps your heart work more efficiently. This procedure may help postpone or avoid valve replacement.Valvuloplasty is a minimally invasive procedure. Compared to open-heart surgery, the benefits of minimally invasive heart treatments can include:Faster recovery.Less scarring.Lower risk of complications.Reduced pain.However, valvuloplasty is not an alternative for surgery when it is indicated by your healthcare provider.What are the risks of a valvuloplasty?Like all medical procedures, a valvuloplasty can come with a risk of infection or bleeding. If you are pregnant or think you could be pregnant, tell your healthcare provider. Valvuloplasty and radiation exposure (from X-rays during the procedure) can be harmful to pregnant women and fetuses.There’s also a risk that the heart valve will narrow again after a valvuloplasty. Your specific risk factors depend on your overall health. Your healthcare provider can help you understand all risks or potential complications of a valvuloplasty.Recovery and OutlookWhat is the recovery time after a valvuloplasty?Recovery time depends on several factors, including your overall health and heart condition. Generally, you’ll need to avoid strenuous activity and swimming for about five to seven days.Many people can return to work after a week. You may need to wait longer if your job involves physical activity or manual labor. It may take up to eight weeks to resume all your usual activities.When to Call the DoctorWhen should I see my healthcare provider?After a valvuloplasty, call your healthcare provider right away if you have:Chest pain.Chills or fever.Dizziness or fainting (syncope).Drainage or bleeding at the insertion site.Nausea or vomiting.Pain or swelling that worsens.Weight increase of more than 3 pounds in one day.A note from Cleveland ClinicValvuloplasty is a procedure to open narrowed heart valves. In a valvuloplasty, cardiologists use minimally invasive techniques to place a deflated balloon in the heart valve. When the balloon inflates, it opens the valve. This treatment improves blood flow, so your heart pumps blood more efficiently. A valvuloplasty may help you avoid or delay valve replacement surgery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/09/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicHeart Valve CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"