"Vesicostomy800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/VesicostomyAdvertisementAdvertisementAdvertisementVesicostomyWhen an infant or small child has trouble emptying their bladder, a vesicostomy may be needed. This is a small cut made into the abdomen to drain urine from the bladder. The procedure is usually a temporary fix until the underlying cause of the problem is addressed.ContentsArrow DownOverviewProcedure DetailsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRecovery and OutlookOverviewWhat is a vesicostomy?A vesicostomy is a procedure in which a small opening is made in the lower abdomen (usually just below the belly button) to allow urine to drain out from a child’s bladder. This usually is done when an infant or young child has problems emptying their bladder. A doctor does the procedure to try to stop the kidneys from being damaged by the urine flowing back to the kidneys (refluxing).This is usually a temporary and reversible measure that is done to protect the kidneys until the underlying cause of the problem is corrected. The urine usually just drains into the child’s diaper after a vesicostomy, rather than being collected in a bag.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy would a child need a vesicostomy?A vesicostomy is usually needed to continuously empty the bladder. One cause of this is spina bifida. Another possible cause is a spinal cord injury. When a person cannot empty their bladder, pressure builds up and the urine can reflux back to the kidneys, damaging them. A temporary vesicostomy is used when a catheter is not enough to stop kidney damage.Procedure DetailsHow is a vesicostomy done?A small part of the bladder is cut and then sewn to the abdominal wall. The procedure usually takes one to two hours. Many children can go home several hours later, but in some cases a child will need to spend the night for monitoring.Most children have only a small amount of pain afterward. Your doctor will advise you on what pain relief options are best for your child. They can resume normal activities within about a week.AdvertisementRecovery and OutlookWhat is the outlook for a child who has had a vesicostomy?Most children do very well once the opening is in place. Some may need a little extra diaper rash ointment if the skin is irritated by urine. Some children may need a larger diaper to make sure the opening is covered properly and their clothes do not get wet.A small part of the bladder may come through the opening when the child is straining, such as during a bowel movement. If the bladder does not go back in after the bearing down is finished, it can be pushed back in gently. If it will not go back in, call the doctor’s office immediately.Most patients’ incisions heal well once the doctor closes the vesicostomy. If the opening starts to close up due to natural healing, before it is intended to, it may need to be opened up again. To prevent the vesicostomy from closing prematurely, the parents may need to place a catheter into the vesicostomy one to two times each day.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/06/2020.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementCall Appointment Center 24/7 866.320.4573Questions 216.444.2200Request an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"