"Video-Assisted Thoracic Surgery: VATS Procedure800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Video-Assisted Thoracic Surgery (VATS)AdvertisementAdvertisementAdvertisementVideo-Assisted Thoracic Surgery (VATS)You may need video-assisted thoracic surgery (VATS) to diagnose or treat lung cancer. Healthcare providers also use VATS to diagnose and treat thoracic conditions like esophageal cancer, lung infections and pleural effusion. Compared to an open-chest surgery (thoracotomy), VATS offers a faster, less painful recovery with fewer complications.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is video-assisted thoracic surgery (VATS)?Video-assisted thoracic surgery (VATS) is a procedure to diagnose and treat certain conditions that affect your chest area. Healthcare providers insert a thin tube with a tiny video camera on the end (a thoracoscope) into a small incision in your chest.This scope allows your provider to view inside your chest cavity. Your provider inserts surgical instruments into separate small incisions. They use images from the thoracoscope to guide and perform procedures. You may also hear the term video-assisted thoracoscopy.What does thoracic mean?Thoracic refers to the area between your neck and abdomen known as the thorax. It includes some blood vessels and lymph nodes (part of your lymphatic system), as well as your:Diaphragm.Esophagus.Heart and pericardium (protective sac around your heart).Lungs.Ribs, thoracic spine and breastbone.Thymus gland (part of your immune system).Who needs VATS?Healthcare providers mostly use VATS to diagnose and treat lung cancer or metastatic cancer that spreads to your lungs.VATS also helps providers diagnose and treat other thoracic conditions like:Esophageal cancer.Heart cancer.Hiatal hernia.Hyperhidrosis (excessive sweating).Lung diseases like chronic obstructive pulmonary disease (COPD) and lung infections like tuberculosis.Myasthenia gravis.Pericarditis.Pleural effusion and pleural mesothelioma.Spine tumors and abscesses.Thymoma and thymic carcinoma.Procedure DetailsWho performs VATS?A thoracic (chest) or cardiothoracic (heart and chest) surgeon performs video-assisted thoracoscopy. These medical doctors have additional training in performing surgery to diagnose and treat conditions in your chest area.What are the types of video-assisted thoracic surgeries (VATS)?Thoracic surgeons use VATS to perform different procedures like:Esophagectomy, the removal of the esophagus.Laminectomy, the treatment of spine tumors and abscesses.Lung volume reduction surgery (LVRS), the removal of diseased lung tissue.Pericardiectomy, the removal of part or all of the pericardium. This is the membrane around your heart.Thymectomy, the removal of a diseased thymus gland.VATS lobectomy, the removal of a section (lobe) of a cancerous lung.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat happens before VATS?You should follow your surgeon’s instructions on what to do before the procedure. They may need you to fast (not eat or drink) for a certain period of time before surgery. Your surgeon may ask you not to take certain medications, including vitamins and herbal supplements. You may also need to quit smoking.Before surgery, you may get tests such as:Blood tests, including a complete blood count (CBC).Heart tests like an electrocardiogram (EKG) or exercise stress test.Imaging tests, such as a chest X-ray, CT scan or positron emission tomography (PET) scan.Pulmonary function testing.Upper endoscopy or gastrointestinal (GI) X-ray examination (barium swallow).What happens during VATS?VATS takes place in a hospital or surgical center. You receive general anesthesia to sleep through the procedure. You’ll lie on your nonsurgical side during surgery.Depending on the thoracic condition and VATS procedure, your surgeon:Makes several quarter-inch to half-inch incisions in your chest. Or they make a single incision for a uniport VATS (U-VATS) procedure.Inserts the scope device, which sends images of the inside of your chest to a video screen.Inserts surgical instruments into the other incisions.Uses the video images to guide the removal of the diseased tissue or organ.Closes the incisions with removable stitches or staples.AdvertisementWhat is robotic VATS?Some surgeons use robotic technology to perform video-assisted thoracoscopy. Your surgeon views images from the thoracoscope to guide a robotic surgical device that removes tissue or the diseased organ.What happens after VATS?Your surgeon may send tissue to a lab for a biopsy. A specialist examines the tissue for signs of cancer, infection or disease. The findings may indicate a need for additional surgery or treatments.Care at Cleveland ClinicLung Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the benefits of VATS?VATS is a minimally invasive procedure. This means it takes place through small incisions. An open-chest surgery (thoracotomy) takes longer to perform. It requires a large incision to spread open the ribs and access the chest area. As a result, the recovery is often longer and more painful.Benefits of VATS include:Less risk of blood loss that may require a blood transfusion.A shorter hospital stay.Less severe postoperative pain and scarring.Faster recovery of respiratory function.Lower risk of infection or complications.A quicker return to daily activities.What are the risks of VATS?VATS carries a risk of complications like:Arrhythmias.Blood clots and strokes.Bruising.Collapsed lung (pneumothorax) or atelectasis (lung air sacs don’t properly inflate).Damage to nearby glands, organs, nerves or blood vessels.Hypoxemia (low blood oxygen).Infections.Internal bleeding and blood loss.Respiratory problems like pneumonia.Recovery and OutlookWhat is recovery like after VATS?Most people need to spend a few nights in the hospital after surgery. You should carefully follow your discharge instructions. Doing so will promote a healthy recovery and lower your risk of complications.Your at-home recovery may include:Changing surgical dressings regularly.Not driving and staying home from work or school for a designated time.Resting and not lifting anything heavy for a set time.Taking antibiotics, pain relievers or other medications as directed by your provider.What is the outlook for people who have VATS?Your outlook depends on the specific thoracic disorder, your overall health and the success of treatments. Your thoracic surgeon can discuss your prognosis with you based on your unique diagnosis.When to Call the DoctorWhen should I call the doctor?You should call your healthcare provider if you experience:Chest pain.Difficulty breathing.Signs of infection, such as redness or yellow discharge at the incision site or a fever.A note from Cleveland ClinicYou may need video-assisted thoracic surgery (VATS) to diagnose or treat lung cancer. Healthcare providers also use VATS to diagnose and treat other thoracic conditions that affect your heart, esophagus and chest area. VATS is a minimally invasive procedure with a faster recovery than with an open-chest surgery (thoracotomy). You should also have less pain and scarring. Your provider can discuss whether VATS is the right procedure for your unique health situation.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/09/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicLung Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"