"Voice Therapy: What It Is, Exercise, Studies800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Voice TherapyAdvertisementAdvertisementAdvertisementVoice TherapyVoice therapy uses vocal cord exercises to prevent or treat voice disorders like hoarseness and laryngitis. Speech-language pathologists, respiratory therapists and voice coaches provide voice therapy. Transgender voice therapy helps transgender individuals control their pitch to achieve higher or lower voices.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is voice therapy?Voice therapy helps people with voice disorders change vocal behaviors and heal their vocal cords. The therapy helps your voice sound stronger and more like it did before the voice disorder.Voice therapy can also help prevent a voice disorder. And people who are transgender may benefit from a type of voice therapy called gender-affirming voice therapy.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are voice disorders?Voice disorders affect your voice box (larynx), and can cause a consistent or inconsistent change in your voice. The larynx is the area of your throat that contains your vocal cords. It also has the muscles you need to talk, breathe and swallow.Voice disorders can change the quality, pitch or loudness of your voice. Your voice may sound strained, husky or weak. Sometimes, your voice becomes a whisper or disappears altogether.How does your voice work?When you make sounds, air moves through your lungs and into your windpipe (trachea) and voice box. Inside of your larynx are two vocal cords (also called vocal folds). These flexible muscles vibrate as air passes through them. The vibrations produce the sound waves that are your voice.Typically, your vocal cords vibrate together to produce a clear sound. Vocal disorders occur when your vocal cords vibrate out of synch or don’t fully open or close.Pitch refers to how high or low your voice is. The size and the length (tension) of your vocal folds affect pitch.AdvertisementWho needs voice therapy?Close to 18 million Americans have problems with their voice, but many don’t seek treatment. Voice therapy helps children and adults. Your healthcare provider may recommend voice therapy if you have a voice disorder, such as:Laryngitis: Allergies or an upper respiratory infection irritate your voice box, causing it to swell. Laryngitis typically improves when the underlying condition clears up.Muscle tension dysphonia: Excess stress on your vocal cords causes your muscles to tighten.Spasmodic dysphonia/vocal tremor: Voice box muscles spasm or shake, causing periodic breaks in speech. Spasmodic dysphonia is a neurological disorder.Vocal cord dysfunction (VCD): Vocal cords want to shut when they should be open. Vocal cord dysfunction can lead to trouble breathing during exercise or when your throat is irritated.Vocal cord lesions: Benign (noncancerous) growths form on vocal cords, affecting your voice. Types of vocal cord lesions include nodules, polyps and cysts. Singers and people who speak a lot, such as teachers and attorneys, are more prone to vocal cord lesions.Vocal cord paralysis: One or both vocal folds have no movement or reduced movement, which you can’t control. This is due to scar or nerve damage. Vocal cord paralysis can cause hoarseness, difficulty swallowing (dysphagia) and shortness of breath (dyspnea).What is gender-affirming voice therapy?Transgender individuals can benefit from voice therapy before, after or in place of voice feminization surgery or voice masculinization surgery. These procedures change the length, size or tension of vocal cords. These changes make the pitch of your voice sound higher or lower.Gender-affirming voice therapy can help you adjust the pitch and intonation of your voice to sound more feminine or masculine and meet specific voice goals.AdvertisementProcedure DetailsWho provides voice therapy?If you’re having voice problems, you may first see a laryngologist. This medical doctor treats conditions that affect the voice box. When needed, they perform surgeries on the larynx.Depending on the problem, a laryngologist may refer you to a voice therapist. Different specialists can provide voice therapy, including:Speech-language pathologist (therapist).Respiratory therapist.Voice coach.What does a voice specialized speech-language pathologist do?A voice therapist guides you through voice therapy exercises to:Eliminate or prevent harmful vocal behaviors.Help vocal cords heal after surgery or injury.Promote healthy vocal behaviors.What are voice therapy techniques?During voice therapy, your healthcare provider teaches you exercises that improve vocal function. The exercises may vary depending on the cause of your vocal problem. They may include:Breathing exercises to help control your diaphragm muscle that enables you to breathe and speak.Tension release exercises to decrease the tension in your throat, such as stretching and massage.Semi-occluded vocal tract sounds such as straw phonation, lip trills, humming and more to promote healthy vocal cord vibration.Voice building exercises to strengthen vocal cords and breath support for those with weak vocal cords.What happens during transgender voice therapy?People who are transgender may have voice therapy along with or instead of voice feminization or voice masculinization surgery.A voice therapist shows you how to create healthier and more efficient vibration of your vocal folds, while working to increase pitch and change resonance. Voice therapy can also help with postsurgical recovery for those who choose to have surgery of their voice box. Voice feminization surgery can help change the pitch of your voice by altering the length and mass of your vocal cords.Regardless of whether you undergo surgery, transgender voice therapy helps you learn to adjust:Pitch (frequency) of your voice: Lowering or raising pitch to meet gender identity goals.Nonverbal communication: Eye contact, hand gestures and pauses in communication.Resonance: Voice quality and intensity as air passes through your vocal cords and vibrate off the tissue of your throat, mouth and nose.Care at Cleveland ClinicSchedule Voice TherapyFind a Speech TherapistMake an AppointmentRisks / BenefitsWhat are the advantages of voice therapy?As a preventive measure, voice therapy can help you learn healthy ways to use your vocal cords. Therapy helps prevent problems like hoarseness, laryngitis and lesions that commonly affect singers and people who speak a lot in their jobs. Voice therapy can also help heal vocal cord swelling and small vocal cord lesions by promoting better vocal cord vibration. It’s also used to help vocal cords heal after surgery. There aren’t any downsides or risks to participating in voice therapy.Recovery and OutlookHow long does it take for voice therapy to work?The extent and duration of voice therapy depend on the underlying problem. Most people need voice therapy once or twice a week for several months. For success, it’s important to follow your voice therapist’s instructions and perform vocal exercises at home. To keep your vocal cords healthy, you can continue these exercises after voice therapy sessions end.What other steps can I take to protect my voice?Good vocal hygiene can protect your voice. You can:Drink plenty of water to stay hydrated.Limit caffeine and alcohol, which dry out vocal cords.Manage conditions like allergies, chronic coughs and GERD (chronic acid reflux) that irritate vocal cords.Rest your vocal cords when possible if you do a lot of talking or singing.Quit smoking and avoid secondhand smoke.When to Call the DoctorWhen should I call the doctor?You should call your healthcare provider if you experience:Chronic hoarseness or wheezing.Loss of voice (laryngitis) or raspy voice for several weeks.Neck pain or lump in your throat.Shortness of breath.Speech or swallowing problems.Additional Common QuestionsWhat’s the difference between voice therapy and speech therapy?Speech therapy addresses a range of problems, not just those that affect vocal cords. Voice problems may occur along with speech problems. Types of speech problems include:Cognitive-communication disorders due to stroke, traumatic brain injury (TBI) or dementia that affect thought processes.Language disorders that affect your ability to express yourself or understand others.Social communication disorders associated with autism spectrum disorder (ASD) and TBI.Speech disorders like stuttering.Swallowing disorders after a stroke, injury or surgery.A note from Cleveland ClinicVoice therapy can help you recover your voice if you have a voice disorder or a vocal cord procedure. A voice therapist teaches you exercises that strengthen or heal your vocal cords. These exercises help you regain strength in your voice. As a preventive measure, voice therapy may keep your vocal cords healthy. Gender-affirming voice therapy helps people learn to achieve a lower or higher pitch, as well.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/02/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Voice TherapyFind a Speech TherapistMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"