"Voice Feminization Surgery: Transgender Voice Change Surgery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Voice Feminization SurgeryAdvertisementAdvertisementAdvertisementVoice Feminization SurgeryVoice feminization surgery raises the pitch of your voice, making it sound higher. The procedure changes the length, tightness or size of your vocal cords. Transgender women may choose to have voice change surgery as part of their male-to-female (MTF) transition. Healthcare providers recommend voice feminization therapy before and after surgery.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewWhat is voice feminization surgery?Voice feminization surgery is a procedure to raise the pitch of your voice or make it sound higher. Surgery changes the length, size or tightness of your vocal cords.Your vocal cords (also called vocal folds) are bands of soft tissue in your larynx (voice box). They control the pitch of your voice. They vibrate when you take in air. Surgery changes the folds so they vibrate differently and make higher sounds when you speak.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAre there different types of voice feminization surgery?There are different approaches to voice feminization surgery, including:Anterior glottal web formation shortens the length of your vocal cords. This is the most common type of voice feminization surgery. It’s also called the Wendler glottoplasty.Cricothyroid approximation (CTA) increases the tightness of your vocal cords.Laser reduction glottoplasty (LRG) decreases the mass, or size, of your vocal cords.Why is voice feminization surgery done?You may choose to have voice feminization surgery if you:Are a transgender woman (male transitioning to female).Have a disorder of sex differentiation (born with both male and female sex organs).Have disorders that require androgen (male sex hormone) therapy as treatment.Have ovarian cancer where tumors produce androgens.AdvertisementWhat is voice feminization therapy?Many people choose to have voice feminization therapy before and after surgery. In addition to adjusting the pitch of your voice, a speech-language pathologist helps you feminize:Intonation (adapting the sound of your voice to express emotions).Loudness.Nonverbal communication, such as eye contact, gestures, articulation and pausing.Resonance (how you pass air through your vocal folds to control the intensity of your voice).How common is voice feminization surgery?About 1% of transgender women have voice feminization surgery. More people (about 14%) choose to have nonsurgical voice feminization therapy instead.AdvertisementWho performs voice feminization surgery?A laryngologist performs voice feminization surgery. This type of healthcare provider specializes in surgery for the voice box and throat.Procedure DetailsHow do I prepare for voice feminization surgery?Many people do voice feminization therapy before surgery. A speech-language pathologist works with you on:Vocal function exercises: Expanding and contracting your vocal cords several times each day helps them move more easily. Exercises also strengthen the muscles in your voice box. This can help your recovery process.Vocal hygiene: Good vocal hygiene means keeping your voice as healthy as possible, especially before surgery. Your speech-language pathologist may ask you to drink plenty of water and stop smoking. They might also want you to avoid alcohol and caffeine, both of which can dry out your vocal folds.Your speech-language pathologist also makes sure you don’t have any existing voice disorders that could prevent a successful surgery.It’s important to have realistic expectations about the results of voice feminization surgery. Talk to your healthcare provider or your psychologist before the procedure so you know what to expect. They can help you prepare emotionally.What happens during voice feminization surgery?Voice feminization surgery includes the following steps:You receive general anesthesia. This is a medication that puts you to sleep so you don’t feel pain during your surgery.Your surgeon may use a laryngoscope to access your voice box. This is a thin, lighted tube that goes into your mouth and reaches back to your larynx. But some procedures require incisions (cuts) on the outside of your throat.Depending on the type of surgery you have, your surgeon does the following:Anterior glottal web formation: Removes several layers of tissue from the vocal folds at the front of your voice box. Then they use stitches to join the vocal folds, shortening the length of your voice box.Cricothyroid approximation (CTA): Stitches together cartilage from the top and bottom of your larynx.Laser reduction glottoplasty (LRG): Destroys the outermost tissues of the vocal cords with light energy from a laser.Voice feminization surgery is usually an outpatient procedure. This means you probably won’t have to stay overnight in the hospital or surgery center. Most people can go home the same day as their procedure.What happens after voice feminization surgery?Your voice box will need several weeks to heal after voice feminization surgery. Most people continue voice feminization therapy after surgery. This therapy helps you adapt to the changes in your voice. Ask your healthcare provider when it’s safe for you to resume therapy.Care at Cleveland ClinicSchedule Gender Affirming SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the risks of voice feminization surgery?Risks of voice feminization surgery include:Dysphonia (difficulty speaking), such as voice breaks or tremors.Edema (fluid buildup in your vocal cords).Enlarged Adam’s apple.Hoarseness.Not enough pitch increase (voice is still too low).Scarring inside your voice box or on the outside of your throat.Too much pitch increase (voice is unnaturally high).Vocal cord dysfunction.Vocal cord lesions (abnormal growths or bumps on your vocal cords).Vocal fold paralysis.What are the benefits of voice feminization surgery?The major benefit of voice feminization surgery is that you can achieve a pitch that more closely matches your gender identity. Many people who have the procedure consider it an important part of their transition process.Recovery and OutlookWhat is the recovery process after voice feminization surgery?For the first few days after surgery, you may need to avoid talking, laughing, singing or coughing. Be prepared to communicate nonverbally with text messages or notes. Your healthcare provider will tell you when you can gradually start using your voice again, as well as when you can resume voice therapy.Will I need a second surgery?Sometimes voice feminization surgery doesn’t produce the results you want. You may need a second surgery to achieve your target pitch.Your provider may use steroid injections or Botox® injections after surgery. These help treat vocal cord scarring or dysphonia.A note from Cleveland ClinicVoice feminization surgery is a procedure to increase the pitch of your voice. Transgender women may choose the surgery as part gender confirmation process. Several surgical techniques are available to change the length, tightness or size of your voice box. Healthcare providers usually recommend voice feminization therapy before and after surgery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/06/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Gender Affirming SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"