"Volumetric Modulated Arc Therapy (VMAT)800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Volumetric Modulated Arc Therapy (VMAT)AdvertisementAdvertisementAdvertisementVolumetric Modulated Arc Therapy (VMAT)Volumetric modulated arc therapy (VMAT) is a form of radiation therapy used to treat cancer. During treatment, a machine rotates around your body, sending multiple energy beams of varying strengths to kill cancer cells and destroy tumors. It treats various cancers, including prostate cancer, lung cancer and head and neck cancers, among others.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookAdditional Common QuestionsOverviewWhat is volumetric modulated arc therapy (VMAT)?Volumetric modulated arc therapy, or VMAT, is a type of external beam radiation therapy (EBRT) healthcare providers use to treat cancer. With EBRT, a machine that never touches your body sends radiation to destroy tumors. VMAT is a newer form of EBRT that was introduced in 2007. With VMAT, the machine rotates around your body while you’re lying down, delivering continuous doses of radiation toward a tumor. No radiation source is placed inside your body, so there’s no concern of being radioactive during or after the radiation treatments.VMAT is also a form of intensity-modulated radiation therapy (IMRT). IMRT sends various doses of radiation toward a tumor across multiple smaller beams instead of using a single radiation beam. This technique allows healthcare providers to direct high doses of radiation toward tumors without exposing the surrounding healthy tissue to harmful amounts of radiation.During VMAT, you receive customized doses of radiation as a machine encircles your body in one or more rotations, or arcs.What is VMAT used for?The precise dosage and delivery volumetric modulated arc therapy provides makes it a good option for treating oddly shaped tumors or tumors close to vital organs. For example, your cancer provider, or oncologist, may recommend VMAT if you have a tumor wrapped around an organ.VMAT is a common form of radiation therapy used for prostate cancer, head and neck cancers, and lung cancers, among many others, including:Anal cancer.Brain cancer.Breast cancer.Cervical cancer.Colorectal cancer.Esophageal cancer.Lung cancer.Nasopharyngeal cancer.Oropharyngeal cancer.Many others.What type of radiation does VMAT use?Volumetric modulated arc therapy uses photons (X-rays) generated by a medical linear accelerator. This machine is called a LINAC. The machine aims small beams of varying intensities at a tumor as it rotates around you.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow does VMAT work?Volumetric modulated arc therapy (VMAT) delivers the maximum radiation dose to the cancerous tumor without exposing healthy tissue to harmful radiation levels. As the machine rotates around you, it continually adjusts the shape and strength of the radiation beams directed toward the tumor. High doses of radiation reach the tumor and destroy cancer cell DNA, causing these cells to die.What happens before VMAT?Treatment planning is an essential part of VMAT. As part of your diagnosis, your cancer care team generates 3D images (usually using CT scans or MRI and/or PET scans) of your body. They use these images to identify the tumor and nearby organs that need to be protected from the radiation. They determine the radiation dose required to destroy the tumor.During a planning or mapping session called simulation, or “sim,” your care team will position you on a treatment couch. They’ll line you up in relation to the LINAC machine so that the radiation will strike your tumor at the precise location once it’s time for your treatment session. You may receive:Temporary or permanent markings (like a small tattoo) on your body that show the tumor’s location.Special accessories like a mold or mask that hold your body in place during treatment sessions.Sim may take place during a single session. Or it may take a few visits for your care team to design radiation beams that conform to your tumor’s shape and location exactly. VMAT radiation beams can be as small as 2.5 x 5 millimeters, roughly the size of a pencil tip.AdvertisementWhat happens during VMAT?A healthcare provider called a radiation therapist will position you as you were during the mapping session (or simulation). They’ll operate the LINAC machine from a separate room. You’ll be able to communicate via a two-way microphone.During the treatment session, the machine will rotate slowly around you. As it moves, radiation beams of varying shapes and dose intensities target your tumor. You won’t feel the beams. The radiation therapist will monitor your treatment in real-time to ensure you’re receiving the right amount of radiation in the right spots.This precise delivery method usually only requires a rotation or two per treatment session for you to receive a full radiation dose.How long does VMAT treatment take?Treatment sessions take about 20 minutes. Most of that time will involve the radiation therapist positioning you for treatment. It takes approximately two minutes for the LINAC machine to deliver the radiation.Depending on your diagnosis, you may need daily VMAT treatment sessions for several weeks. Ask your oncologist about your treatment schedule.What happens after VMAT?You’ll be able to leave the treatment facility that same day and resume your regular schedule.Care at Cleveland ClinicGet Cancer CareMake an AppointmentAdvertisementRisks / BenefitsWhat are the advantages of VMAT?The main advantages of volumetric modulated arc therapy (VMAT) are precision and speed.Precision: VMAT focuses the radiation on the tumor while sparing healthy tissue.Speed: Each VMAT treatment takes around two minutes — often less. Faster treatments improve the accuracy of radiation delivery. They also reduce the time you have to lie still for treatment and take less time out of your day.What are the side effects of VMAT radiation?Because VMAT spares healthy tissue from harmful radiation, you’re less likely to experience cell damage. This leads to reduced side effects. Still, some cell damage is unavoidable. Most side effects following VMAT affect the part of your body that received direct radiation.Side effects depend on the area that’s getting treated and may include:Fatigue (most common).Nausea and vomiting.Diarrhea.Headaches.Hair loss.Skin irritation (itching, dryness, redness, swelling or peeling skin).Recovery and OutlookWhat is the recovery time?Everyone’s experience is different. You may experience side effects and feel better shortly after treatment ends or you may need a few months to recover completely.Ask your oncologist what to expect based on your health and treatment plan.When should I see my healthcare provider?You’ll need follow-up appointments to check on your progress after VMAT. Keep all scheduled appointments. Come prepared to ask questions about your treatment response and report any symptoms or side effects you’re experiencing.Additional Common QuestionsWhat is the difference between VMAT and IMRT?Volumetric modulated arc therapy (VMAT) is a type of IMRT (intensity-modulated radiation therapy). Both treatments destroy tumors by sending customized doses of radiation that kill cancer cells without exposing healthy tissue to harmful radiation levels. The biggest difference is that while VMAT uses a machine that rotates continuously around you to send the beams, IMRT doesn’t.A note from Cleveland ClinicVolumetric modulated arc therapy (VMAT) is a newer form of radiation therapy that customizes radiation treatment to target tumors without exposing healthy tissue to harmful radiation. Members of your cancer care team work hard behind the scenes to design multiple energy beams that target your tumor precisely. Although you’ll likely need multiple treatment sessions, the actual treatment time is quick. It only takes a few rotations of the machine (a few minutes) to deliver the optimal radiation dose to kill cancer cells.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/16/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Cancer CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"