"Vulvoplasty: Procedure, Recovery & Results800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/VulvoplastyAdvertisementAdvertisementAdvertisementVulvoplastyA vulvoplasty is a gender-affirming surgery for transgender and nonbinary individuals who are designated male at birth (DMAB). During surgery, tissue from the penis, testes, scrotum and urethra is used to create a vulva. Having this surgery can help trans and nonbinary DMAB people whose genitals feel out of alignment with their gender identity.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewWhat is a vulvoplasty?A vulvoplasty is a gender-affirming surgery that creates a vulva. The vulva includes the external genitalia associated with those who are designated female at birth (DFAB). A vulvoplasty creates the parts of a vulva — the mons, the clitoris, and the outer and inner labia — out of tissue that is associated with being designated male at birth (DMAB).For many people who are transgender or nonbinary and DMAB, a vulvoplasty changes the appearance of their genitals so that the way they look matches their understanding of their gender, or gender identity, better. A vulvoplasty is just one option for trans and nonbinary DMAB people who want to live more comfortably as their authentic selves.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy are vulvoplasties done?A vulvoplasty can help if you feel uncomfortable with the appearance of your genitals. Choosing to get a vulvoplasty may be the right choice for you if you’d prefer your genitals to look closer to a vulva. Or, you may choose a vulvoplasty because it’s less invasive and has fewer risks than a vaginoplasty, a surgery that creates a vaginal canal in addition to a vulva. Everyone’s gender journey is different.Who should have a vulvoplasty?A vulvoplasty is a major surgery that isn’t reversible. This is why it’s so important to be sure your surgery doesn’t cause you any harm physically or psychologically. Having a care team that includes surgeons and behavioral health specialists with expertise in transgender care can make it easier to decide whether a vulvoplasty is right for you. They’ll evaluate your physical and mental health to ensure you’re a strong candidate for surgery.Physical Health EvaluationYour provider will do a physical evaluation to be sure you’re healthy enough for surgery. Your provider will:Review your medical history.Conduct a thorough physical exam.Order lab tests that show important information about your hormone levels and the health of your organs.Note any infections or prior conditions you may have, treating or helping you manage them as needed.Ensure that you’re drug-free and smoke-free, offering resources and support as needed.Your provider will also talk with you about how having a vulvoplasty will affect your future health and family planning goals. After surgery, you won’t be able to conceive a child biologically. If you want to conceive a child in the future, you can bank your sperm for later use.Behavioral health evaluationYou’ll meet with two different behavioral health specialists, both with expertise in transgender health. They’ll work with you to be sure that having a vulvoplasty is a healthy option for your psychological well-being, too. Topics you discuss may include:Your feelings about the disconnect between the way your body looks and your gender identity.Your experiences of gender acceptance and discrimination in places where you interact with others — like work, school and at home.Your goals for your vulvoplasty, including the support network and resources you have to help you through your surgery, from preparation to recovery.Your history with behavioral health conditions or mood disorders.Your history with self-harm or other risk-taking activities.Both specialists must submit a letter of support before you can get approved for a vulvoplasty. The letters must confirm that you meet the Word Professional Association of Transgender Health (WPATH) standards of care for surgery. The letters should confirm that:You’ve been undergoing hormone therapy for at least a year unless there are medical reasons that prevented it.You’ve been living in a way that syncs with your gender identity for at least a year.Finally, you’ll need to confirm that you understand what a vulvoplasty involves, including its risks, benefits and costs. A vulvoplasty is expensive, and not all insurance plans cover it. And you must consent to have the surgery.AdvertisementProcedure DetailsWhat happens before a vulvoplasty?Your healthcare provider is your best resource for explaining how to prepare for your vulvoplasty. Your provider will share detailed instructions with you about how to plan, including what to pack for your hospital visit and what medications you should and shouldn’t take in the weeks leading up to your surgery.As you plan for your vulvoplasty, think ahead to how you can make your recovery process as easy as possible for your future self.Address any workplace responsibilitiesYou’ll need to take 8 to 12 weeks off work to recover. Make sure that your employer has approved your leave of absence. If your job requires heavy lifting or lots of physical activity, see if you can negotiate for a lighter workload for when you return.Take care of your physical and mental healthEat healthy. Eating nutritious foods each day can help you heal faster after your surgery.Exercise. Staying in shape can also support your recovery process. Talk to your provider about an exercise routine that is best for your health.Don’t smoke. Smoking or using other tobacco products can cause complications during surgery and slow your healing.Keep counseling appointments. Stay in touch with your counselor or therapist in the days, weeks and months leading up to your surgery. They can help you process what you’re feeling as you prepare to take this big step toward affirming your gender. They can also connect you with resources and support to address any concerns you may have about the surgery or adjusting to life after your vulvoplasty.Make your home a cozy place to recoverBefore your surgery:Complete any chores or errands.Plan your meals and buy groceries.Pick out loose, comfortable clothes and non-slip shoes to wear during recovery.Arrange any items you’ll regularly need so that you can get them without having to reach or bend over.Assemble your support networkYou’ll need friends and family members’ support during your recovery. It’s a good idea to have people lined up to help with chores and errands, especially during the first two weeks after surgery when you’ll need the most rest. It may be a good idea to have an extra key made so that it’s easy for friends and family to come and go as they help you. Also, having people who love and support you close by can boost your spirits. And this is also good for your recovery.What happens during a vulvoplasty?The surgery takes about an hour and a half. During the procedure, your provider will use your genital tissue to create a vulva. Your provider will:Remove your penis, scrotum, and testes.Use the tissue from the head of your penis (glans) to form your clitoris.Shorten the tube that carries urine out of your body (urethra).Use the tissue from your scrotum, penis and urethra to form the rest of your vulva.Insert a urinary catheter to help you pee after your surgery.You’ll likely go home wearing a catheter that will be removed later.AdvertisementWhat happens after a vulvoplasty?After surgery, your healthcare provider will keep a close watch on you to make sure that you’re healing without any complications. You’ll likely stay in the hospital or an area close to the hospital for the next several nights so that your provider can monitor your progress.Your provider will give you medications to ease your pain and prevent infection. Still, you may notice unpleasant symptoms that are all part of the healing process. After your vulvoplasty you may notice any of the following symptoms in the days, weeks and months ahead:Bleeding from your incisions. You may bleed for up to 2 days post-surgery.Itchiness at the surgery site. The itching lets you know that your wound is healing.Spraying or dribbling when you pee. This should get better in time, as your wounds heal.Electrical sensations at the surgery site. This is just your nerve endings healing.Bruising in your genital area, your belly and thighs. The bruises may take up to a month to fade.Swollen labia. It may take up to 6 months for the swelling to go down.Scars that may be red, dark pink, or purple. These may take up to a year to disappear.Numbness in your genitals. The numbness usually gets better within the next few months, but it can take up to 18 months to regain full sensation.In addition to following any after-care instructions that your provider shares with you, plan to attend regular check-ups so that your healthcare provider can ensure that you’re healing as you should be.Risks / BenefitsWhat are the advantages of this procedure?A vulvoplasty can make you feel more comfortable and happier with the way you look. With a vulvoplasty, you:Have genitals that look closer to the way you want them to.Can stop or reduce your dose of testosterone blockers.Can stop or reduce your dose of estrogen.Have the possibility of experiencing clitoral pleasure and orgasm.You can also do everyday things that people with vulvas do, like peeing while sitting down. These simple, everyday changes may help you feel more comfortable in your body.What are the risks or complications of a vulvoplasty?Any surgery comes with risks. But when your vulvoplasty is done by an experienced surgeon, the chance of complications is low. Let your provider know if you notice any of the following:Numbness in your legs.A pus-filled mass at the surgery site (abscess).Blood that’s collected at the surgery site (hematoma).Clear fluid that’s collected at the surgery site (serotoma).Signs of an infection, like a fever over 101, swelling and warmth near your incisions.Signs of a blood clot, like pain or redness in your calf, knee, thigh or genital area.Sometimes, people who’ve had vulvoplasties feel less sexual sensation in their genitals and have a harder time achieving orgasm. But this is rare. Or, they may not be happy with the way their vulva looks. If you’re unhappy with your vulva, talk with your provider about surgical options for correcting its appearance.Most people who choose to have gender-affirming surgery are happy with their decision. Instead, they feel happier in their everyday lives, including their sex lives. It’s important to take the time to find the right medical professional to do your vulvoplasty so that you’re less likely to have complications and more likely to be pleased with the final results.Recovery and OutlookWhat is the recovery time for a vulvoplasty?You should start feeling better after the first two weeks following your surgery. After four months, you should have healed enough so that you know what your vulva will look like once the swelling is completely gone. And within 8 to 12 weeks, you should be able to go back to work.Healing completely may take a little longer, up to a year in some cases. During this time, it’s important to follow your provider’s instructions about your care and to attend all check-ups. Follow your provider’s advice about how much physical activity, including sexual activity, is safe.A note from Cleveland ClinicA vulvoplasty is a major surgery with the potential to help you inhabit your gender more comfortably. As you consider whether or not a vulvoplasty is right for you, find a support network that can help you talk through the pros and cons of surgery. In addition to speaking with friends, family and medical professionals who support you, connect with others who’ve experienced gender-affirming surgery firsthand. Listen and learn from their experiences.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/22/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"