"Targeted Therapy: What It Is, Process & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Targeted TherapyAdvertisementAdvertisementAdvertisementTargeted TherapyTargeted therapy is cancer treatment that targets the genetic changes or mutations that turn healthy cells into cancer cells. Targeted therapy helps healthcare providers treat cancer cells without hurting healthy cells. Healthcare providers sometimes use targeted therapy as the front line or initial treatment. They may also combine targeted therapy with other treatments.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is targeted therapy?Targeted therapy is a kind of cancer treatment that’s focused on genetic changes or mutations that turn healthy cells into cancer cells. To use targeted therapy, healthcare providers test for the genetic changes responsible for helping cancer cells grow and survive. Then, they identify specific treatments to kill those cells or keep them from growing. Targeted therapy helps healthcare providers treat cancer cells without hurting healthy cells. Healthcare providers have developed more than 80 targeted therapies to treat many kinds of cancer. Sometimes, they use targeted therapy as the front line or initial treatment. They may also combine targeted therapy with other treatments.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow does targeted therapy work?Once healthcare providers understand the genetic mutation changing a healthy cell into a cancer cell, they identify specific cancer cell parts to target for treatment. Sometimes, these are targets on cancer cells surfaces. Other times, the targets are substances inside cancer cells. Here’s information on the two most common kinds of targeted therapies and how they tackle cancer:Monoclonal antibodies: Monoclonal antibodies are lab-made versions of your antibodies. Your antibodies are part of your immune system. They’re proteins that scour your body for signs of intruder proteins (antigens) that can come from things like infections or cancer cells. Antibodies target these antigens to get rid of the intruders. Monoclonal antibodies have several ways of attacking cancer cells.Small-molecule drugs:These drugs bind or attach to specific targets on cancer cells, preventing cancer cell growth or killing the cancer cells.What are examples of targeted therapies?Cancer cells need many things to survive. Some targeted therapies designed to keep cancer cells from growing, multiplying and surviving include:Angiogenesis inhibitors: Just like all organs and tissues, cancer cells have blood vessels that they rely on for the oxygen and nutrients to survive. To make sure they get enough oxygen and nutrients, cancer cells send out chemical signals encouraging their blood vessels to keep on growing. Angiogenesis inhibitors block these signals — and cancer cells’ lifeblood.Proteasome inhibitors: This targeted therapy focuses on enzymes called proteasomes. These enzymes digest proteins located in cancer cells.Signal transduction inhibitors: This treatment disrupts the cancer cells’ messaging system for growth and survival. Normally, cancer cells use a protein receptor called a signaling receptor to send messages to other proteins inside the cell. These proteins rely on the signaling receptor for instructions on dividing, dying and other steps cancer cells take to grow and multiply.AdvertisementCan targeted therapies treat all kinds of cancer?Healthcare providers have developed more than 80 targeted therapies to treat many kinds of cancer. Further, they’ve developed targeted therapies that treat different mutations that are part of the same kind of cancer. Some types of cancer that may be treated with targeted therapy include:Blood cancers like leukemia, multiple myeloma and lymphoma.Brain cancers like glioblastoma and neuroblastoma (treated with monoclonal antibodies acting as immunotherapy).Bone and soft tissue cancers like certain soft tissue sarcomas.Breast cancers like BRCA gene mutation breast cancer, HER2-positive breast cancer, hormone receptor-positive breast cancer and triple-negative breast cancer.Digestive system cancers like colorectal (colon) cancer, esophageal cancer, gastrointestinal stromal tumor (GIST), neuroendocrine tumors, non-Hodgkin’s lymphoma, pancreatic cancer, stomach cancer (intestinal stomach adenocarcinomas), hepatocellular (liver) cancer and cholangiocarcinoma (gall bladder cancer).Head and neck cancers like laryngeal cancer, nasal cavity and paranasal sinus cancer, nasopharyngeal cancer, oral cancer and oropharyngeal cancer.Lung cancerslike non-small cell lung cancer, small cell lung cancer and mesothelioma.Reproductive system cancers like cervical cancer, endometrial cancer (high risk or cancer that’s come back), and prostate cancer.Skin cancers like melanoma and cutaneous squamous cell skin cancer.Thyroid cancers like anaplastic thyroid cancer, medullary thyroid cancer and papillary/follicular thyroid cancer.Urinary system cancers like bladder cancer, kidney cancer and prostate cancer.Is targeted therapy always successful?Targeted therapy is a very effective treatment, but it isn’t always successful. Identifying a target for therapy is a complicated process that requires healthcare providers to obtain very detailed information about a cancer. It’s a challenging process, and healthcare providers are still learning how to make this more successful. Here are some examples of why targeted therapy might not work:The tumor doesn’t have the target that matches the treatment.The tumor doesn’t react to the therapy as expected. For example, some targeted therapies concentrate on blocking tumor growth with a drug tailored to the substance-driving growth. But if it turns out the tumor doesn’t need that substance to grow, the targeted therapy won’t make a difference.The tumor cells continue to mutate. When that happens, the targeted therapy stops working or isn’t as effective as it once was.AdvertisementProcedure DetailsWhat happens before targeted therapy?Your healthcare provider will confirm if targeted therapy is the right treatment for the kind of cancer that you have. Your healthcare provider may need to test your blood or some of your tissue obtained from biopsies. They’ll examine the samples for specific gene changes or mutations, looking for targets that are likely to respond to specific therapies.What happens during targeted therapy?Everyone’s situation is different, so ask your healthcare provider to explain your treatment plan so you know what to expect. Here’s some general information about what may happen during targeted therapy:You may receive targeted therapy by taking a pill that you swallow, as a shot under the skin (subcutaneously) or through an IV (intravenously, or through a vein). People receiving treatment through an IV typically go to their healthcare provider’s office or outpatient treatment center.You may receive targeted therapy along with other treatments, including chemotherapy or radiation therapy.You may receive targeted therapy every day, once a week, several times a week or once a month, or less frequently.There may be times when you take a break from therapy.You’ll have regular visits with your healthcare provider so they can monitor your progress. They may perform blood tests, X-rays, computed tomography (CT) scans and other tests to assess how well the targeted therapy is working. They’ll also ask how you’re doing with any treatment side effects.Risks / BenefitsWhat are targeted therapy benefits?Targeted therapy’s major benefit is that it can kill cancer cells without damaging healthy cells. It can also block cancer cells from growing. Healthcare providers may recommend targeted therapies when other treatments haven’t been effective.What are the side effects of targeted therapy?Targeted therapy side effects are different for each specific drug. Some examples of possible side effects include:Diarrhea.Elevated liver enzymes: This happens when your liver releases more enzymes than needed, possibly damaging your liver.Cardiotoxicity: This is damage to your heart muscle.Dry skin.Extreme sensitivity to ultraviolet (UV) light (photosensitivity).High blood pressure (hypertension).Loss of hair color.Nail changes.Problems with wound healing and blood clotting.Skin rash.Interstitial lung disease: This is another term for pulmonary fibrosis, which causes scarring and inflammation of your interstitium. Your interstitium is tissue that surrounds your lung’s air sacs, blood vessels and airways.Heart rhythm changes.Neurologic changes.Recovery and OutlookHow long do side effects last after targeted therapy treatments?You may have side effects throughout your treatment. Target therapy side effects vary from person to person. Most targeted therapy side effects go away a few months after you finish your treatment.What is the success rate of targeted therapy?Targeted therapy is an effective cancer treatment for many people. The success rate of targeted therapy varies significantly. The results depend on the cancer type and stage.When to Call the DoctorWhen should I contact my healthcare provider?Targeted therapy can affect people in many different ways. Ask your healthcare provider what to expect as you go through targeted therapy treatment, including what to do if your side effects are more serious than expected.What else should I ask my healthcare provider?You may want to ask your healthcare provider:Am I a candidate for targeted therapy?Why am I a candidate for targeted therapy?What type of targeted therapy do you recommend?What can you tell me about this targeted therapy’s success rate?What are targeted therapy side effects?How will targeted therapy affect my daily activities?How often will I need targeted therapy?How long will I be on targeted therapy?A note from Cleveland ClinicCancer starts when something rewrites a cell’s genetic instruction book. Healthy cells start following these instructions, which turns them into cancer cells. In targeted therapy, healthcare providers identify cancer cell targets and use drugs tailored to specific cancer cells’ genetic instructions. These made-to-order drugs either kill cancer cells outright or keep them from receiving instructions the cancer cells need to continue growing.Targeted therapy is changing how healthcare providers treat cancer. But targeted therapy isn’t the best treatment for every kind of cancer. But healthcare providers are constantly decoding cancer’s genetic instruction book and starting clinical trials based on what they’ve learned. If you have cancer, ask your healthcare provider about targeted therapy. They’ll discuss all of your therapy options, including targeted therapy.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/14/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"