"Tdap Vaccine: Tetanus, Diphtheria, Acellular Pertussis Vaccine800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Tdap VaccineAdvertisementAdvertisementAdvertisementTdap VaccineThe Tdap vaccine can prevent you from getting tetanus, diphtheria and pertussis. You should get a Tdap vaccine booster shot every 10 years to boost your immunity from these infections. Side effects are usually mild and include pain, redness and swelling at the injection site. Serious reactions are rare.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewWhat is the Tdap vaccine?The Tdap vaccine protects you against three potentially severe bacterial infections. Tdap stands for:T — Tetanus: Tetanus (lockjaw) causes painful muscle stiffening, especially around your neck and jaw. It can lead to trouble opening your mouth, difficulty breathing and swallowing, and even death.d — Diphtheria: Diphtheria causes a thick coating to form in the back of your throat. This can lead to difficulty breathing, heart failure, paralysis or death.ap — Acellular Pertussis: Pertussis (whooping cough) causes violent coughing that makes it hard to breathe, eat or drink. It can be life-threatening for babies and young children.The Tdap vaccine is a combination vaccine. That means it contains more than one vaccine in the same shot. The Tdap vaccine is only for children ages 7 and older, adolescents and adults.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the differences between the DTaP vaccine, DT vaccine, Tdap vaccine and Td vaccine?The differences between the vaccines are in which infections they prevent, what age group can get them and other indications.VaccinePreventsAgeIndicationsDTaPTetanus, diphtheria and pertussisAge 6 and youngerPart of the routine childhood immunization schedule.DTDiphtheria and tetanusAge 6 and youngerIf your child had a previous bad reaction to the pertussis vaccine.TdapTetanus, diphtheria and pertussisAge 7 and olderTo start or complete childhood vaccination; booster shot given every 10 years.TdDiphtheria and tetanusAge 7 and olderTo start or complete childhood vaccination; booster shot given every 10 year.VaccineVaccineDTaPPreventsTetanus, diphtheria and pertussisAgeAge 6 and youngerDTPreventsDiphtheria and tetanusAgeAge 6 and youngerTdapPreventsTetanus, diphtheria and pertussisAgeAge 7 and olderTdPreventsDiphtheria and tetanusAgeAge 7 and olderWhat do the uppercase and lowercase letters mean in the vaccine names?Uppercase letters mean the vaccine has a full-strength dose of that part of the vaccine. The lowercase “d” and “p” in Tdap mean the vaccine uses smaller doses of diphtheria and pertussis.The “a” in Tdap is an abbreviation for “acellular.” Acellular means the vaccine contains only part of the pertussis bacteria instead of the whole bacteria.AdvertisementWho should get the Tdap vaccine?The Tdap vaccine is for anyone ages 7 and older. The Centers for Disease Control (CDC) recommends the following:Children: Children ages 7 and older should receive the Tdap vaccine if they’ve never been vaccinated. They can also get it to finish their childhood vaccine series.Adolescents: Preteens should receive one dose of Tdap at age 11 or 12 to boost their immunity.Pregnant people: People who are pregnant should get a Tdap shot during the early part of their third trimester of pregnancy.Adults: Adults who haven’t ever received the Tdap vaccine should get a dose of Tdap. They should also receive a Tdap booster shot every 10 years.Should I get the Tdap vaccine if I’m pregnant?Yes. If you’re pregnant, you should get a dose of Tdap. The Tdap vaccine during pregnancy:Prevents pertussis (whooping cough), which can be a life-threatening disease for your baby.Helps protect your baby from whooping cough until they’re old enough to get their own vaccine.Is safe for you and your growing baby (fetus).Studies have shown there haven’t been any safety issues with the Tdap vaccine during pregnancy. Getting the vaccine doesn’t cause any risks to your baby, including premature birth or low birth weight. Side effects of the Tdap vaccine during pregnancy are the same for those who aren’t pregnant.AdvertisementWho shouldn’t get the Tdap vaccine?Some people shouldn’t receive the Tdap vaccine. If you’re very ill, you should wait until your illness has passed before receiving the Tdap vaccine.Ask your healthcare provider if you should receive the Tdap vaccine if you have had:A severe allergic reaction after receiving a Tdap vaccine.Severe pain or swelling after receiving a diphtheria vaccine or tetanus vaccine.A coma, reduced consciousness or seizures after receiving a pertussis vaccine.Seizures.Guillain-Barré syndrome (GBS).Procedure DetailsWhat is the Tdap vaccine schedule?Children ages 7 and older who didn’t receive a series of DTaP or DT vaccines should start or complete their vaccination series with Tdap. Preteens (ages 11 or 12) should get the Tdap vaccine to boost their immunity.Adults who’ve never received the Tdap vaccine should get a dose of Tdap. People ages 7 and older should receive a Tdap vaccine booster shot every 10 years.How much does the Tdap vaccine cost?The Tdap vaccine cost ranges from about $43 to $48. Many private health insurance plans cover most of the cost of the vaccine. Some Medicare and Medicaid plans cover the cost of the vaccine as well.Where can I get the Tdap vaccine?Your healthcare provider’s office is the best place to receive the Tdap vaccine. If a healthcare provider near you doesn’t have the vaccine available for adults, you may be able to receive the vaccine at:Pharmacies.Community health clinics.Workplaces.Schools.Churches.Check with your state health department if you need further help to access the vaccine.Does the Tdap vaccine hurt?After you receive the Tdap vaccine, you may experience pain at the injection site. The pain should decrease within a few days.Can I get the Tdap vaccine at the same time as other vaccines?Yes. You may safely receive Tdap at the same time as other vaccines, including the COVID-19 vaccine.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentRisks / BenefitsWhat are the benefits of the Tdap vaccine?The Tdap vaccine reduces your risk of getting tetanus, diphtheria and pertussis. Diphtheria and pertussis are infections that spread from person to person. Tetanus doesn’t spread from person to person but can enter your body through cuts or wounds. All three diseases can cause serious, life-threatening health conditions.What are the possible side effects of the Tdap vaccine?The most common side effects of the Tdap vaccine include:Pain, redness or swelling at the injection site.Fever.Headache.Fatigue.Nausea and vomiting.Diarrhea.Stomachache.Severe reactions to the Tdap vaccine are extremely rare. If you develop any of the following signs of an allergic reaction, call 911 or go to your nearest emergency room:Hives and swelling of your face and throat.Difficulty breathing.Rapid heartbeat.Dizziness.Weakness.When to Call the DoctorWhat questions should I ask my healthcare provider?It’s normal to have questions before you get a vaccine. Some common questions you may want to ask your healthcare provider include:When should I get the Tdap vaccine?What side effects can I expect from the Tdap vaccine?How long does the Tdap shot last?How often do I need to get a Tdap shot?How effective is the Tdap vaccine?Is there any reason I shouldn’t receive the Tdap vaccine?A note from Cleveland ClinicThe Tdap vaccine can prevent tetanus, diphtheria and pertussis. All three of these bacterial infections can cause serious health complications. It’s important to stay up to date on your Tdap vaccine. Get a Tdap vaccine booster shot every 10 years to boost your immunity. Side effects of the vaccine are mild and serious reactions are rare. Talk to your healthcare provider about whether you should get the Tdap vaccine.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/05/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementQuestions 216.444.2538Appointments & LocationsRequest an AppointmentFind a Primary Care ProviderFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"