"Teeth Retainer: How it Works, Types & Uses800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Teeth RetainerAdvertisementAdvertisementAdvertisementTeeth RetainerIf you want to keep your teeth straight after getting your braces off, you need to wear a retainer. This device keeps your teeth in proper alignment for years to come. For best results, always follow your provider’s recommendations for wearing a retainer.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewA teeth retainer helps your teeth stay in their corrected position after wearing braces.What is a retainer?A teeth retainer is a custom-made device you wear in your mouth over your teeth. It helps keep your teeth in their new, correct position after braces.What do retainers do for teeth?Even after braces made your teeth straight, they aren’t completely firm in their new position. This doesn’t happen until the gums, bones and muscles get used to the change. Everyday habits like chewing and grinding apply forces to your teeth and can move them. Shifting teeth can also lead to malocclusion. This is when your upper and lower teeth don’t align with your mouth closed.Your braces kept your teeth in a straight position for a long time. Once the braces come off, nothing is keeping your teeth from moving back to their previous position. Wearing a retainer helps keep your teeth in the correct place, so they don’t move. Think of it this way: Braces straighten your teeth, but your retainer keeps them that way. They help your teeth “retain” their position.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho fits teeth retainers?A general dentist or an orthodontist fits you for your retainer. Orthodontists are dentists who have special training in the correct alignment of teeth.What are the different types of teeth retainers?The two main types of retainers are:Fixed retainers that stay in your mouth.Removable retainers that you take out.Many dental providers use a combination of fixed and permanent retainers to keep teeth straight. You could have both types at the same time. The purpose of all types of retainers is to make your alignment last for years.What are fixed retainers?Fixed retainers (also called permanent retainers) stay on your teeth with a glue-like bonding agent. You can’t remove this type of retainer yourself. These are often used on the front, lower or upper teeth to keep them from coming apart or shifting over time.What are removable retainers?Removable retainers can go in and out of your mouth. Traditional (Hawley) retainers have a piece of wire attached to plastic (or acrylic). Clear retainers (Essix) are also plastic but don’t have any wires. Both are custom-made to fit your teeth.Procedure DetailsHow are teeth retainers fitted?The process for making the retainer for your teeth depends on which type you get.For removable retainers:Your provider takes a dental impression of your teeth using dental putty, a soft material similar to play dough.They put the putty in trays, then insert the trays over your teeth. This imprints your unique bite and teeth layout into the putty. It takes one or two minutes to take an impression of your mouth.A dental laboratory uses the mold to create a plastic (or acrylic) teeth retainer. You typically wait a week or more before getting the retainer.Note: Many dental offices take digital impressions. Digital impressions are an alternative to the traditional impressions mentioned above. During this process, your dental provider simply uses a handheld wand to capture images of your teeth and gums. Next, a computer software program stitches those images together, creating a three-dimensional model of your mouth.For fixed retainers:Your dental provider uses a metal wire to measure the correct placement on your teeth.They use glue to set the wire in place.This intricate process takes longer than creating an impression for a removable retainer. But you leave the dental office with your retainer in place. You don’t have to wait for a laboratory to create the retainer.Care at Cleveland ClinicGet Dental CareFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the advantages of using a retainer?When your provider takes off your braces, your teeth are perfectly aligned. Using a retainer keeps your teeth in the correct position so the results last. With the long-term use of a teeth retainer, all the hard work you put into getting and wearing braces pays off.What happens if I don’t wear my retainer?It’s normal for teeth to move over time. If you don’t wear your retainer, your teeth will shift and move. They can become crooked, crowded or misaligned. Or you can develop an overbite. That’s why most dental providers prescribe the use of a teeth retainer after braces come off.AdvertisementDo they hurt?When you get your retainer after your braces come off, it shouldn’t hurt. The fit should be snug yet comfortable over your teeth.You could feel discomfort if:You forget to wear your retainer for a short time, then start wearing it again.You haven’t worn your retainer in a long time and try to wear it.Your retainer breaks or cracks.If you do feel pain, it’s probably from your retainer nudging your teeth into the correct alignment. If you wear your retainer as directed by your dental provider, and it’s in good condition, you shouldn’t feel any pain or discomfort.Recovery and OutlookHow long will I have to wear a retainer?Your dental provider will likely recommend you wear the retainer day and night (full-time) for at least four to six months. After that, you’ll need to wear the teeth retainer at night (part-time) for the rest of your life.Can retainers move teeth back?If you stop wearing your retainer and your teeth move, going back to wearing the retainer might move the teeth back to their aligned position. But don’t wait too long — the more your teeth shift, the harder it is to get the retainer to fit right.How do I take care of my retainer?Prevent your retainer from getting damaged or lost so it’ll last a long time. You can keep it in great condition by cleaning it at least once a day.Follow these tips so you don’t break or lose your retainer:Take your retainer out of your mouth when you eat.When you’re not wearing the retainer, put it back in its case.Don’t chew gum while wearing your retainer.Never put the retainer in your pocket or purse unless it’s in the case.Avoid wrapping your retainer in a napkin, which can make it easy to accidentally throw away.Keep your retainer away from pets who might chew it.Don’t leave your retainer in a hot place, like a car or stovetop, where it can melt.Always brush and floss your teeth thoroughly before putting your retainer back in.These guidelines can help keep your retainer clean:Brush your removable retainer regularly with antibacterial soap and water. (Some toothpastes are too abrasive and may harm your retainer.)Rinse your retainer with warm water after brushing and flossing.You may be able to use an effervescent cleanser for some types of retainers. Ask your dental provider for more information about cleaning your retainer.If your retainer turns yellow, gently scrub it with water, baking soda and a soft toothbrush.For a fixed retainer, practice good oral hygiene and floss around it.Talk to your dental provider about care instructions specific to your retainer. They can show you how to clean it.When to Call the DoctorWhat if my retainer breaks?Fix a broken retainer right away. Broken wires can poke and irritate your gums or lips. There’s likely nothing you can do at home to fix your retainer. See your dentist or orthodontist if your retainer breaks.What if I lose my retainer?If you can’t find your retainer, contact your dental provider to get a new one made. Don’t delay — the longer you go without wearing a retainer, the more your teeth can shift.Additional DetailsHow much does a retainer cost?The typical price for a removable retainer is anywhere between $100 and $500. Clear retainers tend to cost more.Some insurance carriers provide partial coverage for orthodontic treatment, while others don’t. Check with your insurance provider for the specifics of what your policy covers.Can a retainer straighten my teeth?No, retainers don’t straighten teeth like braces do. Teeth retainers can’t apply the constant, steady force needed to move teeth into their correct positions.If you forgot to wear your retainer for a few weeks and your teeth have shifted, wearing it may help nudge your teeth back into their correct position. You’ll probably feel some discomfort as the retainer slowly pushes your teeth back into alignment. This usually only works for subtle, short-term changes.My retainer no longer fits. What should I do?If your retainer is too snug or no longer fits, your teeth have probably shifted. There’s nothing you can do to make your current retainer fit. Your dental provider can adjust it or make a new retainer.Why does my removable retainer smell?Bacteria can grow on a retainer just like it can grow inside of your mouth. The bacteria that cause bad breath can also create a nasty smell on your retainer. That’s why cleaning your retainer every day is so important. If your retainer starts to smell, scrub it with soap, water and a soft toothbrush. Ask your dental provider if you can soak it in a special cleanser made for retainers.A note from Cleveland ClinicBraces gave you straight teeth, but a retainer makes them last. You put a lot of time, energy and money into achieving that perfect smile through braces. You can keep it for years by following your dental provider’s recommendations for a teeth retainer. It’s an essential part of the teeth straightening process.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/25/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Dental CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"