"Tenotomy: Procedure, What It Is & Why It’s Used800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/TenotomyAdvertisementAdvertisementAdvertisementTenotomyTenotomy is used to treat issues that affect your tendons throughout your body. Which type you need depends on what’s causing you pain or other symptoms. \nTalk to your provider about other treatments that might help you before you need a tenotomy.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is tenotomy?Tenotomy is a procedure to treat pain in one of your tendons. You might see it referred to as dividing a tendon. Your provider might poke your injured tendon with a needle through your skin. They might also surgically remove a piece of the tendon through small cuts (incisions) in your skin.Tenotomy can be used to correct tendon issues throughout your body, but it’s most commonly performed on:The tendons that connect your biceps muscle to your shoulder blade (your scapula).Tendons in your elbow.Tendons in your feet and ankles.Biceps tenotomy vs. tenodesisBiceps tenotomy and biceps tenodesis are both treatments to treat biceps tendon injuries.If you need a tenotomy, you provider or surgeon will intentionally cut or sever your biceps tendon to relieve pain. After this cut, your muscle will move further down in your arm.Tenodesis is a different type of surgical procedure. Your surgeon will cut your biceps tendon from your shoulder and reattach it to a new hole they make in your upper arm bone (your humerus).Which treatment you need depends on how active you are, how quickly you want to recover and whether or not you’re comfortable with your arm looking different after surgery. Talk to your provider about which procedure you’ll need to repair your biceps tendon.Tenotomy vs. tenolysisTenotomy and tenolysis are different procedures used to treat issues that affect your tendons. Tenolysis is sometimes referred to as a tendon release. Tenotomy can be used throughout your body to repair lots of different tendon issues.Surgeons perform tenolysis when a tendon is stuck in place after a trauma or another surgery. It’s a common treatment for trigger finger or trigger thumb. Your surgeon will make a tiny cut in the sheath around your tendons. Cutting the sheath widens the space around the tendons in your affected fingers or thumb and lets them move smoothly again.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat does tenotomy treat?Tenotomy is used to treat conditions that affect tendons throughout your body. The most common issues include:Biceps tendinitis.Shoulder calcific tendinitis.Tennis elbow or golfer’s elbow.Plantar fasciitis.Club foot and other birth defects that affect babies’ feet and ankles.Hammertoes.Patellar tendinitis and patellofemoral pain syndrome (runner’s knee or jumper’s knee).Achilles tendon injuries. You might see tenotomy performed on your Achilles tendon referred to as heel cord tenotomy or peroneal tenotomy.Procedure DetailsWhat happens before tenotomy?Your provider will usually try other treatments before recommending tenotomy. Usually, they’ll suggest other, non-surgical treatments first, including:Rest: Resting your tendon by avoiding the sport or activity that irritated it.Ice and NSAIDs: Icing the area and using over-the-counter NSAIDs can help with symptoms like inflammation and pain.Physical therapy: Exercises to stretch and strengthen the muscles around your injured tendon can help reduce tension on it.Corticosteroid injections: Steroids decrease inflammation.If you’ve tried some or all of these other treatments and are still experiencing pain or discomfort, your provider might suggest tenotomy.AdvertisementWhat happens during tenotomy?Percutaneous needle tenotomy and open tenotomy are two tenotomy techniques used to treat issues with your tendons.Which type you need depends on which tendon is injured and what caused the damage.Percutaneous needle tenotomyPercutaneous is the medical term for putting something through your skin. During percutaneous needle tenotomy, your provider pokes a needle through your skin into your tendon. They’ll give you a local anesthetic to numb the area around your injured tendon. Then they’ll either poke holes in your tendon or remove damaged pieces. Your provider might use an ultrasound to guide the needle during your procedure.Percutaneous needle tenotomy promotes your body’s natural healing response by creating inflammation around the tendon. Your body sends more blood than usual to the area, which stimulates your tendon’s ability to regrow and repair itself.Open tenotomyOpen tenotomy is a surgical procedure. Your surgeon will give you local anesthesia in the area around your tendon or a general anesthesia to put you to sleep. Then they’ll cut through your skin to expose your tendon before cutting it. Surgically releasing your tendon will relieve pain. In some cases, it can make the tendon regrow longer and less tight than it was before.Care at Cleveland ClinicTendinopathy TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of tenotomy?Both forms of tenotomy are safe, effective treatments for lots of conditions. They’re quick procedures that can relieve your symptoms and repair the conditions that cause them.Percutaneous needle tenotomy isn’t surgery and has a very low risk of complications. Open tenotomy is a minimally invasive surgery and will leave only a small scar on your body (less than a few inches).AdvertisementWhat are the risks of tenotomy?Tenotomy has a few risks, including:Cramping: After tenotomy on your biceps tendon, there’s a chance you could develop cramping near where you had tenotomy. Many people may not even notice it, and it’s not certain that you’ll experience symptoms after tenotomy. If you do have cramping, the discomfort will improve over time.Scar tissue: If scar tissue develops around your tendon near your surgery site, it can be painful.Return of symptoms: Some people who’ve had tenotomy experience symptoms again in the future, sometimes years later. This is especially likely if you frequently overuse your tendons or repeat a specific motion for your job or as part of an activity or sport.Recovery and OutlookWhat is the recovery time after tenotomy?After a tenotomy procedure, you’ll need to avoid using the tendon or part of your body that was operated on as much as possible. How long it takes to recover depends on which type of tenotomy you needed and where in your body the damaged tendon is. Your provider or surgeon will tell you what to expect.Most people need to wait a few months before resuming sports or intense exercise. Talk to your provider or surgeon before resuming physical activity.When to Call the DoctorWhen should I see my healthcare provider?Visit your provider if you experience any of the following symptoms:Pain that’s getting worse or doesn’t get better after a few days.Swelling.Discoloration.It’s hard or painful to move or use a part of your body.Go to the emergency room if you’ve experienced a trauma or can’t move a part of your body that you usually can.A note from Cleveland ClinicTenotomy can treat lots of issues with your tendons throughout your body. It’s used after injuries and to correct health conditions that damage your tendons. No matter which type of tenotomy you need — or which condition you’re getting treated — it’s a safe, effective way to relieve your symptoms.Talk to your provider or surgeon about what you’ll need to do after your tenotomy procedure. They’ll give you a customized recovery timeline to help you get back to doing the activities you love as soon as it’s safe.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/07/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicTendinopathy TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2606Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"