"Tetracyclines: Uses & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/TetracyclinesAdvertisementAdvertisementAdvertisementTetracyclinesTetracyclines are a class of antibiotics that treat several kinds of bacterial infections. Examples include acne, chlamydia and traveler’s diarrhea. Tetracyclines commonly have gastrointestinal side effects, like upset stomach and nausea.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewWhat are tetracyclines?Tetracyclines are a type of antibiotic that work on two major kinds of bacteria. Healthcare providers prescribe them to manage and treat various bacterial infections. They work by preventing the growth and spread of bacteria.Examples of tetracyclinesThere are many types of tetracyclines, including:Tetracycline.Demeclocycline.Doxycycline (Acticlate®, Adoxa®, Doryx®, Vibramycin® and others).Lymecycline (Tetralysal 300). This is available in the U.K. but not in the U.S.Minocycline (Amzeeq®, Arestin®, Ximino®, Solodyn® and others).Rolitetracycline.Eravacycline (Xerava®).Sarecycline (Seysara®).Omadacycline (Nuzyra®).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat conditions do tetracyclines treat?Tetracyclines can treat several kinds of bacterial infections. Bacterial infections are any illness or condition caused by bacterial growth. You can get sick from getting harmful bacteria in your skin, gut (gastrointestinal tract), lungs, blood or anywhere else in your body.Harmful bacteria from the environment, an infected person or animal, a bug bite or something contaminated (like food, water or surfaces) can cause infections. A bacterium that’s not normally harmful but that gets into a place in your body where it shouldn’t be can also cause an infection.Bacterial infections that tetracycline can treat include (but aren’t limited to):Acne.Actinomycosis.Amebiasis.Anaplasmosis (an infection you get from a tick bite).Brucellosis.Chlamydia.Early Lyme disease.Ehrlichiosis.Legionnaires’ disease.Leptospirosis.Melioidosis.Pelvic inflammatory disease.Pneumonia and other bacterial respiratory tract infections.Rickettsial infections (Rocky Mountain spotted fever and typhus).Staph infections.Syphilis.Traveler’s diarrhea.Tularemia.Whipple’s disease.Healthcare providers may also prescribe tetracyclines to treat certain types of food poisoning and anthrax if you can’t take penicillin.Other conditionsHealthcare providers sometimes prescribe tetracyclines for conditions that aren’t bacterial infections. These include:Rosacea.Sarcoidosis.Kaposi sarcoma.Pyoderma gangrenosum.Hidradenitis suppurativa.Sweet syndrome.Rheumatoid arthritis.Scleroderma.Procedure DetailsHow do I take a tetracycline?Most tetracyclines come in pill form. But they also come in the form of topical creams and intramuscular and IV injections. Your healthcare provider will give you specific instructions on how to take the medication. Be sure to follow them.Some tetracyclines require you to take them on an empty stomach (without eating). This is because food can affect how well they work when they enter your body.In addition, calcium, aluminum, iron and magnesium negatively affect how tetracyclines work. It’s important to tell your healthcare provider about any other medications or supplements you take. Many multivitamins, antacids and laxatives have high amounts of these substances. Your provider may ask you to stop taking them while taking a tetracycline antibiotic.How long will I need to take a tetracycline antibiotic?The length of time you’ll need to take the antibiotic will depend on the reason for taking it and other factors, like your overall health. Your healthcare provider will let you know how long you need to take it.Be sure to complete your course of antibiotics — even if you start to feel better before you’re finished with them. You need to take the medication regularly until the prescription is complete to make sure it kills all the harmful bacteria or prevents them from multiplying.AdvertisementRisks / BenefitsWhat are the benefits of tetracyclines?Tetracycline antibiotics can treat a broad range of bacterial infections. They’re relatively safe, and healthcare providers commonly prescribe them.What are the side effects of tetracyclines?Common side effects of tetracycline antibiotics include gastrointestinal issues, like:Abdominal discomfort.Nausea and vomiting.Diarrhea.Decreased appetite.Some people have sun sensitivity (photosensitivity) while taking the medication. This can result in an exaggerated sunburn reaction, like skin blistering. Be sure to use extra sun protection (like sunscreen or wearing long sleeves) when taking tetracyclines.Rare side effects of tetracyclines include:Issues with liver function (hepatotoxicity).Worsening kidney failure (if you already have it).Esophageal strictures and ulcers.Intracranial hypertension (increased pressure around your brain).Lastly, all antibiotics can contribute to the development of diarrhea related to a Clostridium difficile (C. diff) infection, including tetracyclines.AdvertisementWhat are the risks or complications of tetracyclines?Tetracycline antibiotics are generally safe, but there are some risks to consider, including:Tooth discoloration.Antibiotic resistance.Tooth discolorationBe sure to tell your healthcare provider if you’re pregnant or think you might be pregnant. Tetracyclines cross the placenta and can affect the bones of a fetus. They can also cause permanent discoloration of the fetus’s teeth.These antibiotics can also cause tooth discoloration in children under the age of 8. Because of this, providers don’t generally prescribe tetracyclines to children in this age group unless it’s absolutely necessary.Antibiotic resistanceResearchers and healthcare providers have a growing concern over bacterial strains that are resistant to tetracycline antibiotics.Antibiotic resistance happens when bacteria change, so antibiotic medicines can’t kill them or stop their growth. As a result, bacterial infections become extremely difficult to treat.Your body doesn’t develop antibiotic resistance — bacteria do. When antibiotic resistance happens, fewer antibiotics are effective against a particular bacterium. Other antibiotics often help, but it’s important to have as many treatment options available as possible. Your provider will choose the best antibiotic for you and will follow up to make sure it’s working.It’s important to remember that antibiotics (like tetracyclines) don’t work for the common cold, flu or other viral infections. Using antibiotics when you don’t need them increases your risk of getting an infection later that resists treatment. Only take an antibiotic when your provider prescribes it for you.When to Call the DoctorWhen should I call my healthcare provider?If you’re taking a tetracycline antibiotic, call your healthcare provider if:You have any questions about taking your medication.You experience unpleasant side effects.Your symptoms from the infection aren’t getting better.A note from Cleveland ClinicTetracyclines are a common and generally safe type of antibiotic that treat many bacterial infections. As with all antibiotics, it’s important to finish your course of the medication. If you have any questions or concerns about the medication, reach out to your healthcare provider or pharmacist. They’re available to help you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/28/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementQuestions 216.444.2538Appointments & LocationsRequest an AppointmentFind a Primary Care ProviderFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"