"Theophylline: What Is It, How Does It Help & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/TheophyllineAdvertisementAdvertisementAdvertisementTheophyllineTheophylline is a bronchodilator, which is medicine that makes breathing easier. Your healthcare provider may prescribe theophylline as a tablet or liquid. This medication eases the symptoms of asthma, emphysema or other lung diseases.ContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is theophylline?Theophylline is a bronchodilator, a type of medication that makes it easier to breathe. Brand names include Elixophyllin®, Theobid®, Theo-24®, T-phyl® and Uniphyl®.Theophylline is a long-acting bronchodilator. It provides relief over six to 24 hours. Other types of bronchodilators may be short-acting. They provide immediate relief for acute (sudden) breathing problems. Many people take theophylline alongside a short-acting therapy, such as an inhaler.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat conditions does theophylline treat?Your healthcare provider may recommend theophylline for:Asthma.Chronic bronchitis.Chronic obstructive pulmonary disease (COPD).Emphysema.Other lung disorders.How does theophylline help breathing?Bronchodilators like theophylline make breathing easier by:Reducing your airways’ response to irritants.Relaxing the muscles around your bronchial tubes (airways in your lungs).Theophylline can lessen symptoms of:Chest tightness.Coughing.Shortness of breath.Wheezing.AdvertisementHow should I use theophylline?You can take theophylline by mouth in the form of a tablet or capsule. In some cases, your healthcare provider may recommend it as a liquid. Rarely, providers give theophylline intravenously (through a vein). They do so to relieve sudden, severe breathing problems.For any form, the dose, or amount you take, depends on your age, body weight and other factors.Always use theophylline exactly as your healthcare provider directs. This medication is usually taken every six, eight, 12 or 24 hours. You can take it with a full glass of water, with or without food. Never:Crush or chew theophylline.Replace any other breathing medication with theophylline.Share theophylline with someone else.Stop or start taking theophylline without a healthcare provider’s knowledge.Take more or less of the prescribed dose.Risks / BenefitsWhat are the advantages of theophylline?While theophylline doesn’t cure breathing problems, it can help you breathe easier. You usually only need to take it once or twice a day. The medication may help you stay active, sleep better and enjoy a higher quality of life.AdvertisementHow long will I need to take theophylline?Continue taking theophylline as long as your healthcare provider recommends. Theophylline is for chronic (long-lasting) lung conditions. That means many people will take the medication for the rest of their lives. Check in with your healthcare provider regularly to adjust your dosage as needed.Recovery and OutlookWhat side effects or complications of theophylline need medical attention?Some side effects of theophylline can be serious. Seek medical attention right away if you experience:Allergic reactions such as a rash or facial swelling.Fainting.Persistent fever.Seizures.Unusual breathing or heart rate.When to Call the DoctorWhat should I tell my healthcare provider before taking theophylline?Before taking theophylline, tell your healthcare provider if you:Are pregnant, breastfeeding or trying to get pregnant.Have any allergies.Smoke or use any tobacco products.Use drugs or drink alcohol.Theophylline can interact with other medications. Tell your healthcare provider about all prescription and non-prescription medications you’re taking. This includes vitamins, nutritional supplements and herbal supplements.You should also notify your healthcare provider if you have any of the following health conditions:Arrhythmia (irregular heartbeat).Epilepsy (seizures).Heart disease.Liver disease.Thyroid disease.Ulcers (sores in the stomach).A note from Cleveland ClinicThe symptoms of a breathing disorder can have a big effect on your life. But with the right medications, most people can manage breathing problems. A bronchodilator like theophylline may be one part of your treatment plan. Talk to your healthcare provider about the safest way to take medications for lung issues such as asthma or COPD. A healthy lifestyle should be part of any medical treatment plan.Care at Cleveland ClinicRespiratory TherapyMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/19/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicRespiratory TherapyMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6503Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"