"Thoracic Aortic Aneurysm Surgery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Thoracic Aortic Aneurysm SurgeryAdvertisementAdvertisementAdvertisementThoracic Aortic Aneurysm SurgeryThoracic aortic aneurysm surgery is a procedure to treat a bulge (aneurysm) in the thoracic aorta. The aorta is the large blood vessel that carries blood away from your heart. The thoracic aorta is the portion of the aorta in your chest. You may have open surgery or thoracic endovascular aortic repair (TEVAR).ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is thoracic aortic aneurysm surgery?Thoracic aortic aneurysm surgery is a treatment for a bulge (aneurysm) in the part of your aorta that runs through your chest (thoracic aorta). Your aorta is the large artery that carries blood from your heart throughout the rest of your body. It starts at your heart and extends through your chest and abdomen before it ends at your pelvis.Aneurysms occur when there is a weak spot in one of your arteries. This weakening can lead to ballooning or expansion in that section of your artery. Thoracic aortic aneurysms (TAAs) are rare, affecting only about 1 in every 10,000 people.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs thoracic aortic aneurysm surgery?Not everyone needs surgery for a thoracic aortic aneurysm. Whether you need surgical treatment depends on several factors, including the aneurysm’s size, your symptoms and your overall health.What are the types of thoracic aortic aneurysm surgery?There are two procedures to treat a thoracic aortic aneurysm:Open thoracic aneurysm repair is an open surgery that requires a long incision along the side of your chest. Your surgeon removes the damaged portion of the aorta and replaces it with synthetic material (graft).Thoracic endovascular aortic repair (TEVAR) is a minimally invasive procedure. Your surgeon reaches your aorta by placing a small, hollow tube (catheter) through a blood vessel in your groin. They use the catheter to place a small mesh device (stent) that repairs the diseased portion of the aorta and restores proper blood flow.AdvertisementWhy is thoracic aortic aneurysm surgery done?Your provider may recommend thoracic aortic aneurysm surgery to lower your risk of an aneurysm rupture. TAAs don’t always rupture. They are life-threatening if they do.Procedure DetailsWhat happens before thoracic aortic aneurysm surgery?Your provider uses imaging scans to decide if you need surgery for a thoracic aortic aneurysm. They often use CT scans to monitor the aneurysm size. Your provider may recommend surgery if the aneurysm is larger than 5.5 centimeters or has grown more than 0.5 centimeters in six months.Your provider will give you instructions to prepare for the procedure. They may prescribe medications for a few days leading up to your surgery. These medicines may lower your blood pressure or relax your blood vessels. If you take blood thinners (anticoagulants), you may need to stop for a period before the procedure.AdvertisementWhat happens during thoracic aortic aneurysm surgery?In open thoracic aortic aneurysm repair, your surgeon:Makes a large incision along the side of your chest.Uses special tools to stop blood flow temporarily in the affected segment of your aorta.Replaces the damaged section of your aorta with a synthetic graft.Closes the incision with stitches.During TEVAR, your provider:Inserts a catheter and special wires through an artery in your groin.Guides the catheter to your thoracic aorta.Injects a contrast dye through the catheter so they can see your thoracic aorta clearly.Uses CT or X-ray guidance to position the stent accurately.Removes the catheter and wires and places a bandage over the incision area in your groin.What happens after thoracic aortic aneurysm surgery?You move to the intensive care unit (ICU) for immediate recovery after open surgery. After a day or two, you’ll move to another area of the hospital, where you’ll stay for up to 10 days.You usually stay in the hospital for about three days after TEVAR surgery. You may have some mild bruising and pain. Your healthcare provider will give you medications to manage the pain if needed.Care at Cleveland ClinicAortic Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of thoracic aortic aneurysm surgery?Thoracic aortic aneurysm surgery significantly reduces your risk of an aneurysm rupture, which is a life-threatening emergency. Your healthcare provider typically recommends surgery when the risks of a rupture outweigh the risks of surgery.What are the risks or complications of thoracic aortic aneurysm surgery?Thoracic aortic aneurysm repair can be a lifesaving procedure, but it is major surgery. Possible risks and complications may include:Bleeding.Disrupted blood flow to the spinal cord.Heart attack.Infection.Loss of kidney function.Pneumonia or other respiratory problems.Stroke.Weakness in your legs.Recovery and OutlookWhat is the recovery time after thoracic aortic aneurysm surgery?Most people are back to their usual routine within two to three months after thoracic aortic aneurysm surgery. You’ll need to limit your physical activity for around four to six weeks after open surgery. You can return to daily activities within a couple of weeks after TEVAR, but you’ll still need to avoid strenuous activities for about four weeks.What is the success rate of thoracic aortic aneurysm surgery?In TEVAR, the rates of successfully placing the stent are as high as 99%. Thoracic aortic aneurysm open surgery is also a highly successful procedure.When to Call the DoctorWhen should I see my healthcare provider?Call your healthcare provider if you experience any signs of complication or infection after thoracic aortic aneurysm surgery, including:A bulge around the incision site.Excessive redness around the incision site.Fever of 100.4 degrees F or higher.Pain that doesn’t go away.Swelling.A note from Cleveland ClinicThoracic aortic aneurysm surgery is a procedure to repair a balloon or bulge in your thoracic aorta. There are two types of thoracic aortic aneurysm surgery: open surgery and TEVAR. The type of surgery you have depends on multiple factors, including the size of the aneurysm and your overall health. Thoracic aortic aneurysm surgery is a lifesaving procedure for many people.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/25/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicAortic Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"