"Thread Lift: What to Expect, Benefits & Complications800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Thread LiftAdvertisementAdvertisementAdvertisementThread LiftA thread lift is a nonsurgical cosmetic procedure that lifts and tightens your skin for a younger look. A thread lift also stimulates your body’s collagen production. Collagen creates firmer, more supple skin and naturally diminishes with age. A thread lift procedure has a quick recovery with minimal complications.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a thread lift?A thread lift is a nonsurgical procedure that lifts sagging, aging skin and stimulates collagen production to give your face or neck a more youthful appearance. Plastic surgeons place medical-grade thread under the skin to pull the skin into position. These threads activate the body’s natural healing response, triggering the increase of collagen. Threads come in several different materials and lengths.Unlike a facelift, a thread lift is a nonsurgical procedure that creates subtle changes. It’s often called a “lunchtime facelift” because it’s such a quick procedure with minimal downtime.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat types of thread lifts are available?There are several types of thread lifts, including:Cat or fox eye thread lift: This involves lifting the eyebrows toward the temples to give your eyes a catlike look.Eyebrow thread lift: A plastic surgeon lifts sagging or furrowed eyebrows and tightens your skin.Nose thread lift: A plastic surgeon injects threads to lift, straighten or slim your nose. In some cases, they may combine a nose thread lift with dermal fillers.Neck thread lift: This procedure lifts the loose skin on your neck or smooths neck lines.How long does a thread lift last?Results from a thread lift are temporary, lasting from one to three years. Over time, the threads dissolve, and your body absorbs them. If you like your results, you can have another thread lift procedure.AdvertisementWho’s a good candidate for a thread lift?A thread lift is generally best for people who:Are experiencing early signs of aging.Are in their late 30s to early 50s.Don’t expect dramatic results.Don’t want to have cosmetic surgery.Had a facelift (rhytidectomy) or neck lift and want to refresh their results.And because a thread lift is a low-risk procedure, it’s a good option for people with certain conditions who can’t have a traditional facelift. For example, you can have a thread lift even if you have high blood pressure, diabetes or heart disease.Is a thread lift worth it?A thread lift is a relatively quick procedure with little downtime and risk. However, results are subtle and temporary. So, whether a thread lift is worth it depends on your goals and situation.Consider these questions and talk to your plastic surgeon:How long do you want your results to last?Are you looking for a subtle change or a more dramatic one?Do you have a small area of skin that needs tightening or a lot of loose, sagging skin?Are you a good candidate for traditional cosmetic surgery? Or do you want to avoid surgery?AdvertisementIs a thread lift painful?During a thread lift procedure, you receive local anesthesia, so you don’t feel any pain. After the procedure, you may experience some pain, discomfort and soreness. You can take an over-the-counter or prescription pain reliever for several days until the discomfort goes away.Procedure DetailsWhat happens before a thread lift procedure?Your surgeon will discuss with you what to expect during a thread lift procedure. A thread lift doesn’t require general anesthesia. Plastic surgeons use local anesthesia, so you’re awake during the procedure but don’t feel any pain.What happens during a thread lift procedure?Your plastic surgeon uses a thin needle (called a cannula) to insert various threads under your skin. The thread lift procedure takes about an hour.What happens after a thread lift procedure?You can go home right after a thread lift procedure. You may experience some bruising and swelling around the area. Your plastic surgeon will give you instructions on how to care for the treated area, such as:Apply a cold compress or ice pack.Avoid washing your face for 24 hours.Don’t use makeup for several days.Don’t use face moisturizer for a few weeks.Sleep in a propped-up position.Take an antibiotic to prevent infection.Care at Cleveland ClinicPlastic Surgery CareMake an AppointmentRisks / BenefitsWhat are the benefits of a thread lift?Benefits of a thread lift:It’s a low-risk procedure, so most adults can have it.The threads stimulate the production of collagen, naturally improving skin elasticity.Recovery is quick, so you can return to your activities right away.If you don’t like your results, the plastic surgeon can remove the threads.What can go wrong with thread lifts?Thread lift complications tend to be uncommon and can include:Allergic reactions.Bleeding.Infection.Pulling or lumpiness.Recovery and OutlookWhat is the recovery time?After a thread lift, you may experience some swelling and bruising for up to five days.When can I go back to work and other activities?Most people can return to work immediately. However, your plastic surgeon may recommend waiting two weeks before resuming vigorous exercise or any other activities that may loosen the threads.When to Call the DoctorWhen should I see my healthcare provider?Call your healthcare provider right away if you experience signs of infection:Fever.Headache that won’t go away.Swelling that lasts longer than 48 hours.A note from Cleveland ClinicA thread lift is a nonsurgical cosmetic procedure that uses threads under your skin to create a more refreshed, smoother appearance. Recovery is short and complications are minimal. Results are temporary and subtle, so you may need to have the procedure again. Talk to your plastic surgeon about whether a thread lift is the best procedure for your goals.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/07/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPlastic Surgery CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"