"Thyroidectomy: What It Is, Complications & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/ThyroidectomyAdvertisementAdvertisementAdvertisementThyroidectomyThyroidectomy is surgery to remove all or part of your thyroid gland. Surgeons perform thyroidectomies to remove goiters and thyroid nodules and to treat thyroid cancer.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewLocation of thyroid.What is a thyroidectomy?A thyroidectomy is the surgical removal of all (total thyroidectomy) or part (partial thyroidectomy) of your thyroid gland — the butterfly-shaped organ in your neck.Thyroidectomy is the main surgical treatment for thyroid cancer and is a treatment option for certain thyroid conditions, including:Thyroid nodules: A thyroid nodule is a growth (lump) of thyroid cells in your thyroid gland. Thyroid nodules are usually benign (noncancerous), but they can be malignant (cancerous). Sometimes, thyroid nodules can produce excess thyroid hormone, which causes certain symptoms.Goiter: Goiter is an enlarged thyroid gland with or without thyroid nodules. If it grows large enough, it can put pressure on your trachea or food pipe (esophagus) and make it more difficult to breathe and swallow.Hyperthyroidism: Hyperthyroidism (overactive thyroid) is a condition in which your thyroid creates and releases more hormones than you need. It has several causes, and surgery is one of the treatment options for the condition.Types of thyroid cancer include:Papillary thyroid cancer.Follicular thyroid cancer.Medullary thyroid cancer (MTC).Anaplastic thyroid cancer.Primary thyroid lymphoma (surgery is limited to obtaining a tissue biopsy).Metastasis to the thyroid from cancer elsewhere in your body (most commonly renal cell cancer and lung cancer).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is the thyroid?Your thyroid is a small, butterfly-shaped gland located at the front of your neck under your skin. It’s a part of your endocrine system and controls many of your body’s important functions by producing and releasing certain hormones, which are often referred to as thyroid hormone.Hormones are chemicals that coordinate different functions in your body by carrying messages through your blood to your organs, skin, muscles and other tissues. These signals tell your body what to do and when to do it.Your thyroid’s main job is to control the speed of your metabolism (metabolic rate), which is the process of how your body transforms the food you consume into energy. All of the cells in your body need energy to function.There are two main parts of your thyroid: the two halves (lobes) and the middle of the thyroid that connects the two lobes (thyroid isthmus).What are the types of thyroidectomies?There are two main categories of thyroidectomies: Total and partial.Types of partial thyroidectomies, which involve removal of part of your thyroid include:Hemi-thyroidectomy or thyroid lobectomy: The surgeon removes one lobe (one half) of your thyroid.Isthmusectomy: The surgeon removes the thyroid tissue between the two lobes (thyroid isthmus). Surgeons perform this surgery specifically for small tumors that are located in the isthmus.Open thyroid biopsy: In this operation, the surgeon removes a thyroid nodule directly. Surgeons rarely perform this surgery.A total or near-total thyroidectomy is the surgical removal of all or most of your thyroid tissue.The type of thyroidectomy you need depends on the reason for the surgery. For example, if you have a nodule on one side of your thyroid, you may need a hemithyroidectomy to remove the affected lobe. If you have a large goiter or a large cancerous tumor, you’ll likely need a total thyroidectomy.Together, you, your endocrinologist and your surgeon will determine the best surgery plan for you.AdvertisementWhen would I need a thyroidectomy surgery?Your healthcare provider may recommend thyroidectomy for any of the following reasons:You have a nodule (growth) on your thyroid that might be thyroid cancer.You have a diagnosis of thyroid cancer.You have a large nodule or goiter that’s compressing your trachea or esophagus and making it difficult to breathe or swallow.You have a nodule or goiter that’s releasing excess thyroid hormone, resulting in hyperthyroidism, and it’s not responding to other treatment options.How common are thyroidectomy surgeries?Thyroidectomies are a common surgery. Surgeons perform more than 150,000 thyroidectomies in the United States each year.AdvertisementWhat questions should I ask my healthcare provider about a thyroidectomy?If your endocrinologist recommends thyroidectomy, it may be helpful to ask your endocrinologist and/or surgeon the following questions:Why do I need a thyroidectomy?Are there other forms of treatment for my condition?How do I select a surgeon?What are the risks of a thyroidectomy?How much of my thyroid gland needs to be removed?Will I need thyroid hormone replacement therapy after my surgery?What can I expect once I decide to proceed with surgery?What will be my physical restrictions following surgery?How will my life be different after surgery?Procedure DetailsHow do I prepare for a thyroidectomy surgery?Your endocrinologist and surgeon will give you specific instructions to prepare for your thyroidectomy. Be sure to follow them.Depending on your reason for needing a thyroidectomy, in the weeks before your surgery:You may need imaging tests, such as a computed tomography (CT) scan or a thyroid ultrasound, so your surgeon knows exactly where the abnormal thyroid growth is located during surgery.If you have a nodule, your provider may perform a fine needle aspiration (a type of needle biopsy) to find out if the growth is noncancerous (benign) or cancerous.Your provider may check your vocal cord function.You may need thyroid medicine to suppress over-production of thyroid hormones.If you smoke, try to quit. Ask your provider for help.At least one week before surgery:Talk to your healthcare provider about all the medications you take — both prescription and non-prescription. This includes herbs and supplements. Ask your provider which medicines you should still take on the day of surgery.Your provider may ask you to temporarily stop taking blood-thinning medicines. Only do so if they tell you to.You’ll need to fast (not eat or drink anything except water) for several hours before your surgery. Your provider will give you specific instructions.What happens during a thyroidectomy surgery?Before your surgery, an anesthesiologist will give you general anesthesia to relax your muscles, prevent pain and make you fall asleep. Your healthcare team will also place a breathing tube down your throat for the procedure.During a thyroidectomy, there are a few ways your surgeon can access your thyroid, including:Through a standard incision in your neck.Through a smaller incision with the help of a video camera (minimally invasive video-assisted thyroidectomy).With the assistance of a robot through a distant incision in either the axilla (the space below your shoulder through which vessels and nerves enter and leave your upper arm) or the back of your neck.Depending on your situation, your surgeon will remove:Part of your thyroid (lobectomy).Most of your thyroid (near-total thyroidectomy).All of your thyroid (total thyroidectomy).During surgery for a thyroid cancer diagnosis, your surgeon may sample lymph nodes around your thyroid gland. If found, a pathologist will check the lymph node sample during surgery for evidence of thyroid cancer. If they find cancerous cells, your surgeon may also remove nearby lymph nodes in your neck.Once your surgeon is done, they’ll close the incision with stitches (sutures).Surgery to remove your whole thyroid may take up to four hours. It may take less time if your surgeon removes only part of your thyroid.What can I expect after a thyroidectomy surgery?Once you have recovered from anesthesia and are fully awake, you’ll likely be able to have something light to eat and drink.Your throat may be sore due to the breathing tube your healthcare team placed during the surgery. You may also have a small tube (catheter) in your incision to help drain blood and other fluids that build up. Your surgeon will remove the drain one or two days after the surgery.Care at Cleveland ClinicThyroid Disorders TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the risks or possible complications of a thyroidectomy?If a specially trained and experienced surgeon performs a thyroidectomy, it’s generally very safe.Complications are uncommon, but the most serious possible risks of thyroidectomy include:Bleeding after surgery that could lead to acute respiratory distress.Injury to a recurrent laryngeal nerve, which can cause temporary or permanent hoarseness and acute respiratory distress in the very rare event that both nerves are injured.Damage to your parathyroid glands, which are located behind your thyroid. These glands control the calcium levels in your blood by releasing parathyroid hormone. If they’re damaged during surgery, it can lead to temporary, or more rarely, permanent hypoparathyroidism and hypocalcemia (low levels of calcium in your blood).While these complications are rare, they’re more likely to happen if:You have an invasive tumor and/or the cancer has spread to nearby lymph nodes in your neck.You’re undergoing a second thyroid surgery.You have a large goiter that goes below your collarbone into the top of your chest (substernal goiter).If you’re concerned about possible complications of your surgery, talk to your surgeon.Recovery and OutlookWhat is the recovery time for a thyroidectomy?Many people who have a thyroidectomy, especially a hemithyroidectomy, are able to go home the same day of their surgery after a few hours of observation in the hospital. Some people have to stay in the hospital overnight and can leave the next morning.Before you go home, your provider will give you instructions on how to care for your incision and stitches and let you know what types of complications and symptoms you need to look out for.It should take about two to three weeks for you to fully recover.When can I go back to my normal activities after a thyroidectomy?You’ll likely be able to go back to your normal, light activities the first day after your thyroidectomy. Your surgeon will likely recommend that you limit more intense physical activities for a week or two. This is mainly to reduce the risk of a neck hematoma (blood clot) and breaking open your stitches.You should wait at least 10 days to two weeks before returning to vigorous sports and activities, such as swimming and heavy lifting.What are the side effects of having your thyroid removed?The main side effect of having your thyroid removed is a lack of thyroid hormone.After a near-total or total thyroidectomy﻿, you’ll need to take daily thyroid hormone (levothyroxine) pills for the rest of your life to replace the lost thyroid hormone your thyroid naturally made.If you’ve had a hemi-thyroidectomy or thyroid lobectomy, there’s a 60% chance you won’t need to take thyroid medication unless you’re already on thyroid medication for low thyroid hormone levels (hypothyroidism) or blood tests reveal that your thyroid isn’t making enough hormones.When to Call the DoctorWhen should I call my healthcare provider after a thyroidectomy?If you’re experiencing any of the following symptoms or situations after your thyroidectomy, it’s important to call your healthcare provider:Swelling at the incision site.Bleeding at the incision site.Redness or warmth at the incision site.Fever of 101 degrees or higher.Numbness or tingling in your face, hands or lips.A note from Cleveland ClinicIt can be stressful to undergo surgery. Know that thyroidectomies are a common surgery and are generally safe if performed by a qualified and experienced surgeon. If you have any questions or concerns about your thyroidectomy, feel free to talk to your endocrinologist or surgeon. They’re available to help you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/08/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicThyroid Disorders TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6568Appointments & LocationsRequest an AppointmentVirtual Visits for DiabetesFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"