"Tommy John Surgery: Details & Recovery Time800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Tommy John SurgeryAdvertisementAdvertisementAdvertisementTommy John SurgeryTommy John surgery is reconstruction of your ulnar collateral ligament (UCL) at the inside of your elbow. UCL injuries are common in competitive and professional athletes in overhead throwing sports like baseball, javelin or football. You may have to sit out a season or so, but most people are able to return to play after rehabilitation.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewUCL torn in sports injury (top left) and steps of Tommy John surgery to repair the UCL (bottom).What is Tommy John surgery?Tommy John surgery, also known as ulnar collateral ligament (UCL) reconstruction, is a procedure to fix an unstable or torn UCL. Your UCL is a strong band of tissue on the inside of your elbow (the joint where your arm bones meet). In Tommy John surgery, your surgeon reinforces your joint with a healthy tendon from somewhere else in your body. If for some reason your own tendons won’t work, your surgeon may also get one from a donor. Wherever the tendon comes from, it’s called a graft. You surgeon attaches it to your ulna and humerus to act like a new UCL, making your elbow more stable, reducing pain and restoring your range of motion.UCL reconstruction is frequently called Tommy John surgery after a Major League Baseball (MLB) pitcher who tore his UCL. He had UCL reconstruction in 1974. Although he had to sit out for a season, Tommy John went back to playing professional baseball after the procedure.Who typically gets Tommy John surgery?Tommy John surgery treats ulnar collateral ligament injuries. These overuse injuries are most common in people who play sports that involve overhead throwing, like:Baseball.Softball.Javelin.Football.Tennis and other racquet sports.Usually, people who play these sports for fun will recover from a UCL injury after rest and conservative treatment. These people don’t need surgery. But for competitive and professional athletes who throw again and again, their injuries get worse over time. These people may need UCL reconstruction (Tommy John surgery) to return to competitive play.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before Tommy John surgery?Your provider will evaluate the extent of your UCL injury by:Getting imaging tests like X-ray, computed tomography (CT) scans and magnetic resonance imaging (MRI) to look for fractures and torn ligaments.Conducting a valgus stress test to look for joint looseness and pain.They’ll also talk with you about the level of sports you play and when you’d like to return to play before deciding if surgery or nonsurgical treatment is the best option for you.Before recommending Tommy John surgery, your orthopaedic surgeon will ask you to try nonsurgical treatments. These include:Rest.Ice.Taking nonsteroidal anti-inflammatory drugs (NSAIDs).Non-throwing physical therapy.How should I prepare for this procedure?Your surgeon will tell you what you need to do to get ready for Tommy John surgery. In general, you’ll need:A physical exam to make sure you’re healthy enough for Tommy John surgery.Blood tests.An electrocardiogram to check your heart health.A dental exam to reduce your risk of developing an infection after surgery.Tell your provider and surgeon about any medications and over-the-counter (OTC) supplements you take. You may have to stop taking some medications or supplements before your surgery.Your surgeon will tell you when you should stop eating and drinking the day before your surgery. Most people need to avoid eating and drinking for 12 hours before their UCL reconstruction.AdvertisementWhat happens during this procedure?Your surgical team will help you get comfortable on the table. You’ll lie on your back and your arm will be supported. Your anesthesiologist will administer general anesthesia, so you’ll sleep throughout the surgery and won’t feel pain.To begin, your surgeon may take a look inside your elbow using a technique called elbow arthroscopy. Not everyone needs this. But, if they find other injuries to your elbow joint, they may fix them at the same time as your UCL reconstruction.Your surgeon will take (harvest) about 6 to 7 inches of tendon from another spot on your body. They usually use the palmaris longus tendon from your forearm, but sometimes use a tendon from the back of your knee near your hamstring.Next, your surgeon will make an incision on the inside of your elbow. They’ll remove any damaged tissue. Traditionally, the next step is to drill two holes in your ulna and three (in a Y-shaped pattern) in your humerus. These holes form tunnels through which your surgeon threads the harvested ligament. Your surgeon stitches the ligament to itself to make a loop that holds the bones together. Some variations use fewer holes or tunnels, and/or screws to anchor the tendon graft.If the injury damaged your ulnar nerve, your surgeon may move it outside the cubital tunnel during your Tommy John surgery. This allows you to move your elbow without irritating the nerve.After testing the strength of the graft, your surgeon closes your muscles and skin with stitches (sutures) and applies a clean dressing. They’ll put your arm in a hard splint that doesn’t allow you to move your elbow. This is called immobilization.How long is Tommy John surgery?The length of Tommy John surgery (UCL reconstruction) varies. But it usually takes about 60 to 90 minutes.What happens after this procedure?After your elbow heals in the hard splint for one to two weeks, you should be able to switch to a hinged brace. This splint hinges at your elbow to allow for limited exercise. But when you’re not doing your exercises, you lock the hinge to allow for rest and healing.After your surgeon sees you for follow-up about 12 to 16 weeks after the procedure, you can begin a supervised training regimen that involves some (limited!) throwing. As your strength returns, you’ll gradually be able to throw more. Most people return to play in about 12 to 18 months.Care at Cleveland ClinicGet Orthopaedic CareMake an AppointmentAdvertisementRisks / BenefitsWhat are the benefits of this procedure?The benefits of Tommy John surgery include:Most people who have this procedure return to play after rehabilitation.You may have improved throwing endurance. But you shouldn’t get Tommy John surgery just to improve your endurance.You’re unlikely to need revision surgery.How successful is this procedure?Surgeons say a Tommy John surgery is successful if you return to play at the same level or better. These procedures have a high success rate for professional baseball players, with return-to-play rates of 80% to 95%. But your return to play after Tommy John surgery depends on several factors, including your rehabilitation regimen, your age, your level of play before injury and the type of throwing you do in your sport.What are the risks or complications of this procedure?The risks of Tommy John surgery are like those of other surgical procedures. They include:Reactions to the anesthesia.Infection inside your elbow or at the graft site.Numbness or tingling in your ulnar nerve. This numbness (neuropathy) may come and go (transient). You’re at increased risk for this if your surgeon also moves your ulnar nerve outside the cubital tunnel during your procedure.Blood vessel.Problems with the graft, including wearing down or loosening.Certain health conditions can make recovery from a UCL reconstruction more difficult. Talk to your surgeon about your health history. Tell them if you have:Hemophilia.Diabetes.Other autoimmune disorders (like lupus).Your surgeon will tell you what you can expect after your surgery and how you can reduce your chances of experiencing complications.Recovery and OutlookWhat is the recovery time?It takes a long time to recover from a Tommy John surgery. You’ll need at least nine months — probably longer — to rest, recover, strengthen and retrain before returning to sports. For four to six weeks, you’ll wear a hinged brace to slowly increase your range of motion. Your physical therapists and sports medicine team will monitor your progress through rehab and let you know when it’s safe to play again.When can I go back to sports after Tommy John surgery?Everyone heals differently. Working with your sports medicine team, you may be able to return to limited practice in six to nine months. Depending on your sport and level of play, it can take up to 18 months for you to rehab and get back to your game.When to Call the DoctorWhen should I call my healthcare provider?Call your surgeon or healthcare provider right away if you experience any of the following symptoms after Tommy John surgery:Chest pain.Shortness of breath (dyspnea).Fever higher than 102 degrees Fahrenheit (39 degrees Celsius).Bleeding.Signs of infection at your surgery site including leaking, swelling, discoloration, odor or a feeling of warmth.New or worsening pain in your elbow, arm or hand.Severe pain that doesn’t get better after you take pain medication.A note from Cleveland ClinicIf you’re a competitive or professional athlete, a UCL injury may be career-ending. But it doesn’t always have to be. When needed, Tommy John surgery can treat UCL injuries and get you back in the game.Choosing the right surgeon in a hospital that does these procedures regularly is important. So is your commitment to a gradual rehabilitation program. It’s crucial that you don’t return to play until your surgeon says it’s OK. If you go back too soon, you may need more surgeries and even more time away.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/05/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Orthopaedic CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2606Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"