"Tonsillectomy: Procedure Details and Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/TonsillectomyAdvertisementAdvertisementAdvertisementTonsillectomyTonsillectomy is the surgical removal of your tonsils. It’s done to treat sleep-related breathing issues or frequent infections. While surgeons perform tonsillectomies less often than they used to, the procedure is still common today. Tonsillectomy recovery takes up to two weeks.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewA tonsillectomy is a surgical procedure that removes inflamed, infected or problematic tonsils.What is a tonsillectomy?Tonsillectomy (pronounced “tahn-suh-LEK-tuh-me”) refers to the surgical removal of your tonsils. Your tonsils are round, fleshy masses in the back of your throat. Unless you’ve had them removed, you have two — one on each side.Most of the time, surgeons remove all portions of your tonsils during this procedure. But some people might only need a partial tonsillectomy.Why is tonsillectomy done?Healthcare providers recommend tonsillectomy for two main reasons:To treat breathing-related sleep disorders, such as sleep apnea.To reduce the risk of infection in people with frequent or chronic tonsillitis.While most tonsillectomies treat children, adults can also benefit from the procedure.How common are tonsillectomies?Tonsillectomies aren’t as common today as they were a few decades ago. Still, surgeons currently perform over 500,000 tonsillectomies every year in the U.S.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before a tonsillectomy?Before surgery, your healthcare provider will do a routine check to make sure you’re healthy enough for surgery. They may also request blood tests.Your healthcare provider will give you a list of detailed preoperative instructions. You should follow these guidelines closely.What happens during a tonsillectomy?Your healthcare provider will give you general anesthesia to keep you asleep and comfortable during your procedure. Next, they’ll remove your tonsils. You won’t feel pain during this step. Surgeons use many methods to perform tonsillectomies, including:Electrocautery: This method uses heat to remove the tonsils and stop any bleeding.Cold knife (steel) dissection: A surgeon uses a scalpel (traditional surgical knife) to remove your tonsils. Then, they’ll stop the bleeding with electrocautery (extreme heat) or sutures.Snare tonsillectomy: A surgeon uses a special surgical instrument called a snare, which has a thin wire loop at the end. Once your surgeon frees your tonsil, they’ll place this device around it to clamp it off. This helps reduce bleeding.Harmonic scalpel: This method uses ultrasonic vibrations to remove your tonsils and stop bleeding at the same time.Other methods include the use of radiofrequency ablation techniques, carbon dioxide lasers, and/or a microdebrider (which uses a combination of suction and cutting).How long does a tonsillectomy take?In most cases, a tonsillectomy takes about 20 to 30 minutes to complete. It could take longer in some instances.AdvertisementWhat happens after a tonsillectomy?After your tonsillectomy, your medical team will transfer you to a recovery area. There, your provider will check your vital signs (blood pressure, heart rate and blood oxygen levels) and make sure there are no postoperative complications.Tonsillectomy is usually an outpatient procedure. This means you can go home on the same day. Complications are rare, but if they arise, your provider might keep you in the hospital overnight to monitor your progress.Care at Cleveland ClinicSchedule a TonsillectomyFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of a tonsillectomy?Having a tonsillectomy can offer many benefits, including:Better sleep quality.Fewer infections.Improved quality of life.AdvertisementWhat are the risks of having a tonsillectomy?While complications are rare, they can happen. Some possible risks include:Infection.Excessive bleeding (either during or after tonsillectomy).Swelling of your tongue or the roof of your mouth.Reaction to anesthesia.Post-surgical bleeding.Recovery and OutlookWhat’s the tonsillectomy recovery time?On average, most people reach full recovery in about two weeks. Overall recovery time depends on several factors, including the type of tonsillectomy you had, your body’s healing capacity and whether you experienced any complications.Tonsillectomy recovery stagesWhile healing looks a little different for everyone, here’s a general timeline of what to expect during tonsillectomy recovery:One to two days after tonsillectomyThroat pain.Low-grade fever.Fatigue.Bad breath.Difficulty speaking/hoarseness.Feeling of fullness in your throat (due to swelling).Three to five days after tonsillectomyContinued sore throat, which may worsen around day three or four.Fatigue.Five to 10 days after tonsillectomyScabbing.Mild bleeding, which occurs when the scabs eventually fall off.What can I eat after a tonsillectomy?Drinking plenty of fluids is key to a successful tonsillectomy recovery. In addition, you’ll probably want to eat soft, cool foods for the first week. You can introduce solid foods once your comfort level allows, but you should avoid hard and spicy foods, as they can irritate the surgical area.Food and drink recommendations during tonsillectomy recovery include:Water, tea and juice.Ice cream.Smoothies.Yogurt.Pudding.Applesauce.Broth.Mashed potatoes.Scrambled eggs.When can I go back to work or school?It’s best to take at least 10 days off work or school following a tonsillectomy. Staying at home helps reduce your risk for colds or other postoperative infections.When to Call the DoctorWhen should I see my healthcare provider?After a tonsillectomy, you should call your healthcare provider if you develop:Excessive bleeding.Difficulty breathing.Pain that gets worse after five days or doesn’t improve with pain medication.Nausea and vomiting.Signs of dehydration.A fever higher than 101 degrees Fahrenheit (38.3 Celsius) that doesn’t improve with medication.Additional Common QuestionsIs tonsillectomy very painful?You can expect to feel some discomfort following a tonsillectomy. In general, recovery is more difficult for adults than children. This is a normal side effect and should go away in a couple of weeks. Your healthcare provider will give you medications and post-operative instructions to help ease your discomfort.Does having no tonsils affect your immune system?Many people wonder if removing their tonsils will have a negative impact on their immune systems. Research shows that having a tonsillectomy doesn’t result in reduced immunity. In fact, some studies show that the opposite is true: Many people who have a tonsillectomy experience an improved immune response. Keep in mind, though — even if you have your tonsils removed, the tissues in your throat can still become infected and sore.A note from Cleveland ClinicTonsillectomy is the surgical removal of your tonsils. Surgeons perform the procedure to treat breathing-related sleep disorders or chronic tonsillitis. Even though tonsillectomies are somewhat less common today, surgeons in the U.S. still perform over 500,000 procedures every year. If you have frequent tonsil infections or difficulty breathing during sleep, ask your healthcare provider if a tonsillectomy could help.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/17/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule a TonsillectomyFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"