"Total Ankle Replacement: Ankle Replace Surgery, Treat Ankle Arthritis800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Total Ankle ReplacementAdvertisementAdvertisementAdvertisementTotal Ankle ReplacementTotal ankle replacement, or ankle arthroplasty, treats ankle arthritis. The surgery can help reduce ankle pain, increase joint stability and improve overall mobility. Healthcare providers only recommend ankle replacement when other treatments can’t relieve the symptoms of ankle arthritis.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is total ankle replacement?Total ankle replacement is a type of joint replacement surgery. It’s also called ankle arthroplasty. It replaces damaged parts of the ankle with prosthetics (plastic or metal parts). These new parts work together and move like your natural joint. This treatment is usually only for people with ankle pain that doesn’t go away and affects their quality of life.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat can ankle joint replacement treat?Total ankle replacement surgery usually treats ankle arthritis. Arthritis develops from changes to the cartilage (tough tissue) covering the bones of a joint. The cartilage becomes thinner and rougher. Ankle arthritis can happen with age, from general wear and tear. It may also come from repeated ankle injuries, ankle fractures or certain health conditions.Common symptoms of ankle arthritis include:Difficulty walking.Joint pain.Joint swelling.Most people find relief from ankle pain and other symptoms with basic treatments, often used together. Healthcare providers consider these treatments “conservative therapies.” They may include medications, physical therapy or orthotics (special shoe inserts or devices, like braces, to relieve pain). Sometimes, though, severe ankle arthritis requires more targeted treatment. When that happens, a healthcare provider may suggest total ankle replacement.Who should not have ankle replacement surgery?Ankle replacement is not the best option for every person with ankle arthritis. It may not provide a good fit for you if your ankles are severely deformed or unstable. Similarly, healthcare providers may not recommend replacement for people with certain medical conditions:Bone infections.Circulatory problems.Diabetes.Obesity.The first step is to see a healthcare provider who will perform a physical exam and x-rays to determine if you are a candidate for an ankle replacement. Ankle replacement is not the only type of ankle surgery. If ankle replacement isn’t the right procedure for you, other possibilities include ankle fusion or ankle arthroscopy.AdvertisementProcedure DetailsHow do I prepare for total ankle arthroplasty?It’s important to go into surgery and rehabilitation (recovery) with realistic expectations. Talk to members of your care team about how to get ready for the procedure. Knowing what to expect can help you prepare for challenges and make plans for recovery. Before surgery, your team may recommend that you:Start physical therapy.Stop smoking.Stop taking certain medications.Discuss what recovery might look like with your family and friends. You’ll have trouble walking after your ankle replacement. Be sure to make a plan for accomplishing daily tasks. You may need help grocery shopping, getting up and down stairs, or caring for a pet.What happens during total ankle joint replacement?Only a highly skilled orthopaedic surgeon should perform total ankle joint replacement. The surgeon works with an anesthesiologist, nurses and other healthcare providers. Together, the team will:Give general anesthesia or a nerve block.Make an incision in the front of your ankle.Remove the degenerated (worn-down) bone and cartilage.Prepare the joint surface for the new prosthetic pieces.Insert the pieces and check range of motion in the joint.Perform other procedures to make sure proper ankle and foot alignment.Total ankle replacement is typically an inpatient procedure, but you usually only spend one night in the hospital after surgery. Some patients may be candidates for outpatient total ankle replacement surgery.Care at Cleveland ClinicSchedule Ankle SurgeryFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the risks and benefits of ankle replacement?An ankle replacement helps you regain strength and stability in your ankle. The treatment also preserves range of motion. The replacement parts articulate, or move together, like your natural joint. This flexibility can allow you to walk normally, with less pain, and return to a more active lifestyle.Often, ankle replacement is preferable to ankle fusion (arthrodesis). Fusion surgery permanently joins the ankle bones together, limiting range of motion. This loss of flexibility can affect the way you walk or cause arthritis to develop in other joints. Talk to your provider about which procedure — ankle replacement or ankle fusion — best fits your unique needs.Although rare, ankle surgery can lead to complications. Possible risks of ankle replacement include:Blot clots.Infection.Loosening of replacement parts, requiring a procedure to repair.Nerve or blood vessel damage.Problems healing the incision.Wearing down of metal and plastic replacement parts over time.Recovery and OutlookHow long is recovery after ankle arthroplasty?Recovery from ankle arthroplasty can take anywhere from six to 12 months. Most people use crutches or a walker while wearing a splint or cast. The split or cast keeps the ankle immobilized (unmoving) to heal. During this time, your healthcare provider will ask you to take medications to prevent blood clots.Physical therapy after surgery can help you regain mobility in your ankle. Rehabilitation may include:Gait training to help you stand and walk.Massage to decrease swelling.Strengthening exercises.Stretches for range of motion and flexibility.Weight-bearing activities that get harder over time.Your healthcare provider may recommend coming in for scans and follow-up visits after surgery. This extra care can ensure your ankle heals properly.Will I need a second surgery?Some people do need a second ankle surgery. Over time, the plastic and metal parts in the joint replacement may wear out. You can preserve your prosthetic ankle by maintaining a healthy body weight. You can also avoid high-impact activities that put too much strain on the joint.When to Call the DoctorWhen should I call a doctor after a total ankle replacement?Contact a healthcare provider if you experience any of the following complications after surgery:Ankle or foot swelling.Fever.Pus or a lot of blood draining from the incision.Signs of infection.You can reduce your risk of complications after surgery by eating a healthy diet and not smoking. Also make sure to follow all medical instructions. Some people face an increased risk of developing problems after ankle surgery. This group includes people who smoke or who have diabetes or an autoimmune disorder.A note from Cleveland ClinicAnkle arthritis is a common complaint. Rest, ice, elevation and other basic treatments can usually relieve joint stiffness and pain. Surgery to treat ankle arthritis may provide an option when other therapies don’t work. Reduce the chance you’ll need surgery by taking good care of your joints. Avoid smoking, maintain a healthy body weight and get plenty of low-impact exercise.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/24/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Ankle SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2606Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"