"Total Artificial Heart: Procedure and Outlook800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Total Artificial HeartAdvertisementAdvertisementAdvertisementTotal Artificial HeartA total artificial heart (TAH) is a mechanical device that replaces the lower chambers (ventricles) of the heart. Once in place, the artificial heart takes over pumping blood throughout your body, restoring healthy circulation. The artificial heart is a temporary solution designed to keep you healthy enough to receive a heart transplant.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional Common QuestionsOverviewTotal artificial heart device.What is a total artificial heart?A total artificial heart (TAH) is a mechanical pump that replaces the heart when your heart isn’t working as it should. A heart surgeon places an artificial heart in your chest to replace damaged or diseased heart ventricles.Ventricles are the lower chambers of the heart. You have a left and a right ventricle. When you receive a total artificial heart, the device replaces both the left and right ventricle. The TAH does the job the ventricles can no longer do.A portable machine outside your body powers the artificial heart and keeps it pumping at a steady rhythm. A driveline attached to the TAH and the device exit your body through the skin in your stomach (abdomen).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat conditions does a total artificial heart treat?You may need a total artificial heart due to a congenital (present at birth) heart defect or heart failure. These conditions can affect how well your heart functions. The damage or disease may eventually leave your heart unable to pump blood efficiently.Not having enough blood circulating through your body can lead to a variety of symptoms and conditions, including:Fatigue.Low blood pressure (hypotension).Fluid build-up (abdomen, ankle edema).Shortness of breath (dyspnea).Difficulty laying down flat.Who can benefit from a total artificial heart?Most people who receive a total artificial heart are waiting for a heart transplant. A total artificial heart is a temporary solution until you get a transplant. Your provider may refer to the artificial heart as a “bridge to transplant.”Replacing your damaged ventricles with a total artificial heart can help you regain strength. It can help you stay healthy enough for heart transplant surgery as soon as a donor heart is available.AdvertisementProcedure DetailsWhat happens before an artificial heart implantation surgery?You will need to be in the hospital for at least a week as you prepare for total artificial heart surgery. Your healthcare team will teach you and your family about the artificial heart. You’ll learn what to expect and how it will affect your health and lifestyle.During your time in the hospital, your providers will also ensure that you are healthy enough for artificial heart surgery. You may need a variety of tests to assess your condition. Tests before surgery may include:Blood tests.CT scan.Chest X-ray.Electrocardiogram (ECG or EKG).Echocardiogram.Pulmonary function testing.Heart catheterization.Cardiopulmonary stress testing (metabolic stress test).What happens during total artificial heart surgery?Total artificial heart surgery is complex. The procedure may take up to nine hours. A team of heart surgeons and other specialists performs the operation. You will be under general anesthesia (fully asleep) throughout the procedure. Doctors and nurses monitor your breathing, heart rate, blood pressure and other vital signs.A ventilator helps you breathe while you’re under anesthesia. A heart-lung bypass machine keeps blood circulating through your body during the operation. You will stay connected to the machine until the surgeons place the artificial heart in your chest and it starts pumping.AdvertisementWhat happens after total artificial heart surgery?Immediately after surgery, you’ll go to the intensive care unit (ICU) for close monitoring. You may need a ventilator to help you breathe for a few days while in the ICU. You’ll likely get nutrition through a feeding tube or intravenous (IV) line.As you begin to recover, you’ll be able to start breathing, eating and drinking on your own. Gradually, you will be able to get up and move around the hospital.Your healthcare team will monitor you closely throughout your recovery for signs of infection or other complications.Care at Cleveland ClinicGet Heart SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of a total artificial heart?After receiving an artificial heart, you will regain strength and feel better than you did before surgery. The total artificial heart can help you get strong and healthy enough to receive a heart transplant.Without a TAH, many people die while waiting for a donor heart to become available.What are the risks of a total artificial heart?People who require a total artificial heart are already dealing with serious health conditions. Getting a total artificial heart improves your health in many ways. But the surgery and living with the device increase your risk of other complications, including:Bleeding.Blood clots.Stroke.Infection.When to Call the DoctorWhat is the recovery time after total artificial heart surgery?You will likely spend at least a month recovering in the hospital after receiving a total artificial heart. The first several days after surgery, you will stay in the ICU so that your healthcare providers can closely monitor your condition.When you leave the hospital, you can slowly increase your activity. The device that powers and controls your TAH is portable. You can carry it in a backpack or shoulder bag so that you can move around freely.You will need to take medications to help prevent blood clots and infection. Follow your healthcare provider’s directions carefully.What is the prognosis for people with a total artificial heart?A total artificial heart is a temporary solution for people who are on a waiting list for a heart transplant. You can live with an artificial heart for several months or even years while waiting for a transplant.Once you recover from surgery, you will likely feel stronger and healthier than you did before receiving the total artificial heart. That’s because the device is helping pump blood through your body.Receiving a total artificial heart can increase your chance of being able to get a heart transplant.Additional Common QuestionsWhen should I see my healthcare provider?You should call your healthcare provider after your surgery if you experience:Fever.Signs of infection.Stroke symptoms.Sudden shortness of breath, chest pain or other signs of a blood clot in your lungs (pulmonary embolism).A note from Cleveland ClinicA total artificial heart can be a lifesaving device for people with heart failure or other heart diseases or defects. The device takes over for your damaged heart, pumping blood through the body and maintaining healthy circulation. A total artificial heart is a temporary solution meant to keep people strong while waiting for a heart transplant.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 12/02/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Heart SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"