"Total Body Irradiation: Procedure, Benefits & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Total Body IrradiationAdvertisementAdvertisementAdvertisementTotal Body IrradiationTotal body irradiation is a treatment that delivers small doses of radiation to your entire body. Doctors typically use this therapy to help you prepare for a bone marrow or stem cell transplant. The treatment can destroy cancer cells in hard-to-reach areas or lower your risk of transplant rejection.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is total body irradiation?Total body irradiation is a type of radiation therapy that applies small doses of radiation to your entire body. Other types of radiation therapy to treat cancer apply larger doses of radiation to specific parts of your body.What is the purpose of total body irradiation?Total body irradiation helps prepare you for a bone marrow or stem cell transplant. Your doctor may recommend the therapy to:Destroy cancer cells in your bone marrow, nervous system or other difficult-to-reach areas.Reduce your bone marrow to make space for the transplant.Safely suppress your immune system so the bone marrow transplant is more likely to be successful.What conditions are treated with total body irradiation?You may have total body irradiation along with other cancer treatments, such as chemotherapy or targeted therapy, to treat conditions like:Leukemia.Lymphoma.Multiple myeloma.Myelodysplastic syndrome (myelodysplasia).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before treatment?Before you receive total body irradiation, you’ll have an appointment — called a simulation — to plan your treatment. This is like a trial run of the treatment you’ll receive. It helps your healthcare providers ensure that you’re positioned so you can get the right dose of radiation.You’ll have a CT scan to map the treatment area, while your radiation therapist takes measurements. Once your provider determines how to best position your body for treatment, they’ll make small skin markings and take pictures to help position your body when you go in for treatment. The markings may be permanent but are tiny.What happens during total body irradiation?You may stay in the hospital for several days while you receive total body irradiation. During treatment:The radiation therapist positions you the same way as during your planning appointment (simulation).They may place boards or devices over certain areas of your body, such as your lungs, to lower the radiation dose to that area. They may set up a large screen in front of your body that ensures even radiation distribution.Your therapist leaves the room. You’re alone during treatment but can still communicate with your therapist through the intercom while they monitor you.A machine called a linear accelerator moves around you to deliver the radiation.Total body irradiation treatments can take up to 60 minutes. Your first session may last longer while your therapist takes additional X-rays to ensure correct positioning. You may be able to listen to music to help your sessions pass more quickly.How long will I need total body irradiation?Most people receive total body irradiation up to two or three times a day for up to three to five days. Your care team will explain how many radiation sessions you need before your treatment.AdvertisementRisks / BenefitsWhat are the potential benefits of treatment?Total body irradiation can lower the chances that your body will reject a bone marrow transplant. It can also destroy cancer cells in parts of your body that are difficult to reach with other cancer treatments.What are the risks or complications of total body irradiation?Many people experience side effects of this treatment. Side effects of total body radiation vary based on several factors, including:The number of treatments you have.The radiation dose.Your overall health.Short-term side effectsMost often, people have short-term side effects that start a few days or weeks after treatment, including:Diarrhea.Fatigue.Hair loss.Headaches.Nausea or vomiting.Skin reactions like itchiness or discoloration.Total body irradiation also causes a drop in your blood cell count. This puts you at a higher risk of:Bleeding, including nosebleeds (epistaxis) and bleeding gums.Infection.Iron-deficiency anemia.Long-term side effectsRarely, total body irradiation leads to side effects that appear much later and can last longer, such as:Cataracts.Infertility.Scarring in your lung tissue (pulmonary fibrosis).Underactive thyroid (hypothyroidism).A bone marrow transplant also increases your risk of getting a second type of cancer. However, it’s important to remember that the risk of getting another type of cancer after treatment is lower than the health risks of not getting the transplant.AdvertisementRecovery and OutlookHow can I take care of myself after this treatment?Managing side effects can help make total body irradiation easier, such as:Ask for nausea medication if needed.Follow skin care instructions and apply moisturizer regularly.Join a support group.Share your feelings about treatment with others, like a therapist or trusted loved one.Aim for eight hours of sleep each night.Take time off work to rest after hospital discharge, if possible.When to Call the DoctorWhen should I call my healthcare provider?Tell your healthcare provider if you experience any signs of complications during or after total body irradiation treatment, including:Chills.Fever.Skin changes, such as blisters or peeling.Additional Common QuestionsWhat happens when the body is irradiated?“Irradiation” is the term for when your body is exposed to radiation. Radiation exposure can destroy cells or damage your tissues. When used for cancer treatment, radiation destroys or shrinks cancer cells.Is total body irradiation painful?No, total body irradiation isn’t painful. You can’t feel the radiation beams, and the machine doesn’t touch you during treatment. You may have some uncomfortable side effects after total body irradiation, but these don’t usually last long.A note from Cleveland ClinicTotal body irradiation is a treatment to deliver radiation to your entire body. You may have this therapy to prepare for a bone marrow transplant. Hearing that your entire body will be exposed to radiation may make you nervous. Talk with your radiation oncologist about any concerns you have. Total body irradiation actually uses smaller doses of radiation than other types of radiation therapy, and new techniques minimize the effects of radiation on healthy tissue. The treatment can destroy cancer cells in hard-to-reach areas, making it less likely for your body to reject a bone marrow transplant.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/06/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"