"Tracheostomy: What It Is, Procedure & Purpose800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/TracheostomyAdvertisementAdvertisementAdvertisementTracheostomyA tracheostomy is a surgical procedure in which your surgeon creates a hole through your neck and into your trachea (windpipe). The goal is to deliver oxygen to your lungs easily and safely. You might need a tracheostomy if you have an obstructed upper airway or an underlying health condition. A tracheostomy may be temporary or permanent.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a tracheostomy?A tracheostomy — also called a tracheotomy — is a surgical opening that’s made through your neck into your trachea (windpipe). A tracheostomy opens your airway and helps you breathe.Depending on the specific situation, a tracheostomy might be temporary or permanent.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyTracheotomy vs. tracheostomy: What’s the difference?Technically, the term tracheotomy refers to the incision (cut) that your surgeon creates in your windpipe. The term tracheostomy refers to the opening itself. (This opening is also called a stoma.) However, most healthcare providers use the two terms interchangeably.Who needs to have a tracheostomy?You may need a tracheostomy if you:Have an obstruction in your upper airway (nose, mouth or throat).Have difficulty swallowing.Have trouble breathing due to injury, swelling or lung conditions.Undergo airway reconstruction following surgery on your larynx (voice box) or pharynx (throat).Need mechanical ventilation (breathing machine) for more than a week.AdvertisementIs a tracheostomy permanent?When your tracheostomy is no longer necessary, your healthcare provider can remove your tracheostomy tube. The hole often closes on its own. But if it doesn’t, your surgeon can close it up.What is a tracheostomy tube?A tracheostomy tube is a catheter that’s inserted into your windpipe once your surgeon creates the hole. It helps move air into your lungs.There are many different types of tracheostomy tubes. Your healthcare provider can help you find one that’s right for you.AdvertisementCan you breathe on your own with a tracheostomy?Yes. Many people can breathe on their own with a tracheostomy. Because tracheostomy bypasses your nose, mouth and throat, it allows air to go directly into your lungs.In the event that you’re unable to breathe completely on your own, your tracheotomy tube can be attached to a ventilator (breathing machine). This increases the flow of oxygen to your lungs.Can you talk if you have a tracheostomy?You can talk with a tracheostomy, but it’ll take some practice. You can speak by covering your tracheostomy hole with a finger and forcing air out through your mouth. A speech-language pathologist can teach you how to do this by using speech therapy techniques.There are also speaking valves that can help you talk. These allow you to speak without using your finger to cover your tracheostomy hole. Ask your healthcare provider if you’re a candidate.Procedure DetailsWhat happens before a tracheostomy?Your healthcare provider will tell you how to prepare for your tracheostomy procedure. If you’ll be under general anesthesia, you may need to fast for several hours before your appointment.Sometimes, a tracheostomy is done as emergency treatment. In these cases, there won’t be any preparation time.What happens during a tracheostomy?In most cases, your tracheostomy will be done under general anesthesia. Once you’re comfortable, your surgeon will create an incision (cut) in your neck, just below your Adam’s apple. This incision will also go through your trachea (windpipe). Next, your surgeon will open the hole wide enough to fit a tracheostomy tube inside of it.Once your tracheostomy tube is in place, your surgeon will secure it with a band that goes around your neck. This keeps the tube in place during your recovery.If you’re unable to breathe on your own, your surgeon will hook your tracheostomy tube up to a ventilator (breathing machine).What happens after a tracheostomy?After your tracheostomy, your medical team will watch your progress to ensure a successful recovery. Until you can meet with a speech-language pathologist, you’ll communicate through writing.Your healthcare provider will give you post-operative instructions, which will tell you how to care for your surgical site and how to clean your tracheostomy tube. Depending on your situation, you may need to stay in the hospital for a few days to a few weeks after your surgery.Care at Cleveland ClinicTracheostomy Care and RemovalFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of a tracheostomy?A tracheostomy offers notable benefits — especially compared to tracheal intubation (when a tube is placed down your throat and into your windpipe). Advantages include:Improved comfort.Reduced need for sedation.Easier time weaning off of mechanical ventilation.Faster rehabilitation.Better nutrition.Earlier communication.What are the risks or complications of tracheostomy?Like any surgical procedure, there are some risks associated with tracheostomy. Possible complications include:Bleeding.Infection.Damage to your esophagus.Damage to your trachea (windpipe).Tracheo-esophageal fistula (an abnormal opening between your trachea and esophagus).Injury to your recurrent laryngeal nerve (the nerve that moves your vocal cords).Blocked tracheostomy. (Mucus or blood clots can block your tracheostomy tube.)Air that becomes trapped in your lungs, chest or under the skin around your tracheostomy.Keeping your tracheostomy tube clean and following all recommended guidelines can reduce your risk of developing these complications.Recovery and OutlookWhat is the recovery time after a tracheostomy?Healing times can vary depending on the person. But on average, it takes about two weeks to fully recover after a tracheostomy.Once your initial recovery is complete, you’ll continue working with a speech-language pathologist to improve your communication skills.How can I properly care for my tracheostomy tube?Your healthcare provider will teach you how to care for your tracheostomy tube before you’re released from the hospital. Typically, you’ll need to clean your tracheostomy tube at least once a day.How long can you live with a tracheostomy?According to research, tracheostomy doesn’t shorten your life expectancy. But this doesn’t take underlying conditions into account. To learn more about your specific situation, talk to your healthcare provider.What is the quality of life after a tracheostomy?While you’ll have to adapt to new ways of communicating and swallowing, it’s certainly possible to enjoy a good quality of life following tracheostomy. Even if you have a permanent tracheostomy tube, you can lead a long, fulfilling life.When to Call the DoctorWhen should I see my healthcare provider?Contact your healthcare provider right away if you:Develop an irregular heart rate.Experience severe pain that doesn’t improve with medication.Have trouble breathing.Develop thick secretions, mucous plugs or crusting.Have a fever, pus drainage or other signs of infection.A note from Cleveland ClinicHearing that you need a tracheostomy can feel scary and uncertain. But most people learn to adapt quite well with the help of a speech-language pathologist. Talk to your healthcare provider about how to improve your quality of life after tracheostomy. You may even want to join a local or online support group. Some people only need tracheostomies during the short-term, while they’re healing from another condition. But even if you need a permanent tracheostomy, you can lead a happy and fulfilling life.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/09/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicTracheostomy Care and RemovalFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"