"Transgender Voice Therapy800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Transgender Voice TherapyAdvertisementAdvertisementAdvertisementTransgender Voice TherapyTransgender voice therapy, or transgender voice modification, can help you raise or lower your voice to more effectively express your gender if you’re a transgender woman, transgender man or nonbinary person. It may involve learning other speaking and communication skills to help you express your gender more authentically.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional DetailsOverviewWhat is transgender voice therapy (transgender voice modification)?Transgender voice therapy, or transgender voice modification, is training that allows you to use your voice in alignment with your gender. Voice therapy can help you improve your voice, manage a voice disorder, or prevent or heal from a vocal cord injury. Transgender voice therapy is a specialized form of voice therapy.Transgender voice therapy is a form of gender-affirming care. Voice therapy can help you raise or lower your vocal pitch (how high or low your voice sounds) and shape your sound to express yourself the way you would like. It’s an alternative to surgery, which changes your voice by modifying your vocal cord structure.Who needs transgender voice therapy?Your experience of your voice, including your desire to change it, is profoundly personal. There isn’t a “right” or “wrong” way to sound like your gender.Most transgender people seek voice therapy because they feel there’s a mismatch between their voice qualities and how they — or others — perceive their gender. Biological sex characteristics determine vocal pitch. People assigned male at birth (AMAB) tend to have larger and longer vocal cords. As a result, they have lower, or “deeper,” voices than people assigned female at birth (AFAB). These differences don’t often cause distress if you’re cisgender, which means that your sex assigned at birth matches your gender.These biological characteristics can lead to misgendering and psychological distress (gender incongruence) if you’re transgender, which means your gender doesn’t match your sex assigned at birth. Having your gender misrecognized by others may even be dangerous if you’re in a hostile, transphobic environment.You may decide to receive voice therapy if you think that changing your voice will allow you to express your gender more authentically.Transgender voice feminizationVoice therapy may be a part of gender-affirming care if you’re a transgender woman or a nonbinary person assigned male at birth (AMAB) who feels that your voice doesn’t adequately express your gender. Transgender women seek voice therapy more often than any other trans-identified population.If you’re AMAB, the hormone testosterone causes physical changes that deepen your voice during puberty. Your vocal cords thicken, and muscles in your throat and voice box (larynx) get bigger.These biological changes drop your voice frequency, or pitch. These physical changes are irreversible without surgery. Suppressing testosterone and taking estrogen as part of hormone therapy won’t change your pitch.Voice therapy can train you to use your voice muscles to adjust pitch so that your voice sounds higher. Generally, vocal pitches greater than 160 Hz are perceived as feminine. The range is from 160 to 315 Hz and above, with 220 Hz as the average pitch.Voice therapy may also include learning other vocal qualities. For example, you may develop:More pitch variability: Adjusting your pitch so you’re speaking across the highs and lows of your vocal range more frequently.Resonance: Shaping your sound to stay more forward and using different registration, which relies more on the vocal muscles in your head (light quality) instead of your chest (heavy, boomy quality).Transgender voice masculinizationVoice therapy for transgender men and possibly for nonbinary people assigned female at birth (AFAB) focuses on lowering pitch. Generally, vocal pitches between 95 to 175 Hz (with an average of approximately 120 Hz) are perceived as masculine.Unlike feminizing hormone therapy, taking testosterone as part of masculinizing hormone therapy changes your pitch. Testosterone changes your vocal cords and speaking muscles similarly to people AMAB people during puberty, naturally lowering your voice.Still, hormone therapy may not lower your voice to a pitch you’re comfortable with. In this case, you may also need voice therapy. Voice therapy can also help you adapt to changes in your vocal cords that result from taking testosterone. For example, your vocal cords may get bigger, but your voice box may not get bigger proportionally. This can lead to muscle tension and vocal problems that voice therapy can address.Voice problems that may result from hormone therapy include:Hoarseness and voice fatigue.Vocal instability (cracks or a buzzing sound when you talk).Trouble getting loud or projecting your voice.Sounding younger than your age.You may receive masculinizing voice therapy because you’d like to lower your voice but don’t want to take testosterone.Part of therapy may also include learning other vocal qualities. For example, you may develop:Less pitch variability: Staying in a narrower pitch range, so your voice has less pitch variability.Greater intensity: Speaking louder with changes in rhythm and rate of speech.Gender-expansive or gender diverseGender-ambiguous voices fall within the range of approximately 155 to 187 Hz. You may wish to target this range if you’re nonbinary or uncomfortable having a vocal pitch that others associate with specific genders.This type of therapy trains you to switch between pitches to control when you sound more feminine (higher pitch) or masculine (lower pitch). Voice training can help you find the voice qualities that accurately reflect your gender and also may allow for the flexibility that your voice requires.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWho provides transgender voice therapy?You’ll meet regularly with a voice specialist, such as a speech therapist (speech-language pathologist) or an ear, nose and throat specialist (otolaryngologist).Treatment success will depend on your choice of provider. It’s essential to carefully vet the healthcare provider you work with so you choose someone who understands and respects your treatment needs as a transgender person.What happens before voice therapy?You’ll meet with a healthcare provider to decide on voice therapy goals, and you’ll make a plan to achieve them. To start, your provider will analyze your voice, including how you use your breath, vocal cords and other speaking muscles. They’ll note your baseline voice pitch. This starting point will help them determine how much change is needed to reach your target pitch.They’ll also ensure your voice is healthy, so you don’t risk injury during therapy.AdvertisementHow does transgender voice training work?You’ll meet regularly with a provider on a timeline that makes sense for your goals. Many programs involve multiple sessions over eight weeks, but there’s no standard timeline. You’ll connect on your progress throughout therapy and modify training as needed.Adjusting your pitch will likely be a primary focus during therapy. Still, the specific training you receive depends on your unique goals. You may develop skills in:Pitch modification: Lowering or raising your pitch. You’ll start with a slight pitch change before gradually progressing to higher or lower pitches. You may begin with vowel sounds before gradually progressing to words, phrases, sentences and conversations in your desired pitch.Vocal hygiene: Practicing good habits to keep your vocal cords healthy and free from injury. This includes doing vocal warm-ups, practicing good posture, and performing breathing and relaxation exercises.Articulation:Using your speaking muscles to form sounds in a way that accurately reflects your gender identity. This may mean lightening the constriction between your lips, tongue and teeth/palate or even using greater intensity, depending on your goals.Resonance:Using the air-filled cavities in your throat, mouth and nose to color the sounds your vocal cords make. Working on your resonance can help create a unique tone that feels authentic to you. Training may involve learning how to control your vocal muscles better to anchor sounds in your chest (chest voice) or in your head (head voice).Prosody:Modifying the tone and emphasis you place on sounds, words and phrases, creating a rhythmic quality (or flow) to your speech.Word choice: Choosing words that reflect gendered ways of speaking.Pragmatics:Adjusting your communication style to fit changing social situations.Nonverbal communication: Using visual cues like body language and facial expressions to convey messages without speaking.An important part of transgender voice therapy involves applying the skills you learn to real-world situations. Across settings, you’ll reflect on how you feel when using your voice across a range of purposes: speaking, laughing, singing, etc. You can share your response with your provider to adjust voice therapy to your needs.Care at Cleveland ClinicTransgender and Non-Binary Primary CareFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsCan speech therapy change your voice?Yes. Speech therapy can give you the tools to understand how your voice works. It can help you exercise more control over your voice so you can change how it sounds.Still, there aren’t any guarantees regarding how much higher or lower your voice becomes during therapy. Many people reach their desired pitch, but it’s not possible in all cases. Much depends on the anatomy of your vocal cords and your ability to use them.AdvertisementWhat are the advantages of voice therapy?Voice therapy can help you change your voice without surgery. Most people who receive transgender voice therapy see it as a positive experience. In addition to helping you change your pitch, voice therapy can offer you the space to reflect on the vocal qualities that sound and feel true to you.What are the risks or complications of voice therapy?Your vocal cord anatomy may not allow the pitch adjustments you’d like to achieve. It’s important to remember that pitch is just one vocal quality people hear regarding gender. You can work closely with your provider on other aspects of your communication style to convey your gender.If you’re unsatisfied with your results, talk with your healthcare provider about the possibility of surgery to change your voice.When to Call the DoctorWhen should I see my healthcare provider?Contact your provider if you notice signs of vocal cord strain, including:Hoarseness.Vocal fatigue.Pain when you speak.It shouldn’t feel unpleasant to use your voice. Get guidance from your provider on whether you should adjust your therapy, rest your vocal cords or try other treatments.Additional DetailsHow long does voice feminization last?You’ll need to continue vocal exercises to maintain the gains you make during vocal therapy. Over time and with consistent practice, you’ll gain better control over your voice muscles.How long does voice masculinization last?The effects of testosterone on your vocal cords are permanent, which means your voice will remain lower even if you stop taking testosterone. Whether you’re on hormone therapy or not, the voice exercises you learn in voice therapy can help you maintain better control of your voice.A note from Cleveland ClinicChoosing an experienced speech pathologist who works with transgender people will make the difference in your treatment success. Many healthcare providers can help you adjust your pitch. It’s important, though, to find a provider who can tailor treatment to the changes you’d like to hear so your voice expresses your gender. These changes may involve more than changing how high or low your voice is. You may not know what changes feel right inside of your body when you’re speaking without the guidance of a provider who’s attuned to your needs. Work with a provider who understands how voice and gender identity are related.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 12/07/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicTransgender and Non-Binary Primary CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"