"Transcatheter Aortic Valve Replacement (TAVR)800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Transcatheter Aortic Valve Replacement (TAVR)AdvertisementAdvertisementAdvertisementTranscatheter Aortic Valve Replacement (TAVR)Transcatheter aortic valve replacement (TAVR) is a non-surgical, minimally invasive method to replace the aortic valve in your heart. Originally developed as an alternative to surgery for high-risk patients (meaning too sick to undergo surgery), this procedure is now seeing broader use for low-risk patients, too.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is TAVR?Transcatheter aortic valve replacement (TAVR) is a medical procedure that replaces the aortic valve in your heart from inside your body, avoiding the need for open cardiac surgery. Also known as transcatheter aortic valve implantation (TAVI), this procedure’s use has expanded significantly in recent years, making it the most common way to replace the aortic valve. Available research shows this method is usually safer and has either similar or better outcomes than traditional aortic valve replacement surgery as long as your health and personal circumstances make the procedure possible.How TAVR replaces an aortic valve from the inside.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy would I need to undergo TAVR?Your heart has four valves, and blood flows through each one in sequence. The last of the four is the aortic valve. Your heart pumps blood through that valve and out to the rest of your body. TAVR is a procedure that replaces that valve without major surgery.The most common reason to undergo TAVR is if you have aortic stenosis, which is narrowing the aortic valve or the area around it. That narrowing is usually due to calcium buildup on the valve and age-related wear and tear (especially if you’re over age 70). It can also happen because of other health conditions.Narrowing of the valve limits how much blood flows out to the rest of your body, forcing your heart to pump harder to compensate. That usually leads to long-term damage to your heart muscle and then heart failure.Many people who need aortic valve replacement are “high-risk,” either because of the severity of the stenosis or other health conditions. That means they have a greater risk of complications or death from such a major surgery, and TAVR is their only option. In 2019, the FDA also approved TAVR for people who are at low risk for complications from surgery. TAVR also has FDA approval for people who previously had valve replacement surgery.How common are these procedures? How often are these procedures performed?Since its first use in 2002, more than 400,000 people around the world have undergone TAVR. In 2019, TAVR became the most common method to replace the aortic valve, with 72,991 TAVR procedures compared to 57,626 surgical valve replacements.AdvertisementProcedure DetailsWhat happens before this procedure?Before you undergo TAVR, you’ll likely undergo the following diagnostic tests, which will help your provider plan out the best way to do the procedure:Blood testsThese tests will look for any problems with blood clotting, kidney function and more.EchocardiogramThis test uses ultra-high-frequency sound waves to create a picture of your heart (much like a bat uses sonar to “see”). There are two possible ways this test can happen:Transthoracic: This method involves a device held against your skin that can see into your chest (trans = through, thoracic = chest).Transesophageal: Transesophageal echocardiogram (abbreviated TEE) lowers an ultrasound device into your throat. Your esophagus, the tube between your mouth and stomach, runs right behind your heart, making it an ideal way to get an even closer view with sound wave-based imaging. However, most people will not need this as part of their analysis.ElectrocardiogramElectrocardiogram (abbreviated as either ECG or EKG) involves several different sensors stuck to the skin of your chest. Those sensors pick up your heart’s electrical activity and show it as a wave on a printout or a computer monitor. The wave's shape helps providers make sure your heart's electrical system is functioning as it should be.Other imaging testsThe most likely imaging test is a computed tomography (CT) scan, which takes a series of X-ray images that a computer then assembles into a three-dimensional image.Left heart catheterizationThis procedure uses a similar catheter-based approach to TAVR itself, but without the actual valve replacement. This test starts with an incision at a major blood vessel, usually the one at the top of your thigh, allowing providers to insert a thin, tube-shaped device called a catheter. They then thread that catheter up to your heart. Left heart catheterization is useful because it measures blood flow inside your heart. It also gives providers an inside view of any potential problems that might need fixing or you need a different type of care or procedure.After testingAfter pre-procedure testing, your healthcare provider will talk with you about what to expect during and after the procedure. They'll also talk to you and make a recommendation about whether you’ll receive general anesthesia or moderate sedation during your TAVR procedure. They can also answer any other questions you might have.What happens during this procedure?TAVR procedures typically take about an hour from start to finish. At the beginning of the procedure, you’ll receive either moderate sedation (most common) or general anesthesia (less common). While these are similar, there are important differences:General anesthesia: This technique involves making you sleep using special medications, monitored by a certified registered nurse anesthetist (CRNA) and/or an anesthesiologist (a specialist physician). While you’re asleep, you won’t feel any pain. Medical staff will also place a tube in your throat that connects to an artificial breathing machine called a ventilator. The ventilator ensures you keep breathing even while under anesthesia, and removing the tube typically happens once the procedure is over.Moderate sedation: This technique is similar to anesthesia, making you sleep and preventing you from feeling any pain. However, the effect is not as strong, and you don't need to be on a ventilator during moderate sedation.An interventional cardiologist will start the TAVR most commonly by inserting a catheter into the artery at your upper thigh. They will then thread this catheter up to your heart.Other possible blood vessels to use for entry include:Subclavian (under your collarbone).Trans-apical (between your ribs, and directly into the tip of the heart).Direct aortic approach (just below where your neck ends and your chest begins).Once the catheter reaches the aortic valve, they’ll place the new valve inside the old one and expand it. That means the new valve should fit into place and won’t move, and the old valve will be pushed aside and remain behind the new valve. After that, they remove the catheter device from your body, stitch the entry point closed (inside) and bandage it.Types of valvesAs of Sept. 2021, there are three different manufacturers' that have FDA approval for TAVR valves. These include:Edwards Lifesciences SAPIEN 3 and SAPIEN 3 Ultra valves. These valves use bovine (cow) tissue in a chromium-cobalt alloy frame.Medtronic CoreValve Evolut R and Evolut PRO valves. These use porcine (pig) tissue in a nickel-titanium frame.Abbott's Portico valve (approved Sept. 2021). This uses porcine (pig) tissue in a nickel-titanium frame.AdvertisementWhat happens after this procedure?After the TAVR procedure is over, medical staff will stop either the general anesthesia or the moderate sedation, allowing you to wake up. However, they’ll keep you in bed for several hours (at the very least). That’s because the entry point for the catheter was a major blood vessel, and they want to make sure the stitches are secure — because that blood vessel can bleed heavily if the stitches aren’t — before letting you get up. Your healthcare provider will also likely refer you to a cardiac rehabilitation program, which you’ll start within several days of your TAVR procedure. Cardiac rehab programs are like a prescribed workout plan that involves a team of medical professionals from several different fields. These professionals include exercise physiologists, nutritionists, nurses, doctors and more. Their goal is to help you increase your heart’s strength and endurance, which will help your recovery and your long-term outlook.Care at Cleveland ClinicAortic Valve Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of this procedure?TAVR has several advantages compared to surgery, which is why it's now the most common method for replacing the aortic valve. Some of those advantages are listed below.TAVR is less invasive than surgeryMost surgeries on your heart involve larger incisions in your chest. Surgeons also often have to lift — or even crack and spread open — your rib cage to do heart surgery. Minimally invasive surgery techniques reduce how much surgeons do this but can't eliminate it. TAVR involves one small incision only, with no need to move any of your internal organs or ribs.Easier recoveryLimiting the number and size of the incisions also means there’s less for your body to heal. That means there’s less pain and an easier recovery.Shorter hospital staysHeart surgeries usually involve a hospital stay that lasts several days. Depending on where you undergo TAVR, some hospitals send most people home the same day or the next day. That also depends on what time they had their procedure, the severity of their case and their overall health.Better outcomesEarly on, clinical studies and trials found that TAVR was more likely to be successful and less likely to cause death or major complications among people with higher risks for complications from surgery. Later trials on low-risk individuals had similar results, finding that people who underwent TAVR had:Higher one-year survival rates.Lower rates of stroke.Lower rates of rehospitalization within a year.What are the risks or complications of this procedure?While TAVR has many advantages, some complications are possible. However, advancements in the technology of the catheter and the valves mean that these complications are rare. These include:May need a pacemaker. A possible complication of TAVR is a disruption in your heart’s electrical system. That usually requires implanting a pacemaker.May have a leak around the new valve. Depending on the type of valve, some people might develop a paravalvular leak. That means a leak around the outer edge of the new valve.Some of the other complications that can happen:Stroke.Bleeding.Heart attack.Kidney injury.Low blood pressure.Need for follow-up surgery.Reactions to anesthesia or other medications you might receive during this procedure.What are some of the reasons I shouldn’t undergo TAVR?Though it has many benefits, some individuals have conditions or circumstances that mean they shouldn’t undergo this procedure. The most common reasons for this, called contraindications, include:Heart attack within the last month.Congenital heart defects (meaning something you had when you were born) or similar problems.If the new valve won’t fit because the space where it would go is too short.Severe weakening of certain parts of your heart.Other heart valve problems like mitral regurgitation.Recent stroke or transient ischemic attack (TIA).Severe kidney disease.Recovery and OutlookWhat is the recovery time?Most people who have TAVR can leave the hospital within one day. The overall recovery time can vary depending on your case and your overall health, so your healthcare provider is the best person to tell you how long your recovery is likely to take. In general, most people can start resuming most of their normal activities within days of the procedure. For some, it may take a little longer.When to Call the DoctorWhen should I see my healthcare provider?Your healthcare provider will tell you when you should see them for follow-up care. If you have a heart valve replacement, regular follow-up care is vital to ensuring you have the best possible outcome. Follow-up visits will also sometimes include diagnostic tests to make sure the replacement valve is working as intended. Follow-up care is also important because most people who undergo TAVR will need to take blood-thinning medications for the rest of their life.A note from Cleveland ClinicTranscatheter aortic valve replacement is a lifesaving technique that offers a promising alternative to surgery, especially if you are too ill to undergo surgery safely. Ongoing research also shows that this technique can also be better even for those with a low risk of complications from surgery. This technique and the valves used as replacements are undergoing constant refinement and research, which may open the door for future improvements of this technique.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/22/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicAortic Valve Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"