"Transarterial Chemoembolization (TACE): Definition & Procedure800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Transarterial Chemoembolization (TACE)AdvertisementAdvertisementAdvertisementTransarterial Chemoembolization (TACE)If you have liver cancer, your treatment may include chemoembolization instead of surgery. This procedure involves injecting a combination of cancer-fighting drugs and an embolic agent into the tumor. Treatment cuts off the tumor’s blood supply with little or no effect on liver functioning.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is chemoembolization?Chemoembolization a cancer treatment that blocks a tumor’s blood supply. This treatment is also known as transarterial chemoembolization (TACE).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow does chemoembolization work?This procedure places a combination of substances into the vessel feeding the tumor:Chemotherapydrugs that halt abnormal cell growth.Embolic agents, which may consist of an oil or tiny plastic particles. The embolic agent traps the chemotherapy in place.Is chemoembolization the same as chemotherapy?Chemoembolization and chemotherapy both use cancer-fighting drugs to treat tumors. But there are a few differences:Chemoembolization delivers the drugs directly to the tumor. With standard (systemic) chemotherapy, the drugs travel throughout your body via your bloodstream.This treatment uses a higher dose of chemotherapy than systemic chemotherapy. Because the drugs go directly into the tumor, you’re less likely to experience severe side effects.AdvertisementWho is chemoembolization for?This treatment is for adults and children with liver cancer (hepatocellular carcinoma). It is often the first treatment for those with tumors that are too large to be removed by surgery.It’s also for other cancers that have spread (metastasized) to the liver, including:Breast cancer.Carcinoid tumors.Colon cancer.Neuroendocrine tumors.Ocular melanoma.Sarcoma.Can the TACE procedure affect liver functioning?Your liver gets its blood supply from two blood vessels:Hepatic artery delivers a smaller portion of your liver’s blood supply. Liver tumors receive nearly all their blood from this vessel.Portal vein delivers most of the organ’s blood supply.Chemoembolization blocks the liver’s hepatic artery. But since this is such a small portion of your liver’s blood supply, there’s no significant impact on organ functioning. After treatment, your liver gets all the blood it needs from the portal vein.AdvertisementIs chemoembolization right for me?TACE isn’t safe for people with certain health conditions. These include:Bile duct blockage.Blood clotting disorders.Kidney disease.Metastatic cancer affecting many organs.Other liver diseases, including hepatic encephalopathy and portal vein thrombosis.Severe allergy to contrast dye.Procedure DetailsWho performs chemoembolization?An interventional radiologist delivers chemoembolization. This provider uses tiny tubes (catheters) and real-time imaging to perform various procedures.What happens before chemoembolization?Certain tests help healthcare providers plan your procedure. These include:CT scan.MRI.Blood tests to assess kidney function and check for clotting issues.You may also receive medications to:Lower the risk of infection (antibiotics).Minimize nausea.Protect your kidneys from harmful substances that dying tumor cells release.What happens during chemoembolization?Here’s what happens during a TACE procedure:Children undergo general anesthesia, which includes medications that put them to sleep and block sensation. Adults receive sedation, drugs that make you feel relaxed and sleepy.The interventional radiologist makes a small incision in a blood vessel near your wrist or groin.They insert a catheter into the incision.Using real-time imaging (fluoroscopy), they guide the catheter to the tumor.They inject a special dye through the catheter. The dye makes it easier to see the fine details of the tumor and nearby blood vessels.The interventional radiologist injects the tumor with a mix of chemotherapy drugs and an embolic agent.When the procedure is complete, the interventional radiologist removes the catheter. They cover the incision with a bandage. No stitches or closure devices are necessary.Will I need other cancer treatments?For some people, chemoembolization is the only treatment necessary.In other cases, it’s one of many treatments. Your interventional radiologist will help determine which therapies are right for you. Other therapies may include:Ablation.Cancer surgery to remove the tumor if it comes back.Systemic chemotherapy, cancer-fighting drugs that travel through the bloodstream and destroy abnormal cells.Radiation therapy.Care at Cleveland ClinicLiver Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the risks of chemoembolization?TACE risks include:Increased risk of blood clots in children.Infections.Kidney damage, especially in patients with diabetes.Liver damage, which can happen if chemotherapy drugs and the embolic agent lodge in the wrong place.Mild chemotherapy reaction, which may include nausea, hair loss and anemia.Potential need for additional chemoembolization procedures because the results aren’t permanent.What are the benefits of chemoembolization?TACE has many benefits, including:High success rate: Chemoembolization stops tumor growth in approximately 70% of patients.Preserved liver function: This treatment rarely affects your liver’s ability to do its job.Shorter recovery than traditional cancer treatments: You can expect to feel better within a few weeks.Recovery and OutlookWhat are the side effects of chemoembolization?After the TACE procedure, many people experience pain, nausea, vomiting and a low-grade fever. This is known as postembolization syndrome. You will need to stay in the hospital for a day or two until these symptoms subside.Once you get home from the hospital, you’ll want to take it easy. Your recovery may include:Medications for lingering pain and nausea.Fever that may continue for up to a week.Fatigue and loss of appetite that may last a few weeks.What is the outlook for people undergoing TACE?The outlook is good. Most people make a full recovery and live an excellent quality of life. You’ll will need ongoing testing to check for new tumors.When to Call the DoctorWhen should I contact my healthcare provider after undergoing chemoembolization?Contact your healthcare provider if you:Are not getting relief from vomiting and nausea.Become easily confused or have uncoordinated movements.Have a fever that doesn’t go away, along with sweats and chills.Experience signs of liver failure, which include yellowing of the skin or eyes (jaundice).A note from Cleveland ClinicChemoembolization is a minimally invasive treatment for people with liver cancer. This procedure is gentler on the body than other cancer treatments. In some people, it’s the only treatment that’s necessary. The recovery is shorter than other cancer treatments. This enables many people to resume daily activities faster. For the best results, you should receive chemoembolization from an interventional radiologist familiar with this procedure.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/29/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicLiver Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointment Center 24/7 216.445.7050Appointments & LocationsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"