"Transcendental Meditation(R): Technique & Benefits800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Transcendental Meditation(R)AdvertisementAdvertisementAdvertisementTranscendental Meditation(R)Transcendental Meditation® is a meditation technique where you mentally repeat a word or phrase until you reach a state of inner peace. After learning the technique from a certified Transcendental Meditation teacher, you practice twice a day for 20 minutes. The benefits of the TM technique include lower blood pressure and reduced stress.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is the Transcendental Meditation technique?The Transcendental Meditation technique is a type of meditation. With the Transcendental Meditation program, also called the TM program, you silently repeat a mantra in your head. The focus of the Transcendental Meditation technique is to settle your body down to a state of restful alertness. Your body is deeply relaxed and your mind is quiet, but you’re wide awake. With this type of meditation, your active mind settles inward until you transcend to a state of pure consciousness. Transcend means to go beyond.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho developed the Transcendental Meditation technique?An Indian guru named Maharishi Mahesh Yogi developed the Transcendental Meditation technique in the 1950s. Maharishi studied consciousness. He created the Transcendental Meditation program based on ancient meditative yoga practices. But the TM technique doesn’t involve any kind of religion, philosophy or lifestyle. Maharishi introduced the technique as a science. He helped establish the meditative state as the fourth state of consciousness. The first three are waking, sleeping and dreaming.How many people practice the Transcendental Meditation technique?The popularity of the Transcendental Meditation technique began to increase in the 1960s. The Beatles and other celebrities started practicing the technique. Two nonprofit organizations called Maharishi Foundation and TM for Women teach the Transcendental Meditation technique. Another nonprofit, the David Lynch Foundation, brings the Transcendental Meditation program to people around the world. Today, more than 6 million people worldwide have learned the TM technique.AdvertisementProcedure DetailsHow does the Transcendental Meditation technique work?The Transcendental Meditation technique is simple and effortless. You sit comfortably with your eyes closed and practice twice a day for 20 minutes.With the Transcendental Meditation technique, you don’t need an app to guide your meditation. Instead, you silently repeat a mantra in your head.A mantra is a word or phrase that becomes the object of your attention. You drive your consciousness toward your mantra. The Transcendental Meditation mantras are not English words for objects, feelings or experiences. They’re sounds that help you take your attention from active thinking to a deeper level of self-awareness.How can I learn the Transcendental Meditation technique?To learn the Transcendental Meditation technique, a certified teacher must teach you. The Transcendental Meditation course includes a one-hour lecture and one hour of formal one-on-one training with your teacher. The course is carefully personalized for you by your teacher.After these sessions, you’ll receive your mantra. Your Transcendental Meditation teacher selects your mantra for you. After that, you’ll have three follow-up sessions. At these sessions, you’ll meditate under your teacher’s observation. Then, you can begin to practice the Transcendental Meditation technique on your own every day, twice a day.AdvertisementHow much does the Transcendental Meditation program cost?People learn the Transcendental Meditation technique through several sessions. The cost of these sessions ranges from $420 to $980, depending on household income. Also, grants are available for low-income households receiving federal assistance.Can I learn the Transcendental Meditation technique on my own?You may find Transcendental Meditation resources in books, videos, YouTube, Reddit or various apps. But to properly learn the technique, you must learn from a certified Transcendental Meditation teacher. Certified teachers have five months of in-residence training. Then they must maintain their certification through continuing education. Also, they give you personalized one-on-one attention to train you on the technique.Care at Cleveland ClinicMental Health CareMake an AppointmentRisks / BenefitsWhat are the benefits of the Transcendental Meditation technique?Research in the Transcendental Meditation technique supports its effectiveness in several areas. It may have physical, mental, cognitive and emotional benefits. These include:Physical benefitsLower blood pressure: The Transcendental Meditation technique has been shown to reduce high blood pressure. Studies have shown the TM technique may be as effective at reducing blood pressure as blood pressure medication.Improvement in sleep.Pain management and/or distraction from pain.Mental health benefitsReduction in stress, anxiety and depression.Management of post-traumatic stress disorder.Improvement of self-esteem.Cognitive benefitsIncreased productivity, performance and problem-solving skills.Enhanced creativity, intelligence and awareness.Improved energy, focus and memory.Emotional benefitsEnhanced clarity of thoughts and feelings.Increased compassion and gratitude.Improved quality of life and inner peace.When to Call the DoctorWhen should I see my healthcare provider?If you have symptoms such as high blood pressure, stress or anxiety, talk to your healthcare provider. You should speak with them before starting any new treatment or therapy. They may have suggestions for alternative treatments. They may be able to point you toward useful resources, such as finding a Transcendental Meditation teacher near you.Additional Common QuestionsWhat’s the difference between the Transcendental Meditation technique and mindfulness?With mindfulness meditation, you focus on clearing your mind of any thoughts. When you notice your mind has wandered, you gently bring your attention back to the present moment.With the Transcendental Meditation technique, you repeat a specific mantra to help direct your attention inward. The technique is designed to help your mind settle down and go beyond the present moment.A note from Cleveland ClinicThe Transcendental Meditation program is a type of meditation. You silently repeat a word or phrase in your mind to settle yourself into deep consciousness. The Transcendental Meditation technique has been found to have many health benefits, including lowering your blood pressure and reducing stress. If you’re interested in exploring the TM technique, talk with your healthcare provider about your options.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/19/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicMental Health CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementCall Appointment Center 24/7 866.320.4573Questions 216.444.2200Request an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"