"Transoral Robotic Surgery (TORS): What Is It, Risks & Benefits 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Transoral Robotic Surgery (TORS)AdvertisementAdvertisementAdvertisementTransoral Robotic Surgery (TORS)Transoral robotic surgery (TORS) uses sophisticated technology to access hard-to-reach areas in the back of the throat. You may be eligible for TORS if you have cancer near your throat. It’s also used to treat obstructive sleep apnea and lingual tonsillitis.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is transoral robotic surgery (TORS)?It is a type of robotic surgery that enables safe treatment in hard-to-reach areas, such as the back of the throat. The surgeon accesses the area using specialized technology that slides into your mouth.The technology consists of:Endoscopes, thin tubes with tiny instruments at the tip attached to robotic arms.Special camera at the tip of a robotic arm that provides enhanced views of the surgical area.Computer console where the surgeon manages the instruments and camera’s every move.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat conditions does TORS treat?TORS procedures are performed for a number of head and neck cancers, including:Hypopharyngeal cancer, which affects the lower part of the throat.Laryngeal (voice box) cancer.Oropharyngeal cancer, which affects the back of the throat, base of the tongue or tonsil.TORS is also for noncancerous conditions, including:Obstructive sleep apnea, a sleep disorder.Lingual tonsillitis, inflammation of the tonsils at the base of the tongue.Who performs transoral robotic surgery?A surgeon who completes training in robotic-assisted surgery performs this type of procedure.They may be specialists in:Cancer surgery (surgical oncologist).Ear, nose and throat surgery (also called an otolaryngologist).Some surgeons pursue formal training through minimally invasive and robotic surgery fellowships. To become an expert in TORS, a surgeon must perform a high volume of procedures.AdvertisementProcedure DetailsHow is a TORS procedure different from traditional cancer surgery?Before TORS, a mandibulotomy (procedure to cut through the jaw to gain access to the base of the tongue or tonsil) was necessary to access cancers in the back of the throat. This technique requires extensive reconstruction. After this procedure, many have difficulty talking, swallowing and eating after recovery.What happens during TORS?During a TORS procedure,You receive medication (anesthesia) that puts you to sleep and temporarily blocks sensation.Surgeons slide the camera and instruments through the opening of your mouth.They remove tissue using small incisions and close gaps in the remaining tissue.AdvertisementHow does TORS enable surgeons to perform a more efficient procedure?Efficient procedures lower your risk of complications. TORS makes this possible with:Greater precision: The robotic arm’s movements are more controlled than a human hand. The arms rotate in the tight spaces of your mouth in ways that are not otherwise possible.Shorter operating times: An experienced surgeon can quickly and easily carry out your procedure. Accessing the surgical area through the mouth causes less trauma to the surrounding tissues.Better visualization: The camera provides magnified, high-definition views of the surgical area. It also has 3D capabilities that provide an optimal view of the diseased areas of pathology.Is TORS the only procedure I’ll need?It depends on your diagnosis. Cancer treatment may also include:Reconstructive surgery: This treatment restores the appearance or functioning of your mouth. It may involve repairing your tongue or throat so that you can speak and swallow after surgery.Neck dissection: If the cancer has spread, surgeons remove lymph nodes from the neck. These tiny nodes in the neck are often the first place cancer spreads. Doctors make an incision in the neck to remove the lymph nodes that are most at risk of being involved with cancer.Risks / BenefitsWhat are the benefits of TORS procedures?Benefits include:Decreasing the likelihood of a tracheostomy, an incision through which surgeons insert a breathing tube.Decreased risk of long-term speaking or swallowing issues.Less pain during recovery.Lower likelihood of visible scars.Quicker return to daily activities.Reduced blood loss.Shorter hospital stays.What are the disadvantages of TORS?Some of the disadvantages of transoral robotic surgery are that it’s:Approved for a limited number of conditions.Not appropriate for all patients with those conditions.You might not be eligible for TORS if you have:Advanced cancer.Airway issues that make surgery dangerous.Small mouth or related factors that make access difficult.What are the complications or side effects of a TORS procedure?Complications that may occur during or after surgery include:Abnormal bleeding (hemorrhage).Aspiration, which occurs when food or liquid enters the lungs.Respiratory compromise, a condition in which your lungs cannot take in enough oxygen.Dysphagia, difficulty swallowing.Difficulty breathing that requires a tracheostomy.Recovery and OutlookWhat is recovery from TORS like?Recovery often includes:Staying in the hospital for a few days.For more extensive surgeries, a feeding tube to help you get nutrients may be necessary until you can eat again.Resuming everyday activities within a few weeks.What can I expect when I come home from the hospital?You will receive at-home care instructions that are specific to your needs. They often include:Taking it easy for a couple of weeks.Eating foods that are easy to swallow.Taking medications for pain or constipation.Watching for signs of infection, such as a fever.Watching for any signs of bleeding.When to Call the DoctorWhen should I contact my healthcare provider after TORS?Your care should include follow-up appointments to track your recovery. Complications with TORS procedures are not common.Contact your healthcare provider immediately if you experience:Abnormal swelling.Bleeding.Dehydration.Difficulty breathing or swallowing.Fever.Nausea and vomiting.A note from Cleveland ClinicTORS is a type of robotic surgery that enables safe operations in the back of the throat. It’s used to treat certain head and neck cancers and obstructive sleep apnea. Benefits include less trauma to surrounding tissues, shorter hospital stays and quicker recovery. You are less likely to experience complications from a specially trained surgeon who performs a high volume of procedures.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/09/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"