"Transforaminal Injections800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Transforaminal InjectionsAdvertisementAdvertisementAdvertisementTransforaminal InjectionsWhat is transforaminal injection?Transforaminal injection can help relieve pain in your lower back, legs and feet caused by sciatica, herniated discs or other back problems.You have nerves that run from your spinal cord out to your legs. When one of those nerve “roots” (the end closest to your spinal cord) gets irritated and inflamed due to a damaged disc or other condition, it causes pain that can radiate from your back to your legs and feet.A steroid medication can help reduce the inflammation and alleviate the pain. It’s injected into your back, into the area between your spine and spinal cord.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow is transforaminal injection done?First, you’ll be given an intravenous medication to relax you. Then, you’ll lie on your stomach on an x-ray table.The doctor will numb an area of skin on your lower back with a local anesthetic. Then, guided by an x-ray, he or she will:Insert a thin needle into your lower back, targeting the specific nerve root causing your painInject a mixture of anesthetic (for temporary pain relief) and steroid (for longer term relief)Usually, the procedure takes about 20 minutes. You can go home the same day.How effective is transforaminal injection?Some patients report pain relief within 30 minutes after the injection, but pain may return a few hours later as the anesthetic wears off. Longer term relief usually begins in two to three days, once the steroid begins to work.How long the pain relief lasts is different for each patient. For some, the relief lasts several months or longer. If the treatment works for you, you can have periodic injections to stay pain-free.AdvertisementWhat are the risks?The risk of complication from a transforaminal injection is very low. Rarely, complications include bleeding or infection at the injection site.Side effects can include:Numb or weak legs or feetDizzinessHeadacheThese effects resolve within a few hours.What happens after the procedure?You can continue your regular diet and medications immediately. Do not drive or do any rigorous activity for 24 hours. Take it easy. You can return to your normal activities the next day.It may take up to a week for the steroid to begin working. If you don’t feel better within 10 days, see your doctor for more evaluation and to discuss different treatment.AdvertisementIs transforaminal injection right for you?Transforaminal injection may be right for you if your back or leg pain has lasted longer than four weeks, is severe or has not improved with other treatments, such as physical therapy.Talk to your physician about it. Or schedule an evaluation at Cleveland Clinic’s Department of Pain Management by calling 216.444.PAIN (7346) or 800.392.3353Medically ReviewedReviewed by a Cleveland Clinic medical professional.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7243Questions 216.444.9134Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"