"How to Get Rid of Wrinkles: Retinol, Fillers & Other Treatments800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Treatments to Reduce WrinklesAdvertisementAdvertisementAdvertisementTreatments to Reduce WrinklesWrinkles are a normal part of your body’s aging process. If you don’t like how wrinkles look on your skin, treatment options are available to help you improve your appearance. Most treatment options are outpatient procedures that don’t require a hospital stay and provide high rates of satisfaction.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat are wrinkles?Wrinkles are lines that form on your skin. Similar to the creases in a shirt that needs ironing, wrinkles can form on your skin — most often on your face, neck, hands and arms. They can look like folds or ridges on your skin. Wrinkles are a natural part of your body’s aging process.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat causes wrinkles?There are many factors that contribute to the onset of wrinkles, including:Aging: As you get older, your skin cells divide slowly, which causes the outer layer of your skin to thin and wrinkles to form. You also lose about 1% of your collagen each year starting in your 30s.Facial muscle contractions: You use the facial muscles in your body to smile, frown or squint. Over time, these muscles cause frown lines between your eyebrows and crow’s feet at the corners of your eyes because of weakened fat or bone mass and the effects of gravity on your skin.Sun damage: Exposing your skin to the sun’s ultraviolet (UV) rays can cause your skin to age prematurely. The sun can damage collagen in your skin, which provides the elasticity and flexibility your skin needs to prevent wrinkles.Smoking: Tobacco products cause your body to slow down its production of collagen. Too little collagen causes wrinkles.What are the treatment options for wrinkles?Since wrinkles are a normal part of your body’s aging process, they don’t need treatment. If you don’t like how wrinkles look on your skin, there are treatment options available to cosmetically improve your appearance.RetinoidsRetinoids that include retinol, retinal aldehyde (Retin-A), retinyl esters, adapalene, tazarotene and tretinoin are chemicals that come from vitamin A that help reduce lines and wrinkles in your skin and improve your skin’s texture, pigment and hydration levels. You can find retinol in many over-the-counter skin care products. Retinol can penetrate deep into your skin’s layers to activate collagen and elastin, which give your skin structure and support to prevent wrinkles. You can apply products that contain retinoids at home directly onto your skin as you would a lotion or a moisturizer. Check with your healthcare provider to make sure products that include retinoids are right for you.Micro-needlingMicro-needling, or skin needling, is a facial rejuvenation procedure that uses a device with several tiny needles that poke you to create a miniature wound in the top layer of your skin (epidermis). This wound heals within minutes and causes new collagen and elastin to form as your skin heals. Micro-needling is effective at improving wrinkles or fine lines in your skin.MicrodermabrasionMicrodermabrasion gently removes or sands away thick or uneven outer layers of your skin. This treatment is best to treat scarring or stretch marks, skin discoloration or sun damage.DermabrasionDermabrasion scrapes away layers of your skin. This treatment removes skin layers to reduce wrinkles or irregular skin depressions. This helps you regain smoother, more youthful-looking skin.Chemical peelsChemical peels dissolve skin imperfections using small amounts of a chemical solution. The solution removes the top layers of your skin and makes room for new, healthy skin to grow in its place. Chemical peels are best to treat wrinkles, skin discoloration or scars.Laser skin resurfacingLaser skin resurfacing reduces facial wrinkles and irregularities caused by sun damage or acne. The laser technique directs short, concentrated pulsating beams of light at sections of your skin. You're an ideal candidate for laser skin resurfacing if you have:Fine lines under or around your eyes, forehead or mouth.Wrinkles under or around your eyes, forehead or mouth.Scars from acne.If you have active acne, you should wait until your acne is well controlled before pursuing laser treatment. Laser resurfacing is generally better suited for fair-skinned individuals, as people with dark skin have a higher risk of their skin tone darkening (hyperpigmentation) with certain treatments.Botulinum toxin type A (Botox®, Dysport, Xeomin, Juveau) injection therapyNeuromodulators or wrinkle-relaxing treatments, like Botox®, are medicines derived from the botulinum toxin. They block the chemical signals that cause your muscles to contract. Your healthcare provider will inject these medicines into the muscles whose contractions cause wrinkles, such as between your eyebrows (frown lines) and the lines that extend from the corners of your eyes (crow's feet).FillersWrinkles that remain at rest may require filler to fill in or lift skin with deep wrinkles. Prominent folds around your mouth, nose and chin are the most commonly treated. Hyaluronic acid, a naturally occurring sugar polymer, is the most common filler.FaceliftA facelift is a surgical procedure where your healthcare provider will remove excess skin and fat from your face and neck. Your provider will also tighten the muscular and connective tissue layers to reduce the appearance of wrinkles.AdvertisementWho's a good candidate for wrinkle treatments?Treatment isn’t necessary for wrinkles but it’s an option if you want to improve your appearance. Anyone who has wrinkles can get treatment if they choose to do so. The most common age group that seeks treatment to reduce wrinkles are people between the ages of 40 to 55.You may choose treatment for wrinkles if you don’t like how they look on your skin. Treatment helps smooth your skin and lessens the appearance of wrinkles to give you a more youthful look.How common are procedures to treat wrinkles?Non-surgical procedures to treat wrinkles are common. More than 4 million wrinkle-relaxing treatment injections occurred in 2020.AdvertisementProcedure DetailsWhat happens before a wrinkle treatment procedure?Before any type of procedure to treat wrinkles, you’ll meet with your healthcare provider to discuss your medical history, if you have any allergies, your concerns and your goals for the treatment. Your provider will assess this information and provide treatment options that are right for you. It’s important to note that all treatment options are unique, and the type of treatment that works for one person may not work for another.Depending on the type of treatment, your provider may recommend staying out of the sunlight or wearing sunscreen when outdoors to protect your skin from the sun’s UV rays.What happens during a wrinkle treatment procedure?Before wrinkle treatment, your healthcare provider will cleanse and exfoliate your skin to remove any excess oils and will provide protective eyewear to prevent injury.Outpatient procedures like micro-needling, microdermabrasion, dermabrasion, chemical peels, laser skin resurfacing and neuromodulator injections are in-office procedures, done while you’re awake, and can take minutes to hours. Your provider will use special instruments, needles or laser lights directed onto the area of your skin to be treated during the procedure.Laser skin resurfacing requires receiving a local anesthetic to your skin so you won’t feel the procedure.Surgical procedures like a facelift require general anesthesia, where you’ll be asleep during the procedure.What happens after a wrinkle treatment procedure?After each procedure, your healthcare provider will give you specific instructions to help you care for your skin as it recovers from treatment. After-treatment care could include:Avoiding strenuous activities until your skin recovers.Not rubbing or massaging your skin where you received an injection.Using a compress of ice wrapped in a towel to alleviate swelling.Using a moisturizer throughout the day to avoid dry skin.Wearing sunscreen when outdoors.Gently cleansing your skin.Using an antibiotic cream or ointment on the treated skin to prevent infection.Staying hydrated and drinking plenty of liquids.Avoiding smoking or drinking, which could delay your recovery time.Care at Cleveland ClinicGet Dermatology CareMake an AppointmentRisks / BenefitsWhat are the advantages of wrinkle treatment?The advantages of wrinkle treatment include:It lessens the depth and appearance of wrinkles, blemishes, dark spots or circles and gives your skin a youthful look.It improves your self-esteem.You can have same-day results for non-surgical procedures.Certain procedures are pain-free.What are the risks or complications of these procedures?There are risks associated with wrinkle treatments that vary for each type of treatment, including:An allergic reaction to the medicine.Changes to the color and texture of your skin.The formation of permanent bumps under your skin.You’re unable to move your facial muscles in the same way you used to (provisional paralysis).Surgical site infections.Scarring.Pain.Bruising.Swelling.Before you begin treatment, talk to your healthcare provider about the risks and complications along with instructions on how to take care of your skin after treatment.Recovery and OutlookWhat is the recovery time for wrinkle treatment?The recovery time varies for each type of wrinkle treatment and includes:No recovery time: Wrinkle-relaxing treatments.One to three days: Micro-needling and fillers.One to three weeks: Dermabrasion, chemical peels and laser skin resurfacing.Three weeks or more: Facelift.Do I need multiple procedures to treat wrinkles?Depending on the severity of your wrinkles and your personal goals for your treatment, you may need multiple procedures to get and maintain your desired results.Treatments that last up to six months include:Micro-needling.Chemical peels.Wrinkle-relaxing injection treatments.Fillers.The results of laser skin resurfacing last up to five years. The results of a facelift usually last seven to 10 years. Dermabrasion treatment is permanent.When to Call the DoctorWhen should I see my healthcare provider?After wrinkle treatment, visit your healthcare provider if:You have a fever.Your skin is swollen and it doesn’t decrease after a couple of days.Your skin isn’t healing.Your skin is itchy.Your treatment site is painful, bleeds, leaks a yellow fluid or scabs with a crusty exterior.Additional Common QuestionsCan I get rid of wrinkles permanently?Some treatment options are available to permanently remove wrinkles from your skin, like dermabrasion. Not all procedures are permanent but they do offer temporary cosmetic changes to give you a more youthful appearance. You can get multiple procedures to remove wrinkles over time to maintain your results.At what age do I start getting wrinkles?Most people start to see signs of aging on their skin after turning 25 years old. You’ll first notice fine lines on your skin that turn into wrinkles as your skin loses elasticity and structure.Does Differin® help with wrinkles?Differin® is an over-the-counter skincare product that contains retinoid ingredients. Retinoids help minimize lines and wrinkles on your skin. The product also treats acne.A note from Cleveland ClinicWrinkles are a natural part of your body’s aging process and don’t need surgery, but treatment options are available if you want to change your appearance. Discuss what you want to look like with your healthcare provider, they'll narrow down a treatment option that's best for you to help you meet your goals.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/27/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Dermatology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"