"Tricuspid Valve Replacement and Repair800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Tricuspid Valve Replacement and RepairAdvertisementAdvertisementAdvertisementTricuspid Valve Replacement and RepairTricuspid valve replacement and repair are surgical procedures that treat diseases affecting one of four heart valves. The procedures can ease symptoms and increase survival in people with tricuspid regurgitation or tricuspid stenosis. Traditional tricuspid valve surgery requires open-heart surgery. Less invasive procedures may also be available.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat are tricuspid valve replacement and repair?Tricuspid valve replacement and repair are procedures to treat diseases affecting your heart’s tricuspid valve.The tricuspid valve is one of four valves that control blood flow through your heart. It’s on the right side of your heart, between the upper chamber (atrium) and lower chamber (ventricle). It ensures that blood flows in the correct direction from the right atrium down to the right ventricle. The tricuspid valve has three flaps, called leaflets, that open and close as blood flows through it.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs to have tricuspid valve replacement or repair?Some people have health conditions that affect the tricuspid valve’s function, called tricuspid valve disease. The main types are:Tricuspid regurgitation: The valve leaks or doesn't close tightly enough, allowing blood to leak backward.Tricuspid stenosis: The valve’s leaflets are too stiff, which can restrict blood from flowing.When the tricuspid valve doesn’t function correctly, your heart may have to work harder to supply your body with blood. This can cause bothersome symptoms and lead to complications, such as heart failure.Is it better to repair or replace the tricuspid valve?In general, healthcare professionals recommend repair using your own heart tissue whenever possible. But if the valve and surrounding tissue are too damaged, your healthcare professional may recommend a replacement valve.There are two types of replacement valves: biological and mechanical. A biological valve may come from an animal or deceased human donor. A mechanical valve is a manufactured medical device.If you receive a valve from an animal or human donor, you may not need to take blood thinners afterward. But mechanical valves increase the risk of blood clots, so you will need to take blood thinners for life.AdvertisementProcedure DetailsWhat happens before tricuspid valve repair or replacement?Before surgery to repair or replace your tricuspid valve, your doctor and treatment team will:Explain what to expect before, during and after surgery.Discuss potential risks of the surgery.Allow you to ask questions.Have you sign a form giving consent for surgery.Help you plan for your recovery, including medications and any help you’ll need at home.They may conduct tests to ensure you’re healthy enough for surgery and to plan the procedure. Tests may include:Blood tests.Electrocardiogram (EKG).Imaging tests to take pictures inside the heart, such as chest X-rays or ultrasounds.What happens during tricuspid valve surgery?Tricuspid valve surgery is often performed as open-heart surgery, which involves a 6- to 8-inch incision in your chest.The surgical team will:Give you anesthesia to put you to sleep.Create an incision in your chest and through your breastbone.Administer medication to stop your heart.Connect you to a heart-lung bypass machine to keep blood circulating.Perform the specific type of tricuspid valve repair or replacement.Depending on the valve problem, there are several approaches to tricuspid valve surgery. The surgeon might:Perform annuloplasty to reinforce the annulus, a ring of tissue at the base of the valve’s leaflets.Remove the valve and replace it with a biological or mechanical one.Reshape the valve using sutures.Separate the valve’s leaflets if they’re stuck together.Sew or patch any leaflets that are torn.AdvertisementCan the tricuspid valve be repaired or replaced without open-heart surgery?There are less invasive options for tricuspid valve surgery that use smaller incisions and may not require a bypass machine. Your surgeon will let you know which type of surgery is best for you. Minimally invasive options include:Right thoracotomy approach: This procedure is performed through a small incision on the right side in between the rib cage. It’s often used when a person needs tricuspid valve surgery and mitral valve repair.Robotically assisted surgery: Robotically assisted tricuspid valve repair involves several small incisions in your chest wall. Robotic technology helps your surgeon perform the procedure.Transcatheter tricuspid valve repair or replacement: Your healthcare team uses smaller incisions and threads a thin tube (catheter) through a vein to perform the procedure.Can I have other procedures along with tricuspid valve surgery?Your surgeon and healthcare team may perform other procedures at the same time as tricuspid valve repair or replacement. For example:Catheter ablation for arrhythmia.Coronary artery bypass for coronary artery disease.Repair or replacement of the aortic valve or mitral valve.What happens after tricuspid valve repair or replacement?After tricuspid valve surgery, you’ll probably stay in the hospital a few nights. The length of your stay depends on several factors, including your overall health and the type of procedure you received.Before you leave the hospital, the healthcare team will monitor you and order imaging tests to ensure the repair or replacement is working.You may have to take medications to prevent complications, such as anticoagulants for blood clots and antibiotics for infection.Care at Cleveland ClinicMitral & Tricuspid Valve CareFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of tricuspid valve replacement and repair?Tricuspid repair or replacement can:Correct a tricuspid valve disorder.Help you enjoy life more, such as participating in activities and completing daily tasks.Lengthen survival.Lessen or eliminate symptoms, such as weakness, fatigue, shortness of breath and swelling in your abdomen, legs or feet.What are the risks or complications of tricuspid valve repair or replacement?Tricuspid valve repair or replacement is invasive and presents several potential risks, including:Bleeding.Blood clots.Heart rhythm problems.Infection.Stroke.Valve dysfunction despite replacement.Recovery and OutlookWhat is the recovery time after tricuspid valve repair or replacement?Recovery time after tricuspid valve repair or replacement depends on several factors, including your overall health. Most people need several months after open-heart surgery to return to normal activities. Recovery from transcatheter procedures is shorter, usually a few weeks.How long does a replacement valve last?A biological replacement valve can last 10 to 20 years.When to Call the DoctorWhen should I seek medical attention after tricuspid valve replacement?After tricuspid valve surgery, report any symptoms that could mean the valve or heart aren’t functioning well:Dizziness or lightheadedness.Extreme fatigue.Sudden weight gain.Swelling in your feet or ankles.Also, call your healthcare provider if you have signs of infection, like:Chills.Draining or oozing from the incision.Fever.Pain that gets worse.Redness around the incision site.Seek emergency medical help if you have any of these symptoms, which may indicate a life-threatening problem with heart function:Chest pain.Pressure or tightness in your chest.Sudden severe shortness of breath.Fainting.A note from Cleveland ClinicTricuspid valve replacement and repair are surgical procedures to treat one of four valves in your heart. If you have tricuspid regurgitation or tricuspid stenosis, talk to your cardiologist about whether this type of surgery can help.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/12/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicMitral & Tricuspid Valve CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"