"Trigger Point Injections (TPI): What They Are & Procedure800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Trigger Point InjectionsAdvertisementAdvertisementAdvertisementTrigger Point InjectionsA trigger point injection (TPI) can help relieve myofascial pain, which is usually caused by a \"knot\" in your muscle (trigger point). TPIs are common and generally safe.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat are trigger point injections?A trigger point injection can help soothe myofascial pain, especially in your neck, shoulder, arms, legs and lower back.Trigger points are painful “knots” in your muscles that can be very sensitive to touch/pressure. They may form after acute trauma or by repetitive micro-trauma, leading to stress on muscle fibers. It causes the muscle fibers to be stuck in a contracted state. Sometimes you can feel these knots when you rub your muscle.Trigger point injections commonly involve injections of local anesthetic with or without corticosteroid, botulinum toxin, or without any injection substance (dry needling).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are trigger point injections used for?Healthcare providers use trigger point injections to help treat myofascial pain. “Myo” means muscle and “fascial” means fascia. Your fascia is the thin, white connective tissue that’s wrapped around every muscle.The pain and tenderness in myofascial pain are typically due to one or more trigger points. To the touch, trigger points feel like small bumps, nodules or knots in your muscle.Trigger points can develop in any muscle, but the most common muscle groups that are treated with trigger point injections include:Masseter (a muscle in your jaw).Levator scapulae (a muscle on the sides of your neck).Gluteus medius (a muscle in your hip).Quadratus lumborum (a deep muscle in your low back).Trapezius (the muscle extending over the back of your neck and shoulders).Sternocleidomastoid (a muscle in the front of your neck).Temporalis (a muscle on the sides of your head).Trigger points can cause certain types of pain or issues. For example, trigger points affecting your trapezius muscle may cause tension headaches. A trigger point affecting your piriformis muscle (a muscle in your buttocks) can cause piriformis syndrome — when the piriformis muscle presses on your sciatic nerve. It causes pain or numbness in your buttock and down the back of your leg.Who needs to have a trigger point injection?A trigger point injection may be right for you if your trigger point pain has not improved with other treatments, including over-the-counter pain medication, heat therapy, massage therapy, myofascial release ad physical therapy.Providers typically use trigger point injections alongside physical therapy and stretching exercises to alleviate the pain.This strategy can be particularly beneficial when a trigger point injection is initially used to reduce pain in people who are unable to do physical therapy or stretching due to intense pain. The trigger point injection can allow physical therapy to be more effective.Before your healthcare provider can recommend a trigger point injection, they’ll need to perform a thorough physical exam and rule out other possible causes of your pain, including:Muscle strain.Structural causes of pain.Issues with your spinal column causing back pain, such as degenerative arthritis, a herniated disk or spinal stenosis.Radiculopathy (pain from a pinched nerve).AdvertisementHow common are trigger point injections?Myofascial pain and trigger points are very common — they occur in about 85% of people at some point in their life.Many primary healthcare providers and pain providers diagnose and treat myofascial pain regularly, which may include trigger point injections and/or physical therapy and stretching exercises.Procedure DetailsWhat do I need to do to prepare for a trigger injection?There’s nothing you need to do to prepare for a trigger point injection. However, as with any type of treatment, it’s important to discuss your current medications, symptoms and overall health with your provider before getting the procedure.AdvertisementWhat happens during a trigger point injection procedure?You can expect the following during a trigger point injection procedure:Depending on the trigger point location, you may be sitting or laying down on an exam table.Your healthcare provider will cleanse your skin on the affected area with an alcohol pad.Your provider may mark the trigger point with a skin marker.Once your provider has identified the trigger point by feeling it, they’ll pinch the point between their fingers and stabilize the tissue. This may feel uncomfortable.They’ll insert a thin needle attached to a syringe into the trigger point and rhythmically continue needling the area by repeatedly inserting and retracting the needle without completely withdrawing the needle from the muscle or your skin.You’ll likely feel your muscle spasm or twitch. Your provider will continue the motion in multiple directions until the muscle twitching has stopped or until the muscle feels adequately relaxed.Your provider will then inject the area with a local anesthetic with or without corticosteroid or botulinum toxin.The procedure will be over and you’ll be able to go home.How painful is a trigger point injection?Trigger points are typically painful to the touch, so you’ll likely experience some pain when your healthcare provider is manually locating the trigger point before the injection.You may feel a stinging and burning sensation when your provider inserts the needle and medication. When the tip of the needle touches the trigger point, you may feel a brief increase in your pain. Although this may be uncomfortable, this pain is a good sign that the needle is in the correct spot.What should I expect after a trigger point injection?After a trigger point injection, you can go home and can actively use the affected muscle. However, you should avoid strenuous activity for the first few days.Risks / BenefitsWhat are the benefits of trigger point injections?Trigger point injections are generally safe and can provide pain relief to people who have been experiencing pain associated with trigger points and have not found relief using more conservative treatments, like over-the-counter pain medication or physical therapy.Trigger point injections can also provide significant improvement in range of motion and overall muscle functionality, depending on which muscle is affected.What are the risks and side effects of trigger point injections?Trigger point injections are generally safe and carry a low risk of complications. The most common side effect is temporary discomfort or numbness around the injection site. Your healthcare provider may recommend treating this with acetaminophen (Tylenol®) or ibuprofen (Advil®). You can also apply ice packs to injection sites to reduce the risk of bruising.Complications of trigger point injections, which are rare, can include the following:Bleeding.Infection.Bruising.Allergic reaction to the anesthetic agent.Vascular (vein) injury.Recovery and OutlookHow long do trigger point injections last?Most people experience pain relief starting between 24 and 72 hours after the trigger point injection procedure. Pain relief typically lasts for about a month. If you’re still experiencing pain after this time, your healthcare provider may recommend additional injections to achieve long-term pain relief.When to Call the DoctorWhen should I see my healthcare provider?If you’ve received a trigger point injection and are experiencing signs of infection, such as a fever or warmth at the site of the injection, contact your healthcare provider.A note from Cleveland ClinicTrigger point injections are a common and generally safe way to treat myofascial pain caused by trigger points. Although the procedure can be temporarily painful, the injection can provide pain relief for about a month if not longer. If you have a knot in your muscle that isn’t responding to conservative treatment, such as pain medications, talk to your healthcare about trigger point injections. They can answer any questions you have.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/26/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7243Questions 216.444.9134Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"