"Triptans: What They Are, Uses, Side Effects & Types800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/TriptansAdvertisementAdvertisementAdvertisementTriptansTriptans are a class of medications that treat migraines by changing how blood circulates in your brain and how your brain processes pain signals. They’re a first-line treatment for migraines, and some can also treat menstrual migraines and cluster headaches. They also come in many forms, including pill, nasal and injectable.ContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat are triptans?Triptans are medications that treat migraine headaches. They’re the first line of treatment for migraines and can also treat related headache conditions. They don’t prevent migraines (with only a couple exceptions), but they do stop them while they’re happening.A migraine isn’t just a bad headache. It’s a brain-related condition that can cause pain, vision loss or distortion, nausea, light or sound sensitivity, and much more (especially migraines with aura). For some, these symptoms are unbearable, and the only thing they can do is find a dark, quiet place to lie down until the migraine ends.Discovered in the 1980s, triptans were a key advance in treating and understanding migraines. In the early 1990s, sumatriptan (Imitrex®) became the first triptan to receive approval for treating migraines in Europe and the U.S., and several others followed.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the triptan drugs?Seven triptan medications currently have approval from the U.S. Food and Drug Administration. All triptans treat migraines, but some treat specific migraine types. Some also have the approval to treat children and teenagers. An easy way to identify these drugs is that all of them end in “-triptan.”The seven triptans are:Almotriptan (Axert®). This comes in an oral (pill you take by mouth) form. (The name-brand version of this drug is no longer available in the U.S., but generic forms are still in use.)Eletriptan (Relpax®). This comes in an oral form.Frovatriptan (Frova®). This comes in an oral form.Naratriptan (Amerge®). This comes in two oral forms.Rizatriptan (Maxalt®). This comes in an oral form.Sumatriptan (Imitrex®, Onzetra®, Tosymra®). This comes in oral, nasal (spray or powder you take by nose) and subcutaneous (shallow injection under your skin’s surface) forms. There’s also an oral form (Treximet®) that you take with the nonsteroidal anti-inflammatory drug, naproxen.Zolmitriptan (Zomig®). This comes in oral and nasal forms.How do triptans work?Triptans work by helping your brain to manage migraines. There are a few different effects they have, and those effects can contribute to why these drugs work. But to understand how they work, it helps to know more about the processes behind why you feel pain.How pain worksNerves throughout your body don’t actually feel pain. Instead, they signal your brain when they detect signs of possible injury or illness in or on your body. Your brain gets those signals and translates them into the feeling of pain.Your brain also doesn’t have its own nerve endings, so it doesn’t receive signals from itself that tell it to feel pain. That’s part of why scientists still don’t fully understand how migraines work. The true explanation probably involves multiple processes, some of which include:Neuron activation. Neurons are a type of nervous system cell that make up your brain, spinal cord and nerves. Migraines seem to activate certain neurons in a way that your brain translates into migraine symptoms, especially pain.Blood circulation. Migraines seem to involve changes in blood vessel width, affecting how much blood can flow through them. Triptans affect blood vessel width, which supports this theory.Inflammation. Inflammation is part of your body’s self-protection and self-repair processes. Migraines seem to involve chemicals that cause or contribute to inflammation.How triptans affect those processesNeurotransmitters connect with cells in different parts of your nervous system. These cells have receptors. Receptors are like locks and neurotransmitters are the keys. If the right neurotransmitter locks onto the right kind of receptor, it tells the cell to activate and do a specific job.Triptans mainly activate the three types of serotonin receptors:5HT1B receptors: These control the width of blood vessels in your brain, which changes how much blood can flow through those vessels. That affects blood circulation, which is the effect that led researchers to create triptans in the first place.5HT1D receptors: These affect how certain parts of your brain release neurotransmitters. The parts of the brain affected are in the trigeminal system, which plays a role in how you feel pain.5HT1F receptors: These also affect how areas of your brain release neurotransmitters, which limits pain signaling.While experts understand a great deal about migraines, more research is necessary to understand how these processes and parts fit together. That will lead to even more effective migraine treatments, including preventive therapies, in the future.AdvertisementWhat conditions do triptans treat?Triptans treat migraines, including migraines with and without aura and cluster headaches. Ask your healthcare provider which is right for you.What is off-label prescribing?“Off-label” prescribing is when a healthcare provider prescribes a drug that doesn’t have specific approval to treat a condition but is very likely to be effective and has little or no risk of causing problems. Off-label prescribing is a legal, ethical and medically encouraged practice.Triptans are medications where off-label prescribing is common because these drugs all work very similarly. If an approved drug doesn’t help or causes problematic side effects, your provider may prescribe a drug off-label as an alternative. Likewise, most triptans don’t have approval for treating teenagers, but providers can still prescribe triptans off-label to teens.Are triptans commonly prescribed?According to the U.S. Agency for Healthcare Research and Quality, 955,000 people filled a prescription for rizatriptan and 1.66 million people filled a prescription for sumatriptan in 2020 (the most recent year with available data). That means millions of people in the U.S. take triptans each year.AdvertisementRisks / BenefitsWhat are the potential benefits of triptans?Triptans were a key breakthrough in treating migraines because they have so many advantages over other drugs. The advantages include:Fewer and less severe side effects. Triptans have far fewer side effects than older drugs used to treat migraines. The side effects of triptans are also less severe in general.They’re not habit-forming. Many other medications that treat migraines, especially opioid painkillers, can be habit-forming. Triptans aren’t.They’re safe. In general, triptans are a very safe class of medications. Sumatriptan, in particular, is safe enough that some countries (such as Germany and the United Kingdom) allow over-the-counter (OTC) sales of it.They come in many forms. Triptans are available in multiple forms, including regular and dissolving pills taken by mouth, nasal spray, nasal powder and through an injection.What are the possible disadvantages, side effects and complications of triptans?There are some possible side effects of triptans. You also might not be able to take triptans for certain reasons, such as if you have certain conditions or health circumstances (these are called, “contraindications”).One particular drawback of triptans is that they don’t prevent migraines. The only exceptions to that are menstrual migraines. Some triptans can help prevent menstrual migraines if you take them two days before your period starts (your provider will give you specific instructions on how to use these drugs preventively).Another possible drawback of triptans is how often you can take them. Some people need more than one dose of medication to get relief from a migraine. Some triptans have limits on how often you can take them, and taking them too often can cause side effects or make them less effective in the long run. Taking them too often can even worsen the frequency of the headaches.Triptan side effectsSide effects of triptans include:Chest pain (rare).Dizziness.Drowsiness or fatigue.Flushing.Nausea.Neck pain.Sweating.Tingling, numbness or a “pins and needles” feeling in your hands or feet (paresthesia).Weakness.Recovery and OutlookHow long can I stay on triptans?Triptans aren’t medications you take regularly. They’re “rescue” medications, meaning you take them to “rescue” yourself from a migraine. Some people can use triptans as needed for years or even decades.It’s also common for people to have fewer migraines as they get older (especially after menopause for women and people assigned female at birth). Those individuals may simply not need to take triptans because their migraines naturally go away or become very infrequent.Can I work or drive if I’m taking triptans?Triptans don’t affect your ability to work or drive. In fact, many people who wouldn’t be able to work or drive because of a migraine can keep on doing these things when their triptans are effective.What are the reasons I can’t take triptans?Reasons you might not be able to take triptans include:Drug interactions. Triptans may interact with other medications, including other drugs for migraine that contain ergotamine. Be sure to tell your healthcare provider about all medications, vitamins and supplements you take so they can advise you about drug interactions.Heart and circulatory problem history or risk. You might not be able to take triptans if you have heart disease, unmanaged high blood pressure (hypertension) or peripheral artery disease (PAD). Your provider may also advise against them if you have a history or risk of arrhythmias (irregular heart rhythms), heart attack, stroke or transient ischemic attack (TIA).Pregnancy or breastfeeding. If you’re pregnant, may become pregnant or are breastfeeding, you should discuss triptan use with your provider.When to Call the DoctorWhen should I call my healthcare provider?You should call your healthcare provider if you notice that side effects from triptans are disrupting your life or if your triptan medication loses effectiveness.When should I get medical attention?Serious side effects of triptans are possible but extremely rare, affecting less than 1% of people who take these drugs. You should get medical attention immediately if you have heart- or stroke-related symptoms.Heart-related symptoms include:Chest pain or discomfort (your provider can explain the difference between normal triptan-related sensations and ones that indicate a problem).Heart palpitations.Irregular heart rhythms, including a heart rate that’s too fast (tachycardia) or too slow (bradycardia).Shortness of breath (dyspnea).You should get help if you have stroke-related symptoms, especially hemiplegia. It’s impossible to tell when hemiplegia (one-sided weakness, numbness or paralysis) is a migraine symptom or a stroke symptom, and waiting to see can cause delays in care that can lead to permanent brain damage or death.Migraines can cause many symptoms that are similar to a stroke. If you have these symptoms and have never had a migraine before, you need emergency medical care right away.If you have a history of migraine and experience stroke-like symptoms, it’s best to err on the side of caution and get medical care. After a provider diagnoses you as having migraines, talk to them about symptoms to watch for that would indicate you need emergency care.Additional Common QuestionsWhat is the best triptan for migraines?The best triptan for migraines can vary from person to person. Sumatriptan is the most prescribed, but it might not be the right drug for some people. Your healthcare provider can help you find the right triptan — and the right form of the medication, whether that’s oral, nasal, injection or otherwise — to meet your needs.A note from Cleveland ClinicBefore triptans, migraines were much harder to treat. Today, millions of people get relief from migraine symptoms thanks to these drugs. You don’t have to suffer through the symptoms if you have migraines. Talk to your healthcare provider or a migraine specialist about whether or not triptans can help you. Triptans might make the difference between going about your day like you want and hiding from the world until the migraine passes.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/09/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"