"Tubal Ligation Reversal: Purpose, Procedure, Risks & Success800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Tubal Ligation ReversalAdvertisementAdvertisementAdvertisementTubal Ligation ReversalTubal ligation reversal is a surgery that reopens your fallopian tubes after tubal ligation (having your tubes tied). It may be an option to restore your fertility if you decide you want to have a baby. Your healthcare provider can advise you on whether this surgery is right for you. They can talk you through alternatives like IVF if reversal isn’t possible.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a tubal ligation reversal?Tubal ligation (sometimes called “having your tubes tied”) is an operation that prevents pregnancy by tying, cutting or burning your fallopian tubes. A tubal ligation blocks your fallopian tubes so that an egg and a sperm can’t meet. As a result, fertilization can’t take place.After tubal ligation, the only options for becoming pregnant is either tubal ligation reversal surgery or in vitro fertilization (IVF). You don’t need fallopian tubes to become pregnant with IVF. Both options have their pros and cons.Tubal ligation reversal is surgery to undo a tubal ligation. A tubal ligation reversal reconnects or reopens your tubes, creating a passageway for eggs and sperm to unite so that conception can occur. It reverses a tubal ligation, allowing you to become pregnant again.Tubal ligation reversal is also called tubal reversal, tubal sterilization reversal and tubal reanastomosis.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho’s a good candidate for tubal ligation reversal?You’re a good candidate for tubal ligation reversal if there’s a good chance you can become pregnant after surgery. The likelihood of success depends on multiple factors, including:Your age. Your chance of getting pregnant naturally decreases with age. Younger age is associated with higher pregnancy rates and lower risks for miscarriage and having a baby with a congenital disorder.Other infertility causes. Irregular periods, uterine fibroids, scarring in your pelvis or endometriosis (a condition where the tissue lining your uterus is also present outside of your uterus) may reduce your chances for success after a tubal ligation reversal.Your partner’s sexual health. The health of your partner’s sperm influences whether you’re a good candidate for surgery.Your tubal ligation procedure. The type of tubal ligation you had will determine how successful tubal reversal will be. Tubal ligation procedures where your healthcare provider uses clips or rings to tie your tubes are easier to reverse than procedures that involve burning your fallopian tubes (electrocautery).Your fallopian tube length. Your healthcare provider will need an adequate length of healthy fallopian tube segments to work with to reconnect your tubes.What types of tubal ligation can't be reversed?If most or all of your fallopian tube has been removed or the end of the tube cut off, reversal isn’t possible. Essure® and Adiana® are sterilization devices previously marketed as non-surgical alternatives to tubal ligation. They involved inserting devices through your vagina and into your fallopian tubes, creating a blockage to prevent sperm from reaching an egg. Both have been taken off the market (Adiana® in 2012 and Essure® in 2019). The effects of these devices on your fallopian tubes can’t be reversed.See your healthcare provider if you’ve used these products and wish to become pregnant.AdvertisementProcedure DetailsWhat happens before tubal ligation reversal?Your healthcare provider will explain the procedure and review any risks. They’ll perform the following to ensure you’re a good candidate for surgery:Medical history. Your provider will perform a thorough review of your medical history. They’ll ask about your pregnancy history, tubal ligation surgery and any other pelvic surgeries.Semen analysis. Your provider will assess the quantity and quality of your partner’s sperm to determine your likelihood of pregnancy following a tubal ligation reversal.Additional tests. Your provider may order blood tests and/or imaging procedures based on your medical history and test results.How do I prepare?It would be helpful if you brought a copy of the report from your tubal ligation operation to your first consult with your fertility doctor. If your tubes were removed, bring the pathology report, too.To improve your chances of having a healthy pregnancy:Ensure any current medical problems are well controlled.Don’t smoke.Reduce your alcohol and caffeine.Take a multivitamin or prenatal vitamin containing folic acid.AdvertisementWhat happens during a tubal ligation reversal?Tubal ligation reversal surgery lasts about two to three hours and takes place in a hospital. You’ll be able to go home the day of your operation.The procedure your healthcare provider uses will determine what happens during surgery. With mini-laparotomy, your provider makes a single 2-inch side to side incision just below your bikini line and performs the surgery through the cut using an operating microscope. With robotic-assisted laparoscopy, your provider operates a console that controls the robotic arms that perform surgery through several small incisions in your abdomen.During surgery, your healthcare provider will:Administer general anesthesia so that you’re asleep during the procedure.Insert a thin tube called a catheter into your bladder to collect your pee during surgery.Make a single incision or several smaller incisions to access your fallopian tubes.Assess whether your tubes can be reconstructed. If tubal reversal is an option, your surgeon will immediately proceed with surgery. They’ll open the blocked ends of your tubes and reconnect the segments of your fallopian tubes.Inject dye through your uterus to check if your fallopian tubes are open.Close your incisions with dissolvable sutures under your skin and place a bandage over the surgery site.Is tubal reversal painful?You’ll be asleep during the procedure, which means you won’t feel any pain. Your healthcare provider will prescribe pain medications after surgery to ensure that you’re comfortable once the anesthesia wears off. After the procedure, you’ll experience soreness at the surgery site.What happens after surgery?You’ll remain in the hospital for approximately two hours after surgery. In that time, your healthcare provider or care team will monitor you to ensure you’re safe to go home. Before you leave the hospital, your provider will give you medicine for pain, nausea or vomiting, as needed. They’ll also provide instructions on how to take care of yourself during recovery.You may feel sleepy or groggy for several hours after surgery as the anesthetic wears off. To be safe, you must have a friend or family member drive you home.Care at Cleveland ClinicFind Your Ob/GynMake an AppointmentRisks / BenefitsWhat are the advantages of tubal ligation reversal?The biggest advantage of surgery is that you can try to get pregnant every month and get pregnant more than once without any other fertility treatments.What are the risks or complications of this procedure?The risks with tubal ligation reversal are very low. As with any operation, however, complications can occur, including:Infection.Bleeding or blood clots.Allergic reaction to anesthesia.Damage to other organs during surgery.A tubal ligation reversal can increase your risk of ectopic pregnancy, but your overall risk is still very low. Ectopic pregnancies occur in 2% to 7% of pregnancies following a tubal reversal. With an ectopic pregnancy, a fertilized egg (embryo) implants in your fallopian tube instead of in your uterus. An ectopic pregnancy is a medical emergency that requires your healthcare provider’s attention.Recovery and OutlookWhat is the success rate of tubal ligation reversal?The pregnancy rate following tubal ligation reversal varies from 50% to 80%. Successful surgery depends on many of the same factors that shape whether you’re a good candidate for surgery, like your age and the length of your fallopian tubes following your tubal ligation. Your surgeon’s skill will also impact your surgery’s success.What is the recovery time?Most people resume normal activities within a week or two. Check with your fertility doctor to be sure.How long does it take to get pregnant after a tubal reversal?Most pregnancies happen within the first year or two following tubal reversal. You’ll need to wait two menstrual cycles before trying to get pregnant.How can I get pregnant without tubal ligation reversal?IVF is the other option for getting pregnant after a tubal ligation. It also has a high pregnancy rate but doesn’t involve any surgery. The disadvantages are that it involves many complex steps. For example, it requires about 10 days of injecting fertility drugs and several office visits for monitoring with ultrasounds and blood work.Your fertility doctor may recommend IVF if you’re not a good candidate for tubal reversal, or you may choose IVF if you prefer that to surgery.When to Call the DoctorWhen should I see my healthcare provider?A follow-up appointment will be scheduled with your surgeon a week or two following surgery. You’ll receive instructions on when to call if you have any problems before that visit. You should call as soon as you have a positive pregnancy test so you can be evaluated for a possible tubal pregnancy. Your provider may schedule an x-ray dye test (HSG) a few months after your procedure to make sure your fallopian tubes remain open.A note from Cleveland ClinicTubal ligation reversal may be an option if you’ve had a tubal ligation but would now like to try for a baby. Before proceeding with surgery, your healthcare provider will make sure you’re a good candidate for the procedure. Depending on factors like your age and the condition of your fallopian tubes, IVF may be a better option. Either way, a tubal ligation doesn’t have to mean you can’t have a baby. Ask your provider about what course of action is best for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/01/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind Your Ob/GynMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"