"Tube Feeding (Enteral Nutrition)800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Tube Feeding  (Enteral Nutrition)AdvertisementAdvertisementAdvertisementTube Feeding  (Enteral Nutrition)Tube feeding is needed when a person can't eat through their mouth, for whatever reason. Nutrition is delivered using a flexible tube inserted through the nose, or directly into the stomach or small intestine.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is tube feeding?Tube feeding is a therapy where a feeding tube supplies nutrients to people who cannot get enough nutrition through eating. A flexible tube is inserted through the nose or belly area to provide nutrients by delivering liquid nutrition directly into the stomach or small intestine.Doctors usually insert the tube while you are in the hospital, but you may continue to use it outside the hospital, at home, or in a nursing facility.Tube feeding is also known as enteral nutrition and if provided at home, is termed home enteral nutrition (HEN).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is tube feeding used?Tube feeding can help people who have trouble eating get the nutrition they need. Doctors often use it at the end of life to help people stay more comfortable, though some patients choose to opt out of tube feeding.It is not recommended for patients with severe dementia and in some cases where aggressive medical treatments are not called for.Your doctor may recommend enteral nutrition if your gastrointestinal tract (digestive system) works, but you cannot eat due to another disorder that affects your appetite or ability to chew or swallow.Conditions that may lead your doctor to recommend a feeding tube include:Gastrointestinal dysfunctionHead and neck cancers that make swallowing difficult or require throat surgeryGastrointestinal issues such as an obstructed bowelNeurological disorders including stroke and paralysisProcedure DetailsWhat should I expect from tube feeding?Doctors use different types of feeding tubes for HEN. The type of tube depends on the feeding route (stomach or small intestine) solution and how long you will receive this type of nutrition. Tubes can be:Nasally placed: A doctor inserts a tube through your nose and passes it through your throat into your small intestine (nasojejunal) or stomach (nasogastric). Doctors usually recommend this type of tube for people who will use a feeding tube for less than 6 weeks.Surgically placed: A doctor makes a small incision (cut) in your belly and inserts the tube into the small intestine (jejunostomy) or stomach (gastrostomy). Doctors usually recommend this tube for people who need feeding tube/enteral access longer than 4-6 weeks.After your doctor inserts the tube, you will receive instructions on how to care for it. Your doctor will also tell you what kind of tube feeding formula to use to receive proper nutrition.AdvertisementRisks / BenefitsWhat are the risks of tube feeding?The risks of home tube feeding are small, but complications can occur. These complications may include:Clogged, damaged or displaced tubeInfection at the tube insertion siteGastrointestinal problems including constipation, nausea and diarrheaLeaking of stomach contents at the tube sitePain at the tube siteRecovery and OutlookWhat is the prognosis (outlook) for people who use tube feeding?The length of time enteral nutrition lasts varies by the person. Depending on the reason for the tube, people may use a feeding tube for a few weeks, several months, or years.In some cases, people use a feeding tube for the rest of their lives after surgery or an injury impairs their ability to receive enough nutrition through eating.AdvertisementWhen to Call the DoctorWhen should I call my doctor?It’s important to take care of your feeding tube the way your doctor instructs you and to keep your insertion site clean. If you have pain, redness, swelling, excessive itching or leaking, call your doctor.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/16/2019.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"