"Tympanoplasty: Surgery Details & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/TympanoplastyAdvertisementAdvertisementAdvertisementTympanoplastyTympanoplasty is surgery to treat ruptured eardrums. If you have a ruptured eardrum, you have a hole in your eardrum that affects your ability to hear. Your healthcare provider may treat your ruptured eardrum with ear drops or antibiotics. If your eardrum doesn’t heal, your provider may perform tympanoplasty, accessing your eardrum and patching the hole.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewMiddle ear (top) with ruptured eardrum. Ruptured eardrum (bottom left) and eardrum with graft after tympanoplasty to repair rupture (bottom right).What is tympanoplasty surgery?Tympanoplasty is surgery to treat ruptured eardrums. Your eardrum (tympanic membrane) is the tissue separating your ear canal and your middle ear. When you rupture your eardrum, there’s a hole in your eardrum tissue. This hole keeps your eardrum from vibrating, which can affect your hearing.Many times your healthcare provider will treat your ruptured eardrum with ear drops or antibiotics. But if your eardrum doesn’t heal after two or three months, you may need tympanoplasty surgery to prevent problems like hearing loss, chronic infections and dizziness.Healthcare providers perform tympanoplasty surgery by accessing your eardrum and patching the hole. Studies show tympanoplasty surgery successfully treats ruptured eardrums in 93% of people who have the surgery.What causes ruptured eardrums?Your eardrum can rupture if:You have a middle ear infection (otitis media).You poked your eardrum while cleaning your ear with a cotton swab, bobby pin, pencil or another object.You have ear injuries caused by a loud explosion, a fractured skull or taking a hard hit on the side of your head.You develop barotrauma, a condition that can happen when your eardrum is affected by sudden changes in air pressure.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before tympanoplasty?Before surgery, your healthcare provider will examine your middle ear and hearing. Here are some steps they may take:They may examine your head and neck.They may examine your middle ear and eardrum with a microscope or otoscope so they know the location and size of your rupture, whether your eardrum is discharging any fluid or is dry and if there are signs of inflammation.They may use tests like audiometry, which checks whether you can hear different sounds and pitches and tympanometry, which checks how well your middle ear functions.They may ask you to complete a quality-of-life questionnaire so they understand how your ruptured ear affects your daily life.Your healthcare provider will use this information to decide which tympanoplasty technique is best for your situation.What are the different tympanoplasty techniques?All tympanoplasties involve patching your ruptured eardrum. The techniques differ in how your healthcare provider reaches your middle ear to repair your eardrum. Here is information on each technique:Postauricular tympanoplasty. Your provider makes a curved incision behind your auricle, which is the crease in your outer ear.Endaural. They make an incision above your ear canal.Transcanal. Your provider reaches your middle ear through your ear canal. They may use this technique if your eardrum hole is relatively small and located in the back of your eardrum.Is tympanoplasty major surgery?Yes, tympanoplasty is major surgery because you’re usually given general anesthesia.What else may happen before my tympanoplasty?Your healthcare provider may provide antibiotics to reduce the chance you’ll develop an infection. They may also shave your hair around your ear.What happens during tympanoplasties?Tympanoplasties are completed in steps, starting with obtaining tissue to patch the hole in your eardrum. (Providers may also patch the hole with a piece of synthetic material that integrates with your body.) Here is more information on the specific steps:Your healthcare provider starts by making incisions above or behind your ear or by going through your ear canal.They obtain a small piece of tissue called temporalis fascia to create the graft or patch. Your temporalis fascia is the connective tissue that lines your temporalis muscle, the muscle located on each side of your head near your temples. They may also use cartilage from your tragus (the bump in front of your ear.Next, your provider reaches your eardrum. They lift it to place graft material underneath your eardrum.Your provider then places foam over your eardrum to hold the graft in place while your eardrum heals. Over time, your eardrum grows new tissue, using the graft material as the foundation.They’ll close any incisions.What happens after tympanoplasty?You’ll likely go home after the surgery. However your healthcare provider may recommend you stay at the hospital for a night so they can watch for complications.Care at Cleveland ClinicRuptured Eardrum TreatmentFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the advantages of this procedure?Tympanoplasty repairs your damaged eardrum, reducing the chance you will lose your hearing or have long-term problems with chronic infections.What are the risks or complications of this procedure?Tympanoplasty complications are rare. The most common complications are graft failure, meaning your eardrum patch doesn’t solve the problem, your eardrum develops another hole during surgery, or your hearing is worse.What is the success rate of tympanoplasty?Studies show tympanoplasty is successful in treating 93% of people.Recovery and OutlookHow long does it take to recover from tympanoplasty?It can take 10 days to two weeks for you to recover from tympanoplasty. Plan on taking it easy during that time. Your healthcare provider will have at-home instructions for you to follow. Here are some general recommendations:Place a cotton ball in your ear if you notice a bit of blood coming from your ear. Call your provider if you have more bleeding than you expect.Don’t blow your nose for at least three weeks after your surgery. If you have to sneeze, keep your mouth open.Keep your ear dry. Your provider may suggest you not shower or wash your hair for the first few days after your surgery. When you can shower, place a cotton ball soaked with Vaseline in your ear.Is tympanoplasty surgery painful?You may have some moderate pain for the first few days after your surgery. Most people can manage any pain with over-the-counter (OTC) pain medication.AdvertisementWhen to Call the DoctorWhen should I see my healthcare provider?You should see your provider about two weeks after surgery. They’ll examine your eardrum to see how it’s healing. They may do follow-up hearing tests.While most people don’t have post-surgery problems, you should contact your provider if you notice the following problems:Your ear hurts more than you expect.You notice a foul-smelling fluid coming from your ear or your incisions.A note from Cleveland ClinicAnyone can rupture an eardrum. All it takes is going too deep —or with too much enthusiasm — when you clean your ears. Your eardrum can rupture if you develop a middle ear infection or you develop airplane ear. Many times your ruptured eardrum will heal on its own. But when it doesn’t, you may need tympanoplasty surgery so you don’t develop hearing loss, vertigo or dizziness. Being able to hear keeps you connected to your world. If you have a ruptured eardrum, ask your healthcare provider if surgery may be the solution.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/01/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicRuptured Eardrum TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"