"Ear Tubes (Tympanostomy): Definition & Procedure800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Tympanostomy (Ear Tubes)AdvertisementAdvertisementAdvertisementTympanostomy (Ear Tubes)Tympanostomy is surgery to place ear tubes. Ear tubes are small, hollow cylinders inserted into your eardrum. They’re often used in children or adults who have chronic middle ear infections or infections that have resisted treatment.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWith tympanostomy, an ear tube helps drain fluid from your middle ear.What is tympanostomy?Tympanostomy (tuhm-puh-NAA-stuh-mee) is a surgical procedure performed by an ear, nose and throat (ENT) specialist to place ear tubes. Tympanostomy is sometimes called ear tube surgery.What are ear tubes?Ear tubes are small, hollow cylinders made of plastic or metal that are inserted into your tympanic membrane (eardrum).How common is tympanostomy?Tympanostomy is one of the most common surgeries in children. Though less common, ear tubes for adults can be placed, too.Why do people get tubes in their ears?Ear tubes are most often placed in children who’ve had several middle ear infections (acute otitis media). They’re also used to treat buildup of fluid (effusion) in the middle ear that’s lasted longer than three months.In adults, ear tubes are most commonly used to treat barotrauma — a painful condition caused by air pressure changes. In addition to draining fluid from your ear, ear tubes let air in to prevent buildup of fluid in your middle ear.If these conditions aren’t treated, they can lead to larger issues, such as difficulties with speech or permanent hearing loss.What’s the difference between tympanostomy and myringotomy?Myringotomy involves making an incision (cut) in your eardrum to drain excess fluid from your middle ear. Sometimes, myringotomy is performed as a standalone treatment. Often, however, it’s combined with tympanostomy, which is the actual placement of ear tubes into your eardrum.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow can I prepare for tympanostomy?Your surgeon will talk with you about what to expect the day of your ear tube surgery. They’ll go over your medical history in detail and tell you if you need to stop taking any medications prior to your appointment. In most cases, you’ll also need to fast for several hours before your procedure.How is ear tube surgery performed?Ear tube surgery is usually performed under general anesthesia. Adults may be placed under local anesthesia, depending on the situation.During the surgery:Your surgeon makes a small incision in your eardrum.The fluid that’s trapped in your middle ear is drained or suctioned out.Your surgeon then inserts the ear tube into the incision in your eardrum. This allows fluid to drain out of your ear.In some cases, especially if you’ve already had a tympanostomy in the past, your surgeon may also perform an adenoidectomy (adenoid removal). Adenoids are tissue located above the roof of your mouth and behind your nose. They’re part of your immune system and help protect your body from viruses and bacteria. Removing your adenoids may prevent the need for future ear tube surgeries.Ear tube surgery is performed in the operating room or in your healthcare provider’s office. It usually takes fewer than 15 minutes — and because it’s an outpatient surgery, you’ll go home the same day.AdvertisementWhat can I expect after ear tube surgery?You’ll spend some time in the recovery room after ear tube surgery. You might experience some side effects from the surgery and anesthesia, including grogginess and nausea.Your surgeon will check on you after your procedure to make sure you’re doing well. They may prescribe antibiotic ear drops to treat infection. In addition, your surgeon may recommend wearing earplugs during certain activities, such as swimming and showering.After surgery, your surgeon will check on you every few months to monitor the tubes and make sure they’re functioning. They might recommend a hearing test as well.How long do tubes stay in ears?Your eardrum usually closes around the ear tube to keep it in place and prevent it from falling out early. In most cases, ear tubes fall out on their own in nine to 18 months. If your ear tubes don’t fall out within two years, your surgeon can perform ear tube removal.Care at Cleveland ClinicSchedule Ear Tube SurgeryFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the advantages of tympanostomy?Tympanostomy offers significant benefits, including:Reduced need for oral antibiotics during ear infections.Less pain or lower fevers during ear infections.Improved or restored hearing.Improved speech development.Reduced risk of sleep problems related to chronic ear infections.What are the side effects of getting tubes in your ears?As with any type of surgery, ear tube surgery may have certain complications. These include:The hole in your eardrum doesn’t close after the tube comes out. If this happens, the hole has to be repaired with another surgery.Scarring of your eardrums, caused by multiple ear infections or by the ear tube surgery itself.Repeated ear infections, even after ear tube surgery.Your ear tubes either fall out early or don’t come out at all.A condition called otorrhea (continuous drainage of fluid from your ear).Your eardrum may shrink or harden after several ear tube surgeries.Your ear tubes may become clogged due to earwax buildup.Recovery and OutlookHow long does it take to recover from ear tube surgery?Most people feel better in one to two days. During this time, you may experience mild pain. Take over-the-counter pain relievers to manage any discomfort.When can I go back to work or school?Most people can resume work, school and other normal routines 24 hours after their ear tube surgery.When to Call the DoctorWhen should I call my healthcare provider?Following ear tube surgery, you should call your healthcare provider if you develop:Ear pain that doesn’t go away with medication.Fever or chills.Ear bleeding.Increased ear drainage that continues after the first few days.A note from Cleveland ClinicIf you, or your child, experience chronic ear problems — such as infections, ear pain or hearing issues — tympanostomy might help. This common procedure opens the space between your outer and middle ear, equalizing air pressure and allowing any excess fluid to drain out. Talk to your healthcare provider about whether ear tubes are right for you or your child.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/08/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Ear Tube SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"