"Umbilical Cord Care & Appearance800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Umbilical Cord CareAdvertisementAdvertisementAdvertisementUmbilical Cord CareCaring for your child’s umbilical cord in the first few weeks of life is important to prevent infections. Once they’re born, your provider will cut the cord, which leaves a small piece hanging onto their body. This will naturally dry up and fall off within three weeks. Don’t pull the cord off on your own. Make sure the cord is dry and clean to prevent infections.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is the umbilical cord?The umbilical cord is the lifeline between you and your baby during pregnancy. The cord allows oxygen and nutrient-rich blood to flow to your baby. The cord also carries away the baby’s waste products. The umbilical cord connects your baby to your placenta and contains two arteries and one vein. After your baby is born, they don't need the umbilical cord any longer. Your provider will cut the umbilical cord, leaving a short piece of it, called a stump, attached to your baby’s belly button. The stump will naturally dry up and fall off within a few weeks after birth.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat does the umbilical cord look like?The umbilical cord is a flexible, tube-like structure that has a spongy appearance. A jelly-like substance surrounds the cord. After childbirth, your provider will clamp the cord and then cut it, leaving a stump (umbilicus) behind. Between one to three weeks, the stump dries up and falls off. As the stump dries, it shrinks and changes in color from yellowish-green to brown to black before falling off.Who has an umbilical cord?All newborns have an umbilical cord.AdvertisementWhy is umbilical cord care important?As your newborn’s caretaker, it's important that you make sure the cord stays clean and dry so it can fall off naturally. If the umbilical cord stump isn’t cared for properly, your baby is at risk of infection.Procedure DetailsWhat happens to my baby’s umbilical cord when they’re born?After birth, your baby is ready to breathe and eat on their own so they no longer need their umbilical cord. Your provider will place a clamp on your baby’s umbilical cord and cut it. This stops the flow of oxygen and nutrient-rich blood from you to your baby.AdvertisementDoes my baby have feeling in their umbilical cord?The umbilical cord doesn’t have nerves so your baby has no feeling in the cord. Your baby doesn’t feel pain when the doctor cuts the cord. The cord doesn’t hurt your baby as it dries, shrinks and falls off.How do I take care of my newborn’s umbilical cord?After your baby is born, you’ll need to take steps to care for the umbilical cord after your hospital stay. It’s important to keep the cord stump clean and dry to prevent infection. You can take care of your newborn’s umbilical cord by:Allowing the cord to air dry. Don’t apply topical substances, such as alcohol, to dry it.When diapering your baby, make sure to fold the front of the diaper down below the cord and in toward your baby’s tummy so that the cord can dry. Some newborn diapers have a special cut-out cord area.Sponge bathe your baby. Wrap your baby in a towel and wash each body part with a sponge or washcloth. Don’t bathe your baby in a bathtub until the cord falls off. Occasional wiping of the cord with plain water and allowing it to air dry doesn’t increase the rate of infection or make the cord take longer to fall off. This may be needed, especially if your baby pees or poops on the cord.Waiting for the stump to fall off: The stump will naturally fall off. Although it may seem like a good idea to help your baby’s stump come off sooner, don’t pull it off on your own, even if it seems to be dangling or hanging by a thread. Pulling off the cord may result in unnecessary bleeding and harm your baby.Watching for signs of infection: This may include redness and swelling. In some cases, there may be fluid discharge, foul smell or bleeding. Call your baby’s provider right away if you suspect an infection.How do I care for my baby’s belly button after the umbilical cord falls off?Your child’s belly button might bleed a little when the cord falls off. Bleeding is similar to a scab falling off and light bleeding is normal. If your child bleeds continuously when their cord falls off, visit the emergency room.A couple of days after the stump falls off your baby, continue giving them a sponge bath to make sure the entire cord removed itself and there is no bleeding from the area. Then, you can let your baby take a bath in a tub.Can I throw away my baby’s umbilical cord stump when it falls off?Yes, you can dispose of your baby’s umbilical cord stump after it falls off.Care at Cleveland ClinicFind a Pediatric Primary Care ProviderFind a Doctor and SpecialistsSchedule a Pediatric Primary Care AppointmentRisks / BenefitsWhat are the advantages of caring for the umbilical cord stump until it falls off?Taking care of your newborn’s umbilical cord stump prevents infections from forming and keeps your baby happy and healthy. The umbilical cord detaching from your child’s body is a natural part of their growth and development.What are the risks or complications at the umbilical cord site?Infections at the site of the stump can occur. The following symptoms are a sign of infection:The stump leaks a clear to yellow fluid (pus) that smells bad.The skin around your child’s umbilical cord changes color (red) or swells.Your child has a fever of 100.4°F (38°C) or higher.Your child is overly sleepy or lethargic (fatigue).Your child isn’t feeding well.Your child has a weak muscle tone (hypotonia).Infections can spread quickly. Contact your provider if you notice any symptoms of an infection in your newborn.Umbilical granulomaWhen your baby’s umbilical stump falls off, sometimes there’s a small amount of tissue that remains on their skin. This appears as a bump of scar tissue that is pink to red, located on the belly button. The granuloma can leak a yellow or clear fluid that usually goes away after a week. If the granuloma stays for longer than a week, see your baby’s pediatrician.Umbilical HerniaAn umbilical hernia is a small bump or bulge under your child’s belly button, giving it an “outie” appearance. This happens when part of your baby’s intestines get stuck in the opening of the abdominal wall. Umbilical hernias are painless and become more noticeable when your baby cries. A hernia will normally heal on its own within 18 months. If the hernia doesn’t heal on its own by the time your child turns five years old, your provider may need to surgically repair that part of your child’s abdominal wall.Can I use alcohol for umbilical cord care?Providers don’t recommend the use of alcohol for umbilical cord care. In the past, new parents used rubbing alcohol to clean the umbilical cord after a bath or diaper change. Today, research shows that this could destroy healthy bacteria that naturally help separate the stump from your baby’s body. Instead of using alcohol, gently wash your baby’s stump with a damp sponge or washcloth and let the cord air dry. You can roll down your baby’s diaper below their cord to prevent covering up the stump.Recovery and OutlookWhat is the recovery time?Your newborn’s umbilical cord stump should fall off within one to three weeks after birth. When the stump falls off and there is no bleeding, you can stop sponge baths and begin tub baths. Since the cord isn’t there anymore, you don’t need to fold the front of your baby’s diaper. Visit your baby’s provider if you notice their belly button is red or swollen or if their stump doesn’t fall off after three weeks.When to Call the DoctorWhen should I see my healthcare provider?Visit your child’s healthcare provider if their umbilical stump:Doesn’t fall off after three weeks.Leaks pus or fluid.Swells or turns red.Bleeds and doesn’t stop.If your baby has a fever or won’t feed normally, call your provider immediately.A note from Cleveland ClinicThe best way to care for your newborn’s umbilical cord is to keep it clean and dry. Make sure you fold your child’s diaper in the front so it doesn’t cover up the stump and make it harder for it to dry up. Avoid the temptation to help your child’s cord fall off by pulling on it. Talk to your provider if you notice signs of an infection, especially swelling, fever or your baby has trouble feeding normally.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/14/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Pediatric Primary Care ProviderFind a Doctor and SpecialistsSchedule a Pediatric Primary Care AppointmentAdAdvertisementAdvertisementAdvertisementCall Appointment Center 24/7 866.320.4573Questions 216.444.2200Request an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"