"Umbilical Hernia in Adults & Babies: Causes, Treatment, Surgery 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Diseases & Conditions/Umbilical HerniaAdvertisementAdvertisementAdvertisementUmbilical HerniaAn umbilical hernia is a tissue bulge on or near your belly button. Umbilical hernias in children usually disappear by age 4 or 5. In adults, untreated umbilical hernias can lead to complications. If your provider has concerns about an umbilical hernia, they may recommend surgery to put the tissue back into place.ContentsArrow DownOverviewSymptoms and CausesDiagnosis and TestsManagement and TreatmentPreventionOutlook / PrognosisLiving WithContentsArrow DownOverviewSymptoms and CausesDiagnosis and TestsManagement and TreatmentPreventionOutlook / PrognosisLiving WithOverviewThe most common sign of an umbilical hernia is a bulge on or near your belly button, where your small intestine pokes through your abdominal wall.What is an umbilical hernia?An umbilical hernia is an unusual bulge you can often see or feel over your belly button (umbilicus). It develops when part of your small intestine, together with fat or fluid, forms a sac. The sac pushes through an opening or weakness in your abdominal wall muscle.Umbilical hernias are most common in newborns, babies and young children. But adults can get them, too.What are the types of umbilical hernia?It can be helpful to think of hernias in terms of their risk. Generally, most hernias affecting newborns, babies and children are harmless. Umbilical hernias in adults aren’t always serious, but they pose greater risks of complications that usually require surgery.Reducible: If a hernia is reducible, a healthcare provider can use their hands to just push the herniated tissue back into place. They often don’t require immediate treatment. The majority of pediatric hernias are reducible.Incarcerated: An incarcerated hernia is more serious than a reducible hernia. It happens when your intestines get trapped in the bulging abdominal muscles, causing pain and tenderness. Your provider will need to act immediately to examine the tissue and prevent damage to your intestines.Strangulated: A strangulated hernia happens when the blood supply to your intestines is cut off, causing the tissue to die. It’s a medical emergency that requires quick action to save as much tissue as possible and prevent complications, like infection.How common are umbilical hernias?They occur in 1 out of 6 children (up to 20%) and affect both sexes equally. They’re more common in babies born prematurely or with low birth weight. Umbilical hernias are more common in babies that are Black, but researchers aren’t sure why.In adults, they affect about 2% of the general population. Still, they’re the second most common type of hernia, after inguinal (groin) hernias. Umbilical hernias are three times more common in women and people assigned female at birth (AFAB) than in men and people assigned male at birth (AMAB).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicySymptoms and CausesWhat are the symptoms of an umbilical hernia?Umbilical hernia symptoms are similar in adults and children. The most common sign is a visible bulge on or near your belly button that’s soft to the touch. In some people, it’s always visible. Other times, you can only see the bulge when there’s pressure in your abdomen.For example, you may not notice the bulge until you lift something heavy. In newborns and babies, sometimes the bulge doesn’t appear until they’re crying.They’re usually painless in children. Adults with umbilical hernias are more likely to experience discomfort, dull pain or pressure.Symptoms that should alert you of a problem with your hernia requiring emergency care (like incarceration or strangulation) include:Sharp, sudden or worsening pain in your abdomen.Bulge that’s red, darkened, purple and firm.Bloody stool (poop).Nausea and vomiting.What causes an umbilical hernia?Causes are different in children and adults.Umbilical hernia causes in childrenUmbilical hernias in children happen when the hole in their abdominal wall that allows the umbilical cord to pass through (umbilical ring) doesn’t fully close.During pregnancy, the umbilical ring allows the umbilical cord to pass from the mother (gestational parent) to the developing fetus. This connection allows the mother to share nutrients that help the fetus grow and develop. Once a baby’s born, the ring in their abdominal wall starts to close. It’s usually completely closed by ages 4 or 5. In the meantime, hernias can form through that opening.Umbilical hernia causes in adultsIn adults, umbilical hernias happen when pressure in your abdomen causes weaknesses in your abdominal wall muscles. Parts of your small intestine and related tissue can bulge through the weakened muscle.Several factors can increase your risk, including:Sex. People AFAB are more likely to get diagnosed with reducible umbilical hernias. However, people AMAB are more likely to have incarcerated hernias requiring immediate surgery.Obesity. Umbilical hernias are more common in adults with a BMI greater than 30.Multiple pregnancies. People who’ve given birth multiple times are at increased risk of umbilical hernias.Fluid buildup in your abdomen (ascites). Ascites are common among people with cirrhosis of the liver, who are at greater risk of developing umbilical hernias.Previous abdominal surgeries. Procedures on your abdomen that weaken the muscle wall can increase your risk.AdvertisementWhat are the complications of an umbilical hernia?In adults especially, reducible hernias can become incarcerated. The small intestine can get stuck in the hernia, causing problems like a small bowel obstruction (a blockage in your intestine). It can also progress to strangulation, which causes tissue to die.It’s important for you and your provider to monitor your hernia and time treatment to prevent serious complications.Complications can affect children, but this is rare. In children, complication rates for incarceration are as low as .07% to .3%.Diagnosis and TestsHow is an umbilical hernia diagnosed?A physical exam is usually enough to diagnose an umbilical hernia. Your healthcare provider may ask you to squeeze or tense your abdominal muscles so it’s easier for them to see and feel the bulge.To check for complications (like incarceration or an obstruction), they may use imaging to see inside your abdomen. Common imaging procedures include an abdominal ultrasound and a CT (computed tomography) scan.AdvertisementManagement and TreatmentDoes an umbilical hernia need treatment?In children, usually not, because most umbilical hernias go away in time. More than 90% of children with umbilical hernias heal by the time they’re 4 or 5 years old. In the meantime, your provider may be able to use their hands to push the hernia back into place.But you should never attempt to put your child’s hernia back into place. Although you may be trying to help your child, you’ll likely injure them instead.If your child does need treatment, surgery can help. Your child is more likely to need surgery if their hernia is:Incarcerated or strangulated.Larger than 2 centimeters, around three-quarters of an inch.Still present by the time they’re 4 or 5 years old.Painful.In contrast, most adults eventually need surgery. Umbilical hernias in adults are more likely to worsen and cause complications.Specific treatments used to treat umbilical herniasThe only treatment for an umbilical hernia is hernia repair surgery. During the procedure, a surgeon makes incisions (cuts) that allow them to access the hernia and push the tissue back into place. Then, they strengthen the abdominal wall muscle to hold the tissue in place. Sometimes, they use a material called surgical mesh to strengthen the tissue barrier.Care at Cleveland ClinicHernia RepairFind a Doctor and SpecialistsMake an AppointmentPreventionHow can I lower my risk of an umbilical cord hernia?There’s nothing you can do to prevent your child from having an umbilical cord hernia. Prevention isn’t always possible in adults, either.As an adult, you can reduce your risk of a hernia by avoiding repeated activities that create pressure inside your abdomen (like repeated heavy lifting). Also, trying to maintain a weight that’s healthy for you can reduce your risk of developing a hernia.Outlook / PrognosisWhat can I expect if I have this condition?Umbilical hernias have an excellent prognosis. In children, 90% of umbilical hernias close by the time a child is 4 or 5 years old. In adults, surgery can fix your hernia. The odds that it’ll come back (recur) are low.Will an umbilical hernia come back?It’s possible for an umbilical hernia to return after surgery, but it’s uncommon. Studies show that the recurrence rate in adults who have umbilical repair surgery involving surgical mesh (a material that helps hold the abdominal wall muscles together) is less than 3%. In children who have surgery, the recurrence rate is 2%.Some factors can increase the risk of a hernia returning in adults, including obesity and not managing your ascites.Work with your healthcare provider to reach a target healthy weight for you, and follow your treatment plan for reducing fluid buildup in your abdomen.Living WithWhen should I seek care?See a healthcare provider if you notice a bulge at your belly button. Once your healthcare provider diagnoses your hernia, they can advise you on when it may need surgery and when you can monitor it. If you or your child has a hernia, they can help you identify symptoms that should prompt you to seek care, including:Pain (signs of pain in an infant may include irritability, crying or refusing to eat).A bulge that’s getting bigger.Nausea & vomiting.Constipation.Bloody stool.A bulge that feels firm, is darkening or changing color.What questions should I ask my healthcare provider?Questions to ask include:How serious is my hernia?Does my hernia need treatment?How often will I need appointments to monitor my hernia?Should I adjust my activity levels or lifestyle to prevent complications?What lifestyle changes should I make to reduce the risk of my hernia worsening or returning?A note from Cleveland ClinicAn umbilical hernia’s seriousness has everything to do with who has it. In children, umbilical hernias are common and usually don’t cause problems. In adults, they’re considered more high-risk. Even if a hernia isn’t causing problems now, it can potentially cause issues in the future. If your provider’s concerned about complications, hernia repair surgery can help. This surgery puts herniated tissue back into place and secures it so that the chances of developing another bulge are low.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/21/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicHernia RepairFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"