"Upper Endoscopy: What Is It, Who Needs It, Risks & Benefits800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Upper EndoscopyAdvertisementAdvertisementAdvertisementUpper EndoscopyDuring an upper endoscopy, a digestive tract specialist (gastroenterologist) uses a scope to view the inside of the esophagus, stomach and duodenum (upper part of the small intestine). Doctors use the procedure to diagnose and treat acid reflux, stomach ulcers, celiac disease, gastrointestinal disorders and other digestive tract problems.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is an upper endoscopy?An upper endoscopy is a procedure to examine the upper part of the digestive tract. The procedure is also called an esophagogastroduodenoscopy, or EGD.A gastrointestinal (GI) doctor (gastroenterologist) uses an endoscope. The scope is a narrow, flexible tube with a light and small video camera. Through the scope, your doctor can view the inside lining of your:Esophagus: The tube that carries food from your mouth to your stomach.Stomach: The organ that holds food and starts the digestion process.Duodenum: The upper part of your small intestine.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho might need an upper endoscopy?You may need an upper endoscopy if you have unexplained:Abdominal pain.Bleeding in the upper digestive tract.Nausea and vomiting.Swallowing problems.Weight loss.Why do healthcare providers perform upper endoscopies?An upper endoscopy allows for a direct view and biopsies. It can be more accurate than X-rays in diagnosing problems in the upper digestive system. These problems include:Acid reflux (gastroesophageal reflux disease or GERD) and heartburn.Cancerous and noncancerous tumors.Inflammation, such as esophagitis, gastritis and duodenitis.Gastrointestinal disorders, such as celiac disease and Crohn’s disease.Stomach (peptic) ulcers.Swallowing disorders.AdvertisementWhat does an upper endoscopy treat?Healthcare providers can also do treatments with an endoscope. Your doctor may also use upper endoscopy to:Manage upper digestive tract bleeding.Stretch narrowed digestive tracts.Remove polyps, tumors or swallowed objects.What other procedures use upper endoscopy?Your doctor may combine an upper endoscopy with:X-rays: In endoscopic retrograde cholangiopancreatography (ERCP), doctors combine the two tools with injected dye. ERCP helps diagnose and treat problems that affect the liver, pancreas, gallbladder and bile ducts.Ultrasound: An endoscopic ultrasound (EUS) creates images of the digestive tract. EUS can also show surrounding organs, lymph nodes and tissue.AdvertisementProcedure DetailsWhat should I expect before an upper endoscopy?To help your doctor clearly view the digestive tract, you should go into the procedure with an empty stomach. Your doctor will review preparation with you. You may need to prepare with:Food and drink: Consume only clear liquids (broth, gelatin, popsicles, water, black coffee or tea) for six to eight hours before the procedure.Medications: Stop taking medicines that thin blood or affect blood clotting, including aspirin. You may need to switch medications for diabetes or high blood pressure. Follow your doctor’s recommendation.How is an upper endoscopy performed?An upper endoscopy is typically an outpatient procedure, meaning you go home the same day. The procedure may be uncomfortable, but it shouldn’t be painful. You’ll receive an intravenous sedative or another form of anesthesia. Someone should drive you home after the procedure.You lie on your left side during the procedure, which takes about 30 minutes. Your doctor:Administers a numbing spray to your throat and inserts a mouthguard to protect your teeth.Guides the endoscope through your mouth and down into the esophagus, stomach and duodenum.Pumps air through the endoscope into the stomach and duodenum to make it easier to see organs.Views images from the endoscope on a video monitor while looking for problems or performing treatments.Removes small pieces of tissue to biopsy (examine in a lab), if necessary.Performs treatments, if needed.What should I expect after an upper endoscopy?You’ll spend some time recovering while the sedative wears off before going home. An upper endoscopy can irritate your throat. You may be hoarse or have a cough for a few days. You can eat soft foods, drink ice water and use throat lozenges until the soreness subsides.After the procedure, you may experience some bloating (a swollen feeling from the pumped-in air) and nausea (an anesthesia side effect). With your doctor’s approval, you should be able to resume your usual activities, including working and driving, the next day.Risks / BenefitsWhat are the potential risks or complications of upper endoscopy?An upper endoscopy is a relatively low-risk procedure. Potential complications include:Allergic reactions to the sedative.Digestive tract bleeding or infection.Tear (perforation) in the digestive tract lining.Recovery and OutlookWhen should I get my test results?Your doctor may share diagnostic findings with you immediately. It can take up to two weeks to get biopsy results.When to Call the DoctorWhen should I call the doctor?You should call your healthcare provider if you experience:Chronic cough or coughing up or vomiting blood.Difficulty swallowing.Fever and chills.Rectal bleeding (black, tarry stool).Severe throat pain, chest pain or abdominal pain.A note from Cleveland ClinicAn upper endoscopy is a relatively low-risk procedure that helps your doctor find the cause of certain digestive tract problems. Your doctor may also use upper endoscopy to treat some problems. You may have a day or two of throat irritation and bloating after the procedure. If your doctor took biopsy samples, it could take a few weeks to get results.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/28/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"