"Ureteral Stents: What Are They, Procedure & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Ureteral StentsAdvertisementAdvertisementAdvertisementUreteral StentsUreteral stents hold open the ureters, tubes that allow urine to flow from the kidneys into the bladder. People may need them due to ureteral obstructions from kidney stones, ureteral stones, narrowed ureters or tumors. Most stents are temporary, but some people with chronic problems need ureteral stents for a longer time.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat are ureteral stents?Ureteral stents are thin, flexible tubes that hold ureters open. The ureters are part of the urinary system. Typically, these long, thin tubes carry urine from the kidneys to the bladder. Healthcare providers place ureteral stents to prevent or treat ureteral obstructions.Silicone or polyurethane (plastic) ureteral stents are about 10 to 15 inches long and about ¼ inch in diameter. They line the entire length of the ureter, keeping it open. The top part of the stent has a coil that sits inside a kidney. The loop at the lower end sits inside the bladder.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs ureteral stents?Sometimes ureters can become blocked so that urine can’t drain as usual. A ureteral stent can clear the ureter so your kidneys can work as they should.The most common use of ureteral stents is to allow urine to flow through the ureter around a kidney stone that’s blocking urine flow. Also, your provider may use a stent after breaking up kidney stones to prevent blockage from the passing fragments. Stents can also be used after kidney stone removal to prevent the ureter from getting blocked by postoperative swelling.Healthcare providers also use ureteral stents to treat ureteral obstructions due to:Blood clots.Inflammatory bowel disease (IBD).Scar tissue buildup from endometriosis or other conditions.Tumors.Ureteral stones.Ureteropelvic junction obstruction (an inherited condition that causes the ureters to narrow).Procedure DetailsWhat happens before ureteral stenting?Before a ureteral stent procedure, your provider may ask you to:Get blood tests to check kidney function.Give your healthcare team a list of the medications and supplements you take.Stop taking medications like aspirin that thin the blood.Fast (not eat or drink) for a specified amount of time before the procedure.AdvertisementWhat happens during ureteral stenting?Stenting is typically an outpatient procedure. You go home the same day. A urologist, a doctor who specializes in conditions that affect the urinary system, performs the procedure.Before the procedure, you receive anesthesia. Most often, you have general anesthesia, so you’re asleep. You lie on your back for the procedure. Your provider:Uses X-ray imaging (fluoroscopy) or a kidney ultrasound to locate the obstruction and guide the procedure.Inserts a small scope device with a lens (cystoscope) through the urethra and into the bladder. The urethra is the tube where urine leaves your body when you pee.Threads a thin, flexible wire (guidewire) through the cystoscope into the blocked ureter.Uses the guidewire to place the ureteral stent. A curled part of the stent sits in the kidney, while another curled part rests in the bladder. These coils hold the stent in place.Gently removes the guidewire and cystoscope, leaving the stent in place.What happens after ureteral stenting?Someone should drive you home when your provider says it’s safe to go. Your provider may recommend drinking lots of water after the procedure to help with kidney and bladder function.You may notice some blood in the urine and have some discomfort. These symptoms are normal after the stent placement and should gradually improve in a couple of days. However, you may see traces of blood and have discomfort until your provider removes the stent. You may also experience frequent urination and pain in the kidney that gets worse when you urinate as long as the stent is in place. The blood in your urine may come and go randomly.AdvertisementHow long will I have a ureteral stent?Most ureteral stents are temporary. Your healthcare provider will perform another procedure to remove the stent after the kidney stone passes, infection clears up or other problems resolve. You’ll probably have the stent for a few days or weeks.Some people need stents for months or years. People who have tumors that press on the ureters or narrowed ureters may need ureteral stents for an extended time. Your provider will replace the stent with a new one every three to six months. Replacing the stent reduces the likelihood of complications.How are ureteral stents removed?Some short-term ureteral stents have strings that hang outside the urethra, where pee comes out. Your healthcare provider gently pulls on the string to remove the ureteral stent.If you need a ureteral stent for a few weeks or longer, the stent won’t have a string. Your provider removes the stent during a minor office procedure. You may get X-rays or an ultrasound before removal. This imaging assures the provider that your kidney stone or other issue has resolved.To remove the stent during a procedure, your provider:Inserts a cystoscope through the urethra and into the bladder.Uses tiny clamps attached to the cystoscope to grab onto the stent.Gently removes the stent.Care at Cleveland ClinicUrology CareMake an AppointmentRisks / BenefitsWhat are the potential risks or complications of ureteral stenting?As many as eight out of 10 people with ureteral stents experience:Bladder irritation, bladder spasms (painful cramps) and frequent urination.Blocked, broken or dislodged stents.Blood in urine (hematuria) or painful urination.Infections, including urinary tract infections (UTI).Your healthcare provider will talk about your likelihood of risk. They will also tell you how to handle any worrying signs while the stent is in place.Recovery and OutlookHow can I relieve ureteral stent pain?Ureteral stents can be uncomfortable. You may have pelvic pain or a pulling sensation when you pee. Over-the-counter pain relievers such as nonsteroidal anti-inflammatory drugs (NSAIDs) can help.Do I need to restrict activities while I have a ureteral stent?You may need to restrict physical activities for the first week after the procedure. If your job doesn’t require lifting heavy objects, you should be able to return to work as usual within 24 hours after the procedure.Your provider may recommend not having sex for the first week after stent placement to reduce the risk of a UTI.What’s the prognosis for someone who has ureteral stents?Ureteral stents are generally safe. They don’t typically cause any long-term problems.Despite the risk of annoying side effects, ureteral stents are helpful. Ureteral stents often allow kidney stones to pass. They also work well to resolve ureteral obstructions. Left untreated, a ureteral obstruction can lead to life-threatening kidney failure and sepsis.When to Call the DoctorWhen should I call the doctor?You should call your healthcare provider if you experience:Clots of tissue in urine.Dark, cloudy or foul-smelling urine.Difficulty urinating or extreme pain or burning sensation when peeing.Kidney pain (dull ache deep on the left or right side of the spine).Nausea and vomiting.Signs of infection, such as fever or chills.Additional DetailsWhat is a kidney stent?Rarely, a healthcare provider can’t place a ureteral stent due to scarring or other problems. You may need a nephrostomy (kidney stent) instead. To perform nephrostomy, a radiologist inserts a stent (tube) directly into a kidney. The kidney stent drains urine from the kidney into a bag outside of the body, bypassing the ureters and bladder.A note from Cleveland ClinicUreteral stenting is an effective way to allow painful kidney stones to pass through the ureters and out of the body. Ureteral stents for kidney stones and ureteral stones are temporary. Some people need ureteral stents longer to keep narrowed ureters open. A ureteral stent can be uncomfortable and even slightly painful. Your healthcare provider can suggest ways to ease discomfort until it’s time to remove the stent.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/25/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicUrology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"