"Urethral Dilation: Purpose, Procedure, Risks & Results800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Urethral DilationAdvertisementAdvertisementAdvertisementUrethral DilationUrethral dilation is a quick procedure that treats scarring in your urethra. The procedure usually takes less than an hour. The short-term success rate is good, but scarring may come back and require additional treatment.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is urethral dilation?Urethral dilation is a minimally invasive procedure to treat urethral strictures. Your urethra is the tube through which urine (pee) flows out of your body. A stricture is a narrow band of scar tissue that can block the flow of pee. Urethral strictures can occur as a result of:Infection.Inflammation.Trauma.No obvious cause.During a urethral dilation, a surgeon (urologist) widens your urethra using long, thin rods (sounds) that gradually get thicker or a balloon they gradually inflate.If your stricture comes back (recurs) after one attempt at dilation, it’ll usually continue to come back even with another dilation. At this point, it’s generally best to move on to a more extensive surgery — urethroplasty. If you can’t or don’t want to undergo a urethroplasty, you can undergo repeat dilations. But you likely need to continue these at home or with your urologist as the scar tissue will keep coming back.What is a urethrotomy?A urethrotomy is a type of urethral dilation. During this procedure, a surgeon passes a pencil-sized lighted tube with a camera at the end (cystoscope) through your urethra to examine it. The cystoscope also contains a small knife (scalpel), which the surgeon will use to cut away scar tissue and widen your urethra.How common is urethral dilation?Urethral dilation is a common treatment for urethral strictures. It’s more common in men and people assigned male at birth (AMAB).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow should I prepare for urethral dilation?Before urethral dilation, you’ll meet with your healthcare provider. They’ll evaluate your general health. They’ll also take vitals (temperature, pulse and blood pressure). They’ll likely order imaging tests or perform a cystoscopy to determine the severity of your urethral stricture. They may also order a urinalysis. If the urinalysis reveals bacteria in your pee, you may need to treat the infection before you have urethral dilation. Tell your provider about any prescription or over-the-counter (OTC) medications you’re taking, including herbal supplements. Aspirin, anti-inflammatory drugs and certain herbal supplements can increase your risk of bleeding. Your provider will also give you specific directions on when to stop eating and drinking before the procedure. If you’re going to be put to sleep for the procedure, you shouldn’t eat or drink anything for at least six hours prior to the procedure. If you have to take prescription medications by mouth, take them with a small sip of water.Is urethral dilation a major surgery?No, urethral dilation isn’t major surgery. In most cases, it’s an outpatient procedure, so you don’t have to stay at a hospital overnight. You may go home after the procedure.How do you dilate a urethral opening?A special team of healthcare providers will perform urethral dilation. The team typically includes a urologist and nurses. It may also include an anesthesiologist. In most cases, your urologist will perform a urethral dilation while you’re under anesthesia. If your urologist performs a urethral dilation while you’re awake, they’ll inject a numbing lubricant into your urethra, so you’ll feel little pain or discomfort. After opening the blockage, your urologist may insert the cystoscope into your bladder to check for problems in your urinary tract. After dilating the stricture, a healthcare provider will insert a urinary catheter. A urinary catheter drains your pee from your bladder while your urethra heals.How long does urethral dilation take?Urethral dilation usually takes less than an hour to perform.AdvertisementWhat happens after urethral dilation?After the procedure, healthcare providers will examine the urinary catheter to ensure it’s working properly. They’ll also teach you how to care for it. Most people can stop using a catheter after a few days, and you should be able to pee more easily. If you have a catheter in place, you may experience bladder spasms — this is the sensation that you need to pee even though the catheter is draining your bladder. You may also notice blood in your urine (hematuria). As long as most of your pee is draining through the catheter, blood in your pee isn’t a cause for concern. In some cases, your urologist will give you dilation tools and teach you how to do urethral dilation at home after they remove the catheter.How painful is urethral dilation?Urethral dilation is moderately painful. You may feel pain or soreness in your urethra, and you may feel burning when you pee. You can manage pain with over-the-counter pain relievers. Your healthcare provider may prescribe pain relievers for severe pain.How long does urethral dilation pain last?Urethral dilation pain should improve after several days.Care at Cleveland ClinicUrethral Stricture TreatmentFind a Doctor and SpecialistMake an AppointmentAdvertisementRisks / BenefitsWhat are the benefits of urethral dilation?Urethral dilation helps relieve urethral stricture symptoms. You should be able to pee with more ease afterward.Is urethral stretching permanent?No, urethral dilation (stretching) usually isn’t permanent. You’ll likely need urethral dilation again or another procedure to help relieve your symptoms.What are the risks or complications of urethral dilation?Urethral dilation has a low long-term success rate. You may develop a urethral stricture again, which may require you to go through the procedure again or have a different procedure to open up your urethra.What is the success rate of urethral dilation?Urethral dilation has a success rate of up to 60% for urethral strictures shorter than 2 centimeters. But the success rate usually decreases over time. You may need urethral dilation again or a different procedure to treat your symptoms.Recovery and OutlookHow long does urethral dilation take to heal?Most people feel better within a few days of urethral dilation. However, your body is unique. Talk to your healthcare provider. They can give you a better idea of how long it’ll take to heal.To manage pain, some people take over-the-counter nonsteroidal anti-inflammatory drugs (NSAIDs), such as aspirin (Bayer®), ibuprofen (Advil®) or naproxen (Aleve®). Not everyone can take NSAIDs, so be sure to ask your healthcare provider for other medications if needed.When should I see my healthcare provider after urethral dilation?Your healthcare provider will tell you when to schedule follow-up appointments.During your follow-up appointments, your provider will remove your urinary catheter and will make sure you’re emptying your bladder. They may also measure how fast you pee and how strong your stream is.What can you do after urethral dilation?Most people should feel well enough to return to work or school and resume light physical activity after a few days. You may need to take more time off to heal if you have a more physically demanding job. Don’t participate in intense physical activity until your healthcare provider clears you.Your provider will also let you know when it’s safe to masturbate or have sexual intercourse. In general, avoid sexual activity for at least a week after urethral dilation.When to Call the DoctorWhen should I call my healthcare provider?Call your healthcare provider right away if you have any abnormal symptoms after urethral dilation. These symptoms may include:Inability to pee.A clogged catheter that isn’t draining.Infection, including fever, chills or new pain with peeing.Increased pain.Swelling.After you heal, call your healthcare provider if urethral stricture symptoms return. You may need urethral dilation again or a different procedure.A note from Cleveland ClinicUrethral dilation is a short, safe procedure to widen your urethra. The short-term success rate for the procedure is good. However, as time goes on, you may have urethral dilation again or a different procedure. Another procedure may be best for you, depending on the extent of your stricture. Talk to your healthcare provider about your questions or concerns. They’re here to help.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/30/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicUrethral Stricture TreatmentFind a Doctor and SpecialistMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"