"Urinary Diversion: What Is It, Types & Surgery Options800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Urinary Reconstruction & DiversionAdvertisementAdvertisementAdvertisementUrinary Reconstruction & DiversionUrinary reconstruction and diversion is a surgical method to create a new way to pass urine out of the body after the bladder has been removed.ContentsArrow DownOverviewRecovery and OutlookContentsArrow DownOverviewRecovery and OutlookOverviewWhat is urinary reconstruction and diversion?When your urinary bladder is removed (due to cancer, other medical conditions or because the organ no longer works), you need another way to pass urine through your body (pee). Urinary reconstruction and diversion are types of surgery done to help you do this.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyUrinary tract anatomyThe urinary tract normally consists of two kidneys, two ureters, a urinary bladder and a urethra:The kidneys filter your blood and remove water and waste through the urine.The urine travels from the kidney to the bladder through tubes called ureters.The urine is stored in the urinary bladder, and then moves through the urethra to be passed out of the body when you urinate.When the bladder is removed, urine needs to exit the body in a new way, through a urinary diversion. In all of the types of urinary diversions, a part of the intestine is surgically converted to either 1) a passage tube for urine to exit the body, or 2) a reservoir to store urine (like a normal bladder).Regardless of surgical method, urine and stool remain completely separate from each other. (They are two different systems — the urinary and digestive systems — respectively.)What are the urinary diversion options?There are three main types of urinary diversion surgeries:Ileal conduit urinary diversion.Indiana pouch reservoir.Neobladder-to-urethra diversion.For all of these procedures, a portion of the small and/or large bowel is disconnected from the fecal stream and used for reconstruction.Ileal conduit urinary diversionA segment of the intestine directs urine through a stoma into an external collecting bag.With this procedure, the ureters (the tubes that carry urine from the kidneys to the bladder) drain freely into part of the ileum (the last segment of the small intestine). The end of the ileum into which the ureters drain is then brought out through an opening in the abdominal wall. This opening, called a stoma, is covered with a bag that gathers the urine as it drains from the ileal conduit.Advantages and disadvantagesThe advantages of the ileal conduit urinary diversion surgery are:It is a relatively simple surgery.It requires less surgical time (compared with other surgical methods).There is no need for occasional catheterization (use of a tube to drain the urine)The disadvantages of the ileal conduit urinary diversion are:There’s a change in body image.It uses an external bag to collect urine, which might leak or have odors.Indiana pouch reservoirA pouch is made of portions of the intestines. It stores urine until it is drained via a catheter inserted through the stoma.With this type of surgery, a reservoir or pouch is made out of a portion of the large intestine (the ascending colon on the right side of the abdomen) and a portion of the ileum (the last segment of the small intestine). The ureters are repositioned to drain into this pouch. The urine flows freely in a downward direction from the kidneys into the pouch. This positioning prevents urine from backing up into the kidneys, which protects the kidneys from infection. A short piece of small intestine is then brought out through a small opening in the abdominal wall (a stoma). The stoma is very small and can be covered with an adhesive bandage.Unlike the ileal conduit, no external bag is needed. Instead, a one-way valve is surgically created to keep the urine inside the pouch. Several times a day (usually every four hours around the clock), a small, thin catheter must be passed through the stoma and into the pouch to empty the urine. An adhesive bandage is worn over the stoma at all other times (when not actively emptying the pouch).Most insurance policies will allow you to have enough catheters so that you can use a new one each time. If your policy doesn’t, or if you run out, catheters can be washed with soap and water and reused. The catheters don’t have to be sterilized. They can be taken on trips or social events and simply stored in a plastic bag.Advantages and disadvantagesThe advantages of the Indiana pouch reservoir surgery are:Urine is kept inside the body, in the reservoir, until it’s ready to be emptied.No external bag is necessary.There is no odor.The risk of urine leaking is minimal.The small stoma can be covered with an adhesive bandage.The disadvantages of the Indiana pouch are:The surgery takes longer compared with the ileal conduit.There is the need for occasional catheterization (the passing of tubing into the stoma to empty the pouch), every four hours around the clock.Neobladder-to-urethra diversionTheIntestine is made into a reservoir and connected to the urethra.This procedure most closely resembles the storage function of a urinary bladder. A small part of the small intestine is made into a reservoir or pouch, which is connected to the urethra. The ureters are repositioned to drain into this pouch.Urine is able to pass from the kidneys, to the ureters, to the pouch, and through the urethra in a manner similar to the normal passing of urine. To empty the pouch, you need to contract (tighten) your abdominal muscle.To be a candidate for this surgery, there must be a low risk of cancer recurrence (return) in the urethra. Occasionally, people aren’t able to empty adequately by contracting their abdominal muscles. In these cases, they must pass a catheter into the urethra to empty the pouch, up to six times a day. If this isn’t something you’re willing or able to do, you probably shouldn’t consider this type of diversion.Advantages and disadvantagesThe advantages of the neobladder-to-urethra diversion are:The process of urination most closely matches normal urination.No stoma is needed.The disadvantages of the neobladder-to-urethra diversion are:Surgery time is slightly longer than the ileal conduit urinary diversion procedure.While learning how to manage urination, urinary incontinence (leakage of urine) is normal after surgery, but might last up to six months. Also, about 20% of people with this diversion experience incontinence during the night and 5% to 10% of people have incontinence during the day and have to wear a pad.Despite the surgery, some people might not be able to empty their bladder well and will need to perform occasional catheterization (passing tubing through the urethra into the pouch every four hours) for a prolonged period of time after surgery, and perhaps permanently.AdvertisementRecovery and OutlookWhat can I expect after urinary reconstruction and diversion?After urinary reconstruction and diversion, it takes one to two months to feel well again and to regain your strength. Don't hesitate to call your doctor or other healthcare team members for assistance or if you have questions. Their goal for you is to get you back to your lifestyle as soon as possible.What restrictions will I face after urinary reconstruction and diversion?People with urinary diversions are usually able to return to the life, work and hobbies they previously enjoyed:Work: Most people can return to their jobs in one or two months, on average. If you have concerns about your line of work or other job hazards, be sure to ask your doctor.Activities: After the post-operative period, exercising and participation in sports and other activities is encouraged. Check with your doctor or healthcare team member.Diet: There are no eating restrictions. If you have special dietary concerns, ask your doctor or health care team member.Travel: There are no travel restrictions. You should travel fully prepared with necessary supplies, as you might not be able to purchase all supplies at your destination.A note from Cleveland ClinicAs with any life change, an adjustment period is normal after a major surgery. It's not unusual to feel a little depressed or discouraged. Talk about your feelings with friends and family. If you join a support group, other members may be able to help you deal with your emotions. (Ask your healthcare team member about support groups in your area.)Care at Cleveland ClinicUrology CareMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/14/2020.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicUrology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"