"Urostomy: Definition, Procedure & Care800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/UrostomyAdvertisementAdvertisementAdvertisementUrostomyIf you’ve had your bladder removed, or have damage to other parts of your urinary system, your best choice may be a urostomy. This is a new way to let urine out of your body through a stoma in your abdomen.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewA urostomy surgery creates a stoma (opening) in your abdomen to collect urine outside of your body if you’ve had your urinary bladder removed.What is a urostomy?If you’ve had a cystectomy (urinary bladder removal), you’ll need a new way to move urine (pee) from your kidneys to the outside of your body. This process is called urinary diversion, and one of the ways this can happen is to have a urostomy.In general, an ostomy surgery is one that creates an opening (stoma) in your abdomen to allow urine or stool (poop) to leave your body in a different way. There are three types of ostomies:Colostomy.Ileostomy.Urostomy.A urostomy surgery creates a stoma in your abdomen. The stoma is attached to a place in your urinary tract to let urine leave your body. You use a pouch, also called an ostomy bag, to collect the urine for disposal.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAre there different types of urostomies?Yes, there are different types, including ileal conduit, colonic conduit and continent urostomy. Sometimes procedures are named for the way the diversion is created.Ileal conduitOne type is an ileal conduit. During the urostomy surgery, your surgeon will use a piece of your small intestine to make a tube that will connect to the stoma. Your ureters, which take urine away from your kidneys, will be connected to the newly created tube. The urine flows through the tube to the stoma and then out of your body.Colonic conduitThis type of urostomy is similar to an ileal conduit. The difference is that your surgeon will use tissue from the sigmoid colon to create the tube.Continent urostomyIn some cases, your surgeon may create a new bladder or reservoir inside you from intestinal tissue. This is a continent urostomy. You may have a reservoir attached to the stoma that you can drain with a plastic tube.Some types of continent urostomies include:The Kock pouch: This procedure uses the end of your small intestine to make valves, the pouch and the outlet.The Indiana pouch: This procedure uses tissue from your large intestine to make the pouch and the tissue from the small intestine for the outlet. For the valve, your surgeon will also use the natural ileocecal valve, which is located where the small and large intestines meet.The Mitrofanoff procedure: This procedure can take many forms. Your surgeon can use tissue from your bladder, small intestine or colon to make the pouch. They can even use a combination of tissues. Your surgeon can use your appendix, a fallopian tube or part of the ureter to make the outlet.If you have a neobladder, a type of continent urinary diversion that uses tissue from the intestine to make a new bladder, you won’t need a stoma. Your surgeon will attach the neobladder to your urethra so pee leaves your body in the way that it did before. You’ll need to schedule times to drain the bladder because you won’t be able to feel the need to go to the bathroom.Why would you need a urostomy?Your provider may suggest a urostomy if your bladder has been damaged by trauma or disease or if it’s been removed. You might have your bladder removed if you have bladder cancer.Your provider might also suggest a urostomy if your bladder just isn’t working the way that it should be working. For some people, a urostomy is a better option than dealing with urinary incontinence, which means you can’t control when you pee.A urostomy is also an option for people with spinal cord injuries or congenital defects (like spina bifida) and for people with damaged urethras.Some babies are born with urinary tract abnormalities that make it difficult for them to pee successfully. Urine backs up and causes infections. Sometimes, these children will have urostomy surgeries.AdvertisementHow common are urostomies?There are about 130,000 new ostomies each year. Most are ileostomies and colostomies. The most common type of urostomy is the ileal conduit.Is a urostomy permanent?In almost all cases, a urostomy is a permanent procedure that can’t be reversed.AdvertisementCan you still pee after a urostomy?You’ll still be able to get rid of urine, but it won’t be in the way that you did it before. If you have an ileal or colonic conduit, you will drain urine continuously into a bag attached to the stoma (called an ostomy bag). If you have a continent urostomy, you will have scheduled times that you need to drain your pouch with a plastic tube called a catheter.Procedure DetailsWhat happens before a urostomy?Your healthcare team, including your surgeon, will speak to you before your surgery. They’ll make sure you understand:Why you need a urostomy.What will happen during the urostomy surgery.What to expect after the urostomy surgery.The possible risks related to the urostomy.Your team will give you specific information about not eating or drinking before your surgery and whether you should or shouldn’t take your normal medications. Make sure that you tell your team about every type of medication and supplement that you take.Before the surgery, you’ll meet with your providers to find a good spot for the stoma. The spot should be flat and easy for you to reach.What happens during a urostomy surgery?Your surgeon will perform the urostomy surgery while you are under general anesthesia. You won’t feel any pain. You may need to have bladder surgery at this time to remove part or all of your bladder.It’s possible that your surgeon may have to remove other organs, such as your appendix, lymph nodes or parts of your reproductive system. This is especially true in cases of cancer. The details depend on the type of procedure you have. For instance, if your surgeon is creating a neobladder, you won’t have a stoma.For other types of surgeries, the surgeon will create the stoma in your abdomen at the site you previously decided upon. The surgeon will attach the ureters to the tube leading to the stoma. The surgery could last as long as six hours.What happens after this procedure?You’ll be in a recovery unit until you move to a hospital room. You’ll probably have one or more drains to remove fluids, and you’ll get medication to relieve your pain.Your healthcare team will help you to get moving after your surgery. Sitting up, moving your legs and walking will help you to avoid blood clots and pneumonia.You’ll be able to start drinking and eating normally a few days after the surgery. Your diet may include food that helps with constipation.After a urostomy surgery, you’ll stay in the hospital for a period of time. Some people leave after three days, while others stay as long as seven days. During this time, you’ll learn how to take care of your stoma and use the necessary ostomy supplies.Care at Cleveland ClinicUrology CareMake an AppointmentRisks / BenefitsWhat are the advantages of a urostomy?If you’re having a urostomy surgery, it’s because you’ve had problems with parts of your urinary tract. The urostomy can make your life easier.What are the risks or complications of a urostomy?Generally, a urostomy procedure is very safe. However, risks with any type of surgery include:Difficulties with anesthesia.Infection.Organ damage.Blood clots or bleeding.Pneumonia.Later complications could include:Blockages.Skin irritation.Bleeding at the stoma.Recovery and OutlookHow long will it take to recover from a urostomy?After you come home from the hospital, you’ll still need about two months to be able to go back to work or school. During this time, you can practice becoming more comfortable with taking care of your urostomy.When to Call the DoctorWhen should I contact my healthcare provider?You should call your healthcare provider if you have any concerns about your urostomy. Call if you have:Fever.Unusual bleeding.Pain.Trouble using your ostomy supplies.Discolored or foul-smelling urine.Additional Common QuestionsWhat is the difference between a urostomy and a nephrostomy?A urostomy uses a tube (created out of your own intestines) to help you pass urine when your bladder has been removed or isn’t working correctly. The tube generally goes to a stoma that lets you collect the urine outside of your body in a bag or pouch. A urostomy is permanent.A nephrostomy also uses a tube to bypass the usual path that urine takes. However, for nephrostomy tubes, your provider inserts a plastic tube into your kidney and the urine then drains into a bag outside of your body. Nephrostomy tubes are not permanent (these plastic tubes need to be changed every six to eight weeks).What does a urostomy stoma look like?When you look at your stoma for the first time, it might look a little bit bruised, red and swollen. This should change over time. The stoma will get smaller and lighter in color. The stoma will look like an oval or a circle and it may stick out a little or be flat against your skin. It may look a little different from person to person.What does having a stoma feel like?The wound may hurt a little while it’s healing, but it’s your belly that hurts, not the stoma. You can use over-the-counter pain medications to manage it temporarily. The stoma itself has no nerve endings and doesn’t have any sensation. Once the surgery wound heals around the stoma, you won’t feel it.You might have a variety of emotional feelings about having a stoma or an ostomy. You might worry about how other people in your life will feel about it. Your ostomy nurse can help talk you through this. They can also connect you with ostomy support groups.How often do you change a urostomy bag?You’ll need to empty your urostomy bag (pouch) about as often as you went to the bathroom before your urostomy. This could be every couple of hours or a little longer, but it could be more often if you drink a lot of fluids.It’s best not to wait until the bag is full, so you should empty the pouch when it’s filled halfway or a third of the way. Leaking could cause emotional distress and could also irritate your skin.At night, you’ll be able to connect your pouch to a larger drainage container so you’ll be able to sleep through the night.How often you change the pouch depends on the type of system you’ve chosen. Some bags are changed daily, while others are designed to last about three days and still others about a week.A note from Cleveland ClinicLife after a urostomy will be different in some ways, and many of those ways could be better than the old ways. It may take some time to get used to the new process and to deal with feelings about your urostomy. Certainly, there are many people living with ostomies and many support groups. These people are living longer and more fulfilling lives. You can be one of them. Talk with your healthcare provider about any concerns.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/14/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicUrology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"