"Uvulopalatopharyngoplasty (UPPP Surgery)800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Uvulopalatopharyngoplasty (UPPP Surgery)AdvertisementAdvertisementAdvertisementUvulopalatopharyngoplasty (UPPP Surgery)Uvulopalatopharyngoplasty, or UPPP, is a common surgery healthcare providers use to treat obstructive sleep apnea (OSA). UPPP widens your airway by removing or restructuring tissue in the back of your throat. Your healthcare provider may recommend this surgery if conservative treatments to manage your OSA, like CPAP, haven’t helped.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewDuring UPPP surgery, the surgeon removes and reshapes tissue inside your mouth, opening up space so you can breathe easier.What is uvulopalatopharyngoplasty (UPPP surgery)?Uvulopalatopharyngoplasty is surgery that opens your airway by removing or reshaping tissue in your throat (pharynx). It’s also called UPPP. You may need UPPP if you have obstructive sleep apnea (OSA).UPPP removes tissue blocking your airway so you can breathe (and sleep) more easily. Your surgeon may remove all or part of your:Soft palate: Soft flesh in the back of your throat that extends from the hard bony structure at the roof of your mouth (hard palate).Uvula: Teardrop-shaped tissue hanging in the back of your throat.Tonsils: Two fleshy mounds at the back of your throat.UPPP may be a standalone procedure. Often, healthcare providers perform UPPP alongside other procedures that also correct structural problems causing sleep apnea. UPPP may help if the tissue collapsing at night is in the back of your throat. You may need different or additional surgeries if you have structural issues in your nasal cavity, farther down your throat or elsewhere.When is UPPP done?UPPP may be an option if conservative therapies to manage OSA haven’t worked. First-line treatments include devices that open your airways, like a CPAP machine, and weight loss. Having overweight and obesity are risk factors for OSA.Research has shown that uvulopalatopharyngoplasty provides the most benefit based on the anatomy of a person’s mouth and throat and their weight. Healthcare providers use a staging system based on these characteristics to determine who is a good candidate for UPPP.Providers consider:The size of your tonsils.The positioning of your soft palate in relation to your tongue.Your body mass index (BMI).Providers classify potential candidates for UPPP into Stages 1, 2 or 3. People who are Stage 1 will likely experience symptom improvement following UPPP. People who are Stage 2 and 3 are less likely to benefit from UPPP.Ask your healthcare provider about the factors that play a role in determining whether you’re a good candidate for this surgery.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow should I prepare for UPPP surgery?Your healthcare provider will review the steps you need to take to prepare for UPPP. Before surgery:Review your medical history with your provider.Tell your provider about any medical conditions or past procedures, including any reactions to anesthesia. Let them know whether you’re pregnant or plan to become pregnant. Inform your provider of any medicines or supplements you’re taking.Stop using tobacco products.Tobacco use, including smoking, using e-cigarettes and chewing tobacco, slows your healing time. Work with your healthcare provider to develop a plan to quit if you use tobacco.Follow your provider’s guidance on when to fast or stop taking medicines. Your provider will tell you when you should stop eating or drinking. Follow their advice on what medications you should take or avoid in the days leading up to surgery.Arrange for someone to drive you home and care for you. You’ll need someone to drive you home after you leave the hospital. If possible, arrange to have a loved one care for you for at least 24 hours after discharge.Plan to bring your CPAP machine to your procedure. Follow your provider’s instructions on using your CPAP machine (if you use one) in the days leading up to your procedure. Bring it with you to the hospital.Alert your provider if you get sick. You may need to postpone surgery if you get sick. Let your healthcare provider know if you’re not feeling well.What happens during the procedure?During surgery:You’ll receive a sedative to help you relax and anesthesia to put you to sleep. You’ll be asleep for the entire surgery.Your surgeon will prop your mouth open and stabilize your tongue so they can easily access the tissue in the back of your throat. They’ll position your head and neck so your airway is clear.Your surgeon will mark the tissue that needs to be removed.Your surgeon will remove all or part of your tonsils, uvula and possibly some of your soft palate. They may use a sharp instrument or electrocautery. Electrocautery uses heat to make cuts into tissue.They’ll close the wounds with sutures. The sutures may be dissolvable.How long does surgery take?Surgery may take up to two hours, depending on which structures your healthcare provider removes or restructures. Timing also depends on whether you’ll need additional procedures to address other structural issues contributing to your sleep apnea.AdvertisementWhat happens after UPPP?You may be discharged the same day or possibly stay in the hospital for one night. Your care team will monitor your vital signs closely. You’ll get to go home once your breathing has stabilized and you can safely swallow.Your provider will work with you to manage pain during recovery. Before you leave the hospital, they’ll prescribe pain medicines you’ll take at home.Care at Cleveland ClinicObstructive Sleep Apnea TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of uvulopalatopharyngoplasty?UPPP can help you breathe easier so you’re able to sleep at night. It can help you manage obstructive sleep apnea (OSA) and can reduce related symptoms like excessive snoring.How successful is it?UPPP is successful when it’s performed on people who are good candidates for this procedure.UPPP wasn’t as successful when healthcare providers first started performing the procedure in 1981. Often, symptoms improved after surgery only to gradually return. Results improved once healthcare providers began staging people to identify the best candidates for surgery. According to research, 80.6% of people who are Stage 1 experience symptom improvement after UPPP.Does it cure sleep apnea?UPPP eliminates sleep apnea entirely in some people. UPPP improves sleep apnea symptoms for others, but they still need to use a CPAP machine. Your response to treatment depends on your anatomy and other factors that you should discuss with your provider.AdvertisementWhat are the risks or complications of uvulopalatopharyngoplasty?All surgeries come with risks like infection and bleeding. You may be allergic to the anesthesia. Complications unique to UPPP include:Nasopharyngeal stenosis: Scar tissue builds up, causing your airway to narrow. This may cause your throat to feel tight, dry or like something’s stuck in your throat. Stenosis is a rare complication that may require additional surgery to correct.Velopharyngeal insufficiency: Your soft palate and your throat aren’t coordinating to close when they should. For example, liquid may travel up through your nose when you drink. When this happens following UPPP, it’s usually temporary.Changes in your voice: Your voice may sound more high-pitched or nasal for a short time after surgery. If your provider removes your entire uvula, you won’t be able to speak using uvular consonants. Uvular consonants are sounds made with the back of your tongue and your uvula. Danish, French, German, Hebrew, Swedish and other languages use uvular consonants.Discuss risks and potential complications with your healthcare provider before surgery so you know how to prepare.Recovery and OutlookWhat is the recovery time?Recovery may take two to four weeks or even longer, depending on how extensive your surgery was. Most people need to take time off from work or school while recovering.What should I expect during recovery?Follow your healthcare provider’s instructions about how to care for yourself after surgery. They can advise you on what symptoms are related to healing and which symptoms may be signs of a complication. Follow their advice on when it’s safe to use CPAP following surgery if you continue to use it.Weeks one and two: Avoid strenuous activity, but stay in motion to prevent blood clots from forming. Ask your provider which activities to avoid and which can aid your recovery.Weeks one, two and three: You’ll start with clear liquids after surgery. When you’re comfortable, you’ll advance to soft foods. Avoid spicy, acidic, hard or crunchy foods that could irritate your mouth. Choose foods and drinks that are cold or at room temperature.Up to a month: Your throat will be sore, especially when talking or swallowing. Your provider will prescribe pain medication to help.When to Call the DoctorWhen should I call my healthcare provider?Contact your healthcare provider if uvulopalatopharyngoplasty doesn’t improve your symptoms or if you notice signs of complications. Call if you notice:Your sleep apnea symptoms worsening.Blood in your saliva.Food getting stuck in your throat or trouble swallowing.Signs of an infection, like fever, redness, swelling or pus.When should I go to the ER?See a healthcare provider immediately or visit the ER if you have bleeding.A note from Cleveland ClinicUvulopalatopharyngoplasty, or UPPP, is a common surgery to treat obstructive sleep apnea (OSA). It may be an option if other methods to manage your OSA haven’t helped. Ask your healthcare provider about treatment outcomes based on your unique diagnosis, including whether you’ll need to continue using a CPAP. Understanding your treatment goals will help you throughout the recovery period and beyond.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/26/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicObstructive Sleep Apnea TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"