"Hair Loss Treatment Options & Information800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Hair Loss TreatmentsAdvertisementAdvertisementAdvertisementHair Loss TreatmentsA number of hair replacement procedures–including micro-grafting, slit grafting, punch grafting, and scalp reduction–are available to treat permanent hair loss. Find out who qualifies as a candidate.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsOverviewHow common is hair loss?Hair loss, or alopecia, is very common. Many conditions can cause it. Hair loss is divided into 2 categories:Scarring, which leads to permanent destruction of the hair follicle.Nonscarring, in which hair follicles remain intact.The vast majority of hair loss is nonscarring. It includes such conditions as pattern baldness and telogen effluvium, or excessive hair shedding.The majority of hair loss in both men and women is pattern baldness, also referred to as androgenetic alopecia. Both genetic (family) and hormonal factors play a role in pattern baldness.Another common cause of hair loss is excessive hair shedding. Common triggers for hair shedding include a major illness, surgery, rapid weight loss, nutritional deficiency, thyroid problems, stress, and certain medications.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat can cause hair loss?Medications, vitamins, or minerals: medications used to treat high blood pressure, heart problems, depression or gout; chemotherapy or radiation treatment for cancer patients; and in some cases, unusually high levels of vitamin A or low levels of iron or protein. For women, birth control pills can cause hair loss.Illness, including thyroid disease and severe infection.Scalp conditions, including psoriasis, seborrheic dermatitis, and folliculitis.Trauma, including traction alopecia resulting from certain hair styles that cause trauma to the hair follicles, and trichotillomania, or repetitive pulling and breaking of one’s own hair.Who is a candidate for hair replacement?Men with male-pattern baldness.Some women with thinning hair.A person who has lost some but not all hair as a result of burns or other scalp injuries.AdvertisementWho is not a candidate for hair replacement?Hair replacement is not recommended for the following patients:Women with a wide-spread pattern of hair loss.Those who do not have enough \"donor\" sites (hair-bearing portions of the head from which hair-bearing skin is taken).People who form keloid scars or thick fibrous tissue that can result from trauma, burning, or radiation injury.Those whose hair loss is due to medication.Procedure DetailsWhat are the treatment options for hair loss?Therapies for hair loss include:Identifying and treating the underlying cause.Minoxidil (Rogaine®) is FDA-approved for treating male and female pattern baldness. Minoxidil is a topical solution that is directly rubbed onto the scalp where hair growth is desired. It is available over-the-counter and does not require a prescription.Finasteride (Propecia®) is FDA-approved to treat male pattern baldness. Finasteride is not approved for female pattern baldness. Like all prescription products, finasteride should be given under a physician’s care.Hair transplantation or hair replacement surgery. Hair replacement surgery is a cosmetic procedure and includes such replacement procedures as micro-grafting, slit grafting, punch grafting, and scalp reduction.The type of hair loss, as well as the patient’s circumstances and desires, determine which hair replacement procedures are most suitable.AdvertisementCommon hair replacement procedures: graftingGrafting is an outpatient procedure performed in the dermatologic surgeon’s office. Micro-grafts contain only 1 to 2 hairs per graft, while slit grafts contain between 4 and 10, and punch grafts hold 10 to 15 hairs. A local anesthetic is injected into the scalp and sedation is available, if needed, for relaxation and comfort.How is hair grafting done?The dermatologic surgeon first removes a disc-shaped portion of the hair-bearing scalp from the back of the head. Then, the surgeon cuts the removed scalp into small segments with varying amounts of hair in each graft to achieve a very subtle thickening and \"natural\" look with this technique.With each session, 100 to 1,000 hair-bearing segments are transplanted. \"Donor\" sites are closed with stitches, which usually are then concealed by the surrounding hair. After the grafting session is complete, the scalp is cleaned and covered with gauze and, if necessary, a bandage. Stitches will be removed approximately 10 days later.Three to four sessions may be needed to achieve satisfactory \"fullness.\" After each session, a healing process of 2 to 4 months is usually recommended prior to the next procedure.Common hair replacement procedures: scalp reductionA scalp reduction is the removal of non-hair-bearing skin from the scalp so that the remaining hair-bearing skin can be stretched to fill in the bald area of the head. Scalp reduction can reduce as much as half of the bald area. It is a procedure performed to cover bald areas on the top and back of the head and is not found to be beneficial for the frontal hairline.How is scalp reduction done?The scalp is injected with local anesthetic and a bald segment of scalp is removed. The surrounding skin is then loosened and gently stretched so that the sections of hair-bearing scalp are brought together and closed with stitches. This procedure may also be performed during punch grafting sessions.Care at Cleveland ClinicGet Dermatology CareMake an AppointmentRisks / BenefitsWhat are the side effects of hair grafting?Most side effects that come with a hair transplant usually go away within 1 to 3 weeks. Among the most common side effects are:Swelling.Bruising around the eyes.Crust may form on the \"donor\" and \"recipient\" sites of the scalp.A lack of feeling or decreased sensation around the \"donor\" and \"recipient\" sites of the scalp.Itching in the \"donor\" site.What are the side effects of scalp reduction?Headache.Scalp tightness (temporary).Swelling (temporary).Scarring at the suture lines.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/10/2016.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Dermatology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"