"Hartmann's Pouch Procedure (Proctosigmoidectomy): Definition, Overview & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Hartmann’s ProcedureAdvertisementAdvertisementAdvertisementHartmann’s ProcedureHartmann’s procedure is a type of colectomy that removes part of the colon and sometimes rectum (proctosigmoidectomy). The remaining rectum is sealed, creating what is known as Hartmann’s pouch. The remaining colon is redirected to a colostomy. It can be reversed later.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewHartmann’s Procedure involves a colectomy of the sigmoid colon and a new outlet for the remaining colon in the abdominal wall.What is Hartmann’s procedure?Hartmann’s procedure, also called proctosigmoidectomy, is a surgical operation on the large intestine (colon). It’s a specific kind of colectomy, which means that part of the colon is removed. Hartmann’s procedure removes the last part of the colon, called the sigmoid colon, where it joins the rectum — and sometimes part of the rectum too. This is the end of food’s journey through the digestive tract, where it is almost ready to be expelled as poop. Hartmann’s procedure interrupts and redirects that journey.Hartmann’s procedure is often an emergency operation to remove an obstruction, persistent infection or cancer before it can spread. When a portion of the bowel is removed under these conditions, the remaining portions can’t be safely reattached at that time. Infection, inflammation and other factors make it too technically difficult or too dangerous to attempt rejoining the sections in the same surgery. The colon needs time to heal. So, Hartmann’s procedure seals the remaining part of the rectum and diverts the remaining part of the colon to a new outlet, called a colostomy.The surgeon will make a new opening in your abdomen and attach the remaining colon there on the inside. They'll give you a colostomy bag to attach to the outside of the opening. This is where your poop will come out. Hartmann’s procedure is often a life-saving intervention, and it involves a significant life change. But it’s not always permanent. After your colon has had a chance to heal, your surgeon will reevaluate your condition. If they find you fit for additional surgery, they can perform a reversal about 6-12 months after the first procedure, rejoining the colon to the rectum and closing the colostomy.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is Hartmann's procedure necessary?There are two parts to Hartmann’s procedure. First, it removes a portion of the lower bowel. Second, it redirects the remaining bowel to a colostomy. There are different reasons for these two parts.Why does part of the colon or rectum have to be removed?Any part of the colon may need to be removed if:It has stopped functioning due to an obstruction.It is bleeding or leaking due to a perforation (hole in the colon).It has a dangerous infection or disease that could continue to spread.Removing the unhealthy part of the colon saves the healthy part and allows the rest of your digestive tract to continue to function as normally as possible.Why does Hartmann’s procedure end with a colostomy?When surgeons remove part of the bowel and reconnect the remaining ends during the same surgery, it’s called “resection with primary anastomosis.\" This longer and riskier surgery is possible when you are in good overall condition and there isn’t a risk of infection or inflammation in your remaining bowel. Hartmann’s procedure treats those at higher risk and whose condition may be more complicated. The colostomy allows the surgeon to focus on solving the immediate problem at hand while leaving open the option to reverse the operation at a more appropriate time.What is Hartmann’s pouch?When discussing Hartmann’s procedure, doctors sometimes refer to the closed-off part of the rectum and anus as Hartmann’s pouch. (This is different from Hartmann’s pouch in the gallbladder.) Because the rectum side is sealed and the anus side is open, and the leftover length is relatively short, it’s like a pouch. It doesn’t have any special function, but doctors might discuss it as a separate part of the body to watch for infection or disease, especially if you’re having the procedure to treat diverticulitis or cancer.AdvertisementWhat conditions does Hartmann’s procedure treat?The surgery is most commonly performed for:Complicated diverticulitis, especially in stages III and IV, which involve peritonitis (inflammation and infection of the abdominal cavity).Colorectal cancer, particularly rectosigmoid carcinoma, which makes up 53%. It may be an emergency procedure if cancer causes an obstruction, perforation or bleeding.Other, less common reasons include:Other large bowel obstructions, usually caused by scar tissue.Tissue death due to ischemia (lack of blood flow).Complications of inflammatory bowel disease.Complications of prior bowel surgery, such as bowel leaking.Injury by trauma.Rectal prolapse.Procedure DetailsHow is Hartmann’s procedure done?Hartmann’s procedure may be performed through laparoscopic surgery or open surgery, depending on your condition. Traditional open surgery involves opening up the abdominal cavity to access the organs. Laparoscopic surgery is a newer method that uses smaller incisions aided by a tiny camera called a laparoscope. The laparoscopic method is less invasive and involves less recovery time, but it isn’t always possible to manage every condition laparoscopically. Some laparoscopic surgeries may have to convert to open surgery if they turn out to be more complicated than predicted.AdvertisementWhat happens before Hartmann’s procedure?You’ll be required to fast for six to 12 hours before the procedure. This is to make sure your stomach is empty for the surgery to prevent vomiting.If you are well enough, you will undergo a bowel preparation to help clear out your colon.When you come to the hospital, an intravenous (IV) catheter will be installed into your vein to give you continuous fluids.Your healthcare provider will discuss your pain medication options with you in advance.What happens during Hartmann’s procedure?You’ll be put to sleep under general anesthesia.You’ll be put on a ventilator to help you breathe.If your surgery is laparoscopic, your surgeon will begin with a small incision, through which they will introduce the laparoscope. The camera will project the organs onto a screen. They’ll make additional small incisions to access the colon.If you’re having open surgery, the surgeon will make one large incision through your abdomen to open up your abdominal cavity.The surgeon will retrieve the colon and identify the part to be removed.They’ll remove the unhealthy portion of the colon and seal off the rectal end.They’ll attach the other end of the colon to the abdominal wall, where they will make a new opening called a stoma.They’ll attach a colostomy bag to the outside of the stoma.They’ll close the surgical wounds.The process takes about two to four hours.What happens after this procedure?After surgery, you’ll be moved to a recovery room, where you’ll spend the next few hours.When your condition has stabilized, you’ll be moved to a hospital room, where you’ll spend the next seven to 10 days in recovery. Your healthcare team will continue to monitor your progress.Your IV will continue to deliver fluids, antibiotics and pain medication for the next three to seven days.Your bowels may take a few days to become functional again. You’ll be given a clear liquid diet initially and will progress gradually to more solid foods.Your healthcare team will provide consultation on caring for your stoma and using your colostomy bag.When can I go home?When your vital signs (heart rate, blood pressure, temperature, etc.) are stable.When you are able to get up and move around without assistance.When you are able to poop into your colostomy bag.When you are able to manage your pain with oral medications.When you are able to change and clean your colostomy bag.Risks / BenefitsWhat are the advantages of Hartmann’s procedure?Before Hartmann introduced his procedure in 1921, disease in the lower bowel was treated by permanently removing the entire sigmoid colon, rectum and anus. This more severe surgery is still necessary in some cases, but it has its disadvantages. It’s more difficult for the surgeon, riskier for the patient and it’s permanent. Hartmann’s procedure offers a faster, safer and less permanent alternative for cases where the immediate condition may be critical but the long-term outlook may be more optimistic.What are the possible risks or complications of the surgery?This surgery is considered relatively safe, but complications are always possible. They may include:Wound infection.Chest infection (pneumonia).Internal bleeding.Leaking colon.Damage to the surrounding organs.Hernia.Intestinal scarring that may cause later obstruction.Blood clots.What are the potential side effects of Hartmann’s procedure?Temporary ileus. After the procedure, your bowels may be slow to start working again. This is called ileus, or bowel paralysis. You may need temporary IV fluids or IV nutrition while your bowel recovers in the hospital.Anal discharge. Even though you won’t poop from your anus anymore, there may still be fluids inside that come out when you go to the bathroom. Most of the discharge will come out in the first week after surgery. However, your remaining rectum will continue to make mucus, so you may continue to have some occasional drainage.Sexual dysfunction. Sometimes surgery in the rectal area injures a nerve that is connected with sexual function. In women, this may cause extra sensitivity or pain during sex. In men, it may cause difficulty in ejaculating or maintaining an erection.Recovery and OutlookWhat is the recovery time from Hartmann’s procedure?It may take four to six weeks to:Wean off of prescription pain medications.Progress from a soft diet to a regular diet.Resume manual labor or vigorous exercise.It may take three to six months to:Adjust to life with a colostomy bag.Feel like you have physically recovered from the surgery.Begin discussing reversal surgery with your healthcare provider.When is Hartmann’s procedure permanent and when can it be reversed?Surgery is demanding on the body, especially following a major illness such as infection or cancer. Your surgeon will consider your fitness for additional surgery between six and 12 months after the first one. If you've healed well and are in good general health, you may choose to undergo reversal surgery.Factors that may advise against reversal surgery include:Severe systemic disease (ASA class III or higher).Preoperative sepsis (systemic infection).Disseminated malignancy (cancer that has spread beyond the original spot).Hypoalbuminemia (low blood protein levels).Dyspnea (labored breathing).Obesity.A note from Cleveland ClinicIf you’re someone undergoing Hartmann’s procedure, chances are it is saving your life. This can make the weight of the surgery easier to bear. Keep in mind that as surgeries go, Hartmann’s procedure is relatively fast and safe and the prognosis is generally good. The recovery and the adjustment to life with a colostomy are no small matter, but they're most likely saving you from cancer, systemic infection or permanent bowel dysfunction. You may even be able to reverse the procedure in six to 12 months’ time.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/19/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"