"Hearing Aids: Uses & How They Work800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Hearing AidsAdvertisementAdvertisementAdvertisementHearing AidsHearing aids are small electronic devices that amplify sounds and deliver them to your ear. These devices help people with hearing loss improve hearing and speech comprehension so they can participate more fully in daily life.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewA hearing aid has three basic parts to help it function, including a microphone, amplifier and speaker.What are hearing aids?A hearing aid is a small electronic device that you place in or behind your ear. Hearing aids amplify sounds so that people with hearing loss can improve their hearing and speech comprehension.There are many different types of hearing aids available today, including prescription and over-the-counter (OTC) hearing aids. Your healthcare provider can help you find a solution that fits your lifestyle and preferences.How do hearing aids work?Hearing aids contain different components that work together to amplify sound.The three basic hearing aid parts include:A microphone.An amplifier.A speaker (receiver).Sounds goes in through the microphone. Then, the microphone converts the sound waves to electrical signals before sending them to the amplifier. Finally, the amplifier sends the sounds to your ear through a tiny speaker.Hearing aid batteriesHearing aids are battery-powered. Some run on traditional (disposable) hearing aid batteries. But most of today’s hearing aids have a built-in rechargeable battery. In other words, you can charge your hearing aids just like you charge a smartphone.Who can benefit from hearing aids?Hearing aids work best for people with sensorineural hearing loss. This type of hearing loss is a result of damage to your inner ear or auditory nerve (the nerve that connects your ear to your brain). Causes of sensorineural hearing loss include:Aging.Disease.Infection.Loud noises.Certain medications.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWho performs hearing aid evaluations and fittings?Generally, audiologists perform hearing aid exams. Your primary care physician (PCP) or otolaryngologist (ENT) can refer you, but some audiologists will see you without a referral.First, a hearing care specialist will need to perform a hearing test. This test helps determine if you have hearing loss and whether you could benefit from hearing aids.If you’re a candidate for hearing aids, a hearing care specialist will perform a custom hearing aid fitting. They’ll help you find the right hearing aid for your needs and ensure a comfortable fit.Where can I buy hearing aids?You can purchase prescription hearing aids at any hearing or audiology clinic. In the United States, you can buy over-the-counter hearing aids without an exam, prescription or professional fitting, thanks to an FDA ruling in August 2022.Prescription hearing aids vs. over-the-counter hearing aidsPeople with perceived mild to moderate hearing loss may benefit from over-the-counter hearing aids. These hearing aid devices amplify sound — but they’re not customizable. (Think about the difference between prescription eyeglasses and “readers” you can buy at the pharmacy. Prescription devices are more customizable, and therefore typically more effective.) Over-the-counter hearing aids are more affordable than prescription hearing aids, but they’re not right for everyone. Talk to your healthcare provider to find out more.Prescription hearing aid devices are fully customizable based on your unique hearing needs. Many people with mild, moderate and severe hearing loss can benefit from prescription hearing aids. To get a custom hearing aid, you’ll need an exam, prescription and professional hearing aid fitting. Since prescription hearing aids are fully customizable, you’ll need to see your audiologist at least once a year for adjustments and recalibration. This ensures that your hearing aid works as effectively as possible.Care at Cleveland ClinicHearing Loss TreatmentFind a Doctor and SpecialistsRequest a Hearing Assessment in OhioRequest an Appointment in FloridaAdvertisementRisks / BenefitsWhat are the benefits of hearing aids?Wearing hearing aids offers many advantages for people with hearing loss.Hearing aids can:Help you hear better in different environments.Improve your communications skills.Improve comprehension when listening.Give you more independence.Reduce tinnitus (ringing in your ears).Are there complications regarding hearing aids?Hearing aids can improve your hearing, but they’re not a cure for hearing loss. In other words, wearing a hearing aid won’t restore your hearing back to normal. But it can amplify sounds in your environment and maximize your hearing potential.Here are some drawbacks to using hearing aids:It can take several months to get used to your hearing aid.Your voice might seem too loud to you when you first start using your new hearing aid. (Most people adapt to this over the first couple weeks of consistent hearing aid use.)You may have to see your audiologist for programming adjustments if you have hearing difficulty in certain environments.Hearing aids may be expensive.AdvertisementRecovery and OutlookHow can I properly care for my hearing aids?Taking care of your hearing aids helps keep them in good condition. Your healthcare provider can give you specific recommendations. Here are some general guidelines:Clean your hearing aids exactly as directed.Keep your hearing aids away from extreme temperatures, moisture, children and pets.Avoid using personal care products, like hairspray, while wearing your hearing aids.Turn your hearing aids off whenever you’re not using them.Replace dead hearing aid batteries immediately.If you have prescription hearing aids, see your audiologist at least once a year for adjustments and recalibration.How long do hearing aids last?An additional benefit of modern hearing aids is that your audiologist can adjust your device settings if your hearing changes. (In other words, you probably won’t have to buy a new device. You can just update your existing one.) Most people can use the same hearing aid device for six to seven years.When to Call the DoctorShould I ask my healthcare provider about hearing aids?Ask your healthcare provider about hearing aids if you:Feel that everyone around you speaks too softly or mumbles.Often ask people to repeat what they said.Have difficulty hearing people on the phone.Strain to hear in group settings.Prefer the TV or radio volume louder than other people.Additional Common QuestionsCochlear implant vs. hearing aid vs. bone-anchored implants: What’s the difference?Hearing aids, cochlear implants and bone-anchored auditory implants all help people with hearing loss. But these devices all work in different ways:A hearing aid amplifies sound using a built-in microphone, amplifier and speaker. Hearing aids are the recommended treatment for a variety of hearing losses, ranging from mild to severe sensorineural hearing loss.A cochlear implant is a surgically implanted device that directly stimulates your auditory nerve (the nerve that connects your ear to your brain). Cochlear implants are typically recommended for people with severe to profound sensorineural hearing loss, or for those who don’t benefit from a traditional hearing aid.A bone-anchored auditory implant is a surgically implanted device that sends sound as a vibration directly to your best-functioning inner ear. Bone-anchored implants are recommended for people with conductive hearing loss (sound isn’t traveling through your ear properly) or single-sided deafness (little to no hearing in one ear).A hearing care specialist can advise you on which device is best for you.A note from Cleveland ClinicHearing loss can have a significant negative impact on your personal relationships and quality of life. A hearing aid amplifies sound so you can hear things in your environment more clearly. There are many different styles and types of hearing aids available today. You can purchase an over-the-counter hearing aid or an audiologist can fit you with the prescription device that’s best for your needs and preferences.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/21/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicHearing Loss TreatmentFind a Doctor and SpecialistsRequest a Hearing Assessment in OhioRequest an Appointment in FloridaAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"