"Heart Surgery: Types, Recovery & Outlook800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Heart SurgeryAdvertisementAdvertisementAdvertisementHeart SurgeryCardiac surgery, also called cardiovascular surgery or heart surgery, treats many problems related to your heart and the blood vessels connected to your heart. Coronary artery bypass grafting (CABG) and surgeries to treat valve disease are the most common types of heart surgery. Heart surgery can help you live a longer and healthier life.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is cardiac surgery?Cardiac surgery is any surgery that involves your heart or the blood vessels connected to your heart. It’s also called cardiovascular surgery or simply heart surgery. Heart surgery is complex and requires the specialized expertise of cardiac surgeons. It’s a major event that can improve heart function and circulation and give you a whole new lease on life.Heart surgery can correct issues you were born with (congenital heart disease). It can also repair issues that develop later in life. The type of heart surgery you have depends on the underlying problem or combination of problems.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs to have heart surgery?People with many different heart problems need heart surgery. These include blockages in the arteries that carry blood to your heart, valves that aren’t working right, and abnormal heart rhythms.Usually, heart surgery is planned in advance as part of your treatment plan. This happens when your provider (usually your cardiologist) diagnoses a problem with your heart, and surgery is the best or only way to fix it.Other times, heart surgery is an emergency treatment that comes up when you don’t expect it. This can happen if you have a heart attack, or if you’re diagnosed with severe blockages that put you in urgent danger.Depending on the problem, you may not need surgery. Technology is providing us with innovative ways to manage heart disease. For example, percutaneous coronary intervention (PCI) repairs blocked coronary arteries. Endovascular aneurysm repair (EVAR) repairs an abdominal aortic aneurysm through an artery in your leg.These methods reduce your time in the hospital and make recovery easier. They’re especially helpful for people who would face higher risks if they had surgery.But innovations are also improving heart surgery, making it even safer and more effective. Heart surgery has the best outcomes in high-volume hospitals. These are hospitals that perform many surgeries every day. Surgeons and specialists at high-volume hospitals have extensive training and experience. They’re prepared to treat complex problems in high-risk patients. Your care will be in the best possible hands from pre-operative planning through recovery.What conditions are treated with heart surgery?Heart surgery treats a range of conditions that affect your heart and the blood vessels connected to your heart.AneurysmsAn aneurysm is a bulge in your artery wall or heart muscle. One type of aneurysm is an aortic aneurysm. This occurs in your aorta, which is the large artery that carries blood out of your heart to the rest of your body. Aortic aneurysms may form in your belly (abdominal aortic aneurysms). Less often, they form in your chest (thoracic aortic aneurysms).Aneurysms can also form in your heart muscle, usually in your left ventricle. This is the chamber of your heart responsible for pumping blood through your aorta.ArrhythmiasAn arrhythmia is an abnormal heartbeat. Your heart might beat too fast (tachycardia) or too slow (bradycardia). Or, your heart may have an irregular rhythm. Atrial fibrillation is the most common type of irregular rhythm.Over time, an arrhythmia can weaken your heart and lead to serious problems.Congenital heart diseaseMany different forms of congenital heart disease affect babies, children and adults. These problems include:Aortic coarctation.Atrial septal defect (ASD).Dextro-transposition of the great arteries.Patent foramen ovale.Tetralogy of Fallot.Tricuspid atresia.Ventricular septal defect (VSD).Some congenital heart defects need to be repaired soon after birth. Other defects may not show symptoms right away. So, congenital heart disease can affect adults who never knew they had a problem. This often happens with atrial septal defects, which may not show symptoms until middle age.Coronary artery disease (CAD)Coronary artery disease (CAD) is a narrowing of your coronary arteries. Atherosclerosis, a gradual buildup of plaque in your arteries, causes CAD. You have three coronary arteries, and they provide oxygen-rich blood to your heart. Your coronary arteries work at their best when they’re wide open and mostly free of plaque.Too much plaque in your coronary arteries is dangerous. It can clog your arteries and prevent blood from getting to your heart. When your heart doesn’t get enough blood, it can’t get enough oxygen and nutrients. This condition is called myocardial ischemia. The plaque can also break open (rupture) and trigger a blood clot to form.CAD may cause no symptoms. In some cases, it causes chest pain (angina). If untreated, CAD can lead to a heart attack.CAD is the most common form of heart disease, affecting about 18 million adults in the U.S.Heart failureHeart failure means your heart can’t pump blood out to your body as well as it should. Nearly six million adults in the U.S. have heart failure. And it’s the most common reason people over age 65 are admitted to the hospital.Many people who have heart failure also have other cardiovascular conditions. These include coronary artery disease and high blood pressure.Heart valve diseaseHeart valve disease can affect any of your four heart valves (tricuspid, pulmonary, mitral or aortic). But it’s most common in the aortic valve. Problems with the aortic valve are also the most dangerous, causing about 60% of all heart valve disease deaths.Your valves play an essential role in your cardiovascular system by helping your blood flow in the right direction. Each valve has flaps, called leaflets, which together act like a little door. The flaps open and shut at the right moment to let blood through and then close to stop blood from going backward.But just like wooden doors that get warped in hot weather, your valves can have trouble opening and closing as they should. A valve’s flaps may become:Stiff and narrow (stenosis).Floppy and stretchy (prolapse).Leaky (regurgitation).Common forms of valve disease include:Aortic valve stenosis.Mitral valve prolapse.Tricuspid valve regurgitation.AdvertisementWhat are the different types of heart surgery?There are many types of heart surgery. The type of heart surgery you have depends on the condition being treated.Coronary artery bypass grafting (CABG)Coronary artery bypass grafting is often called CABG (pronounced “cabbage”) for short. This surgery treats coronary artery disease (CAD) in one or more of your coronary arteries. You might’ve heard someone say “double bypass,” “triple bypass” or “quadruple bypass.” The first word tells you how many coronary arteries and their branches need to be bypassed (two, three or four).CABG uses a healthy blood vessel from somewhere else in your body to create a new path for blood to reach your heart. Usually, CABG uses arteries from your arms or chest, or veins from your legs. This allows your blood to avoid (bypass) the damaged part of your coronary artery.Heart valve repair or replacementHeart valve surgery manages heart valve disease by repairing or replacing the valve that isn’t working as it should. This surgery allows a “door” that manages your blood flow to open more widely or close more tightly. As a result, blood can flow in the right direction and get where it needs to be.Aneurysm repair surgeryAneurysm repair surgery treats aortic aneurysms in your belly and chest. This surgery replaces the damaged part of your aorta with a graft, which is an artificial artery made of a special type of cloth. The graft offers a new, safe path for your blood to flow.Left ventricular reconstructive surgery treats aneurysms that form in your heart muscle. These aneurysms usually result from a heart attack. Surgery removes the aneurysm and any surrounding scar tissue. This reduces symptoms, like angina, and allows your heart to pump better.Septal myectomyA septal myectomy helps people who have hypertrophic cardiomyopathy. This disease causes your heart muscle to become too thick. Usually, it affects the septum (the muscular wall that separates the left and right sides of your heart).The surgery removes a small part of your septum. This allows more blood to flow from your left ventricle to your aorta and helps relieve symptoms.Heart surgery for atrial fibrillationSome people with atrial fibrillation (AFib) need heart surgery to treat another condition. A surgeon can treat atrial fibrillation during the same operation using the MAZE procedure.The MAZE procedure is a helpful option when other AFib treatments haven’t worked. A surgeon uses a sophisticated method to create scar tissue in your heart. This scar tissue is helpful because it blocks the abnormal electrical signals that cause AFib. Your heart can then get back to a normal rhythm.The MAZE procedure can also be done through minimally invasive means. This is a suitable method for people with AFib who have no other heart problems that need repair.Insertion of a cardiac devicePeople who have arrhythmias or heart failure may benefit from surgery to insert a cardiac device. Several kinds of devices treat specific problems.A permanent pacemaker helps your heart’s electrical system work as it should. The pacemaker’s sensor allows it to know when your heart rhythm is off and restore a normal rhythm.An implantable cardioverter defibrillator (ICD) detects dangerous arrhythmias. The ICD sends a safe electric shock to your heart to bring back a normal rhythm.A left ventricular assist device (LVAD) helps your left ventricle pump blood to your aorta and the rest of your body. It’s used when other heart failure treatments aren’t working. It also improves quality of life for people with heart failure as they wait for a heart transplant.A total artificial heart (TAH) takes over the function of your right and left ventricles. This device is a temporary solution known as a “bridge to transplant.” It helps people stay strong enough to have heart transplant surgery.Heart transplant surgeryHeart transplant surgery is a last-resort treatment for people who have end-stage heart failure. It involves replacing your heart with a donor’s heart.This is a rare surgery because it’s hard to find a donor heart. Plus, the procedure is very complex. Only 150 out of over 6,000 hospitals in the U.S. can perform a heart transplant.What are the most common heart surgeries?Coronary artery bypass grafting (CABG) is the most common heart surgery. In 2018, about 200,000 CABG procedures were performed in the U.S.The second most common heart surgery is valve replacement and repair. About 110,000 valve surgeries were performed in the U.S. in 2018. This number doesn’t include endovascular repair methods, which don’t require open surgery.AdvertisementHow many heart surgeries take place each year?The number of heart surgeries can vary by year. In 2018, nearly half a million people in the U.S. had heart surgery.But the COVID-19 pandemic affected how many people are having heart surgery. The monthly average dropped by 50% in April 2020. The number continued to be lower than normal through the rest of 2020. Partly, this is because hospitals needed to postpone non-elective care. But it seems many people also chose to delay care even if they had symptoms.If you’ve been putting off your appointments because you’re concerned about COVID-19 exposure, you’re not alone. But it’s important that you call your healthcare provider and make an appointment. Ask your provider what their office is doing to help keep you safe. And keep in mind that untreated heart problems can get worse and lead to more serious issues down the road.Procedure DetailsWhat happens before heart surgery?Preparation for your surgery can take weeks or months. Before your heart surgery is scheduled, your medical care team will evaluate your condition. Your care team will likely include your primary care doctor and cardiologist. You’ll also consult with a cardiothoracic surgeon (a cardiac surgeon who operates on organs and tissues in the chest).Your care team will give you a medical evaluation. This includes:Talking about your symptoms and how long they’ve been going on.Talking about your medical history and your biological family’s medical history.Blood tests to check your cholesterol and other important numbers.Your team will also run some diagnostic tests. These tests provide a detailed picture of your heart function and any problems. They also help you and your care team decide if you need surgery and what type you need.Cardiac computed tomography scan (cardiac CT).Cardiac magnetic resonance imaging (heart MRI).Chest X-ray.Coronary angiography.Echocardiogram (echo).Electrocardiogram (ECG/EKG).Stress test.If you need surgery, your care team will tell you exactly how to prepare and what to expect. It’s important to follow their recommendations about:When to stop taking any medications.When to begin fasting (not eating or drinking anything) the day before your surgery.Quitting smoking or tobacco use and reducing alcohol consumption to lower your risk of complications.Be sure to ask any questions you have, even if they seem small or you think you asked them already. It’s better to double-check to make sure you’re as prepared as possible for your surgery.What to expect after you’re admitted to the hospitalYou might be admitted to the hospital the day before surgery, although this is often not necessary. If you are in the hospital, you’ll spend some time getting settled and talking with your care team. You might also have:Tests like an EKG or chest X-ray.Hair shaved from the spot where you’ll have your incision.Blood tests.You’ll need to stop eating and drinking (usually at midnight). It’s a good idea to give personal items to a family member or friend the night before your surgery or early in the morning. These include:Glasses and contact lenses.Dentures.Jewelry.Wristwatch.Phone.You’ll be given medicine to help you relax, and you’ll be wheeled to the operating room on a rolling bed. In the operating room, you’ll receive anesthesia so you won’t feel anything and won’t remember anything from your surgery.What happens during heart surgery?What happens during your surgery depends on the type you’re having. It also depends on the method your surgeon uses to perform the operation.Surgeons use different methods for operating on your heart. These include open-heart surgery, off-pump bypass surgery and minimally invasive heart surgery. Your care team will discuss which method is best for you, and why.Open-heart surgeryOpen-heart surgery is what most people think of when they hear someone say “heart surgery.” Your surgeon makes a 6-to 8-inch long incision in the middle of your chest and spreads your ribcage to reach your heart. You’ll be connected to a heart-lung bypass machine, so your heart won’t be beating during the surgery.The length of traditional open-heart surgery varies based on what’s being fixed. CABG surgery (the most common type) takes about three to six hours.Off-pump bypass surgeryOff-pump bypass surgery is also called “beating heart” surgery. It’s similar to traditional open-heart surgery, but you won’t be on a heart-lung bypass machine. This method can only be used for CABG surgery. And it’s most suitable when only one or two coronary arteries need to be bypassed.Minimally invasive surgeryMinimally invasive heart surgery is also called a “keyhole surgery.” This means your surgeon makes smaller incisions to access your heart.A partial sternotomy involves a 3- to 4-inch incision through part of your sternum (breastbone). A mini-thoracotomy avoids your breastbone and instead uses small cuts between your ribs.Minimally invasive surgery sometimes uses robotics. Don’t worry – a surgeon is still in charge. But the surgeon uses computer and imaging equipment to guide robotic arms. These arms are the size of a pencil, and they hold surgical tools. The robotic arms can make complex, precise movements. This incredible, innovative approach can cut down on your surgery time and recovery time. It also needs smaller incisions than other approaches.What happens after heart surgery?After your heart surgery is done, you’ll be moved to the intensive care unit (ICU). You’ll recover in the ICU for at least one day. You’ll then move to a regular hospital room for continued rest and care.How long you stay in the hospital depends on the surgery you had and how your body responds to it. Each person’s recovery is different. Your hospital team will keep a close eye on you and make sure you’re healing as you should. They’re also prepared to notice and respond to any problems that come up.Care at Cleveland ClinicGet Heart SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of heart surgery?Heart surgery can save your life and change your life. After you recover, you’ll likely feel healthier, stronger and ready to get back to the things you love doing.What are the risks or complications of heart surgery?Heart surgery has excellent outcomes overall. But there are still risks, as with any other surgery. Possible risks and complications include:Allergic reaction to anesthesia.Arrhythmias.Bleeding.Confusion or trouble thinking clearly.Damage to nearby blood vessels or organs.Infection in your incision or inside your chest.Stroke.The risks are higher if you have health conditions like:Diabetes.Chronic obstructive pulmonary disease (COPD).Kidney disease.Obesity.Peripheral artery disease.Smoking and tobacco use also raises the risk of complications during and after surgery.Recovery and OutlookHow long does it take to recover from heart surgery?Recovery depends on the type of surgery and other factors like your overall health. Most people need six to 12 weeks to recover from open-heart surgery. Some people need even more time.Follow your care team’s instructions on when you can drive, go back to work, lift heavy objects or do other activities. Your care team will also offer advice on how to care for your incision. It’s important to take things slow and give your body time to heal.As you recover, you may feel:A clicking sensation in your chest. This should go away after a week or two. If it doesn’t, call your surgeon.Bruising or minor swelling at your incision site.Constipated.Difficulty falling asleep or staying asleep.Less hungry. You may even feel nauseated around food for a couple of weeks. This is normal and common.Pain or tightness in your shoulders and upper back.Sad, depressed or moody.These are normal responses to surgery. But that doesn’t mean you have to face them alone. Tell your family or friends how you’re feeling. If the pain feels severe or medication doesn’t help, call your care team.What is the survival rate of heart surgery?Heart surgery survival rates vary based on the type of surgery and how many problems are repaired during the operation. Survival rates are:Mitral valve repair for mitral valve prolapse: 100%.Aortic valve replacement: 98.1%.Coronary artery bypass surgery (CABG): 97.8%.Heart surgery is generally riskier for people who are very ill or have other medical conditions.How long can you live after heart surgery?You can live for many years or decades after heart surgery. Many factors affect how long you live, including other health conditions and risk factors. Heart surgery can make you healthier and stronger. But it’s important to keep doing whatever you can to lower your risks for future problems. Things you can do include:Make lifestyle changes recommended by your healthcare provider.Take your medications as prescribed.Keep all your medical appointments and follow-ups.Heart surgery is like a bicycle that can carry you down a long road when you’re tired of walking, but you still have to push the pedals.When to Call the DoctorWhen should I see my healthcare provider?Call your doctor if you have signs of complications as you recover. It’s normal to feel some discomfort. Pain medication will help. But it’s not normal to have the following:Chest pain that's not getting better over time.Fever.Nausea and vomiting.Shortness of breath.Signs of infection by your incision, like oozing or redness.Slurred speech or other signs of a stroke.It may be hard to know when a symptom is just a part of recovery, or when it’s a sign of a complication. When in doubt, pick up the phone and call your care team. It’s better to get checked out and learn nothing’s wrong than to ignore a problem that needs medical care.A note from Cleveland ClinicHeart surgery is a life-changing event for you and your loved ones. Take the time to learn more about your condition and the surgery that you need. Talk with your healthcare provider and ask any question that comes to mind. Keep your support system close during this journey, and don’t be afraid to ask for help when you need it. If you don’t have family and friends nearby, talk with your provider about available resources and support groups.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/13/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Heart SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"