"Heart Ablation: Procedure, Risks and Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Heart AblationAdvertisementAdvertisementAdvertisementHeart AblationCardiologists use several heart ablation techniques to treat irregular or abnormal heart rhythms (arrhythmias). The most common type of heart ablation is catheter ablation, a minimally invasive procedure. People who aren’t candidates for catheter ablation may need heart ablation surgery.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is heart ablation?Heart ablation (also called cardiac ablation) describes a variety of procedures that treat irregular or abnormal heart rhythms (arrhythmias). Ablation describes any technique used to target and eliminate abnormal electrical signals from your heart.During cardiac ablation, a cardiologist (a doctor who specializes in heart conditions) uses hot or cold energy to create tiny scars in heart tissue, targeting the areas of your heart causing the arrhythmia. Scarring in these areas helps to block your heart from producing irregular or abnormal rhythms.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat conditions does cardiac ablation treat?Cardiac ablation treats heart arrhythmias that can’t be controlled with medication. Heart ablation procedures can treat all types of irregular or abnormal heart rhythms, including:Atrial fibrillation (Afib): Afib is the most common reason for heart ablation. When you have Afib, the upper chambers of your heart (called the atria) beat irregularly. The atria quiver instead of contracting. Without strong contractions, your heart can’t pump blood. When your blood doesn’t move through your heart properly, it increases your risk of forming blood clots within your heart and the risk of stroke if the clot travels to your brain.Atrial flutter: With this condition, the atria contract to pump blood, but they do it too quickly. Atrial flutter results in a heartbeat that’s faster than normal and like Afib, increases your risk for blood clots and stroke.Supraventricular tachycardia (SVT): If you have SVT, your heart still pumps blood normally. But you’ll experience episodes of racing heartbeats (up to 300 beats per minute). If SVT occurs frequently or for long periods, the arrhythmia can lead to heart damage and severe symptoms.Ventricular tachycardia (VT): The ventricles are the two lower chambers of your heart. An arrhythmia in those chambers (ventricular tachycardia) causes your heart to beat too quickly, not allowing enough time for blood to fill and pump to your body, leading to a dangerous drop in blood pressure.What are the types of heart ablation procedures?Healthcare providers perform heart ablation using a minimally invasive catheter procedure, surgery or combination treatment.Catheter ablation: Catheter ablation is the most common type of heart ablation. It’s a minimally invasive procedure. A cardiologist threads a catheter (a thin, flexible tube) through a vein, typically through your groin and guides it into your heart. The catheter delivers hot or cold energy to your heart tissue, creating scars that block irregular or abnormal heart rhythms.Surgical ablation: Cardiac surgeons often perform an open-heart ablation called a maze procedure while doing other heart surgery. If you’re having bypass surgery or a valve replacement — and also need ablation — your doctor may suggest a maze procedure. This is now also performed using hot or cold energy to create scar lines in your heart, which blocks the electrical signals causing the arrhythmia.Hybrid surgical/catheter ablation: If you don't need open-heart surgery, your cardiac surgeon can perform a hybrid procedure, sometimes called a mini maze. The surgeon makes small incisions in your chest. Surgeons can then insert a catheter to treat the arrhythmia-causing signals.AdvertisementProcedure DetailsWhat happens before heart ablation?All cardiac ablation procedures are performed in the hospital by a cardiologist or cardiac surgeon. Your provider will thoroughly evaluate your heart condition and overall health before deciding which type of cardiac ablation procedure is best.In preparation for the procedure, your provider will give you specific instructions. You may be asked to:Stop taking medications that thin your blood (like aspirin or warfarin) or treat arrhythmia. Follow your provider’s guidance and stop these medications only as directed.Not eat or drink anything the night before your procedure. Your provider will give you exact instructions.Arrange for someone to drive you home from the hospital if you are having an outpatient procedure.What happens during an ablation procedure?During a heart ablation procedure, a cardiologist will perform the following steps depending on if you are undergoing a catheter or surgical ablation:Catheter ablationIf you are having a catheter ablation, you’ll have an intravenous (IV) line inserted into your arm to deliver anesthesia. You will typically be under general anesthesia (you’ll be asleep throughout the procedure) due to the length of the procedure.The cardiologist inserts a small tube (called a sheath) through your skin and into a vein usually in your groin. They then insert the electrode catheters (thin tubes with wires) into the sheath and thread them to your heart, using X-rays as a guide. The catheter delivers hot or cold energy to eliminate the irregular or abnormal rhythms.Surgical ablationIf you have surgical ablation, you’ll receive general anesthesia.The cardiac surgeon can do the ablation during open-heart surgery. Or your doctor will do a less-invasive hybrid surgery, making small incisions in your chest to access your heart.AdvertisementWhat happens after heart ablation?Catheter ablation generally requires less recovery time than surgical ablation. Depending on which procedure you’ve had, you can expect the following:Catheter ablationCatheter ablation takes two to four hours to complete. After the procedure, your provider removes the catheter and sheath from your vein.You move to a recovery room and stay there for several hours (sometimes overnight). A nurse monitors your condition as you recover.When it’s time to go home, you’ll receive detailed instructions about at-home care. Your provider may prescribe aspirin or other blood-thinning medication for several months. These drugs help prevent blood clots while you recover.Surgical ablationAfter surgical ablation, you’ll move to the ICU. You’ll stay in the ICU for several hours up to a few days. The length of stay depends on how invasive your surgery was.Once you leave the ICU, you’ll remain in the hospital for a few more days until you recover enough to return home.While recovering at home, you may continue taking aspirin or other blood-thinning medication. These help prevent blood clots during your several months of healing.Care at Cleveland ClinicArrhythmia TreatmentsFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of heart ablation?If you have an arrhythmia that can’t be controlled with medication, cardiac ablation can be lifesaving. Most people are able to have catheter ablation. This minimally invasive procedure carries fewer risks.Heart ablation success rates are high. For most people, cardiac ablation restores normal heart rhythms. It typically eliminates the need to take antiarrhythmic medication.What are the risks of heart ablation?Side effects of heart ablation are more common after surgical ablation than after catheter ablation. Possible risks of heart ablation include:Arrhythmias.Blood clots.Damage to the vein from the sheath and catheter.Damage to your heart, like a puncture or damaged valves or conduction.Narrowing of the veins that carry blood between your lungs and heart (pulmonary vein stenosis).Exposure to radiation during catheter ablation.Infection or bleeding.Stroke or heart attack.Death, rarely.Recovery and OutlookWhat is the recovery time after heart ablation?How long it takes to heal after heart ablation depends on whether you had catheter ablation, a hybrid procedure, or surgical ablation. Your recovery might take a few days, several weeks, or even a few months.Will I still have arrhythmia after heart ablation?You may continue to experience arrhythmias while your heart tissue heals. This is typical after any heart surgery. Within three months, you can expect the arrhythmias to subside. Until then, your provider may recommend continuing to take anti-arrhythmia medication.When can I go back to work and resume other activities?If you have catheter ablation, you’ll likely feel ready to return to work a day or two after your procedure. If your job requires physical labor, you may need a few extra days before returning to work.After catheter ablation, you should avoid heavy lifting and strenuous exercise for at least three days. Talk with your provider about when it’s safe to return to physical activity.After surgical ablation, you’ll spend about a week in the hospital. Once at home, you may need several more weeks to recover enough to return to work. Recovery will be quicker if you’ve had a less-invasive surgical procedure instead of an open-heart ablation.When to Call the DoctorWhen should I call my doctor?You should call your healthcare provider after your surgery if you experience:Arrhythmias, including racing or skipped heartbeats.Bleeding at the puncture site where your provider inserted the catheter, or at the incision site for surgical ablation.Chest pain.Dizziness or lightheadedness.Nausea or vomiting.Numbness or tingling in your leg (if the puncture site is in your groin).Swelling or pain at the puncture or incision site.A note from Cleveland ClinicHeart (or cardiac) ablation can fix life-threatening arrhythmias, including Afib. Depending on your condition, your cardiologist might recommend catheter ablation, surgical ablation or a hybrid procedure. Once your heart tissue heals from the ablation procedure, your heart rhythms should become regular. Most people report an improvement in symptoms and quality of life after the procedure.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/17/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicArrhythmia TreatmentsFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"