"Heart Valve Replacement: Types, Procedure & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Heart Valve ReplacementAdvertisementAdvertisementAdvertisementHeart Valve ReplacementHeart valve replacement is an option for people with a valve that can’t be repaired. Heart valve replacement can improve symptoms and quality of life. Biological and mechanical valves are available as well as different surgical approaches. Success rates are high, and people can live many years with a replacement heart valve.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a heart valve replacement?Heart valve replacement is a procedure to replace one of your heart’s valves with a biological or mechanical valve.Sometimes, a valve doesn’t form right when you’re born. Some people may have a valve that gets too narrow, stiff or leaky. In these cases, your blood can’t move through your heart efficiently.You have four valves that control where your blood goes in your heart. Normally, your heart’s valves are all opening and closing completely when your heart beats. This allows blood to move in an organized way.Your blood moves:From one part of your heart to the next.To your lungs to get oxygen.To your aorta, which sends your oxygen-rich blood out to the rest of your body.Like a sink drain that doesn’t hold all the water or completely drain it, a diseased valve keeps some of your blood from going where it’s supposed to go.If one of your valves isn’t working right, you may need to take medicine or have your valve repaired. If these treatments don’t work, you may need a heart valve replacement.Types of Heart ValvesBiological ValvesBiological valves (also called tissue or bioprosthetic valves) are made of:Cow tissue (bovine).Pig tissue (porcine).Human tissue (allografts or homografts).In general, there’s no difference in durability between the types of biological valves. Biological valves may have some artificial parts to give the valve support and make it easier to put in place.Homograft ValvesA homograft (or allograft) is:A human heart valve that comes from a donor after they die.Most often used to replace a diseased aortic valve in children or young adults or when an infection destroys an aortic valve in adults.Also used to replace the pulmonary valve during the Ross procedure.Mechanical ValvesMechanical valves are made of metal or carbon and are designed to work just like your own valves. The bileaflet valve is the most common type of mechanical valve. It’s made up of two carbon leaflets mounted in a ring covered with polyester knit fabric.Mechanical valves are:Well-tolerated.Very durable.Designed to last a lifetime.Heart valve replacement: mechanical vs. tissueWhen choosing between a biological valve and a mechanical valve, you may want to consider:The inconvenience and risk of bleeding while taking a blood thinner when you have a mechanical valve.The possibility of needing another biological valve replacement during your lifetime.Your age. (A mechanical valve is best for people younger than 50 for an aortic valve and younger than 65 for a mitral valve.)How active you are.Which heart valve is affected?Biological valvesAdvantages: Most people don’t need to take lifelong blood-thinner medication unless they have other conditions, such as atrial fibrillation. If you’re older than 60 years of age, the bovine pericardial valve will probably last for the rest of your life.Drawbacks: In the past, biological valves usually needed to be replaced after about 10 years. However, recent studies show these valves often last 15 to 20 years or more without a decline in function.Mechanical valvesAdvantages: Mechanical valves are very durable. They’re designed to last a lifetime.Disadvantages: Because of the artificial material in mechanical valves, people who receive these valves need to take warfarin, a blood-thinning (anticoagulant) medication, for the rest of their lives. Blood thinners are medications that delay your blood’s clotting action. They help prevent clots from forming on your new valve. Clots can cause a heart attack or stroke. If you take warfarin, you’ll need to have regular blood tests to see how well you’re responding to the medication and if you need a different dose. Also, some people who have a mechanical valve replacement hear the valve make a clicking noise at times. This is the sound of the valve leaflets opening and closing.Types of Heart Valve Replacement SurgeryIn addition to the biological or mechanical valve choices, there are options in the method your surgeon uses. They can do open-heart surgery, minimally invasive surgery or go through a blood vessel.Transcatheter Aortic Valve Replacement (TAVR)Transcatheter aortic valve replacement is a treatment option for some people with severe aortic stenosis (narrowing). You may have TAVR if you’re high-risk, although a provider can use it for someone of any risk level.Younger people, those with a bicuspid valve or those who need other procedures like a maze procedure or coronary bypass are more likely to have open-heart surgery.In TAVR, your healthcare provider uses a catheter to replace your diseased valve with a biological valve. They insert the catheter into an artery in your groin or a cut (incision) in your chest. They put the new valve inside of the old one. Your provider can also use this method to replace your pulmonary valve.Ross ProcedureThe Ross procedure involves switching your pulmonary valve to the aortic valve position and then placing a pulmonary homograft. This is a very complex procedure. However, it has many benefits, especially for young people with aortic valve disease.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhen is a heart valve replacement necessary?A heart valve replacement is necessary when valve repair surgery isn’t a treatment option. Valve replacement surgery is most often used to treat people with aortic valve disease, particularly aortic stenosis (narrowing).Other conditions that may require a heart valve replacement include:Mitral, pulmonary or tricuspid valve stenosis (narrowing).Mitral valve prolapse.Aortic, mitral or tricuspid regurgitation (some blood goes the wrong way because of a leaky valve).Congenital (since birth) heart valve disease.Procedure DetailsWhat happens before heart valve replacement?Your healthcare provider may take a chest X-ray and do an electrocardiogram (EKG) a day before your operation.Avoid eating or drinking anything during the night before or the day of your surgery.Follow your provider’s instructions about which medications to take or stop taking before your operation.Take comfortable clothes with you to the hospital, along with shoes you can slip into instead of tie. Your relative or friend who drove you to your appointment can hold your belongings for you during surgery.Your provider will prepare your incision site by shaving and cleaning it.AdvertisementWhat happens during heart valve replacement?Your heart valve replacement surgery will take two to five hours.Your healthcare provider will give you medication to make you sleep and be pain-free.Depending on which kind of surgery you’re having, your provider will make:A 6- to 8-inch cut (incision) in your breastbone for open-heart surgery.A 3- to 4-inch incision for minimally invasive surgery.A small incision in your groin and put a catheter through it and all the way to your heart.Your provider will use a machine to do the work of your heart and lungs during your operation so your heart doesn’t move during the operation.Your provider will remove your diseased valve and replace it with a biological or mechanical valve. For a transcatheter procedure, they’ll place your new valve inside your original one.They’ll close your incisions and start your heart again.What happens after heart valve replacement?You’ll start your hospital stay in an intensive care unit (ICU) so your healthcare provider can keep a close eye on you. Next, you’ll move to a regular room. Your hospital stay may last five to seven days.You can expect to have machines checking your blood pressure and heart rate.There could be tubes draining fluid from your chest.You can drink, eat and walk as soon as you’re able to after your operation. Take a few steps around your room and then down the hallway with help from your healthcare provider.After you go home, you may go to a cardiac rehab program to help you get stronger.Care at Cleveland ClinicHeart Valve CareFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the advantages of heart valve replacement?Heart valve replacement surgery gives you a long-term solution to your valve issue. Also, it improves your life by treating your symptoms and helping you live longer.If you have a minimally invasive procedure, your advantages include:Less time in the hospital.Faster recovery.Smaller infection risk.What are the risks or complications of heart valve replacement?Heart valve replacement surgery risks include:Infection.Bleeding.Heart failure.Kidney failure.Heart attack.Abnormal heartbeat.Recovery and OutlookWhat is the recovery time?Heart valve replacement recovery takes about one or two months. You might have a quicker recovery if you had a minimally invasive operation.For the first three weeks of your recovery, you’ll probably get tired easily.You’ll need to avoid driving for several weeks after your operation.During the first six to eight weeks after surgery, don’t pick up anything more than 10 pounds.How long do you live after heart valve replacement?Your life expectancy after a heart valve replacement depends on several factors, such as:How old you were when you received your heart valve replacement.What other health issues you have.One study found that people considered low-risk lived anywhere from six to 16 years after a surgical aortic valve replacement. People aged 85 had shorter survival times, while those aged 60 to 64 lived longer.What is the success rate of heart valve replacement surgery?Success rates for heart valve surgeries are high. According to a study of nearly 8,000 people, TAVR had a 92% success rate.When to Call the DoctorWhen should I see my healthcare provider?Contact your provider if you have:A fever.Chest pain.Depression.More than five pounds of weight gain.A note from Cleveland ClinicTalking with your healthcare provider can help you decide on the best kind of heart valve replacement for you. Consider the pros and cons of the types of valves and the different kinds of surgery. Advances in heart valve replacement have made it possible for people to have less invasive operations that don’t require opening your chest. Ask your provider if you qualify for this type of procedure.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/01/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicHeart Valve CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"