"Heimlich Maneuver Choking Treatment800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Heimlich ManeuverAdvertisementAdvertisementAdvertisementHeimlich ManeuverThe Heimlich maneuver is a first aid method for choking. It can be used on adults and children but isn’t recommended for infants. The Heimlich maneuver is known as abdominal thrusts, because it involves thrusting into the abdominal area. It’s a quick life-saving method, but it should only be used on conscious people who can’t breathe on their own.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsAdditional Common QuestionsOverviewWhat is the Heimlich maneuver?The Heimlich maneuver is a first aid method for choking. Choking is when a person can’t breathe because food, a toy or another foreign item is blocking their throat or windpipe (trachea). The Heimlich maneuver is also known as abdominal thrusts. It can be used in different ways on adults and children.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho invented the Heimlich maneuver?Dr. Henry Heimlich invented the Heimlich maneuver in 1974. Dr. Heimlich discovered the remaining air in a person’s lungs could be used to free (dislodge) a foreign object from their esophagus using quick, upward thrusts under their ribcage.At first, the Heimlich maneuver didn’t catch on with the medical community. The backslap method remained the most popular first aid choking treatment for another 10 years. Eventually, the Heimlich maneuver caught on for use in conscious adults. Backslaps (back blows) are still recommended for infants, and CPR is recommended for unconscious adults, children and infants.Procedure DetailsWhen should you use the Heimlich maneuver?You should use the Heimlich maneuver if a person is conscious but choking. You can usually tell a person is choking if they can’t speak, breathe or cough. Ask the person, “Are you choking?” They may be able to cough but can’t speak to ask for help. Sometimes, their breathing and speaking becomes weaker and weaker until only gasping sounds come out. The universal choking symbol — holding your hands up and clutching your throat — is often used.If a person is able to speak, cough or breathe, don’t attempt the Heimlich maneuver. Encourage the person to keep coughing. Sometimes a strong cough can free the foreign object. Only perform the Heimlich maneuver if a person’s life is in danger.AdvertisementHow do you perform the Heimlich maneuver?To perform the Heimlich maneuver, follow these steps:Stand behind the person, and put your arms around their abdomen.Make a fist with one hand, and clasp your other hand tightly around it.Place the thumb side of your fist just below their ribcage and about two inches above their belly button (navel).Sharply and quickly thrust your hands inward and upward five times.Repeat this process until the object is freed (dislodged) or the person becomes unconscious. If the person becomes unconscious, start CPR.Can you perform the Heimlich maneuver on children?The Heimlich maneuver can be performed on children. If the child is younger than 5 years old or weighs less than 45 pounds, the method should be slightly altered. The rescuer should kneel behind the child to get down to their level. Then, they should use less forceful thrusts than the typical Heimlich maneuver requires.AdvertisementCan you perform the Heimlich maneuver on babies?The Heimlich maneuver is not recommended for use on infants 12 months or younger. Instead, babies should receive backslaps (back blows).To perform this method, follow these steps:Turn the infant face down with their chest resting on your forearm. Make sure their head is lower than their body.Using the heel of your hand, strike the infant between their shoulder blades five times. The strikes should be firm but not so hard that you cause injury.Check the infant’s mouth and remove any visible objects.If their airway remains blocked, turn the infant face up with their head down. Using your second and third fingers, give five inward and upward chest thrusts about ½ to 1½ inches into the infant’s breastbone (sternum).Check the infant’s mouth for visible objects again. Repeat this process until the object is freed (dislodged) or the infant becomes unconscious. If the infant becomes unconscious, start CPR.How do you perform the Heimlich maneuver on people who are pregnant or obese?People who are pregnant or obese can receive the Heimlich maneuver in a slightly altered way. Instead of thrusting on the abdomen, the thrusts should be placed on the breastbone (sternum).Can you perform the Heimlich maneuver on yourself?If you’re alone and choking, you can try to free the item by performing the Heimlich maneuver on yourself.To perform this method, follow these steps:Make a fist with one hand, and clasp your other hand tightly around it.Place the thumb side of your fist just below your ribcage and about two inches above your belly button (navel).Sharply and quickly thrust your hands inward and upward five times.Repeat this process until the object is freed (dislodged).You can also try leaning over a railing, chair or table edge. Then, sharply and quickly thrust your upper abdominal area against the edge.Who should not receive the Heimlich maneuver?Infants shouldn’t receive the Heimlich maneuver. In addition, if a person is unconscious, they should not receive the Heimlich maneuver. Instead, you should perform CPR.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentRisks / BenefitsWhat are the risks of the Heimlich maneuver?The Heimlich maneuver is considered a safe and quick method to save lives. You don’t have to have any medical knowledge or training to perform the Heimlich maneuver. However, if the Heimlich maneuver isn’t performed correctly, serious abdominal harm can be done. If the foreign object is not removed after the first few set of thrusts, problems can occur. The most common complications of the Heimlich maneuver are broken ribs and holes in the gastrointestinal tract. Other rare abdominal complications can happen, but in a life-or-death situation, performing the Heimlich maneuver is still recommended.Additional Common QuestionsHow can I prevent my child from choking?Young children are at a high risk of choking. To prevent your child from choking:Keep small objects and other hazards out of their reach.Cut their food into small pieces.Be especially careful with round foods such as hot dogs, nuts and grapes.Don’t let them have hard candy.Supervise your child while they’re eating and playing.A note from Cleveland ClinicThe Heimlich maneuver is a first aid method for choking. Choking is when someone can’t breathe because of a blockage (obstruction) in their upper airway. Food, a toy or another small item could be blocking their throat or windpipe. The Heimlich maneuver can be used on adults and children but isn’t recommended for infants. The Heimlich maneuver is performed by wrapping your arms around a person, making a fist with one hand and clasping it with the other. You place your fists between the person’s ribcage and belly button and thrust your hands into their abdomen until the object is freed. The Heimlich maneuver can be a life-saving rescue technique, but it should only be used if the person can’t breathe and is conscious.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/13/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementQuestions 216.444.2538Appointments & LocationsRequest an AppointmentFind a Primary Care ProviderFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"