"Hemodialysis: What It Is, Types & Procedure800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/HemodialysisAdvertisementAdvertisementAdvertisementHemodialysisHemodialysis is a type of dialysis that performs normal kidney functions. It removes your blood, filters out toxins in a machine and then sends your filtered blood back into your body. You may receive hemodialysis in a special healthcare facility or at home.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is hemodialysis?Hemodialysis is a type of dialysis. If you have a condition that prevents your kidneys from working properly, dialysis does the work for them — it filters your blood to remove waste products and excess fluids. Common waste products include nitrogen waste (urea), muscle waste (creatinine) and acids.During hemodialysis, a machine removes blood from your body, filters it through an artificial kidney (dialyzer) and then returns the cleaned blood to your body.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow does hemodialysis work?The dialyzer is the part of the hemodialysis machine that filters your blood. Your blood flows through tiny mesh tubes inside the dialyzer’s core. Waste products and excess fluids in your blood pass through the mesh tubes into dialysate. Dialysate is a fluid that consists of water, salts and electrolytes.Your filtered blood returns to your body. The dialyzer then disposes of the dialysate, which contains your blood’s waste products and excess fluid.What are the two types of hemodialysis?There are two main types of hemodialysis. Talk to your healthcare provider about what type of hemodialysis is best for you.The main types of hemodialysis include:In-center hemodialysisFor this type of hemodialysis, you go to a special healthcare facility that specializes in providing hemodialysis. A hemodialysis nurse or technician performs the procedure.Most people get in-center hemodialysis at least three times per week. Each session takes between three and four hours to complete.Home hemodialysisThis type of hemodialysis takes place in your home. Over several weeks or months, your healthcare providers will teach you how to perform hemodialysis and resolve common problems that may develop. You then perform the procedure yourself on your own schedule.There are three types of home hemodialysis, including:Conventional home hemodialysis: You perform conventional home hemodialysis three times a week. Each session lasts at least three to four hours.Short daily home hemodialysis: Short daily home hemodialysis uses new technology that allows for shorter procedures. You perform the procedures five to seven days a week. Each session lasts around two hours.Nocturnal (overnight) home hemodialysis: This type of hemodialysis takes place at night while you’re asleep. You perform the procedure four to six days a week. Each session lasts between six and eight hours. This type of hemodialysis removes more waste from your blood because you spend more hours each week on dialysis than the other types.AdvertisementWho is the best candidate for hemodialysis?You may need hemodialysis if you have late-stage kidney disease, end-stage kidney disease (ESKD) or kidney failure.You may also need hemodialysis if you’re waiting for a kidney transplant.What happens if I refuse hemodialysis?If you choose not to start or decide to stop hemodialysis, toxins will build up in your blood (uremia) and your kidneys will eventually fail.Kidney failure is fatal. You may survive a few days or weeks without hemodialysis if you have kidney failure.Refusing or stopping hemodialysis is a personal choice. Before making a decision, you should share your feelings with your healthcare provider and family.How common is hemodialysis?Hemodialysis is the most common type of dialysis. About 90% of all people who need dialysis receive hemodialysis.AdvertisementProcedure DetailsWhat happens before hemodialysis?You must prepare for your first hemodialysis session weeks or even months in advance.If you’re able to do hemodialysis at home, your healthcare provider will teach you how to properly perform the procedure and review common problems that may arise.You’ll first undergo minor surgery to make it easier to access your bloodstream. You may have one of two procedures:Arteriovenous fistula (AV fistula): Your surgeon connects an artery and vein in your arm.Arteriovenous graft (AV graft): If the artery and vein in your arm are too short to connect, your surgeon will use a soft, hollow tube (graft) to join them.These procedures make the connection between your artery and vein easier to access during hemodialysis. They also help your blood flow in and out of your body faster.In some situations, you may need to start hemodialysis quickly. Your healthcare provider may temporarily insert a catheter into a vein in your leg, chest or neck. A catheter is a soft, hollow tube. It consists of rubber, silicone or another medical-grade material.Your healthcare provider will also teach you how to clean your fistula or graft to prevent infections. Signs of infection include:Pain.Tenderness.Swelling.Discoloration (red, gray, pink, brown or black).Fever.Protecting your fistula or graft and the surrounding area is important. The following tips can help protect the areas:Avoid sleeping on your access area.Avoid wearing jewelry or tight clothes that may squeeze your access.Avoid wearing a purse or bag strap across your access.Don’t take blood pressure or have blood drawn from the arm that has your access.If you accidentally damage your fistula or graft, you may no longer be able to use it for hemodialysis.Do I need to change my diet before starting hemodialysis?What you eat and drink can limit the effectiveness of hemodialysis and affect how you feel. Certain foods and drinks can create a lot of waste in your blood, create extra fluids in your blood, raise your blood pressure and make your heart beat faster.Before you start hemodialysis, a dietitian who specializes in kidney diseases (renal dietitian) will work with you to create a hemodialysis diet.It’s a good idea to avoid foods that contain a lot of:Potassium: Too much potassium in your diet can accelerate your heartbeat. Examples of potassium-rich foods include bananas, avocados and dry fruits.Phosphorus: Too much phosphorus in your diet can make your bones brittle and your skin itch. Examples of phosphorus-rich foods include dairy, chicken, turkey, hot dogs and canned chili.Sodium: Too much sodium (salt) in your diet makes you drink more fluids. Examples of sodium-rich foods and drinks include vegetable juice, sports drinks, fast food and seasonings.What happens during hemodialysis?Your hemodialysis nurse or technician will put two needles in your arm.The needles are 15- or 16-gauge. The outer diameter of a 15-gauge needle is about 1.8 millimeters (mm), which is approximately 2.5 times larger than the tip of a ballpoint pen. The outer diameter of a 16-gauge needle is slightly smaller — about 1.65 mm. Soft tubing connects both needles to the hemodialysis machine.If you’re on home hemodialysis and have proper training, you may put the needles in yourself.The hemodialysis machine removes your blood from one of the needles in your arm. It then circulates your blood through the many mesh tubes in the dialyzer. The dialyzer moves excess waste and fluids into a dialysate solution.The hemodialysis machine eventually returns your filtered blood to your body through the second needle in your arm.During the session, your hemodialysis machine regularly monitors your blood pressure. It may adjust the speed at which your blood flows in and out of your body.Is hemodialysis painful?You may feel a slight pinch when the needles enter your fistula or graft. However, the hemodialysis process itself doesn’t cause any pain.Why does hemodialysis take so long?Healthy kidneys work nonstop to filter your blood, even while you sleep. Even with advances in treatment, hemodialysis can’t wholly replicate your kidneys’ consistency and efficiency.Healthy kidneys filter about 150 quarts of blood in a single day. Hemodialysis is only 5% to 10% as effective as healthy kidneys. As a result, sessions generally take three to four hours to complete.What happens after hemodialysis?You or your healthcare provider will remove the needles and clean your access areas. You may continue your everyday activities.Many people feel tired or ill after standard hemodialysis sessions. Your symptoms may last for several hours. However, some people report having more energy with more frequent hemodialysis. Talk to your healthcare provider about what type of hemodialysis is best for you.Care at Cleveland ClinicKidney CareMake an AppointmentRisks / BenefitsWhat are the advantages of hemodialysis?The main advantage of hemodialysis is that it does the work of your failed kidneys by clearing blood of toxic waste products and removing excess water. Without hemodialysis, you’ll develop uremia. Uremia is fatal without treatment.Another advantage of hemodialysis is that sessions are usually only three times each week.You may decide when and where to have your sessions for home dialysis. You may even choose to have your sessions overnight. Nocturnal home hemodialysis allows you to maintain a more consistent daily routine.What are the complications of hemodialysis?Some people may have complications with their fistula or graft. These may include:Infection.Scar tissue that causes a blockage.Blood clots. Blood clots of the fistula or graft won’t allow dialysis. A provider can usually remove the clot through a minimally invasive procedure. In rare cases, you may need an open surgical procedure to remove a blood clot.Though rare, the needles in your arm may come out, or a tube may disconnect from your hemodialysis machine. In these situations, the machine will alert you or your healthcare provider. The machine then shuts off to protect you from blood loss until someone fixes the problem.What are the side effects of hemodialysis?Side effects of hemodialysis include:Low blood pressure (hypotension).Nausea and vomiting.Dizziness.Fainting (syncope).Chest pain.Back pain.Headaches.Itchy skin (pruritus).Muscle cramps.Restless legs syndrome.How long can you live on hemodialysis?If you’re on hemodialysis, the average life expectancy is five to 10 years.However, some people have lived up to 30 years on hemodialysis without drastic changes to their quality of life.Recovery and OutlookWhat is the recovery time?Most people start to feel better a few weeks after starting hemodialysis.Reach out to your healthcare provider if you feel sick or tired after your session. They can prescribe medications or make adjustments to help you feel better.When can I go back to work?If you have a desk job, you should be able to return to work once you’re used to hemodialysis. It usually takes a week or two to adjust.If you have a more physically demanding job, it might be a good idea to find a new job that puts less stress on your body.When to Call the DoctorWhen should I see my healthcare provider?Contact your healthcare provider if you experience:Signs of low blood pressure, including dizziness, fainting or dehydration.Nausea and vomiting.Signs of infection.Severe pain in your abdomen.A bulge in your abdomen (hernia).Additional Common QuestionsWhat is the difference between dialysis and hemodialysis?Dialysis is the general name for treatment that filters waste products from your blood when your kidneys no longer work. Hemodialysis is a type of dialysis.There are two types of dialysis: hemodialysis and peritoneal dialysis.What is the difference between hemodialysis and peritoneal dialysis?During hemodialysis, your blood leaves your body and enters a machine that filters out waste products and extra fluid. Once the machine has filtered your blood, it goes back into your body.During peritoneal dialysis, your healthcare provider will attach a catheter to your abdominal lining (peritoneal membrane). You then attach a bag with a dialysis solution to your catheter. The solution flows from the bag into your peritoneal cavity, absorbing waste products and extra fluid. Approximately 60 to 90 minutes later, you drain the solution with the waste products and fluid into a clean, empty bag.A note from Cleveland ClinicHemodialysis is a type of dialysis. It’s a life-saving treatment in which a machine filters waste products and extra fluids out of your blood when your kidneys stop working.It’s a time-consuming process, and you may need regular treatments for the rest of your life. You may be upset about how hemodialysis affects the control you feel you have on your life. These feelings are normal. It’s important to remember that you’re the most important person in charge of your care. You make the ultimate decisions about your health, and your healthcare provider is here for you to provide information and guidance. Talk to them if you have any questions or need support or advice.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/23/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicKidney CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"