"Hip Replacement (Hip Arthroplasty)800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Hip Replacement (Hip Arthroplasty)AdvertisementAdvertisementAdvertisementHip Replacement (Hip Arthroplasty)Your healthcare provider will usually only recommend a hip replacement after other, more conservative treatments don’t relieve your pain or mobility symptoms. The recovery time can take up to 12 weeks, but most people who’ve had a hip replacement live with it for the rest of their lives.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewOrthopaedic hip replacement.What is a hip replacement?A hip replacement is a surgical procedure. An orthopedic surgeon will replace your hip (or parts of it) with a human-made implant (a prosthesis). Your surgeon might refer to a hip replacement as a hip arthroplasty (a joint replacement surgery).Surgeons perform more than 90% of hip replacements on adults older than 50. Your provider might recommend a hip replacement if pain and other symptoms in your hip affect your ability to stand, walk and move.Types of hip replacementsYour surgeon will perform either a total hip replacement or a partial hip replacement:Total hip replacement: A surgeon will replace your whole hip with a prosthetic joint. They’ll replace the top (femoral head) of your thighbone (femur) and the socket it fits into (acetabulum). Almost all hip replacements are total hip replacements.Partial hip replacement: Partial hip replacements are very rare. Your surgeon will replace only part of your hip. These are usually only done to repair certain types of broken hips (hip fractures) or to remove certain types of tumors.When would I need a hip replacement?You might be a good candidate for a hip replacement if symptoms in your hip are making it hard (or impossible) to participate in your daily routine. Most people who get a hip replacement try other, more conservative treatments like medication, physical therapy or using a cane or walker before needing surgery. Your provider will probably suggest these kinds of treatments before recommending a hip replacement.Arthritis is the most common cause of hip pain and other symptoms that lead to people needing a hip replacement. Some of the most common types of arthritis can affect your hip, including:Osteoarthritis.Rheumatoid arthritis.Psoriatic arthritis.Other health conditions and issues that can damage your hip joint enough to require a hip replacement include:Osteonecrosis.Traumas like car accidents or falls.Femoroacetabular impingement syndrome (FAI or hip impingement).Hip dysplasia.Benign tumors (neoplasms).Cancer.Perthes disease.How common are hip replacements?Surgeons perform more than 350,000 hip replacements in the U.S. each year.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before a hip replacement?Your surgeon will perform a physical exam and some tests before your hip replacement surgery. They’ll ask you about your symptoms and check your current range of motion (how far you can move your hip). Tell your surgeon about any medications and supplements you’re taking.Your surgeon will compare the hip you’ll be replacing with your other hip. They’ll have you move your hip in different directions. These motions will help them check the muscles that support your hip and leg.You’ll probably need several tests before a hip replacement, including:Hip X-rays.Blood tests like a basic metabolic panel (BMP).Urinalysis (testing your pee).You might need other imaging tests in addition to X-rays. Your surgeon might order:Magnetic resonance imaging (MRI).A computed tomography (CT) scan.An electrocardiogram (EKG).What happens during this procedure?During a hip replacement, your surgeon will remove some or all of your hip and replace it with a prosthesis. You’ll receive regional anesthesia before your surgery. Regional anesthesia blocks pain in a large area of your body but doesn’t completely put you to sleep. Some providers refer to regional anesthesia as a spinal or a spinal block.No matter which type of hip replacement you need, your surgeon will remove bone and cartilage from your existing hip joint and replace it with the prosthesis. Prosthetic hips are usually made of metal, plastic or ceramic.How long does a hip replacement take?Hip replacements usually take one to two hours. Your surgeon will tell you how long your surgery will take based on which type of hip replacement you’ll need.AdvertisementWhat happens after this procedure?Most hip replacements are outpatient surgeries, which means you can go home the same day. You might need to stay in the hospital overnight (outpatient extended recovery). Your anesthesiologist will make sure you wake up from anesthesia correctly and don’t experience any immediate complications from your surgery.Care at Cleveland ClinicGet Orthopaedic CareMake an AppointmentRisks / BenefitsWhat are the benefits of a hip replacement?Hip replacements are usually very successful surgeries. Most people who have a hip replacement experience a dramatic decrease in their symptoms — especially pain and stiffness.Once you’re fully recovered, you should have increased mobility and range of motion (how well and how far you can move your hip). A hip replacement usually makes it easier to walk, climb stairs and do other physical activities.AdvertisementWhat are the risks or complications of a hip replacement?Complications from a hip replacement are rare, but can happen. The most common complications include:Infections.Blood clots in your legs (deep vein thrombosis) or lungs (pulmonary embolism).Issues with the prosthesis, including it loosening or dislocating.Bone fractures (broken bones) around the prosthesis.Stiffness in your joint.Recovery and OutlookHow long does it take to recover from a hip replacement?Everyone’s body responds differently to hip replacement surgery. It usually takes people several months to recover after a hip replacement. You’ll need physical therapy for a few months.Your surgeon or physical therapist will give you stretches and exercises to start as soon as 24 hours after your surgery. They’ll monitor the strength and flexibility in your leg and hip and your ability to stand and sit.You’ll need to do exercises that strengthen and stretch the muscles around your hip joint. You’ll also slowly return to climbing stairs, bending and walking. You’ll regain your range of motion and strength over time. It might be six to 12 weeks before you’re able to use your hip with no restrictions.Ask your surgeon or physical therapist for tips on moving through your home safely after your surgery. They can show you how to:Walk and move.Sit down and stand up.Go to the bathroom.Bathe or shower.Get dressed.Use stairs.How long does a hip replacement last?The prosthetic hips used in hip replacements usually last a long time. Lots of people who have a hip replacement keep the implant for the rest of their lives.It’s rare, but some people need additional surgeries on their hips in the future. Your surgeon will tell you what to expect.When to Call the DoctorWhen should I call my healthcare provider?Contact your surgeon right away if you notice any of the following after a hip replacement:Severe pain.Bleeding or other drainage at your surgery site.Swelling.Discoloration or redness around your surgery site.Additional DetailsWhat is the hip replacement recovery time for people older than 70?Everyone’s recovery time from a hip replacement surgery is different. Even your age doesn’t guarantee your recovery will be quicker or take longer than someone else’s. People older than 70 can sometimes take longer to recover than people younger than 70, but there’s no set rule that guarantees how long your body will take to heal.The most important part of your recovery is how you feel. As you progress through physical therapy and your body heals, you should notice that it’s easier to move and use your hip than it was before your surgery.Does a hip replacement cure arthritis?Arthritis is a broad term that healthcare providers apply to more than 100 conditions that cause inflammation in your joints. There’s no cure for arthritis. It’s not the same kind of condition as a bacterial infection that a healthcare provider can cure by prescribing antibiotics.Your surgeon will remove and replace the damaged parts of your hip during a hip replacement. It’s not technically curing the arthritis, but symptoms like pain, stiffness and inflammation that affect your hip should be gone once you’ve recovered.A note from Cleveland ClinicHaving any surgery can be scary, especially when it’s to replace a part of your body with a prosthesis. But hip replacements are extremely safe, effective and successful surgeries. If you’re experiencing symptoms like pain, stiffness and trouble moving your hip, ask your provider if a hip replacement could be a good option for you.After your surgery, you’ll need time to strengthen your muscles and heal your body. Take your recovery slow and don’t rush yourself. Talk to your surgeon or physical therapist about your movement goals and which activities you’d like to participate in after your hip replacement.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/10/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Orthopaedic CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2606Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"