"Hip Arthroscopy: What It Is, Procedure, and Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Hip ArthroscopyAdvertisementAdvertisementAdvertisementHip ArthroscopyHip arthroscopy is becoming one of the most common ways to treat hip issues, and with good reason: It’s minimally invasive, quick to perform and has a shorter recovery time than many other surgeries.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewA hip arthroscopy performed on a person’s left hip.What is hip arthroscopy?Hip arthroscopy is a minimally invasive surgery used to treat issues in your hip. Your surgeon will make a few small incisions (cuts) in the skin of your hip then insert a special tool called an arthroscope into your hip joint. The arthroscope includes a camera and a light that lets your surgeon identify and repair damage inside your hip. They’ll also insert any other small tools they need to repair damage to your bones or connective tissues.The incisions required to perform a hip arthroscopy are much smaller than other forms of surgery, which means it’s less stressful on your body than other procedures. You’ll need physical therapy after your surgery to increase your strength and ability to move your hip again. Most people need a few months to recover after a hip arthroscopy.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs hip arthroscopy?Anyone with hip pain that hasn’t responded to other treatments is a good candidate for hip arthroscopy. It can also help people who are having trouble moving properly because of an issue inside their hip joint. Typically, your healthcare provider will recommend arthroscopy only after they’ve identified the cause of your pain and non-surgical treatments like steroid injections or physical therapy and they haven’t completely worked.Hip arthroscopy vs. total hip replacementHip arthroscopy is a much less invasive procedure than a total hip replacement (hip arthroplasty). For many people, an arthroscopy will solve the issues causing pain or mobility issues in their hips. If arthroscopy isn’t successful — or if your symptoms are severe enough — your provider might recommend a hip replacement. People with significant damage to their cartilage or severe arthritis usually need total hip replacements.What does hip arthroscopy treat?Hip arthroscopy is an effective, minimally invasive surgery that can treat a wide range of issues.Some of the most common conditions hip arthroscopy is used to treat include:Femoroacetabular impingement (FAI): FAI — also called hip impingement — is an unusually shaped hip joint that causes two bones in your hip to rub together. The pressure causes friction between the top of your femur (thighbone) and acetabulum (hip socket). FAI can limit your range of motion and cause pain.Labral tears: Labral tears are injuries to the labrum, the soft tissue that covers the acetabulum (socket) of your hip. A labral tear can be caused by trauma, structural problems or degenerative issues.Removing pieces of bone or cartilage: If your hip’s bones or cartilage are damaged, or loose pieces inside your joint are causing you pain, your surgeon can remove them.Dysplasia: Hip dysplasia is a condition that means your femur does not fit together with the pelvis as it should.Tendon tears: Tendons link your muscles to your bones. Your surgeon can reattach tendons that have torn away from the bones in your hip during an injury.Tendon releases: Contractures (tendons that are too tight) can be released or moved with hip arthroscopy.AdvertisementHow common is hip arthroscopy?Hip arthroscopy is becoming increasingly common, and surgeons are able to treat more conditions than they were even five or 10 years ago.For years, arthroscopy has been used to treat issues in people’s shoulders, knees and ankles, and it’s quickly becoming more common to address hip issues. Ongoing advancements in technology and surgical techniques have made hip arthroscopy an option for more people than ever before. In fact, some experts estimate that the number of hip arthroscopies performed in the U.S. increased more than 600% in the last 15 years.Procedure DetailsWhat happens before hip arthroscopy?Before your hip arthroscopy, you might need to:Stop taking certain medications: Make sure you tell your provider and surgeon everything you’re taking — including over-the-counter medicines or herbal supplements. This is especially important if you take any drugs to prevent blood clots. Your surgeon will tell you which medications to stop or how to alter your daily routine.Stop smoking: If you smoke or use other kinds of tobacco products, you should try to quit. In addition to the everyday health risks, smoking makes it harder for your body to heal after a surgery.Reduce how much alcohol you drink: Alcohol thins your blood, which can make it dangerous to have in your system before and after surgery.Fast: Your surgeon will tell you if you need to avoid eating and drinking anything before your hip arthroscopy. You might need to plan ahead and not eat or drink anything except water up to 12 hours before surgery.AdvertisementWhat happens during hip arthroscopy?During a hip arthroscopy your surgeon will make a few small cuts (about the size of a buttonhole) in the skin on your hip and insert the arthroscope. They’ll also insert any other tools they need to repair any damage to your hip’s bones or connective tissues.You will receive either regional anesthesia near your hip to make sure you don’t feel pain during the surgery or general anesthesia to put you to sleep during the operation.Most arthroscopies take around 90 minutes, but the length of your surgery will depend on your unique needs.What happens after hip arthroscopy?Hip arthroscopy is usually an outpatient surgery, meaning you should be able to go home the same day as your procedure. Most people need to wear a brace on their hip for around three weeks after surgery. You’ll need to use crutches for a few weeks, and won’t be able to put any weight on your hip for at least a week.Your provider or surgeon will give you a personalized recovery plan and will go over the results of your surgery with you.You may need to:Avoid putting weight or pressure on your hip (including while you sleep).Ice and elevate the area.Keep the incision clean and covered.Take NSAIDs for pain after the surgery.Take showers, not baths, until the incision heals.Care at Cleveland ClinicSchedule Hip SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of hip arthroscopy?Hip arthroscopy is much less invasive than other types of surgery. Your surgeon will likely only need a few small incisions to fix the underlying issue(s) in your hip. This means you should experience:A faster recovery time.Less pain after the surgery.Minimal blood loss and scarring.Lower risk for complications compared to more invasive surgery techniques.What are the risks or complications of hip arthroscopy?Potential complications from hip arthroscopy include:Allergic reaction to anesthesia.Blood clots, including deep vein thrombosis (DVT).Damage to surrounding tissue or nerves.Excessive bleeding or swelling.Infections.Numbness or tingling in your groin, thigh or foot.A need for further surgery if your underlying issues don’t improve.Recovery and OutlookWhat is the recovery time for hip arthroscopy?Most people recover from a hip arthroscopy in around six weeks. Your exact time to heal fully will depend on why you needed surgery.You’ll need crutches for a week or two after your surgery. After that, you should be able to walk and put more weight on your hip.You will also need physical therapy. This could last anywhere from a few weeks to a few months after your surgery. You should be able to return to heavy exercise and/or sports in around 12 weeks.Talk to your surgeon or healthcare provider for a specific recovery timeline.When can I go back to work or school after hip arthroscopy?If your job or schoolwork involves sitting at a desk or in an office, you should be cleared to return to work or school after a week or two. Check with your provider or surgeon before resuming any activity that might put stress on your hip.When to Call the DoctorWhen should I see my healthcare provider?You should call your healthcare provider if you experience:Intense pain or bleeding at the incision site.Nausea and vomiting.Signs of infection, such as fever or discoloration at the incision site.A note from Cleveland ClinicHip arthroscopy is an increasingly common way surgeons treat a variety of hip conditions. It’s a minimally invasive technique so you can expect a quick surgery, to go home the same day and a relatively quick recovery time.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 12/08/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Hip SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2606Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"