"Hip Resurfacing: Recovery, Pain Relief & What Is It800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Hip ResurfacingAdvertisementAdvertisementAdvertisementHip ResurfacingHip resurfacing is a form of hip replacement surgery. It uses implants to ease hip pain and stiffness caused by osteoarthritis and other conditions. The implants take the place of damaged tissue and bone, allowing for more fluid movement. Men younger than 60 are the best candidates for hip resurfacing.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is hip resurfacing?Hip resurfacing is a type of hip replacement surgery. It relieves arthritis pain in the hip. An orthopaedic surgeon (bone and joint specialist) performs the procedure.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow do hip joints work?Your hip is a ball-and-socket joint that is part of the skeletal system. It includes the:Hip socket (acetabulum).Ball-shaped head of the upper thighbone (femoral head).What causes hip pain?Cartilage covers the hip ball-and-socket joint. This tissue cushions bones so they can move together with ease. Arthritis can wear down cartilage in the hip joint. Over time, bone rubs against bone, causing pain and limiting movement.AdvertisementHow does hip resurfacing work?Hip resurfacing involves trimming damaged bone and cartilage from the ball and socket. Your surgeon places a smooth metal cap on top of the trimmed thighbone. A metal shell goes into the hip socket. These two metal components move together, allowing for painless, fluid motion.What’s the difference between hip resurfacing and hip replacement?It’s as different as putting on a hat, or cutting off your head.During hip resurfacing, your surgeon trims away small amounts of damaged cartilage and bone. You keep almost all the bone in your thigh and hip socket.With hip replacement, a surgeon removes the entire head of the thighbone and replaces it with a metal stem, which is inserted down into the thigh bone (femur). A metal or ceramic ball secures to the top of the stem. This implant fits into a new metal hip socket, usually with a plastic liner.AdvertisementWho benefits from hip resurfacing?Hip resurfacing can ease hip pain from osteoarthritis. Hip pain is often felt in the groin, and sometimes in the buttock or the side of the hip. Your healthcare provider may recommend the procedure if hip pain doesn’t improve with nonsurgical treatments.Hip resurfacing isn’t right for everybody. People older than 65 shouldn’t get the procedure. Hip replacement works fine in the elderly. This age group is more likely to have weaker bones (osteoporosis), which can complicate both hip resurfacing and hip replacement.Candidates for hip resurfacing typically are:Younger, active men, with strong, healthy bones.Women do not do as well as men, and are rarely resurfaced.The average age for hip resurfacing is the early 50’s.Procedure DetailsHow do surgeons perform hip resurfacing?Hip resurfacing usually takes place under spinal anesthesia, with sedation. You are asleep, breathing on your own. The procedure takes under two hours.During hip resurfacing, your surgeon:Makes an incision in the thigh to access the hip joint.Trims damaged bone and cartilage from the thighbone head (ball).Uses surgical cement to attach a smooth metal cap to the ball.Removes damaged bone and cartilage from the hip socket.Pushes a metal shell into the hip socket. The socket has a roughened back which attaches itself to the bone of the pelvis.Moves the femoral head (ball) into the hip socket.Closes the incision with stitches.What should I expect after hip resurfacing?You’ll spend a day or two in the hospital. If your surgeon gives the OK, you can start putting weight on the leg soon after surgery. You may need to use crutches, a walker or a cane for a few weeks until you feel comfortable getting around.Nonsteroidal anti-inflammatory drugs (NSAIDs) can ease pain. Physical therapy can help you regain mobility. You should be able to resume everyday activities after six weeks. By the end of 12 months, you can return to full, unrestricted activity - including sports.Care at Cleveland ClinicGet Orthopaedic CareMake an AppointmentRisks / BenefitsWhat are the potential risks or complications of hip resurfacing?All surgeries carry a risk of blood clots, infection and nerve injury. Other complications of hip resurfacing include:Fractures: A small number of people develop a fracture in the femoral neck, the part of the thighbone that supports the head (ball).Metal reaction: Rarely, you may have a reaction to the metal in the implants. As the metal cap moves within the metal socket, the friction releases metal debris, which can inflame surrounding tissue and bone. Metal ions can get into the bloodstream, where special testing can detect whether there is excessive debris. Scientists are working to develop alternatives to metal implants to prevent this problem.If either of these problems occur, you will need further hip surgery.Recovery and OutlookHow effective is hip resurfacing?Hip resurfacing is as effective as hip replacement in easing hip pain and improving mobility.Compared to hip replacement, hip resurfacing offers these advantages:Improved mobility: Most people who get hip resurfacing can run, jump and do all activities after they heal. People who have replacements should stick to low-impact activities like walking, swimming and golfing. High-impact activities can loosen the artificial joints, causing problems.More equal leg lengths: Hip replacement surgery can result in a slightly shorter or longer treated leg. There’s less risk of this problem with hip resurfacing because your surgeon removes less bone.Reduced risk of hip dislocation: A resurfaced thighbone head (ball) fits more securely into a resurfaced hip socket, and is the normal size. Artificial joints have a looser fit and the smaller ball may pop out of place (dislocation).Simpler follow-up (revision) procedures: Some patients need further “revision” surgery to replace the implants, which may become loose, worn, or infected even years later. Hip resurfacing leaves more bone, making it easier to swap out old components for new ones. It is more complicated to revise a total hip replacement because there’s less bone to work with. This is one of the most important benefits for young, active patients who need hip surgery.When to Call the DoctorWhen should I call the healthcare provider?You should call your healthcare provider if you experience:Fever or other signs of infection at the incision site (skin is red, tender or has yellow discharge).Limited movement.Calf pain, unexpected pain in either leg, shortness of breath or chest pain.Popping sensation in the hip that may indicate dislocation or fracture.Severe hip pain.Hip resurfacing is a viable option for younger, active people, especially men, who have arthritic hip pain. The U.S. Food and Drug Administration (FDA) approved hip resurfacing in 2006, although the device has been used in the UK and elsewhere since 1997. It’s important to find an orthopaedic surgeon who has successful experience performing this procedure.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 12/14/2020.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Orthopaedic CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2606Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"