"Hormone Therapy for Cancer800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Hormone Therapy for CancerAdvertisementAdvertisementAdvertisementHormone Therapy for CancerHormones are chemicals that coordinate different functions in your body. But some types of cancer need hormones to grow and multiply. Hormone therapy cuts off cancer’s access to hormones. Healthcare providers may combine hormone therapy with treatments such as surgery, chemotherapy or radiation therapy.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is hormone therapy for cancer?Hormones are chemicals that coordinate different functions in your body. Your glands release hormones into your bloodstream, sending messages through your blood to your organs. Your body can’t function without hormones. But hormones may fuel cancer. Some cancerous cells need hormones to grow, multiply and spread.Hormone therapy works by eliminating cancerous cells’ access to the hormones they need to grow. Healthcare providers may combine hormone therapy with treatments such as surgery, chemotherapy or radiation therapy. They may also use hormone therapy after treatment to lower the risk of cancer coming back.How does this therapy work?Healthcare providers may use hormone therapy to:Stop your body from producing the hormones that help specific cancerous cells to grow and multiply. In some cases, surgeons remove the glands that produce the hormones that cancerous cells use to grow.Block access to the hormones that cancerous cells need to grow and multiply.Substitute bioidentical hormones for actual hormones. Bioidentical hormones are lab-made, artificial hormones. Cancerous cells can’t use bioidentical hormones to grow, so replacing natural hormones with bioidentical hormones keeps the cells from multiplying.What kinds of cancer does hormone therapy treat?Healthcare providers may use hormone therapy to treat prostate cancer and cancers called estrogen-dependent cancers, including breast cancer, ovarian cancer and uterine cancer.Hormone therapy for prostate cancerHormone therapy for prostate cancer typically uses different medications that block hormones from connecting with cancerous cells. In some instances, hormone therapy involves surgery to remove one or both testicles (orchiectomy). Medications may include:Abiraterone acetate: This medication keeps prostate cancer cells from making androgens. Androgens are hormones such as testosterone that help people enter puberty and mature physically. This treatment may help people who have prostate cancer that hasn’t responded to other hormone therapy or who have prostate cancer that’s likely to come back after treatment.Luteinizing hormone-releasing hormone (LHRH) agonists: LHRH agonists work by telling your pituitary gland to stop making luteinizing hormones. This hormone stimulates people’s testicles to release testosterone. Certain cancerous cells rely on testosterone to grow. Without a steady supply of testosterone, those cells stop growing.Antiandrogens: Like luteinizing hormones, antiandrogens reduce how much testosterone people produce.Healthcare providers may also treat prostate cancer with a combination of hormone therapy and radiation therapy.Side effects of hormone therapy for prostate cancerPeople may have different reactions to hormone therapy for prostate cancer. Ask your healthcare provider about specific side effects. Common side effects may include:Weight gain.Less or loss of interest in sex.Erectile dysfunction.Loss of bone density (osteoporosis.)Hormone therapy for breast cancerEstrogen plays a role in causing certain cancers. Cells in your body have hormone receptors. The hormone receptors are a type of protein. Estrogen in your bloodstream can attach to the receptors. About 8 out of 10 breast cancers are hormone receptor-positive (ER-positive). Healthcare providers treat breast cancer by lowering hormone levels or blocking hormones from attaching to breast cancer cells. Most often, healthcare providers use hormone therapy after surgery to reduce the risk of breast cancer recurrence. However, they may also use it before surgery to shrink cancerous tumors (adjuvant therapy) or to treat cancer that’s spread to other parts of your body.Hormone therapy for breast cancer may include aromatase inhibitors, selective estrogen receptor modulators (SERMs) or estrogen receptor down regulators (ERDs):Aromatase inhibitors: This medication lowers estrogen levels. It does that by blocking the enzyme aromatase, which turns other hormones into estrogen. In ER-positive cancer, estrogen boosts cancerous cell growth. If you have ER-positive breast cancer and you’ve gone through menopause, your healthcare providers may use this type of hormone therapy.Selective estrogen receptor modulators (SERM): SERM medications work by keeping estrogen from connecting with cancerous cells. Without that estrogen connection, cancerous cells can’t grow and multiply.Estrogen receptor down regulators (ERDS): ERDS work by blocking estrogen and by making it more difficult for estrogen to connect with cancerous cells.Side effects of hormone therapy for breast cancerSide effects from hormone therapy vary from person to person. Common side effects may include:Joint pain or stiffness.Fatigue.Nausea and vomiting.Weight gain.Less or loss of interest in sex.Hot flashes.Tender or swollen breasts.Hormone therapy for ovarian cancerHealthcare providers may use hormones to treat a rare form of ovarian cancer. Hormone therapy for ovarian cancer may include luteinizing hormone-releasing hormone agonists: LHRH agonists, tamoxifen and aromatase inhibitors.Side effects of hormone therapy for ovarian cancerSide effects may include:Hot flashes.Vaginal dryness.Osteoporosis.Joint and muscle pain.Hormone therapy for uterine cancerHealthcare providers may use hormone therapy after surgery to remove cancerous uterine tumors, to treat advanced or recurring uterine cancer, or as palliative care to ease uterine cancer pain. Progestin is the most common hormone therapy for uterine cancer. These drugs work like the hormone progesterone, slowing uterine cancer cell growth. Healthcare providers may also treat uterine cancer with tamoxifen, LHRH agonists or aromatase inhibitors.Side effects of hormone therapy for uterine cancerSide effects may include:Hot flashes.Weight gain.Night sweats.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow do healthcare providers administer hormone therapy?Hormone drug therapy may involve injections of certain hormones or taking oral medications.Care at Cleveland ClinicGet Cancer CareMake an AppointmentRisks / BenefitsWhat are the risks of hormone drug therapy?Like most cancer treatments, hormone drug therapy may cause side effects. Everyone’s experience is different. Your reaction to hormone drug therapy depends on factors like overall health and the kind of hormone drug therapy you received. Ask your healthcare provider about potential side effects, including side effects that may cause serious complications.AdvertisementWhat are the advantages of hormone therapy?Hormone therapy may help slow or stop cancer from growing, particularly if it’s combined with other treatments.Recovery and OutlookWhat is the success rate for hormone therapy for cancer?Hormone therapy is one of many ways healthcare providers treat certain types of cancer. Depending on your situation, hormone therapy may keep cancer from growing or slow its growth. If you have cancer, ask your healthcare provider how hormone therapy may make a difference. They’re your best resource for information about your specific situation.AdvertisementWhen to Call the DoctorWhen should I see my healthcare provider?If you’re receiving hormone therapy for cancer, you’ll see your provider regularly depending on your treatment plan.A note from Cleveland ClinicYour hormones are essential. They tell your body what to do and when to do it. Certain types of cancer use hormones to grow and multiply. Hormone therapy for cancer blocks cancerous cells’ access to those hormones. If you have prostate cancer, advanced uterine cancer or a certain type of breast cancer, your healthcare provider may treat your condition with hormone therapy to keep cancer from growing or to slow down how fast it grows. Ask your provider about treatment options and which ones might be best for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/22/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Cancer CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"