"Hormone Therapy for Menopause: Types, Benefits & Risks800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Hormone Therapy for Menopause SymptomsAdvertisementAdvertisementAdvertisementHormone Therapy for Menopause SymptomsHormone therapy (HT) is used to treat symptoms of menopause. Your age, family medical history, personal medical history and severity of your menopausal symptoms are factors that may affect your decision to take hormone therapy. Talk with your healthcare about the benefits and risks of HT, the different forms of HT and other alternative options.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewWhat are estrogen and progesterone?Estrogen and progesterone are hormones that are produced by a woman’s ovaries.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat does estrogen do?Estrogen plays a role in many body functions, including:Thickens the lining of your uterus, preparing it for the possible implantation of a fertilized egg.Influences how your body uses calcium, an important bone-building mineral.Helps maintain healthy blood cholesterol levels.Keeps your vagina healthy.Helps prevent osteoporosis.What does progesterone do?Progesterone plays a role in many body functions, including:Helps prepare your uterus for the implantation of a fertilized egg and maintains your pregnancy.Regulates blood pressure.Improves mood and sleep.AdvertisementWhat is hormone therapy (HT)?As you begin to transition into menopause, your ovaries no longer produce high levels of estrogen and progesterone. Changes in these hormone levels can cause uncomfortable symptoms. Common menopause symptoms include:Hot flashes.Night sweats and/or cold flashes.Vaginal dryness; discomfort during sex.Feeling a need to pee (urinary urgency).Trouble sleeping (insomnia).Mood swings, mild depression or irritability.Dry skin, dry eyes or dry mouth.Hormone therapy (HT) is used to boost your hormone levels and relieve some of the symptoms of menopause. Whether or not you should consider taking HT therapy is a discussion to have with your healthcare provider. There are many health benefits and risks associated with taking HT.What are the types of hormone therapy (HT)?There are two main types of hormone therapy (HT):Estrogen Therapy: Estrogen is taken alone. Doctors most often prescribe a low dose of estrogen to be taken as a pill or patch every day. Estrogen may also be prescribed as a cream, vaginal ring, gel or spray. You should take the lowest dose of estrogen needed to relieve menopause symptoms and/or to prevent osteoporosis.Estrogen Progesterone/Progestin Hormone Therapy (EPT): Also called combination therapy, this form of HT combines doses of estrogen and progesterone (or progestin, a synthetic form of progesterone).AdvertisementDoes having or not having a uterus make a difference in deciding what type of hormone therapy I should take?Yes, it does.If you still have your uterus:Progesterone is used along with estrogen. Taking estrogen without progesterone increases your risk for cancer of the endometrium (the lining of the uterus). During your reproductive years, cells from your endometrium are shed during menstruation. When the endometrium is no longer shed, estrogen can cause an overgrowth of cells in your uterus, a condition that can lead to cancer.Progesterone reduces the risk of endometrial (uterine) cancer by making the endometrium thin. If you take progesterone, you may have monthly bleeding, or no bleeding at all, depending on how the hormone therapy is taken. Monthly bleeding can be lessened and, in some cases, eliminated by taking progesterone and estrogen together continuously.If you no longer have your uterus (you’ve had a hysterectomy):You typically won't need to take progesterone. This is an important point because estrogen taken alone has fewer long-term risks than HT that uses a combination of estrogen and progesterone.Procedure DetailsWhat are some commonly used postmenopausal hormones?The following list provides the names of some, but not all, postmenopausal hormones.EstrogenPills, Brand names: Cenestin®, Estinyl®, Estrace®, Menest®, Ogen®, Premarin®, Femtrace®.Creams, Brand names: Estrace®, Ogen®, Premarin®.Vaginal ring, Brand names: Estring®, Femring® (treats vaginal symptoms and hot flashes).Vaginal tablet, Brand names: Vagifem®. Imvexxy®Patch, Brand names: Alora®, Climara®, Minivelle®, Estraderm®, Vivelle®, Vivelle-Dot®, Menostar®.Spray, Brand name: Evamist®.Combination EPTPills, Brand names: Activella®, FemHRT®, Premphase®, Prempro®, Angeliq®, Bijuva®.Patch, Brand names: CombiPatch®, Climara-Pro®.Vaginal dehydroepiandrosterone (DHEA)Vaginal insert, Brand name: Intrarosa®Care at Cleveland ClinicMenopause TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of taking hormone therapy(HT)?Hormone therapy (HT) is prescribed to relieve menopausal symptoms including:Hot flashes.Vaginal dryness that can result in painful intercourse.Other problematic symptoms of menopause, such as night sweats and dry, itchy skin.Other health benefits of taking HT include:Reduced risk of developing osteoporosis and reduced risk of breaking a bone.Improved mood and overall sense of mental well-being in some women.Decreased tooth loss.Lowered risk of colon cancer.Lowered risk of diabetes.Modest improvement in joint pains.Lower death rate for women who take hormone therapy in their 50s.What are the risks of taking hormone therapy(HT)?While hormone therapy (HT) helps many women get through menopause, the treatment (like any prescription or even non-prescription medicines) is not risk-free. Known health risks include:An increased risk of endometrial cancer (only if you still have your uterus and are not taking a progestin along with estrogen).Increased risk of blood clots and stroke.Increased chance of gallbladder/gallstone problems.Increased risk of dementia if hormone therapy is started after midlife. HT started during midlife is associated with a reduced risk of Alzheimer’s disease and dementia.Increased risk of breast cancer with long-term use.What is known about hormone therapy and the risk of heart disease?Scientists continue to learn about the effects of HT on the heart and blood vessels. Many large clinical trials have attempted to answer questions about HT and heart disease. Some have shown positive effects in women who started HT within 10 years of menopause; some have shown negative effects when started greater than 10 years of menopause. Some studies have raised more questions about the potential benefits of HT.Based on the data, the American Heart Association issued a statement for use of HT. They say:Hormone therapy for the sole purpose of preventing heart disease (specifically heart attack or stroke) is not recommended.What is known about hormone therapy and the risk of breast cancer?Taking combined hormone therapy can increase your risk of developing breast cancer. Here are some important findings:Taking combination hormone therapy showed a rare increase of absolute risk of less than one additional case of breast cancer per 1000 person years of use.There was a nonsignificant reduction in breast cancer seen in women with hysterectomies on estrogen only therapy.If you’ve been diagnosed with breast cancer you should not take systemic hormone therapy.Who shouldn't take hormone therapy(HT)?Hormone therapy (HT) is not usually recommended if you:Have or had breast cancer or endometrial cancer.Have abnormal vaginal bleeding.Have had blood clots or are at high risk for them.Have a history of stroke, heart attack or increased risk for vascular disease.Know or suspect you’re pregnancy.Have liver disease.What are the side effects of hormone therapy(HT)?Like almost all medications, hormone therapy has side effects. The most common side effects are:Monthly bleeding (if you have a uterus and take cycled progestin [estrogen for 25 days of estrogen/month, progesterone for last 10 to 14 days/month, 3 to 6 days of no therapy]).Irregular spotting.Breast tenderness.Mood swings.Less common side effects of hormone therapy include:Fluid retention.Headaches (including migraine).Skin discoloration (brown or black spots).Increased breast density making mammogram interpretation more difficult.Skin irritation under estrogen patch.How can I reduce these side effects of hormone therapy (HT)?In most cases, these side effects are mild and don’t require you to stop your HT. If your symptoms bother you, ask your healthcare provider about adjusting either the dosage or the form of the HT to reduce the side effects. Never make changes in your medication or stop taking it without first consulting your provider.Recovery and OutlookHow long should I take hormone therapy (HT)?In general, there is no time limit to how long you can take hormone therapy. You should take the lowest dose of hormone therapy that works for you, and continue routine monitoring with your healthcare provider to reevaluate your treatment plan each year. If you develop a new medical condition while taking HT, see your provider to discuss if it’s still safe to continue taking HT.A note from Cleveland ClinicThe decision to take hormone therapy needs to be a very personalized one. Hormone therapy is not for everyone. Discuss the risks and benefits of hormone therapy with your healthcare provider at an office visit specifically dedicated for this conversation. You’ll need the time to address all the issues and answer questions in order to arrive at a decision that is best for you. Factors considered should be your age, family history, personal medical history and the severity of your menopausal symptoms.Be sure to talk about the pros and cons of the different types and forms of HT as well as non-hormonal options such as dietary changes, exercise and weight management, meditation and alternative options.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/28/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicMenopause TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"