"How To Use Crutches Correctly800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/How To Use CrutchesAdvertisementAdvertisementAdvertisementHow To Use CrutchesThe most important part of using crutches is going slowly and safely to make sure you don’t reinjure your leg or damage your surgery site.\n\nYour healthcare provider can show you techniques to stand, move, walk and use stairs before you try crutches at home.Who needs to use crutches?Crutches are one of the most common medical devices that people use while they’re recovering from an injury or after a surgery. They’re what’s known as a mobility aid — a tool that helps you move.Crutches help you stand, walk and move without putting your full weight on your recovering leg, knee or ankle.Your healthcare provider or orthopaedist will tell you which kind of crutches you need, how long you should use them and how to use crutches safely.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhen will I need to use crutches?It’s very common to need crutches after an injury or surgery. Some of the most common include:Sports injuries: All kinds of injuries from sprains, to ACL tears or a torn meniscus can require you to use crutches while you recover.Bone fractures: You might need crutches after breaking a bone in your leg, knee, ankle or foot.Ligament or tendon injuries: Your healthcare provider might prescribe crutches if you experience an injury like an Achilles tendon rupture or tendinitis.Surgery: You might need crutches after surgery on your lower body, including common procedures like arthroscopic surgery.How much weight can I bear with crutches?How much weight or pressure you can put on your leg, knee, ankle or foot depends on why you need crutches and how far into your recovery you are. Your healthcare provider, surgeon or physical therapist will advise how much weight you can lean on your recovering side — the medical term is “weight bearing.” Some of the terms they might use include:Nonweight bearing: You can’t put any weight on the part of your body that’s recovering.Toe touch for balance only: Only put your toe on the ground to lightly stabilize yourself and regain your balance. Don’t apply any weight or pressure on it.Partial weight baring or a certain percentage: Your healthcare provider will say you can use a certain percentage of your weight — like 50% or 80%. This isn’t usually a literal amount that you can’t go above — it’s more like a guide to help you understand how much you can use your recovering leg. Picture putting that amount of your usual weight down as you stand, walk and move.Weight bearing as tolerated: This means you can use your full weight as often as you can without feeling pain or other symptoms. Don’t push beyond your limits unless your healthcare provider tells you it’s OK.What are the different types of crutches?There are a few types of crutches you might need:Underarm (axillary) crutches: Underarm crutches are the most common type of crutch. They have a padded top that fits under your arm below your armpit, a straight frame and a handgrip.Forearm crutches: You might see these crutches referred to as elbow crutches. They’re usually shorter than underarm crutches. Forearm crutches have a supportive cuff that fits around the back of your upper arm just above your elbow and a handgrip.Gutter crutches: Gutter crutches are less common than the other types. They have a padded pocket on top of a straight pole. You rest your forearms in the pocket and hold onto the attached handgrip at the front of the gutter.AdvertisementHow do I make crutches more comfortable?Adjusting your crutches will make them more comfortable:Most crutches can be adjusted using a sliding mechanism. Ask your healthcare provider or physical therapist for help fitting the length to your body before using them.Make sure your crutches are adjusted to your height. If you have underarm crutches, the top should hit a few inches below your armpits, and the handgrips should be around your hips.Always rest your weight on your arms using the handgrips. Don’t lean on the top of the crutches under your arms.Remember these safety tips:Make sure your crutches have grooved rubber tips covering the bottom and that the underarm support and handgrips have comfortable padding.Check the bottom of your crutches for debris like stones, leaves or anything else that could make you slip after you use them outside.Make sure your home and workspace are free from clutter that could trip you or others.Use your crutches as long as your healthcare provider tells you to. Even if you feel like you’re recovering quickly, if you stop using them too soon, you can reinjure your leg or damage your surgery site.How do I stand with crutches?Follow these tips for standing up with crutches:Stand up straight with the crutches placed slightly in front of your body and slightly apart on either side.Don’t lean your weight on the underarm supports. Use the handgrips to support your weight.Leaning your weight on your armpits can make you less stable. It can also hurt your shoulder joints and the nerves and blood vessels under your arms. Putting weight on your shoulders will also tire you faster while using your crutches.AdvertisementHow do I move from sitting to standing with crutches?Getting up from a seated position is all about making sure you’re balanced and not letting your momentum move you farther than you want to.Scoot forward so your butt is on the edge of your seat.Hold both crutches in the hand that’s opposite your recovering leg.With one hand on a crutch handgrip and the other on your seat, push yourself up to a standing position. Make sure to use your strong leg as much as possible.Don’t put more pressure on your recovering leg than your weight-bearing limit.Get your balance before starting to move away from your seat.How do I sit down from standing with crutches?Sitting down into a seat is easier than lots of other movements with crutches. Make sure you don’t tip backward into the seat too quickly — you should still try to have slow, controlled motions so you don’t slip or fall.Back up to the edge of your seat as close as you can. You should be able to feel the edge of the seat against the back of your legs.Balance on your strong leg and remove your crutches from under your arms.Hold both crutches in one hand on the handgrip portion of the crutches. Reach backward with the other hand to support yourself on the seat.Slowly lower yourself into the seat.How do I walk with crutches?It’s important to walk safely with crutches while you’re recovering. If you’ve had a surgery, you might need to start moving as soon as the next day. Your surgeon will tell you when you should start walking.If you’re wearing a boot or cast on your foot or ankle, follow these steps the same way, just don’t put more weight on your foot than your healthcare provider says you can.Make sure you’re balanced safely before starting to move.Move both your crutches and your recovering leg forward at the same time.Push down with equal, even pressure on both handgrips and step through with your other leg.Regain your balance before stepping again.How do I walk with one crutch?After some injuries or surgeries, your healthcare provider might say you only need to use one crutch.Hold your crutch on the side opposite your recovering leg.Step forward with your strong leg.Step forward with your recovering leg and the crutch in your opposite hand at the same time.Use your crutch to support your weight as you move forward — make sure not to put more pressure on your recovering leg than your healthcare provider says is OK.How do I walk up stairs with crutches?Climbing up stairs can be dangerous if you try to go too fast. Make sure to go slowly and regain your balance before moving on to the next step. If it’s possible, have someone help you, especially the first few times.If the stairs have a handrail, use it to support yourself while you’re going up:Stand a shoe length away from the bottom step.Balance on your strong leg and hold the handrail for support.Tuck your crutches under the arm that’s not holding the handrail.Step up with your strong leg. Keep your recovering leg lifted and slightly behind you as you move up.Regain your balance before moving again.Follow these steps to go up stairs if your stairs don’t have a handrail:Stand a shoe length away from the bottom step.Hold your crutch on the same side as your recovering leg.Move your strong leg up first.Keep your recovering leg and crutch together on the step below.Then, move the crutch and your recovering leg together up to the next step to meet your strong leg.If you’re not comfortable or don’t feel safe walking up stairs on your crutches, you can hop up them on your butt.Sit on the lowest step with your back to the stairs.Hold your recovering leg out away from the stairs.Hold your crutches in the hand opposite your recovering leg.Push off the ground with your strong leg and the hand that’s not holding your crutches.Regain your balance and strength before pushing up to the next step.How do I walk down stairs with crutches?Going down stairs can be harder than walking up stairs, especially if you’re still getting used to your crutches. Go slowly and make sure your strong leg is safely on the step below you before shifting your weight or moving down.If the stairs have a handrail, use it to support yourself while you’re going down:Stand at the top of the stairs and get your balance before starting to move.Balance on your strong leg and hold the handrail for support.Hold the crutches in your other hand.Step down with your crutches and recovering leg first.Then, bring your strong leg down to meet your recovering leg.Regain your balance before moving again.Follow these steps to go down stairs if your stairs don’t have a handrail:Stand at the top of the stairs and get your balance before starting to move.Balance on your strong leg.Move both crutches to the next stair below you.Step down with your recovering leg to meet your crutches. Put even pressure on your crutches’ handgrips for support then bring your strong leg down to meet your recovering leg.Regain your balance before moving again.If you’re not comfortable or don’t feel safe walking down stairs on your crutches, you can scoot down them on your butt.Sit on the top step facing the bottom of the stairs.Hold your recovering leg out away from the stairs.Hold your crutches in the hand opposite your recovering leg.Slide down one step using your strong leg and the hand that’s not holding your crutches to brace yourself.Regain your balance and strength before moving off the next step.A note from Cleveland ClinicIt’s very common to need crutches after an injury or surgery. The most important part of using crutches safely is going slowly, making sure you’re safe and stable while you’re moving. Don’t be afraid to ask for help throughout your healing process. Your healthcare provider or physical therapist can help you adjust your crutches to be comfortable and safe. They’ll also show you how to use them.Care at Cleveland ClinicSchedule Physical Therapy for AdultsSchedule Physical Therapy for ChildrenMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/23/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Physical Therapy for AdultsSchedule Physical Therapy for ChildrenMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"