"HIPEC: Uses, Benefits, Side Effects & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Hyperthermic Intraperitoneal Chemotherapy (HIPEC)AdvertisementAdvertisementAdvertisementHyperthermic Intraperitoneal Chemotherapy (HIPEC)HIPEC (hyperthermic intraperitoneal chemotherapy) treats cancerous tumors in your abdominal (peritoneal) cavity — the area in your belly that holds your liver, stomach and intestines. In this treatment, surgeons remove cancerous tumors and then flood your abdominal cavity with heated chemotherapy drugs. HIPEC doesn’t cure cancer. But the treatment may help you live longer with cancer.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is hyperthermic intraperitoneal chemotherapy (HIPEC)?HIPEC (hyperthermic intraperitoneal chemotherapy) is cancer treatment for tumors in your abdominal (peritoneal) cavity — the area in your belly that holds your liver, stomach and several other organs. Often, healthcare providers use HIPEC to treat cancer that’s spread (metastasized) from another part of your body to your abdominal cavity.In hyperthermic intraperitoneal chemotherapy, surgeons remove cancerous tumors, and then circulate heated chemotherapy drugs in your abdominal cavity. HIPEC doesn’t cure cancer but treatments may help you live longer with cancer.How does HIPEC work?The treatment works by targeting microscopic cancerous cells in your abdominal cavity:“Hyperthermic” means heated or hot. Heat is cytotoxic, meaning it kills cancer. Research shows heating certain chemotherapy drugs boosts their cancer-killing ability. In HIPEC, chemotherapy drugs are heated to 108 degrees Fahrenheit (41 to 43 degrees Celsius).“Intraperitoneal” means chemotherapy is injected directly into your abdominal cavity, targeting tumors that systemic chemotherapy can’t reach. In HIPEC, there’s a continuous flow of heated chemotherapy drugs that wash throughout your abdominal cavity.Who is a good candidate for HIPEC?Healthcare providers typically use HIPEC for people who have metastatic cancer that’s spread into their abdominal cavity from another part of their body. To determine if HIPEC is the right treatment for you, your healthcare provider will consider:If you have other medical conditions.The kind of cancer that’s spread to your abdominal cavity.Your overall physical strength.Your surgical history.What cancers are treated with hyperthermic intraperitoneal chemotherapy?Healthcare providers typically use HIPEC to treat certain metastatic cancers, like:Adrenal cancer.Appendix cancer.Colorectal cancer.Liver cancer.Ovarian cancer.Stomach cancer.They may also use HIPEC to treat cancers that start in your belly, like:Primary peritoneal cancer.Peritoneal mesothelioma.Pseudomyxoma pertonei.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens during HIPEC?Hyperthermic intraperitoneal chemotherapy (HIPEC) is the second part of a two-part process. The first part is cytoreduction, surgery to remove cancerous tumors and damaged tissue in your abdominal cavity. Treatment steps include:You’ll receive general anesthesia, so you won’t feel any pain during treatment.Your surgeon will make an incision (cut) in your belly and remove cancerous tumors and affected tissue. While you’re still under anesthesia, your surgeon will insert a catheter (or catheters) through an incision in your belly.The catheter (or catheters) will be connected to a machine that heats up the chemotherapy to about 108 degrees F (41 degrees C).A pump will push the chemotherapy through the catheter to the inside of your belly.Your surgeon may gently move your body side to side so the heated chemotherapy drug washes over all of your belly cavity. (Think of rinsing a bowl by tilting it side to side.)The treatment may take several hours, depending on the amount of cancer in your abdomen.Once your surgeon completes treatment, they’ll drain the chemotherapy drugs from your belly cavity and rinse it with saline.Your surgeon will close any incisions made during the procedures.What happens after HIPEC?That depends on your situation and depends on the kind of surgery done to remove the cancerous tumor. In some cases, you may need to use a feeding tube to receive nutrition while your system recovers. That’s because HIPEC involves large doses of powerful chemotherapy that can affect your bowel function. Most people stay in the hospital for several days up to two weeks after treatment. AdvertisementRisks / BenefitsWhat are the potential benefits of hyperthermic intraperitoneal chemotherapy?HIPEC offers some advantages over traditional chemotherapy:You may have less serious side effects, as 90% of chemotherapy stays in your abdominal cavity, and your body is able to safely absorb and get rid of the small amount of chemotherapy that does seep out.You’ll receive cancer-killing drugs in an area of your body that systemic chemotherapy can’t reach or doesn’t normally help. Systemic chemotherapy, which flows through your entire body, can’t get past your peritoneum barrier. This is the membrane that lines your abdominal cavity and surrounds organs located there.You’re able to receive larger doses of chemotherapy or more intense chemotherapy, which can destroy more cancerous cells that remain after surgery.You’re able to complete treatment after one session, compared to having many therapy sessions done over several weeks.What are the risks or complications of HIPEC?All surgeries carry risks, like excessive bleeding and infection. HIPEC risks may vary depending on the type of cancer and the type of chemotherapy drugs used after surgery. Your surgeon will explain the risks involved if you have HIPEC.What are side effects of HIPEC?HIPEC side effects may include:Pain.Nausea and vomiting.Diarrhea.Constipation.Bloating.Weight loss.Fatigue.Depression.Temporary loss of bowel function.AdvertisementRecovery and OutlookWhat’s the recovery time for HIPEC?It can take four to 12 weeks to recover from the treatment, including several days to two weeks recovering in the hospital.What’s the outlook for hyperthermic intraperitoneal chemotherapy?It’s important to remember HIPEC doesn’t cure cancer. Surgery removes cancerous tumors and tissue, and heated chemotherapy kills microscopic cancerous cells that surgery doesn’t eliminate. But the tumors in your abdominal cavity can come back (recur). Likewise, you may develop new tumors if cancer outside your abdomen spread there.What should I call my healthcare provider?After HIPEC, call your healthcare provider if you experience:Fever above 101 F (38.3 C).Nausea and vomiting that doesn’t improve.Severe swelling or drainage around your incision site.Worsening pain.When to Call the DoctorWhen should I call my healthcare provider?After HIPEC, call your healthcare provider if you experience:Fever above 101 F (38.3 C).Nausea and vomiting that don’t improve.Severe swelling or drainage around your incision site.Worsening pain.A note from Cleveland ClinicHyperthermic intraperitoneal chemotherapy (HIPEC) is treatment for advanced cancer in your abdominal cavity, meaning there’s cancer in your abdominal cavity that started in another part of your body. HIPEC doesn’t cure cancer, but it can help people live longer with cancer. If you have a form of metastatic cancer, ask your healthcare provider if HIPEC may be a treatment option to consider.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/19/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"