"Hypnosis: What It Is, Why It’s Done, Benefits & Risks800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/HypnosisAdvertisementAdvertisementAdvertisementHypnosisHypnotherapy is a heightened state of concentration and focused attention. Guided by a trained, certified hypnotist or hypnotherapist, hypnosis allows you to be more open to suggestions to making healthful changes in your perceptions, sensations, emotions, memories, thoughts or behaviors.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsAdditional Common QuestionsOverviewWhat is hypnosis?Hypnosis, also called hypnotherapy, is a state of deep relaxation and focused concentration. It’s a type of mind-body medicine.A trained and certified hypnotist or hypnotherapist guides you into this deep state of focus and relaxation with verbal cues, repetition and imagery. When you’re under hypnosis, this intense level of concentration and focus allows you to ignore ordinary distractions and be more open to guided suggestions to make changes to improve your health.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow does hypnosis work?How hypnosis works isn’t completely understood. However, it’s commonly believed that in the deep state of focus and relaxation that’s achieved with hypnosis:Your conscious mind is quieted.You’re able to tap into the part of your brain where your thoughts, beliefs, perceptions, sensations, emotions, memory and behaviors originate.In this state, you’re more open to gentle guidance from your hypnotherapist to help you modify or replace the unconscious thoughts that are driving your current behavior.What are some myths about hypnosis?Myth: Hypnosis isn’t real. It’s a form of entertainment.Hypnosis isn’t a stage act or some magical act. Clinical hypnosis is a type of medical therapy that’s often used as part of a treatment plan that includes traditional medical approaches.Myth: You lose consciousness or have amnesia when you’re hypnotized.Most people remember everything that happens during hypnosis. You remain aware of who you are, where you are and remember what happened during a hypnosis session.Myth: You’re under the control of your hypnotherapist when you’re hypnotized.Your hypnotist or hypnotherapist guides hypnosis, but hypnosis is something you do for yourself. You can’t be made to do anything against your will. You won’t reveal any information that you wished to remain secret. You don’t lose control over your behavior. Hypnosis makes it easier to experience suggestions but doesn’t force you to have certain experiences.Myth: Hypnosis is nothing more than deep sleep.Hypnosis isn’t sleeping. There are some deeper forms of hypnosis that could make you appear to be asleep because your body is very still and quiet, but you aren’t asleep.AdvertisementWhat conditions is hypnosis helpful in treating?Hypnotherapy may help treat any number of medical conditions in which psychological factors influence physical symptoms.Common mental health uses include:Stress and anxiety, especially before medical or dental procedures; panic attacks; and post-traumatic stress syndrome (PTSD).Phobias.Behavior control issues, including giving up smoking, losing weight and enuresis (bedwetting).Common medical uses include:Insomnia.Asthma.Hot flashes during menopause.Gastrointestinal disorders, including irritable bowel syndrome (IBS).Pain control, including after surgery, childbirth, cancer, fibromyalgia, burns and headaches (migraine and tension).Skin conditions, including warts and psoriasis.Side effects of cancer chemotherapy or radiation treatment, including nausea and vomiting.Hypnosis continues to be explored for use in these and many other medical conditions.How do people describe the hypnotic experience?People describe hypnosis in different ways. You may feel like you’re “zoned in” or in a trance-like state — so focused that you’re able to block out surrounding distractions. Have you ever been so focused on a TV show or so entrenched in a good book that you don’t hear your family talking around you or even your dog barking? This experience is somewhat similar to how you might feel while hypnotized. Many people say they feel calm and relaxed despite their increased concentration. Most described it as a pleasant experience.AdvertisementProcedure DetailsWhat typically happens during a hypnotic session?There are four stages of hypnosis: induction, deepener, suggestions and emergence.InductionDuring this stage, you begin to relax, focus your attention and ignore distractions. Your hypnotherapist will guide you through this stage with specific techniques such as controlled breathing (breathing in over a count of seven, then breathing out over a count of 11), or progressive muscle relaxation (tensing muscles as you breathe in and relaxing muscles as you breathe out, then repeating in a certain order of muscle groups throughout your body) or focusing on a visual image.DeepenerThis stage continues the first stage, taking your relaxation and focus to a deeper level. This step often involves counting down or using similar descending imagery such as walking down stairs or slowly sinking deeper and deeper into a comfortable bed. These first two stages are aimed at easing your openness to suggestions.SuggestionsThis is the stage for actual change in experience, behavior or perception. Your hypnotherapist will use imagery and carefully chosen language. The suggestions are usually symptom focused (to resolve a symptom) or exploratory (to explore experiences associated with the start of symptoms). Suggested changes may be in perception, sensation, emotion, memory, thought or behavior.Example: To quit smoking, you’ll learn to identify your triggers to want to smoke, learn positive ways to change, understand resources to effect change, disrupt your pattern, attach a better response, notice the difference and install the changed behavior. You may be encouraged to see your “old” self with black lungs in a mirror behind you and see your “new” healthy self with clean lungs in a mirror in front. You’ll then be guided to choose which self you like and to walk toward that self.EmergenceDuring this stage, you come out of hypnosis. Your hypnotist may use reverse deepeners, such as giving you the suggestions that you’re climbing up stairs or counting up.Is hypnosis used as the sole treatment?Hypnosis is usually used along with other therapies and treatments, as part of a complete total treatment plan. The decision to use hypnotherapy in a clinical setting as a sole treatment or as an add-on treatment in psychotherapy or traditional medicine is made in consultation with a qualified professional who’s trained in the use and limitations of hypnotherapy.What’s the typical length of treatment with hypnotherapy?There’s no typical length. Treatment varies depending on what and how severe the issue is. Hypnotherapy may take many sessions.Care at Cleveland ClinicMental Health CareMake an AppointmentRisks / BenefitsDoes hypnotherapy work?Despite its use since the 1700s, hypnotherapy continues to have skeptics in the medical community. However, it’s becoming a more accepted and recognized form of therapy. The number of certified and licensed medical professionals incorporating hypnotherapy in their practice is increasing.Scientific evidence supporting the benefits of hypnotherapy has been limited, but is growing. Some studies show “promising” results or “may be helpful in” conclusions. The strongest evidence supporting the use of hypnotic treatments comes from research on hypnosis for treating pain, IBS and PTSD symptoms. Most medical associations and organizations state that more studies are needed to draw meaningful conclusions about the effectiveness of hypnotherapy.Can anyone be hypnotized?Each person differs in their ability to be hypnotized. A person’s fears or concerns about hypnosis may interfere with their ability to be hypnotized.What type of person benefits the most from hypnosis?The person most likely to benefit is the person who’s highly motivated to overcome an issue. Like any other treatment, hypnosis may be helpful for certain conditions or in certain people, but it can also be unhelpful.Is hypnotherapy inappropriate for some people or in certain situations?Hypnosis may not be appropriate for people with severe mental health issues, such as psychotic symptoms, including hallucinations and delusions. It might also be inappropriate for someone who uses drugs or alcohol. The use of hypnosis for memory retrieval is largely unsupported by research. Caution is also advised regarding its use in managing stressful events from early life. The use of hypnosis in these situations may create false memories, especially if unintended suggestions are given, and could cause more distress and anxiety.Additional Common QuestionsIs hypnotherapy dangerous?Hypnotherapy is a safe procedure when done by a trained therapist. Hypnotherapy isn’t mind control or brainwashing. Your therapist can’t make you do something embarrassing or something you don’t want to do.Is self-hypnosis possible?Yes, it’s possible to practice self-hypnosis. Deep breathing, imagery, progressive muscle relaxation and mindfulness techniques may work similarly to aspects of hypnosis. This can be particularly useful for controlling the side effects of chemotherapy or managing recurring (repeating) health issues, such as headache pain.What is sleep hypnosis?Sleep hypnosis is using hypnotherapy to manage sleep problems, such as insomnia and sleep anxiety. It’s not about helping you sleep during a hypnotherapy session. Sleep hypnotherapy helps you work on the underlying issues that prevent you from getting quality sleep. Sleep hypnotherapy may be used along with other treatments, such as cognitive behavioral therapy for insomnia.How do I select a hypnotherapist?First, look for a healthcare professional who’s properly trained, licensed and credentialed in a healthcare field such as medicine, dentistry, psychiatry, psychology, social work or nursing. This practitioner should have additional training in hypnosis and hypnotherapy techniques. Hypnosis should be used along with their mental health and medical training as an additional treatment tool. Ask the practitioner you intend to see about their training, credentials and license to practice hypnotherapy. Also ask if they’re experienced in the condition(s) you’re seeking care for.To find a hypnotherapist near you, talk to your healthcare provider or call or search the websites of the American Society of Clinical Hypnosis, the Society for Clinical and Experimental Hypnosis, or the American Association of Professional Hypnotherapists.You’ll want to find a therapist you feel comfortable with and trust. Don’t hesitate to try a different therapist if you feel a hypnotherapist isn’t the right fit for you.Does insurance cover the cost of hypnosis treatment?Always contact your health insurance company before your appointment to ask if hypnotherapy is a covered benefit. Many insurance companies cover 50% to 80% of the cost of hypnotherapy if performed by a licensed medical professional.A note from Cleveland ClinicHypnosis is a shift in consciousness that enables you to tap into core thoughts, emotions, perceptions, beliefs — and with the guidance of a trained hypnotherapist — to change your thinking pattern to better manage your health issue. Hypnotherapy isn’t for everyone, but it might be helpful for you. It can be a powerful and successful add-on tool to other more traditional forms of mental health or medical therapy. If you’re interested, be sure to ask your healthcare provider about hypnotherapy and for a hypnotherapist referral, if they don’t provide this treatment tool.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/01/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicMental Health CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"