"Hypogastric Plexus Block: Treatment, Pain Relief & Recovery 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Hypogastric Plexus BlockAdvertisementAdvertisementAdvertisementHypogastric Plexus BlockChronic pain from your uterus or ovaries, prostate, or other parts of your pelvis don’t have to be part of your everyday life. The hypogastric plexus, nerves at the base of your spine, can be stopped from transmitting pain information by an injected medication.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a hypogastric plexus block?A hypogastric plexus block is a treatment where medications are injected onto a bundle of nerves near the bottom of your spine. When these nerves, called the hypogastric plexus, are blocked, they stop carrying information about pain in your pelvic area.The hypogastric plexus is divided into two parts: the superior hypogastric plexus and the inferior hypogastric plexus. Your healthcare provider will inject the medication onto parts of the plexus depending on the source of your pain.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat types of pain does a hypogastric plexus block help with?The pain may come from your colon, bladder, lower intestines, uterus or ovaries, prostate or testicles or other parts of your pelvis. The procedure can also help reduce pelvic pain from endometriosis, radiation injury and cancer.When is a hypogastric plexus block necessary?You may need a hypogastric plexus block if the pain in your pelvic area is chronic and not relieved by oral medications.AdvertisementIs a hypogastric plexus block an outpatient or inpatient procedure?Outpatient.What kind of healthcare provider performs a hypogastric plexus block?Interventional pain management physicians perform the procedure.AdvertisementProcedure DetailsWhat happens before the hypogastric plexus block?First, you may be given an intravenous medication to relax you. Then, you’ll lie on your stomach on an X-ray table. Your healthcare provider will numb an area of skin on your back with a local anesthetic.How is a hypogastric plexus block done?Guided by an X-ray, your healthcare provider will:Insert needles into your back, near the hip bone.Inject dye to confirm that the medication will go to the correct spot.Inject pain medication, possibly including a steroid. Alcohol or phenol may also be injected to destroy the nerves in some cases.How long does a hypogastric plexus block take?Usually, the procedure takes about 30 minutes. Then you’ll stay for observation for at least 30 minutes. Most people go home soon after.Will I be asleep during the procedure?No, patients remain conscious to provide useful feedback to the healthcare provider during the procedure.What should I expect after the procedure? How effective is a hypogastric plexus block?Your pelvic area may feel warm or “different,” and you may begin to feel less pelvic pain. Some patients report pain relief within 30 minutes after the injection, but pain may return a few hours later when the anesthetic wears off. Longer term relief usually begins in two to three days, once the medication combined with the anesthetic begins to work.Risks / BenefitsWhat are the risks?The risk of complication from a hypogastric plexus block is low. However, there could be bruising or soreness at the injection site. If present, this subsides in a few days. Serious complications, such as infection, nerve damage and bleeding are uncommon.Side effects of the steroids are rare but can include:Flushed face.Slight fever.Hiccups.Insomnia.Headache.Water retention.Increased appetite.Increased heart rate.Abdominal cramping or bloating.These resolve within a few days.Recovery and OutlookWhat’s the prognosis (outlook) for people who have a hypogastric plexus block? How effective is it?How long the pain stays away is different for each patient. For some, the relief lasts weeks. For others, the relief lasts years. If the pain returns, you can discuss having another hypogastric plexus block with your healthcare provider.Can I eat normally? When can I go back to work/school?You can continue your regular diet and medications after the procedure, but don’t drive or do any rigorous activity for 24 hours after the procedure. You can return to your normal activities the next day.When to Call the DoctorWhen should I contact my healthcare provider?Contact your healthcare provider if the pain increases or doesn’t go away.A note from Cleveland ClinicA hypogastric plexus block treatment may give you more relief and allow you to take less pain medication. It’s an option for people with severe or chronic pain. Talk to your healthcare provider about this treatment – you might not have to live in pain every day.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/07/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7243Questions 216.444.9134Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"