"Hysterectomy: Purpose, Procedure, Benefits, Risks & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/HysterectomyAdvertisementAdvertisementAdvertisementHysterectomyA hysterectomy is a surgical procedure that removes your uterus.  After surgery, you can’t become pregnant and no longer menstruate. Reasons for this surgery include abnormal bleeding, uterine prolapse, fibroids and cancer. Recovery usually takes four to six weeks, depending on the type of surgery you have.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewA hysterectomy is a surgery to remove the uterus and possibly the cervix, ovaries and fallopian tubes.What is a hysterectomy?A hysterectomy is the surgical removal of the uterus, and most likely, the cervix. Depending on the reason for the surgery, a hysterectomy may involve removing surrounding organs and tissues, such as the fallopian tubes and ovaries. The uterus is where a fetus grows during pregnancy. Its lining is the blood you shed during your menstrual period. You won’t be able to get pregnant and you won’t get your period after a hysterectomy.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the different kinds of hysterectomy?Your healthcare provider will discuss which type of hysterectomy is needed depending on your condition. This will determine if your fallopian tubes and/or ovaries need to be removed.Total hysterectomy: Removing your uterus and cervix, but leaving your ovaries.Supracervical hysterectomy: Removing just the upper part of your uterus while leaving your cervix.Total hysterectomy with bilateral salpingo-oophorectomy: Removing your uterus, cervix, fallopian tubes (salpingectomy) and ovaries (oophorectomy). If you haven't experienced menopause, removing your ovaries will start menopausal symptoms.Radical hysterectomy with bilateral salpingo-oophorectomy: The removal of your uterus, cervix, fallopian tubes, ovaries, the upper portion of your vagina and some surrounding tissue and lymph nodes. This type of hysterectomy is performed when cancer is involved.Why is a hysterectomy performed?Healthcare providers perform hysterectomies to treat:Abnormal or heavy vaginal bleeding that isn’t managed by other treatment methods.Severe pain with menses that isn’t managed by other treatment methodsLeiomyomas or uterine fibroids (noncancerous tumors).Increased pelvic pain related to your uterus but not managed by other treatments.Uterine prolapse (uterus that has “dropped” into your vaginal canal due to weakened support muscles) that can lead to urinary incontinence or difficulty with bowel movements.Cervical or uterine cancer or abnormalities that may lead to cancer for cancer prevention.Conditions with the lining of your uterus, like hyperplasia, recurrent uterine polyps or adenomyosis.AdvertisementHow common is it to get a hysterectomy?About 300,000 women get hysterectomies in the United States each year. It’s the second most common surgery performed among women (after Cesarean section).Procedure DetailsHow do I prepare for a hysterectomy?A healthcare provider will explain the procedure in detail, including possible complications and side effects. Talk to them about any concerns you have. You may be asked to provide blood and urine samples.AdvertisementWhat happens during a hysterectomy?Your healthcare provider will determine the type of hysterectomy you need and the best surgical method to perform that procedure. You’ll change into a hospital gown and get hooked up to monitors that track your heart rate. An intravenous (IV) line is placed in a vein in your arm to deliver medications and fluids.An anesthesiologist will give you either:General anesthesia, in which you won’t be awake during the procedure; orRegional anesthesia (also called epidural or spinal anesthesia), in which medications are placed near the nerves in your lower back to “block” pain while you stay awake.There are several different surgical approaches your healthcare provider may use to perform a hysterectomy:Vaginal hysterectomyYour uterus is removed through an incision at the top of your vagina. There isn’t an external incision.Dissolvable stitches are placed inside your vagina.Most commonly used in cases of uterine prolapse and other nonmalignant (or noncancerous) conditions.Fewest complications and fastest recovery (up to four weeks) and considered the preferred approach.People often go home on the same day of surgery.Laparoscopic hysterectomyA laparoscope (a thin tube with a video camera on the end) is inserted in your lower abdomen through a small incision in your belly button.Surgical tools are inserted through several other small incisions.Your uterus can be removed in small pieces through the incisions in your abdomen or through your vagina.Some people go home the same day or after one night in the hospital.Full recovery is shorter and less painful than an abdominal hysterectomy.Robotic-assisted laparoscopic hysterectomyYour surgeon performs the procedure with the help of a robotic machine.A laparoscope is inserted in your abdomen so your pelvic area can be viewed.Small, thin surgical tools are inserted through three to five incisions around your belly button. Robotic arms and instruments are controlled by the surgeon.The recovery is similar to a laparoscopic hysterectomy.Abdominal hysterectomyYour uterus is removed through a six- to eight-inch-long incision in your abdomen.The incision is made either from your belly button to your pubic bone or across the top of your public hairline. The surgeon will use stitches or staples to close the incision.Most commonly used when cancer is involved, when the uterus is enlarged or when disease spreads to other pelvic areas.It generally requires a longer hospital stay (two or three days) and a longer recovery time.How long does a hysterectomy procedure last?The procedure lasts one to three hours. The time can vary depending on the size of your uterus and the need to take down scarring from previous surgeries, as well as if other tissue, such as endometrial tissue, and other organs are being removed with your uterus (like your fallopian tubes or ovaries).What are the most common side effects of a hysterectomy?Some of the most common side effects of a hysterectomy are vaginal drainage (which may occur up to six weeks after surgery) and irritation at the incision sites.If your ovaries were removed at the time of your hysterectomy, you may experience menopausal symptoms such as:Hot flashes.Vaginal dryness.Loss of libido.Difficulty sleeping (insomnia).Your doctor will discuss treatment options to avoid the side effects of menopause mentioned above.What happens after a hysterectomy?The amount of time you spend in the hospital following a hysterectomy varies depending on what kind of surgery you had. Your healthcare provider will want to monitor you and ensure there aren’t any signs of complications like blood clots or bleeding. You’ll walk around as soon as possible after your surgery to prevent blood clots in your legs.If you had an abdominal hysterectomy, you might stay in the hospital for a few days. Vaginal and laparoscopic hysterectomies are less invasive and typically don’t require an overnight stay in the hospital.Your healthcare provider will go over recovery instructions, including restrictions to your day-to-day activities. Be sure to discuss any concerns you have about your recovery or the procedure.Care at Cleveland ClinicSchedule a HysterectomyFind a Doctor and SpecialistsRequest an AppointmentRisks / BenefitsWhat are the advantages of having a hysterectomy?Having a hysterectomy can help you live a more enjoyable life, especially if you have constant pelvic pain or heavy and irregular bleeding. If you’re at a higher risk of uterine cancer, a hysterectomy can lower this risk and potentially be life-saving.What are the disadvantages of having a hysterectomy?A hysterectomy is a major surgery with a long recovery. It comes with risks and side effects and is permanent. Depending on the type of surgery you have, you can go into menopause or experience symptoms of menopause. You also won’t be able to become pregnant after the procedure.What are the complications of a hysterectomy?As with any surgery, there’s a slight chance that problems may occur, including:Blood clots.Severe infection.Bleeding.Bowel blockage.Torn internal stitches.Urinary tract injury.Issues related to anesthesia.Recovery and OutlookHow long does it take to recover from a hysterectomy?Most people recover from a hysterectomy in about four to six weeks. Your recovery depends on the type of hysterectomy you had and how the surgery was performed. Recovering from a vaginal and laparoscopic hysterectomy takes less time than recovering from an abdominal hysterectomy.You should increase your activity gradually and pay attention to how you feel. If anything causes you pain, you should stop. Talk to your healthcare provider about specific instructions for recovering at home, including what medications to take.What should I know about recovering at home?Vaginal and laparoscopic recovery take about two to four weeks. It may take up to six weeks to recover from abdominal hysterectomy. Talk to your healthcare provider before going home to make sure you know how to best care for yourself.Common instructions after a hysterectomyYou can experience light vaginal bleeding for one to six weeks. Use only a light panty liner or sanitary pad to catch the discharge.Don’t lift heavy objects (over 10 pounds) for at least four to six weeks.Don’t put anything into your vagina for four to six weeks, or as directed by your healthcare provider.Don’t have sex for six weeks after surgery.You may take a shower. Wash the incision with soap and water (the stitches don’t have to be removed, as they’ll dissolve in about six weeks). A bandage over the incision isn’t necessary. If surgical strips were used, they should fall off on their own within a week. If staples were used, they’ll need to be removed by your healthcare provider.You can drive about two weeks after abdominal surgery or when you’re no longer taking narcotics for pain. If you had a vaginal or laparoscopic hysterectomy, you might begin driving within a few days.Resume your exercise routine in four to six weeks, depending on how you feel.You can usually go back to work in three to six weeks, depending on what kind of work you do.How will I feel after a hysterectomy?PhysicallyAfter a hysterectomy, your periods will stop. Occasionally, you may feel bloated and have symptoms similar to when you were menstruating. It’s normal to have light vaginal bleeding or a dark brown discharge for about four to six weeks after surgery.You may feel discomfort at the incision site for about four weeks, and any redness, bruising or swelling will disappear in four to six weeks. Feeling burning or itching around the incision is normal. You may also experience a numb feeling around the incision and down your leg. This is normal and, if present, usually lasts about two months. It’s normal to have scarring, both internally and externally. Laparoscopic surgeries will cause smaller, less visible scars as opposed to abdominal hysterectomies.If your ovaries remain, you shouldn’t experience hormone-related effects. If your ovaries were removed with your uterus before menopause, you may experience the symptoms that often occur with menopause, such as hot flashes. Your healthcare provider may prescribe hormone replacement therapy to relieve menopausal symptoms.People who undergo a subtotal hysterectomy may continue to have a light period for a year after the procedure. This happens because small amounts of the endometrial lining can remain in your cervix, causing light periods.EmotionallyEmotional reactions to a hysterectomy vary and can depend on how well you were prepared for the surgery, the reason for having it and whether the problem has been treated.Some may feel a sense of loss, but these emotional reactions are usually temporary. Others may find that a hysterectomy improves their health and well-being and may even be a life-saving operation. Please discuss your emotional concerns with your healthcare provider.Will my stomach go down after a hysterectomy?It’s very normal to experience bloating or feeling gassy after a hysterectomy. It can take several weeks for the puffiness and swelling in your belly to go down. Talk to your healthcare provider about ways to reduce your discomfort. Performing certain exercises, applying a warm compress or changing up your diet may help you.Will I enter menopause after a hysterectomy?This depends on whether your ovaries were removed. If your ovaries remain after a hysterectomy, you won’t enter menopause right away. If both of your ovaries were removed during the hysterectomy, you might enter menopause immediately.Do I still need a Pap test if I have had a hysterectomy?Generally, no, and especially if you’re deemed to be at low risk for developing cervical cancer. You should continue to have a Pap test if you had a hysterectomy because of cancer.When to Call the DoctorWhen should I see my healthcare provider if I had a hysterectomy?Call your healthcare provider if you have:Bright red vaginal bleeding.A fever over 100 degrees Fahrenheit (37.77 degrees Celsius).Severe nausea or vomiting.Difficulty urinating, burning feeling when urinating or frequent urination.Increasing amounts of pain.Increasing redness, swelling or drainage from your incision.Additional DetailsDoes a hysterectomy affect my sex life?Your sexual function isn’t usually affected by a hysterectomy. If your ovaries were removed with your uterus, this could start symptoms of menopause. Symptoms such as low sex drive and vaginal dryness may occur. Using a water-based lubricant can help with dryness.Can you still orgasm after a hysterectomy?Yes, you can still have an orgasm and ejaculate after a hysterectomy. This is because the external organs of your vagina and the pelvic nerves that supply the lower genital tract are still intact after a simple hysterectomy.Does sex feel different to my partner after a hysterectomy?No, studies show that sexual pleasure doesn’t change after a hysterectomy. If your ovaries are removed and you have vaginal dryness, using a lubricant can help. In rare cases and when the hysterectomy is performed for cancer or prolapse, the shape of your vaginal canal changes after a hysterectomy. This could lead to pain, especially during penetration.What fills the empty space after a hysterectomy?After you have a hysterectomy, your other organs move to fill the space. Your small and large intestines mainly fill the space once occupied by your uterus.What are alternatives to a hysterectomy?Your healthcare provider will work with you to develop the best treatment plan for your symptoms or condition. When a hysterectomy isn't medically necessary, some alternatives to try could be:Watching and waiting to see if the condition improves.Taking medications such as birth control pills to manage painful periods or abnormal bleeding.Burning of the lining of your uterus for heavy bleeding.Having procedures to shrink or surgery to remove uterine fibroids.Performing exercises for uterine prolapse that help improve the muscles in your uterus.Using a pessary to “prop up” your uterus if you have a uterine prolapse.Undergoing surgery to treat endometriosis or vaginal bleeding that doesn’t involve removing the entire uterus.A note from Cleveland ClinicA hysterectomy can offer relief from many conditions of the uterus, like irregular bleeding or painful periods. Remember, talk openly and honestly with your healthcare provider about your symptoms so they can recommend the best treatment. If you get a hysterectomy, make sure you understand the procedure and how to safely recover from surgery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/16/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule a HysterectomyFind a Doctor and SpecialistsRequest an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"