"Off-Pump Coronary Artery Bypass Surgery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Off-Pump Bypass SurgeryAdvertisementAdvertisementAdvertisementOff-Pump Bypass SurgeryOff-pump bypass surgery is a type of coronary artery bypass graft (CABG) surgery. It takes a blood vessel from one part of your body and uses it to bypass a blocked coronary artery. Unlike traditional CABG, off-pump surgery doesn’t stop your heart or use a heart-lung bypass machine. Instead, the surgeon stabilizes your beating heart during surgery.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is off-pump bypass surgery?Off-pump bypass surgery is a type of coronary artery bypass graft (CABG) surgery. CABG surgery takes an artery or vein from one part of your body (called a graft) and uses it to bypass a blocked coronary artery. The surgery restores normal blood flow to your heart.During traditional CABG surgery, the surgeon stops the person’s heart. A cardiopulmonary bypass machine does the work of your heart and lungs throughout the surgery. The machine takes blood out of your body, adds oxygen, removes carbon dioxide, then puts oxygenated blood back into circulation.But off-pump bypass surgery doesn’t use a heart-lung machine. Instead, the surgeon operates while your heart is still beating. It’s also called “beating heart” surgery.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs to have off-pump bypass surgery?Off-pump bypass surgery is a treatment option for coronary artery disease (CAD).In a person with CAD, plaque builds up in the arteries, restricting or blocking blood flow. It can cause symptoms like chest pain and shortness of breath. A completely blocked artery can lead to a heart attack.Severe cases of CAD that don’t respond to lifestyle changes, medications and other procedures may require bypass surgery. It can improve symptoms, reduce the risk of a heart attack and improve survival. Off-pump bypass surgery is an option for some people who choose CABG.How long does an off-pump CABG take?Bypass surgery takes several hours, depending on how many arteries are bypassed.AdvertisementProcedure DetailsHow can I prepare for off-pump bypass surgery?Your surgical team will give you instructions to help you prepare. Instructions may include:Quit smoking.Stop taking certain medicines, such as anticoagulants.Avoid eating or drinking anything after midnight the day of surgery.What happens before off-pump bypass surgery?Before off-pump surgery, your surgeon may order some tests to make sure you’re healthy enough for the operation:Blood tests.Chest X-ray.Echocardiogram (echo).Electrocardiogram (EKG).Nuclear cardiac stress test.AdvertisementWhat happens during off-pump bypass surgery?Your surgeon will explain what to expect during off-pump bypass surgery. The team will:Shave the area for the incision if needed.Administer anesthesia to put you to sleep and prevent pain.Make an incision and remove a piece of blood vessel from another area of your body (chest or leg, for example).Make an incision down the middle of your chest and separate the breastbone. A left chest incision between your ribs may be an option depending on the number and location of blockages.Use a device to stabilize your heart to reduce movement.Use a band, clamp or tape as a mini-tourniquet to stop blood flow in the blocked artery.Attach one end of the graft to your aorta and the other end to the blocked artery, just past the blockage. This creates a new channel to bypass the blockage.Remove the mini-tourniquet, allowing blood to flow through the new channel.Close your breastbone and the incision (using wires, stitches, staples or other methods).What happens after off-pump bypass surgery?After off-pump bypass surgery, you’ll be moved to a recovery room, where the surgical team will monitor you. You may:Take a couple of hours to wake up.Have a tube in your throat to help you breathe.Have another tube in your chest to remove excess fluids.Feel some discomfort, but no pain. If you experience pain, tell a healthcare provider, who can provide pain medications.Risks / BenefitsWhich is better, on-pump or off-pump bypass surgery?Scientists are still studying the long-term benefits of off-pump surgery compared to on-pump surgery. Your surgeon will help you decide which is best for you.On-pump CABG provides a surgical area that’s still and free of blood for better stability and visibility.But off-pump bypass surgery may involve a smaller incision, shorter hospital stay and faster recovery. It may also reduce the risk of certain postsurgical complications:Cognitive problems such as memory loss.Infection.Inflammation (swelling).Irregular heart rhythms (arrhythmia).Stroke.It may be a better option for people with:Atherosclerosis of the aorta.Cerebrovascular disease.Chronic lung disease.Cirrhosis of the liver.KidneyPrevious bypass surgery.Not everyone is a candidate for off-pump bypass surgery. Some researchers believe that off-pump procedures might lead to the need for additional bypass surgeries in the future. And the procedure must be performed by a surgeon with experience in the approach.What are the risks or possible complications of off-pump bypass surgery?Off-pump bypass surgery is a major operation. Although most people have a good outcome, there are some possible risks:Bleeding.Blood clots, which can lead to stroke or heart attack.Complications from anesthesia.Infection.Irregular heart rhythms.Kidney failure.Recovery and OutlookWhat is the recovery time after off-pump bypass surgery?Recovery from off-pump bypass surgery depends on several factors, such as:Age.Complications.Overall health.Size of the incision.In general, you’ll:Begin to drink fluids and eat small amounts of food the same day or the day after surgery.Sit in a chair and walk with some help in the first day or two.Stay in the hospital for several days.Need help at home for the first several days after hospital discharge.Get stitches and staples removed in a week to 10 days.Have to avoid lifting anything for several weeks.Recover fully in several weeks or more.Participate in a cardiac rehabilitation program to help rebuild your strength.When to Call the DoctorWhen should I seek medical attention after off-pump bypass surgery?You’ll have follow-up appointments with your healthcare provider during and after your recovery. But seek immediate medical attention if you experience:Abdominal pain or chest pain that doesn’t go away.Chills or excessive sweating.Clicking or a feeling of movement in your breastbone.Fast or irregular heartbeat.Nausea or vomiting.Shortness of breath.Signs of infection (fever or red streaks, pus, swelling or warmth near the insertion site).Sudden weight gain (more than five pounds in a week).A note from Cleveland ClinicOff-pump bypass surgery is a type of coronary artery bypass graft (CABG) surgery. Unlike traditional CABG, the procedure doesn’t stop your heart or use a cardiopulmonary bypass machine. If you need CABG, talk to your healthcare provider about whether on-pump or off-pump surgery is best for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/02/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"