"Open-Heart Surgery: What it Treats, Procedures, What to Expect, Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Open Heart SurgeryAdvertisementAdvertisementAdvertisementOpen Heart SurgeryOpen-heart surgeries treat heart problems including heart failure, congenital heart defects, arrhythmias, aneurysms and coronary artery disease. During the procedure, a surgeon cuts through the breastbone and spreads the ribcage to access the heart. Open-heart surgery may include CABG (bypass surgery), heart transplant and valve replacement.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is open-heart surgery?Heart surgery is a procedure to treat heart problems. Open-heart surgery is one way surgeons can reach the heart.Open-heart surgery requires opening the chest wall to make the heart easier for the surgeon to reach. To access the heart, surgeons cut through the sternum (breastbone) and spread the ribs. Sometimes people call this cracking the chest.Open-heart surgery is a reliable way for surgeons to perform heart surgery. Your surgeon may recommend an open procedure if you are strong enough to tolerate it.It's possible to do many kinds of heart surgery through smaller, less invasive incisions, including small incisions between the ribs on the right side of the chest.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat does open-heart surgery treat?You may need open-heart surgery if you have one of these heart conditions:Arrhythmias, including atrial fibrillation.Congenital heart defects, such as atrial septal defect (hole in the heart) or hypoplastic left heart syndrome (underdeveloped heart structures).Coronary artery disease.Heart failure.Heart valve disease.Thoracic aortic aneurysm.Procedure DetailsWhat procedures take place during open-heart surgery?Certain procedures require direct access to the heart and surrounding blood vessels. Sometimes, these procedures can take place using less invasive techniques. Your surgeon will assess your health to choose the best treatment approach.These procedures may take place during open-heart surgery:Aneurysm repair.Congenital heart defect repairs.CABG (bypass surgery) to treat coronary artery disease.Heart transplant for heart failure.Heart valve replacement or repair to treat heart valve disease.Left ventricular assist device (LVAD) or total artificial heart placement to treat heart failure.Sometimes, surgeons place pacemakers or implantable cardioverter defibrillators (ICDs) during open-heart surgery while performing other procedures. Ablation procedures to treat arrhythmias may also occur in the same procedure.AdvertisementWhat are the types of open-heart surgery?There are two ways to perform open-heart surgery:On-pump: A heart-lung bypass machine connects to the heart and temporarily takes over for the heart and lungs. It circulates blood through the body while moving blood away from the heart. The surgeon then operates on a heart that isn’t beating and doesn’t have blood flow. After surgery, the surgeon disconnects the device and the heart starts to work again.Off-pump: Off-pump bypass surgery takes place on a heart that continues to beat on its own. This approach only works for coronary artery bypass grafting (CABG) surgery (bypass surgery). Your surgeon may call this beating-heart surgery.How should I prepare for open-heart surgery?To prepare for open-heart surgery, you should follow your healthcare provider’s recommendations about:Medications: You may need to stop taking certain medicines a week or two before surgery. People often stop blood thinners (aspirin, warfarin or other medicines that prevent blood clots and strokes) and nonsteroidal anti-inflammatory drugs (NSAIDs). These medicines can increase bleeding risk.Food and drink: Your healthcare team will ask you to fast (not eat or drink) before your surgery. Anesthesia is safer on an empty stomach.Smoking and alcohol: Cut back on alcohol and quit smoking. Both can slow postsurgical healing and increase the risk of complications.AdvertisementWhat happens before open-heart surgery?Before open-heart surgery, you can expect to have:Chest X-rays, an electrocardiogram (EKG) or other tests to help the surgeon plan the procedure.Your chest shaved.Sterilization of the surgical area with antimicrobial (bacteria-killing) soap.An intravenous line (IV) in your arm to provide fluids and medications.What happens during open-heart surgery?Heart surgery is complex. Some surgeries may take six hours or longer. You will receive anesthesia and be asleep during the procedure.Surgery steps vary depending on the heart condition and procedure. In general, your surgeon:Makes a 6- to 8-inch long incision down the middle of your chest.Cuts the breastbone and spreads your ribcage apart to reach your heart.Connects the heart to a heart-lung bypass machine, if you’ll have an on-pump surgery. An anesthesiologist gives IV medication to stop your heart from beating and monitors you during the surgery.Repairs your heart.Restores blood flow to your heart. Usually, your heart starts beating on its own. Sometimes, the heart needs a mild electrical shock to restart it.Disconnects the heart-lung bypass machine.Closes the breastbone or other incision with wires or sutures that remain in your body.Uses stitches to close the skin incision.What happens after open-heart surgery?Depending on the procedure, you may stay in the hospital intensive care unit (ICU) for a day or longer. When you’re ready, you will move to a regular hospital room.You can expect to stay several days in the hospital. Your heart care team will explain how to care for your incision. You may have a special firm pillow to protect your chest when you cough, sneeze or get out of bed.After surgery, you may experience:Constipation (a common side effect of strong pain relievers).Depression or mood swings.Insomnia or difficulty sleeping.Loss of appetite.Memory problems.Muscle pain in the chest area.Pain, bruising and minor swelling at the incision site.Care at Cleveland ClinicGet Heart SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the potential risks or complications of open-heart surgery?Open-heart surgery is a major surgical procedure. Like all surgeries, there are risks.The risk of complications is greater if you have health problems like diabetes or obesity. Lung conditions like chronic obstructive pulmonary disease (COPD) also raise your risk. People who smoke are more prone to surgical and postsurgical issues.Surgery risks include:Allergic reaction to anesthesia.Arrhythmias (irregular heartbeat).Bleeding.Damage to surrounding blood vessels or organs like the lungs or kidneys.Infections.Stroke.Are there alternatives to standard open-heart surgery?Thanks to medical advancements, many procedures that once required opening the chest can now take place using minimally invasive heart surgery or with small incisions. The surgeon sometimes still needs to cut through part of the breastbone (partial sternotomy).Depending on your situation, your surgeon may be able to use these methods:Catheter-based: Your surgeon threads a catheter (thin, hollow tube) to the heart. The surgeon then inserts surgical instruments, balloons, or stents through the catheter to perform a procedure. Catheter-based procedures include transcatheter aortic valve replacement (TAVR) and coronary angioplasty and stenting.Video-assisted thoracic surgery (VATS): Your surgeon performs VATS by inserting a tiny video camera (thoracoscope) and surgical instruments into several small chest incisions. Your surgeon may use VATS to place a pacemaker, repair heart valves or treat an arrhythmia.Robotically-assisted: Certain patients with valvular heart disease, cardiac tumors, atrial fibrillation and septal defects (holes in the heart) may be candidates for this minimally invasive approach.Recovery and OutlookWhat is recovery like after open-heart surgery?Recovery time varies depending on the surgery type, complications and your overall health before surgery. It can take 6 to 12 weeks (and sometimes longer) to recover from an open-heart procedure.Your surgeon will let you know when you can return to work and other activities. Typically, you shouldn’t drive or lift anything heavy for the first six weeks.Some people need to take blood thinners after heart surgery to prevent blood clots. Your healthcare provider may also recommend cardiac rehabilitation. This medically supervised program can help you regain strength and stamina and improve overall heart health.When to Call the DoctorWhen should I call the doctor?You should call your healthcare provider if you experience:Chest pain other than normal discomfort at the incision.Fever.Nausea and vomiting.Shortness of breath.Signs of infection at the surgical site, such as oozing and redness.Slurred speech or other signs of stroke.A note from Cleveland ClinicOpen-heart surgery is a life-saving procedure. But it is also a major surgery. Recovery can be long. When possible, you should take steps to improve your health — like exercising, losing weight and quitting smoking — before surgery. These actions may make recovery easier. It’s normal to have concerns before undergoing a heart procedure. Don’t hesitate to share questions and concerns with your healthcare provider.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/25/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Heart SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"