"Opioid Antagonist: What It Is, Uses, Side Effects & Risks800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Opioid AntagonistAdvertisementAdvertisementAdvertisementOpioid AntagonistOpioid antagonists are medications that block the effects of opioids. Common types include naloxone and naltrexone. Opioid antagonists help treat opioid overdose, opioid use disorder, alcohol use disorder and opioid-induced constipation.ContentsArrow DownOverviewRisks / BenefitsContentsArrow DownOverviewRisks / BenefitsOverviewWhat is an opioid antagonist?Opioid antagonists are medications that block the activation of opioid receptors in your central or peripheral nervous systems. In other words, these medications block the effects of opioids. They’re key to treating opioid overdose, opioid use disorder and other conditions.Opioids (sometimes called narcotics) are a class of drugs that are chemicals — natural or synthetic — that interact with nerve cells and have the potential to reduce pain. Healthcare providers typically prescribe opioids to manage moderate to severe pain. There are also nonmedical forms of opioids, like heroin.Opioids can become addictive because they not only dull pain but produce a sense of euphoria. This, combined with tolerance build (needing to increase doses to produce the same effect), can lead to opioid use disorder.How do opioid antagonists work?To understand how opioid antagonists work, it helps to understand how opioid receptors and opioids function.There are several types of opioid receptors in your body. The three major groups are the mu, kappa and delta receptors. Opioid antagonists mainly work on mu receptors.When you take an opioid, it stimulates your central nervous system’s (brain and spinal cord) mu receptors and causes respiratory depression, pain relief (analgesia) and euphoria. In addition, you have peripheral nervous system mu receptors in your bronchial (air passages in your lungs) smooth muscle and digestive tract. Opioids stimulate these receptors and typically suppress the cough reflex and cause constipation.Opioid antagonists bind to opioid receptors but don’t activate them. Instead, they don’t let opioids act on the receptors. Because of this, opioid antagonists can stop or reverse the effects that opioids currently in your system have on your body. If you don’t have any opioids in your system, opioid agonists generally have no effect.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat do opioid antagonists treat?There are a few different opioid antagonists, each with a different purpose.NaloxoneNaloxone blocks the opioid receptors in your central nervous system. The U.S. Food and Drug Administration has approved the use of naloxone for opioid overdose and the reversal of respiratory depression associated with opioid use.Naloxone works by reversing and blocking the effects of opioids already in your system. It can restore normal breathing within two to five minutes to a person who’s experiencing an opioid overdose.It comes in the following forms:Injection (intravenous or intramuscular). Brand names include Evzio®, Narcan® and Zimhi®.Nasal spray. Brand names include Kloxxado® and Narcan.Due to the opioid epidemic, police officers, emergency medical technicians and first responders carry and are trained to give naloxone. In addition, in most communities, people can get and carry naloxone over the counter (OTC); you don’t have to be a medical professional.NaltrexoneNaltrexone is FDA-approved to treat opioid and alcohol use disorders as a maintenance treatment. It blocks the opioid receptors in your central nervous system. Naltrexone treats these substance use disorders by preventing the substances from producing sedative effects and rewarding effects such as euphoria. The medication doesn’t help to control withdrawal symptoms or cravings.It comes in the following forms:Injection. Vivitrol® is the brand name.Oral tablets. Brand names include Depade® and ReVia®.NalmefeneNalmefene is an injection medication that’s FDA-approved to treat acute opioid overdose. It’s similar to naloxone but lasts longer in your system. It’s not as common as a treatment for opioid overdose as naloxone. Nalmefene also causes rapid onset of withdrawal symptoms in people with opioid dependence.Its brand name is Revex®.MethylnaltrexoneMethylnaltrexone blocks opioid receptors in your peripheral nervous system. It’s FDA-approved for the treatment of opioid-induced constipation. It works by blocking the effect of opioids in your intestine, which helps the muscles in your intestine move poop (stool). Methylnaltrexone doesn’t reduce the pain-relieving effects of opioids.Healthcare providers typically prescribe methylnaltrexone for people who use prescription opioids to manage severe chronic pain.It comes in the following forms:Injection.Oral tablets.The brand name of both forms is Relistor®.Risks / BenefitsWhat are the side effects of opioid antagonists?The main side effect of naloxone, nalmefene and naltrexone is opioid withdrawal.Opioid withdrawal symptoms include:Runny nose (rhinorrhea).Excessively watery eyes (lacrimation).Yawning.Hyperventilation (rapid or deep breathing, usually caused by anxiety or panic).Abnormally high body temperature (hyperthermia).Fast heart rate (tachycardia).Muscle aches.Nausea and vomiting.Diarrhea.Anxiety.The severity of withdrawal symptoms varies from person to person based on how long they’ve been taking the opioid and the type of opioid.In a hospital setting, healthcare providers can manage the withdrawal symptoms that opioid antagonists cause with careful monitoring, IV fluids and medications such as methadone and buprenorphine.Methylnaltrexone side effectsPossible side effects of methylnaltrexone include:Stomach pain.Gas and bloating.Mild nausea or diarrhea.Headache.Muscle spasms.Dizziness.AdvertisementWhat are the benefits of opioid antagonists?Naloxone and nalmefene are very effective in treating opioid overdoses. If they’re given in time, and properly, they can be life-saving.Naltrexone can help treat alcohol use disorder or opioid use disorder, but it alone can’t treat these conditions. Substance use disorders are very complex conditions. They require multi-faceted treatment involving psychotherapy (talk therapy), detoxification, rehabilitation, withdrawal and craving management and more.A note from Cleveland ClinicOpioid antagonists are effective medications that can reverse opioid overdoses, help treat opioid and alcohol use disorders and relieve opioid-induced constipation. While naloxone, nalmefene and naltrexone can cause uncomfortable withdrawal symptoms, the benefits of these medications outweigh the side effects. Talk to your healthcare team if you’re concerned about the effects of these medications. They’re available to help and support you.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/05/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"