"Treating Sleep Apnea with an Oral Appliance: Procedural Details, Risks & Benefits800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Oral Appliance Therapy for Obstructive Sleep ApneaAdvertisementAdvertisementAdvertisementOral Appliance Therapy for Obstructive Sleep ApneaThe preferred method of treating obstructive sleep apnea (OSA) is the CPAP machine.  An alternative treatment is oral appliance therapy. One appliance looks like  a mouth guard. Another dental device stabilizes the tongue.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewWhat is obstructive sleep apnea?Sleep apnea is a serious sleep disorder that occurs when a person's breathing is interrupted during sleep. People with untreated sleep apnea stop breathing many times during sleep, sometimes hundreds of times during the night.There are three types of sleep apnea: obstructive, central and mixed. Obstructive sleep apnea (OSA) is the more common of the three. Obstructive sleep apnea occurs when the upper airway is blocked either partly or completely during sleep. During an apnea episode, the diaphragm and chest muscles work harder as the pressure increases to open the airway. Breathing usually resumes with a loud gasp or body jerk. These episodes can interfere with sound sleep, reduce the flow of oxygen to vital organs, and cause heart rhythm problems.In central sleep apnea, the airway is not blocked but the brain fails to signal the muscles to breathe due to instability in the respiratory control center. Central apnea is related to the function of the central nervous system and not treated by oral appliance therapy.Mixed sleep apnea is a combination of both obstructive and central sleep apnea.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho gets obstructive sleep apnea?Obstructive sleep apnea occurs in about 25 percent of men and nearly 10 percent of women. Obstructive sleep apnea can affect people of all ages, including babies and children and particularly people over the age of forty and those who are overweight. Certain physical traits and clinical features are common in patients with obstructive sleep apnea. These include excessive weight, large neck, and structural abnormalities reducing the diameter of the upper airway, such as nasal obstruction, a low-hanging soft palate, enlarged tonsils, or a small jaw with an overbite.What causes obstructive sleep apnea?Obstructive sleep apnea is caused by a blockage of the airway, usually when the soft tissue in the rear of the throat collapses during sleep. Central sleep apnea is usually observed in patients with central nervous system dysfunction, such as those who have had a stroke or who have neuromuscular diseases. It is also common in patients with heart failure and other forms of cardiac and pulmonary disease.AdvertisementWhat are the symptoms of obstructive sleep apnea?Often the first signs of obstructive sleep apnea (OSA) are recognized not by the patient, but by the bed partner. Many of those affected have no sleep complaints. The most common symptoms of OSA include:SnoringDaytime sleepiness or fatigueRestlessness during sleepSudden awakenings with a sensation of gasping or chokingDry mouth or sore throat upon awakeningIntellectual impairment, such as trouble concentrating, forgetfulness, or irritabilityNight sweatsSexual dysfunctionHeadachesSymptoms in children may not be as obvious and include:Poor school performanceSluggishness or sleepiness, often misinterpreted as laziness in the classroomDaytime mouth breathing and swallowing difficultyInward movement of the ribcage when inhalingUnusual sleeping positions, such as sleeping on the hands and knees, or with the neck hyper-extendedExcessive sweating at nightLearning and behavioral disordersBedwettingWhat are the effects of obstructive sleep apnea (OSA)?If left untreated, obstructive sleep apnea can result in a number of health problems including hypertension, stroke, arrhythmias, cardiomyopathy (enlargement of the muscle tissue of the heart), congestive heart failure, diabetes, and heart attacks. In addition, untreated sleep apnea may be responsible for job impairment, work-related accidents, and motor vehicle crashes as well as academic underachievement in children and adolescents.AdvertisementWhat if I have been diagnosed with obstructive sleep apnea (OSA)?If your doctor has found that you have OSA, you will be offered treatment options. Generally, the gold standard for treating OSA is a continuous positive airway pressure (CPAP) machine. For various reasons, CPAP may not work for you. Another option is oral appliance therapy which resembles a mouth guard used by athletes.Procedure DetailsHow does oral appliance therapy work to treat obstructive sleep apnea (OSA)?For patients with mild to moderate obstructive sleep apnea, dental appliances or oral mandibular advancement devices that prevent the tongue from blocking the throat and/or advance the lower jaw forward can be made. These devices help keep the airway open during sleep. A sleep specialist and dentist with expertise in oral appliances for this purpose should jointly determine if this treatment is best for you.How do I order an oral appliance for obstructive sleep apnea (OSA)?If you and your doctor decide that an oral device is a good option, you will need a referral to an appropriate dentist to have an evaluation. The dentist will decide if you are a candidate for this treatment and make an impression of your teeth. The dentist will make the device and call you back for a fitting. You will also be given a morning repositioner to realign your bite after the appliance is removed. He or she will also give you instructions on how to use and clean the appliance. You might also have to go back to the dentist for further custom adjustments to optimize care. Once care is completed, it is recommended that have another sleep test to see how the appliance is working for you. Further adjustments may be necessary.Care at Cleveland ClinicObstructive Sleep Apnea TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the risks of oral appliance therapy for obstructive sleep apnea (OSA)?The risks of oral appliance therapy include:Bite changesPain in the jaw, teeth, and temporomandibular joint (TMJ) painLoose teethA need for dental work replacementExcessive droolingMouth drynessWhat are the benefits of oral appliance therapy for obstructive sleep apnea (OSA)?Oral appliance therapy:Can improve symptoms of OSA, including daytime sleepiness, moodiness, concentration issues and reduce or eliminate snoring.Offers another option for people who cannot tolerate CPAPIs easier to take along when travelingWorks without electricityIs quietWhen to Call the DoctorWhat questions should I ask my doctor and dentist about an oral appliance to treat obstructive sleep apnea (OSA)?How much does oral appliance therapy cost?Will oral appliance therapy be covered by medical or dental insurance?What kinds of problems should I be looking for?How many visits will this require?How many sleep tests will I need to take?How long will the device last?Are there things that I should avoid doing or eating?Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/30/2020.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicObstructive Sleep Apnea TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"