"Oral Surgery: Procedures, Types & Definition800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Oral SurgeryAdvertisementAdvertisementAdvertisementOral SurgeryOral surgery refers to any surgical procedure performed on your teeth, gums, jaws or other oral structures. This includes extractions, implants, gum grafts and jaw surgeries. Oral surgery is usually performed by an oral and maxillofacial surgeon or a periodontist. These are dental specialists who have advanced training in oral surgery procedures.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is oral surgery?Oral surgery is a broad term for any operation performed on your teeth, gums, jaw or surrounding oral and facial structures. It includes a wide range of procedures, including teeth extractions, dental bone grafts, periodontal (gum) grafts and corrective jaw surgery.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is oral surgery performed?You could need oral surgery for a number of reasons. Your dentist might recommend it if you have:Extensive tooth decay.Badly broken teeth.Gum disease.Impacted teeth.Missing teeth.Temporomandibular joint disorders (TMD).Bone loss in your jaw.Sleep apnea.Oral cancer.Benign oral pathology (noncancerous lumps or bumps).What are the different types of oral surgery?There are several types of oral surgery procedures performed each year. Some of the most common include tooth extraction, dental bone grafts, dental implants, periodontal surgery, corrective jaw surgery, sleep apnea surgery and cleft lip and palate repair.Tooth extractionThe most common type of oral surgery is tooth extraction (tooth removal). An extraction might be recommended if you have severe tooth decay, gum disease (periodontitis), dental trauma or wisdom teeth complications. Sometimes tooth extractions are performed to prepare you for dentures or other prosthetic devices.Most dentists prefer to save natural teeth when possible, but sometimes extractions are necessary to preserve your overall oral health. Additionally, many dentists recommend wisdom tooth extraction as a preventative measure to reduce your risk for cavities, bone loss and other problems.Dental bone graftA dental bone graft is necessary when bone loss has occurred in your jaw. There are a couple of reasons why this may occur. When your natural teeth are present, the roots stimulate the nerves in your jaw. This signals your brain to send nutrients to your jaw, keeping it strong and healthy. If a tooth has been missing for some time, bone deterioration can occur in that area because there are no roots to stimulate the nerves. A dental bone graft restores volume and density in your jawbone so that dental implants can be placed later on.Sometimes, your provider might place a bone graft during periodontal surgery. Advanced gum disease can cause the bone around your teeth to erode. A bone graft reduces mobility and provides a solid foundation, keeping your teeth strong and healthy.Dental implantsDental implants are widely considered the most reliable and longest-lasting teeth replacement option available. These small threaded posts — made of medical-grade titanium or zirconia — are embedded into your jaw to replace missing teeth roots. Once the implants are healed, they can be restored with dental crowns, dental bridges or dentures.Periodontal surgeryIf you have moderate or severe periodontitis, a gum specialist may recommend gum disease treatment. During this procedure, incisions are made along your gum line and the tissue is temporarily moved back away from your teeth. Your surgeon will then clean your teeth roots, flushing away plaque and bacteria that have accumulated under your gums. Finally, the gum tissue is repositioned and sutured into place.Sometimes, gum recession can occur as a result of periodontitis. In these instances, you may need a gum graft. During this procedure, your surgeon reinforces the area of tissue loss with donor tissue. This tissue may be taken from the roof of your mouth or purchased at a certified tissue bank.Corrective jaw surgeryCorrective jaw surgery — also called orthognathic surgery — addresses skeletal abnormalities of your jaw bones. This procedure may be recommended to improve chewing function, correct misalignment or address facial imbalances. Corrective jaw surgery is also used to ease pain caused by TMJ dysfunction (TMD).Sleep apnea surgeryObstructive sleep apnea (OSA) occurs when the tissues in the back of your throat fall back and block your airway during sleep. Sometimes OSA is successfully treated with conservative methods, such as oral appliance therapy or using a CPAP machine. However, severe cases may require surgical intervention.Cleft lip and palate repairA baby born with cleft lip has an opening in their upper lip, while a baby born with cleft palate has an opening in the roof of their mouth. Some babies are born with both conditions. Cleft lip and palate occur when the facial structures don’t fully develop in the uterus. Oral and maxillofacial surgeons commonly perform cleft lip and palate repair to restore normal eating function and help a child develop proper speech patterns later on in life.AdvertisementWho performs oral surgery?An oral and maxillofacial surgeon performs surgery on the mouth, jaw and face. A periodontist, or gum specialist, performs surgery on the gums and bones that support your teeth. Both oral surgeons and periodontists must undergo three to four years of additional training after they graduate from dental school.Procedure DetailsWhat happens before oral surgery?Your healthcare provider will perform a comprehensive evaluation to check your teeth, gums, jaw joints and surrounding structures. They will also take dental X-rays and scans to get a clear view of your teeth roots, jawbone, nerves and other important oral landmarks. Using this information, they’ll tailor a personalized treatment plan.AdvertisementWhat happens during oral surgery?Sometimes, oral surgery is performed in a dental office as an outpatient procedure. Your surgeon may offer sedation options for your comfort, including nitrous oxide, oral medications or intravenous (IV) moderate or deep sedation. In other cases, oral surgery may be completed in a hospital under general anesthesia.How long does oral surgery take?The length of your procedure will depend on several factors, including what type of oral surgery you’re having, how many teeth are being treated and whether or not you choose sedation. A one-tooth extraction usually takes about 30 minutes, while a more involved procedure — such as corrective jaw surgery — typically takes at least two to three hours.What happens after oral surgery?Following your oral surgery procedure, you’ll be given detailed post-operative instructions. It’s important that you follow these guidelines closely to reduce your risk of bleeding, infection and other complications.Is oral surgery medical or dental?When it comes to insurance, most oral surgery falls under dental benefits. However, there are times when oral surgery is covered under medical insurance. For example, if you’ve been involved in an accident and require oral surgery in a hospital setting, it will likely be covered by your medical insurance. Plans and policies vary, though, so ask your healthcare provider for details. In short, medical insurance will cover some oral surgery procedures, but not all of them.Care at Cleveland ClinicSchedule Oral and Maxillofacial SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of oral surgery?Your teeth, gums and jaw joints all work together harmoniously for optimal oral health and function. The overarching goal of oral surgery is to address any issue that interferes with your health or quality of life.What are the risks or complications of oral surgery?As with any procedure, you should be aware of any risks or complications associated with oral surgery. These may include:Infection.Injury to adjacent teeth.Dry socket (a condition that can occur following extractions, when the blood clotting process is disturbed).Numbness.Tooth root fragments.Sinus problems.You can minimize your risk for these complications by following your post-operative guidelines and taking all medications as prescribed. If you develop any of these side effects, call your healthcare provider for further instructions.Recovery and OutlookWhat is the recovery time?Healing times will vary from person to person, but most people feel like themselves again in about one week. The more extensive your oral surgery, the more time it will take to recover. During this time, your healthcare provider will give you medications to keep you comfortable.When can I go back to work or school?Most people can return to work or school within one to three days. For more extensive procedures, such as corrective jaw surgery, it could take a bit longer.Soft foods to eat after oral surgeryTo promote healing, avoid hard and crunchy foods after oral surgery. Instead, keep your fridge and pantry stocked with soft foods like yogurt, soup, pasta, mashed potatoes, fish, pudding, eggs and rice. For a cool treat, try popsicles, ice cream and milkshakes. Cold foods can help soothe the surgical area.When to Call the DoctorWhen should I see my healthcare provider?If you have tooth, gum or jaw pain, schedule an appointment with your provider right away. If you’ve recently undergone oral surgery and you develop pain that doesn’t go away with medication, a fever of 100.4 F or higher or drainage at the surgical site, call your surgeon immediately. These warning signs could indicate infection, which must be treated promptly.A note from Cleveland ClinicModern surgical technologies help your surgeon provide advanced care using less invasive methods. Oral surgery can restore the health of your teeth, gums and jaw joints, ease your painful symptoms and give you an improved quality of life.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/18/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Oral and Maxillofacial SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"