"Orchiectomy: Definition & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/OrchiectomyAdvertisementAdvertisementAdvertisementOrchiectomyAn orchiectomy is a surgical procedure to remove one or both testicles. Providers use this procedure to treat and prevent testicular cancer as well as treat male breast cancer and prostate cancer. Transgender women may choose to have an orchiectomy when transitioning from male to female. Orchiectomies usually don’t require an overnight hospital stay.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is orchiectomy?An orchiectomy (or orchidectomy) is a surgical procedure to remove one or both testicles. Testicles are two small organs that hang in a sac of skin (the scrotum) below the penis. Testicles (or testes) make sperm and male hormones, including testosterone.Healthcare providers perform orchiectomies to treat or prevent testicular cancer, prostate cancer and male breast cancer. Transgender women may choose to have an orchiectomy when transitioning from male to female. Usually, an orchiectomy is an outpatient procedure, so you go home the same day.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho might need an orchiectomy?Healthcare providers use orchiectomies to:Treat cancer: Orchiectomy is the initial diagnostic and treatment step for testicular cancer. This removes the primary cancer, and also allows the pathologist to see tissue for diagnosis. It’s also used as a treatment for male breast cancer and prostate cancer. Androgens (male hormones like testosterone) encourage some cancer cells to grow. Without the testes, hormone levels drop. An orchiectomy shrinks tumors by cutting off the male hormones that help them grow.Help transgender people transition: As part of the transition process, many transgender women (or trans women) choose to have an orchiectomy. Healthcare providers may do this procedure as a single surgery. Or they may perform it as part of comprehensive gender affirmation surgery. In addition to physical changes, an orchiectomy greatly reduces male hormone levels in the body.Remove damaged testicles: Sports injuries, motorcycle accidents other trauma can cause severe damage to the testicles. If a healthcare provider can’t repair the testicle, they remove it and stitch up surrounding tissues. In rare cases, providers may need to remove an undescended testicle.Procedure DetailsWhat happens before an orchiectomy?Providers perform orchiectomies at a surgical center or a hospital. Most commonly, they are done with general anesthesia (to put you to sleep for the procedure). You won’t feel pain during surgery.AdvertisementWhat happens during an orchiectomy?Your healthcare provider cleans the area and makes an incision (cut). The location of the incision depends on the technique your healthcare provider uses. The incision may be in the pubic area (inguinal orchiectomy) or in the scrotum (simple orchiectomy). Your healthcare provider may remove:Both testicles (bilateral orchiectomy).One testicle (unilateral orchiectomy).The testicles and the spermatic cord (radical inguinal orchiectomy). The spermatic cord contains blood vessels and nerves. It carries semen from the testicles to the penis.If you choose to have a prosthetic testicle, your provider will place the new testicle inside the scrotum. The prosthetic testicle is filled with salt water (saline).At the end of the procedure, your provider closes the incision with stitches. Usually, the entire procedure takes between 30 to 60 minutes. After the surgery, you’ll need to wait in the recovery room until you’re ready to leave. Most people go home the day of surgery.What happens after an orchiectomy?You’ll need someone to drive you home after surgery. Patients feel better quickly, but the entire recovery process usually takes several weeks. You will need to schedule a follow-up visit with your healthcare provider after the procedure. As you recover, you should:Avoid physical activity: Wear loose-fitting clothes, and take it easy for a few days after surgery. For a couple of weeks, you shouldn’t lift anything heavy, run, or have sex. Ask your healthcare provider when you can get back to sports and other activities.Keep the area clean and dry: Follow your healthcare provider’s instructions when caring for your incision. Use soap and water when you shower, and keep the area covered with gauze. You may need to wear a special garment to support your scrotum for about 48 hours after surgery.Manage pain: You’ll have some pain, discomfort or tenderness after the procedure. Take over-the-counter acetaminophen or nonsteroidal anti-inflammatory drugs (NSAIDs) to relieve pain and swelling. Apply ice packs to the area every 20 minutes for the first day or two.Stay hydrated and eat right: It’s important to avoid pushing too hard when having a bowel movement (pooping). Drink plenty of water and eat fiber-rich foods to help keep you regular and prevent constipation.Care at Cleveland ClinicUrology CareMake an AppointmentAdvertisementRisks / BenefitsWhat are the advantages of orchiectomy?For patients with testicular cancer, orchiectomy is an effective treatment to remove the tumor and obtain a diagnosis. In cases of other cancers, it is an effective treatment to lower hormone levels as part of a larger treatment strategy.For transgender people, the procedure reduces the need for long-term hormone therapy. Hormone therapy for transgender women often includes drugs or supplements that lower androgen levels (androgen deprivation therapy or ADT) or increase estrogen. Although the risks of estrogen supplements are low, long-term use can lead to blood clots and other health problems. These risks are higher in people who smoke.What are the risks or side effects of orchiectomy?As with any surgical procedure, risks of an orchiectomy include bleeding and infection. Patients may also develop bothersome swelling in the scrotum. Complications and side effects of an orchiectomy depend on the type of surgery you had. They may also vary based on whether your provider removed one or both testicles.People who have both testicles removed (a bilateral orchiectomy) cannot produce sperm. This procedure makes them infertile.Some of the side effects from orchiectomy result from a decrease in hormone levels. While rare, a drop in testosterone and other male hormones can lead to:Low sex drive.Depression.Fatigue.Hot flashes.Low muscle mass.Osteoporosis.Problems with sexual function or the ability to get an erection (erectile dysfunction).Recovery and OutlookWhen can I go back to my usual activities after an orchiectomy?It’s essential to make sure your incision is fully healed before resuming physical activities, including sex. Healthcare providers usually recommend that you wait three to four weeks. Until then, you should not play sports, run or lift anything heavy. Ask your healthcare provider when you can get back to the activities you enjoy.When to Call the DoctorWhen should I see my healthcare provider about an orchiectomy?After an orchiectomy, call your healthcare provider right away if you:Develop a fever or severe pain.Have problems urinating.Lose feeling or sensation in your scrotum.Notice any redness near the incision or a purple spot on the scrotum. This could be blood pooling under the skin (hematoma).See blood or pus coming from the incision.If you’re having hot flashes, fatigue, depression or problems with sexual function, call your healthcare provider. These symptoms can result from a drop in hormone levels. Talk to your healthcare provider about taking hormone supplements, which may relieve these symptoms.An orchiectomy is an effective treatment for testicular cancer, and is also used for other types of cancer. For many transgender people, an orchiectomy may be an important aspect of the transition process. Because an orchiectomy can cause male hormone levels to drop, you may have side effects following surgery. Talk to your healthcare provider about regulating your hormone levels to avoid long-term complications.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/11/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicUrology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"