"Orchiopexy: Purpose, Surgery, Risks & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/OrchiopexyAdvertisementAdvertisementAdvertisementOrchiopexyAn orchiopexy is a surgery that moves an undescended testicle into the scrotum. An orchiopexy also typically describes the surgery that resolved testicular torsion. The procedure usually takes less than an hour to complete. Risks include healing problems, infection and bruising. It may take two or more weeks for you to recover.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is an orchiopexy?An orchiopexy (or-kee-oh-peck-see) is a surgery to move a testicle from your groin (inguinal region) to your scrotum (the pouch of skin behind your penis that typically contains your testes). The procedure permanently fixes your testicle to your scrotum.An orchiopexy can also correct testicular torsion and prevent it from happening again.Other names for an orchiopexy are orchidopexy (or-keh-doh-peck-see) and undescended testicle repair surgery.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs to have an orchiopexy?An orchiopexy corrects two conditions:Undescended testiclesThe testicles develop in the abdomen while a male fetus is still in the uterus. Before birth, the testicles typically drop (descend) from inside the abdomen down into the scrotum.Undescended (cryptorchid) testicles don’t drop into the scrotum before birth or in the first few months of life.About 3% of babies have undescended testicles at birth. Undescended testicles affect up to 30% of premature babies.A unilateral orchiopexy corrects one undescended testicle. A bilateral orchiopexy corrects two undescended testicles.Testicular torsionTesticular torsion is a painful condition in which your testicular blood supply (the spermatic cord) twists and cuts off blood flow to your testicle.Testicular torsion affects about 1 in 4,000 people under the age of 25.At what age should an orchiopexy be done?If your child has undescended testicles that don’t descend on their own after birth, they should have an orchiopexy between 12 and 24 months of age.If you or your child has testicular torsion, you should have surgery immediately. If your blood supply doesn’t return to your testicle within six hours, your healthcare provider may have to surgically remove the testicle.Is orchiopexy a major surgery?No, orchiopexy isn’t a major surgery. It’s an outpatient procedure, so you don’t have to stay at a hospital overnight. You may go home after the procedure.How painful is an orchiopexy?An orchiopexy is moderately painful. The pain should start to improve after several days. You can manage pain with over-the-counter (OTC) pain relievers. Your healthcare provider may prescribe pain relievers for instances of severe pain.AdvertisementProcedure DetailsWhat happens before an orchiopexy?Before an orchiopexy, you’ll meet with your healthcare provider. They’ll evaluate your or your child’s general health. They’ll also take vitals (temperature, pulse and blood pressure).Tell your healthcare provider about any prescription or OTC medications you or your child is taking, including herbal supplements. Aspirin, anti-inflammatory drugs and certain herbal supplements can increase your risk of bleeding.Your healthcare provider will also give you specific directions on when to give your child food or drinks before the procedure. Most patients preparing for an orchiopexy shouldn’t eat or drink anything after midnight the night before the procedure. If you have to take prescription medications, take them with a small sip of water.To reduce the risk of infection, thoroughly wash your groin the day before and the morning of the procedure.What happens during an orchiopexy?A team of healthcare providers who specialize in children (pediatrics) will perform an orchiopexy, including:A pediatric surgeon.A pediatric anesthesiologist.A pediatric nurse.The pediatric anesthesiologist will sedate your child (put them under) with general anesthesia, so they aren’t awake, won’t move and won’t feel pain.Once your child is asleep, the pediatric surgeon will make a small incision (cut) in your child’s groin with a sharp, sterile knife (scalpel) and locate the undescended testicle and the spermatic cord. The surgeon will examine the testicle to make sure it’s healthy. If the testicle looks unhealthy, the surgeon may need to remove it and replace it with a testicular prosthesis.The surgeon will further examine the groin and, if necessary, repair a hernia sac. This may develop when part of your child’s intestine, together with fat or fluid, pushes through an opening in the muscle of the abdominal wall, forming a sac.The surgeon will also examine the spermatic cord to ensure there’s enough length for the testicle to reach the scrotum without tension. If there isn’t enough length, they’ll stitch the hernia sac to have enough.Next, your child’s surgeon will make a small incision in the scrotum to make a pocket (Dartos pouch) that’ll hold the testicle.The surgeon will then insert a small grasping tool through the incision and up to the groin. They’ll gently pull the undescended testicle down into the pocket. They’ll secure the testicle with stitches that dissolve after a week or two.Finally, the surgeon will use dissolvable stitches to close both incisions.What happens during an orchiopexy for testicular torsion?If you have testicular torsion, your surgeon will make a small incision in your scrotum. They’ll untwist your spermatic cord and then examine your testicle.If your testicle looks healthy, they’ll stitch it to your scrotum so that it doesn’t twist again.If your testicle looks unhealthy, they’ll likely remove it and replace it with a testicular prosthesis.Finally, your surgeon will stitch the incision closed.How long does an orchiopexy take?In most cases, an orchiopexy takes less than an hour to complete.AdvertisementWhat happens after an orchiopexy?After the orchiopexy is complete, your healthcare provider will cover the stitches with gauze or bandages.The anesthesiologist will stop putting anesthesia into your child’s body to keep them asleep.Your child will move to a recovery room, where healthcare providers will wait for them to wake up and monitor their overall health.About two hours after the procedure, you can go home once your child’s healthcare providers determine that your child is OK.How do I take care of my child after they have an orchiopexy?Children’s strength OTC nonsteroidal anti-inflammatory drugs (NSAIDs) help provide relief for mild pain. The most common NSAIDs include aspirin (Bayer Children’s Aspirin®), acetaminophen (Tylenol Children’s®) and ibuprofen (Advil Children’s®). Not everyone can take NSAIDs, so it’s a good idea to check with your provider before use.Apply an ice pack wrapped in a light towel over the affected areas for at least 10 minutes. Apply ice at least four times a day to help minimize bruising and swelling.Anesthesia may cause your child to feel nauseous. Their stomach should settle the day after their orchiopexy. At home, it’s a good idea to limit your child’s diet to clear liquids (water and sports drinks) and bland, soft foods (applesauce, bananas, rice and toast).It’s important for your child to take it easy for a few weeks after surgery to ensure proper healing. Playing sports or other physical play may injure their newly repaired testicle.Care at Cleveland ClinicUrology CareMake an AppointmentRisks / BenefitsWhat are the advantages of an orchiopexy?There are many advantages to an orchiopexy, including:Fertility and health. An orchiopexy may help prevent infertility. Studies show it may also help reduce your child’s chances of developing testicular cancer.Lower risk of injury. You’re more likely to injure a testicle if it’s in your groin area instead of your scrotum. Injuries are more likely to occur from sports, a seat belt over the lap, tight clothing and belts.Self-esteem boost. As your child gets older, they may feel embarrassed if they only have one or no testicles in their scrotum. Most patients like the results of their orchiopexy and feel better about their bodies.Safety. An orchiopexy is a relatively safe procedure with a low risk of complications or side effects. Most people return home the same day.What are the risks or complications of an orchiopexy?Rarely, the testicle may move out of the scrotum (reascending testicle). A reascending testicle requires additional surgery to secure the testicle in place.All surgical procedures carry some risk. Some risks of an orchiopexy include:Anesthesia risks.Healing problems.Infection.Mass of clotted blood (hematoma).Swelling.Bruising.Unfavorable scarring.Recovery and OutlookWhat is the recovery time after an orchiopexy?Most children feel tired after an orchiopexy. They may spend the next two to three days sleeping more. Sleeping helps them recover faster.Most children over 12 months of age can resume normal activities about two or three days after an orchiopexy. However, they should avoid any activities that strain their abdominal or groin region. These activities may include tumbling, jumping, sprinting, laying on their stomach and straddling toys (rocking horse, see-saw, swing and tricycle).Keep the affected areas as clean as possible to prevent infection. Wash your hands with soap and water before handling your child’s bandages and incision areas.Showering or sponge bathing your child is OK. However, you should avoid washing your child in a bathtub for about a week.It’s important to remember that your child’s body is unique, so recovery times may vary. Follow your healthcare provider’s instructions on managing your child’s pain and discomfort.When can my child go back to school?Most children can go back to school or daycare two to three days after an orchiopexy.When to Call the DoctorWhen should I see my healthcare provider?Schedule a follow-up appointment two weeks after an orchiopexy. You may need to schedule another follow-up appointment two or three months later.Call your healthcare provider right away if your child experiences any abnormal symptoms after an orchiopexy. Symptoms may include:Heavy bleeding at the incision sites.A fever of 100 degrees F (38 degrees C) or higher.Infection.Increased pain.Swelling.A note from Cleveland ClinicAn orchiopexy is a short, safe procedure that commonly has good results. If your child has an orchiopexy, they may sleep more than usual, but they should be back to many of their regular activities within a few days. Talk to your healthcare provider about your questions and concerns. They’re here to help.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/09/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicUrology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"