"Organ Donation & Transplantation: How It Works, Living Donors800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Organ Donation and TransplantationAdvertisementAdvertisementAdvertisementOrgan Donation and TransplantationOrgan donation and transplantation allows a deceased or living donor to give life to another. Surgeons remove a healthy organ from a donor who doesn’t need it and transfer it to someone else who does. Organs that they can transplant include the liver, kidney, heart, lungs and more.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewWhat is organ donation and transplantation?Organ donation and transplantation is a surgical process to replace a failing organ with a healthy one from someone else who doesn’t need it. Organ donors are usually recently deceased people who either volunteered before their death to donate their organs afterward, or their family donated them on their behalf. Organ recipients are usually people who are critically ill in the end stages of organ failure. Organ donation and transplantation can save these people’s lives. But due to scarcity, unfortunately, not everyone who needs an organ transplant gets one in time.Healthy people can choose to donate certain organs and tissues that they can spare while protecting their own state of health. For example, you can live with only one kidney and donate your other kidney. You can also donate a portion of your liver, and your liver will grow back to nearly full size. The piece of liver that you donate will also grow to a full functional size in the recipient. Most people who need an organ transplant have a long and uncertain wait ahead. Living donors can spare them that wait and leave the next organ available for someone else.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is organ donation important?Organ transplantation is one of the great advances in modern medicine. It offers a second chance at life to people of all ages who have life-threatening diseases or injuries to their vital organs. Other donated tissues, like corneas, tendons and bones, can enhance lives by helping restore sight, movement and other physical functions. But the need for organ donations far exceeds the available supply. In the U.S., over 100,000 people are waiting for a life-saving organ transplant on any given day. But only about 40,000 transplants take place any given year.What organs and tissues can be donated and transplanted?Organs that can be donated and transplanted after your death include your:Liver.Kidney.Pancreas.Heart.Lungs.Intestines.Uterus.Other tissues that can be donated and transplanted include your:Corneas.Heart valves.Bone marrow.Bone.Skin.Tendons.Ligaments.Cartilage.Blood vessels.Nerves.Hands.Face.Organs and tissues that you can donate while still alive include:One kidney.A portion of your liver.Gestational tissue (leftover tissue after the birth of your newborn).Your uterus.In rare circumstances, a segment of your lung, pancreas or intestine.AdvertisementWho can be an organ donor?Almost everyone is a potential organ or tissue donor. There’s no official age limit, and most people have healthy parts left even when disease has affected other parts. Organ donors let the experts decide which of their parts are viable for donation and transplantation. They’ll assess the health of your organs and tissues at the time that they become available. If you want to be a living donor, healthcare providers will assess the health of your organ and your overall health to ensure your safety before proceeding.Procedure DetailsHow does the organ donation process work?The process for deceased organ donation begins with consent and ends with a surgical organ transplant. Here are the steps:1. Identifying an eligible donorEligible organ donors have been declared deceased by a cause that didn’t damage their organs. Usually, they’ve had a catastrophic brain injury that caused brainstem death, or they died by sudden cardiac arrest. In these cases, the hospital can preserve their organs after their death through mechanical ventilation. Medical specialists from the U.S. Organ Procurement and Transplantation Network (OPTN) evaluate the person’s medical status and history to determine whether they can be a donor.2. Obtaining consentMany organ donors decide before their death to donate organs after their death. The OPTN maintains a national database of registered organ donors. After confirming an eligible donor, they’ll check their database to see if they’re registered. If they are, they’ll inform their family of their consent to donate. If they’re not, they’ll consult with their family about the opportunity for donation, taking time to answer all their questions. Their family may choose at this time to donate their organs on their behalf.3. Matching donors to recipientsThe next step is to match donor organs and tissues with the people who need them. This is mostly a computerized process. The OPTN enters information on the donor’s blood type, body size and available organs and tissues into their computer system. The system will find the closest match possible from its database of hopeful recipients. First, it matches organs to potential recipients based on physical factors. Next, it ranks the priority of the potential recipients based on their need, and lastly, their location.4. Coordinating the transplantOnce a recipient has been identified, their transplant center will receive an electronic notification offering the donor organ. The transplant team will make the final decision on whether to accept the organ for their patient. If they accept, they’ll coordinate the logistics with the host Organ Procurement Organization (OPO). They’ll arrange for operating rooms to be available for both donor and recipient as soon as possible. Then they’ll coordinate the arrival and departure of the transplant surgery teams.5. Recovering the organsA specialized surgical team recovers organs and tissues from the donor in a respectful, formal procedure. By federal law, it’s a different medical team from the one that cared for the donor at the end of their life. They’ll leave the donor’s body in fit condition for the funeral procedure of their or their family’s choice. It’s possible to have an open casket funeral after organ donation. The team will preserve the organs in special containers and deliver them to the recipient’s transplant hospital.6. Organ transplantationThe organ recipient should be waiting at their transplant hospital when the donor organ arrives. They’ll have surgery as soon as possible, while the organ is still viable. Organ transplant surgery is complex and can take several hours. Some organs are only viable for six hours after being removed. When the transplant is complete, the OPO follows up with the family and healthcare team of the donor to let them know. The donor’s and recipient’s identities remain anonymous unless they choose to share them.AdvertisementHow do I register to become an organ donor?To become an organ donor after your death, you can register with:The National Donate Life Registry at registerme.org.Your state registry site. Find your state on the federal site at organdonor.gov/sign-up.Your local DMV or BMV. They can register your choice on your state driver’s license or ID.The Health app on your iPhone, which can send your information to the national registry.Joining a registry gives your legal consent to donate your organs after your death. It’s also a good idea to talk to your family about your wish to become an organ donor. If you’ve already registered, this helps to prevent unnecessary surprises. If you haven’t yet, it can help your family advocate for your wishes.How do I get on the waiting list to receive an organ transplant?If your healthcare provider recommends an organ transplant for you, they’ll refer you to a transplant hospital. The transplant center’s multidisciplinary team will evaluate you to decide if you’re a suitable candidate. Each transplant hospital has its own criteria for accepting candidates for organ transplantation. If they accept you as a candidate, they’ll put you on the national waiting list maintained by United Network for Organ Sharing (UNOS). They’ll let you know the date that you were added.What is a living donor transplant?Organ donation isn’t always after death. You can choose to donate certain organs and tissues during your lifetime. These are organs and tissues that you can live without, but someone else needs — either to live, or to live a more independent life. Living organ donors are often friends or relatives of the person who needs an organ, though not always. They volunteer to ensure that the hopeful recipient gets the transplant they need in time. By doing so, they also remove that person from the national waiting list.What are the different types of living donor transplants?Most living donor transplants are for one kidney or one liver lobe, which can grow back to full size. For the transplant to be successful, it’s important that these organs are a match for the recipient’s body. Donor and recipient blood types should be compatible to prevent the recipient’s body from rejecting the new organ. For kidney donors, it’s also important to check that their tissues don’t contain antigens that the recipient’s body makes antibodies against. This could also raise the risk of organ rejection.These compatibility factors determine the different types of living donor transplants that can happen. The types include:Directed organ donation.Paired organ donation.Nondirected organ donation.Tissue donation.Directed donationA directed donation is an organ donation from a living donor that’s directed to a specific person (recipient). To make a directed organ donation, you must know, or know of, the recipient and their need. You can volunteer to meet that need by contacting their transplant hospital. The hospital will test you for general health, and also for physical compatibility with the recipient. If your organ is a match, you can direct your donation to that person. If it isn’t, you might consider another type of donation.Paired organ donationA paired donation is an exchange between two living donors and two recipients. If your organ isn’t a good match for the person you wanted to direct it to, it might still be a match for someone else. Another willing organ donor might be compatible with your intended recipient, but not their own. In this case, you can swap donations so that each recipient gets a compatible organ from a living donor. A computer program pairs the right organ donor with the right recipient to make both transplants happen.Nondirected donationA nondirected donation is an anonymous organ donation to a stranger whose identity you may never know. Either a computer or an individual transplant center will match your organ to the person who needs it. You may make a nondirected donation as part of a paired exchange, or you may make one independently. Living donors have different, personal reasons for making a nondirected donation. Sometimes they wanted to help someone they knew, but that didn’t work out. Others just want to help in general.Tissue donationWithout the need to undergo surgery yourself, you can donate leftover gestational tissues after giving birth. These are tissues that your newborn no longer needs now that they’ve been born. Healthcare providers use these tissues in reconstructive procedures to help repair wounds and burns. They include:The placenta. The amniotic membrane.Amniotic fluid.Umbilical cord tissue.What is the process to become a living organ donor?You can begin the process by contacting a living donor transplant program near you. If you want to direct your donation to someone in particular, contact their transplant hospital. If you want to donate gestational tissue, you can put it in your birth plan or tell your healthcare provider at the time you give birth. For organ donations, the process will proceed with a series of interviews and medical tests. They’ll assess your overall health, as well as your compatibility with the person you want to donate to.What are the qualifications to become a living organ donor?Living organ donors must be:At least 18, old enough to give their legal consent.In good physical health, with minimal surgical risk.In good mental health, with sound motivations for donating.Well informed of the process and potential outcomes.Free volunteers, with no commercial exchange or coercion involved.The transplant hospital will provide the testing and counseling necessary to determine these things. You’ll also have a dedicated team of people with no relationship to the potential recipient advocating for your needs and rights throughout the process. They’ll keep your conversations confidential, and you can change your mind at any time without disclosing your reasons to the potential recipient.Care at Cleveland ClinicKidney Transplant SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of organ donation and transplantation?Organ donation and transplantation saves thousands of lives each year. One of these people could be someone you care about. Tissue donations can help heal and restore quality of life to many more.If you become a donor after your death, your organs and tissues could:Save up to eight lives.Restore sight to two people.Heal up to 75 burn and wound victims.Help someone restore their hand or face.If you become a living donor, you could:Save the life of someone you know.Save them from waiting indefinitely while getting sicker.Give them a healthier organ than they might get otherwise.Let someone else on the waiting list get the next organ, thus saving two lives.What are the risks of organ donation and transplant surgery?General risks for the transplant recipient include:Surgical risks, such as blood loss and other complications.Organ rejection or failure. Most people will have some brief episodes of organ rejection in their first year after surgery. Healthcare providers treat these episodes with medications. But in a few people, rejection episodes continue despite treatment. This can cause the new organ to fail.Infection. Healthcare providers prescribe immunosuppressant medications to help prevent organ rejection in transplant recipients. These medications suppress your immune system. The side effect of taking them is that you’ll be more vulnerable to common infections from now on.General risks for living donors include:General risks of surgery, including pain, blood loss and infection.Damage to your organ during the procedure, causing long-term complications.Reduced kidney function after donating one kidney.Loss of work, or of paid time off from work.Difficulties with health or life insurance coverage.Negative feelings about your choice if things don’t work out as planned.Recovery and OutlookHow long does it take to recover from organ transplant surgery?Whether you’re a living donor or an organ recipient, it can take two to six months to fully recover from organ transplant surgery. You may need to stay in the hospital for a few days to a couple of weeks, depending on the type of transplant you had. You may need to take one to two months off from work, and you may need extra help at home. Despite expert care, you can expect some degree of discomfort and physical limitation while you recover. If possible, try to arrange for someone to support you during this time.A note from Cleveland ClinicIf you need an organ transplant, the wait can be tense. For many, it’s a race against time whether they’ll get one before they’re too sick to have surgery. When they get the call that a donor organ has become available, they head to the hospital for surgery without hesitation. If you know someone who’s waiting for a liver or a kidney, you may share their sense of urgency. And you may be able to help. But you may also have hesitations. Specialized healthcare providers will help you make an informed decision.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/11/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicKidney Transplant SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"