"Osteopathic Manipulative Therapy & OMT800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Osteopathic Manipulation Treatment (OMT)AdvertisementAdvertisementAdvertisementOsteopathic Manipulation Treatment (OMT)Doctors of osteopathy (DOs) literally take a hands-on approach to musculoskeletal disorders. Osteopathic manipulation treatment (OMT) is used to help correct structural imbalances in your body, improve circulation and relieve pain.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is osteopathic manipulative treatment (OMT)?Osteopathic manipulative treatment (OMT) is a hands-on treatment method. OMT is sometimes called osteopathic manipulative therapy or osteopathic manipulation.Doctors of osteopathic medicine (DOs) use OMT to treat mechanical pain (muscle, tendon or bone pain due to structural imbalance) and a wide range of health conditions. DOs also use OMT to diagnose and prevent disease and help your body function better.Using several OMT techniques, DOs apply gentle pressure to manipulate the muscles, soft tissues and joints. The treatment encourages your body to heal itself by ensuring that your bones and muscles are aligned and balanced properly.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs osteopathic manipulation treatment (OMT)?Most people get OMT to treat lower back pain, but DOs use OMT to treat many conditions. Babies, children and adults can benefit from osteopathic manipulative therapy. Pregnant women get OMT to improve sleep and relieve pain. OMT can also help infants who have colic.People who have osteoporosis, bone cancer or other joint concerns should not get osteopathic manipulative treatment. Be sure to share your health history with your DO before starting this treatment.What is a DO?Doctors of osteopathic medicine believe that all the systems in the body work together and affect each other. Also called an osteopath or DO, these doctors focus on the body, mind and spirit as part of one interconnected system.A doctor of osteopathy practices osteopathic manipulative medicine (OMM), a type of medicine that includes hands-on treatments. DOs have special training in healing the musculoskeletal system. But they’re licensed to treat the full range of health conditions.DOs don’t just treat symptoms. Using a holistic approach, they focus on you as a whole person to find out what’s causing your symptoms. To help you feel your best, DOs evaluate your:Activity level and exercise habits.Diet.Environment.Lifestyle.Mental and physical health.Sleep habits.Stress levels.AdvertisementWhat does OMT treat?DOs usually use osteopathic manipulative therapy for back pain relief. But OMT can treat many conditions, including:Breathing issues like asthma and sinus infections.Bowel issues, such as irritable bowel syndrome (IBS) and constipation.Chronic pain, including fibromyalgia, arthritis, menstrual pain and migraines.Musculoskeletal problems like back and neck pain, joint pain and carpal tunnel syndrome.Problems associated with pregnancy, such as swelling (edema), insomnia and sciatica.Sports injuries and repetitive stress injuries.By helping restore your structural imbalance, OMT improves nerve and blood circulation to the bodily organ involved – which can help improve health of that organ.Procedure DetailsWhat happens before osteopathic manipulation treatment (OMT)?Your DO will ask about your symptoms, lifestyle and other health concerns. It’s important to share information about your sleep habits, activity level, diet and mental health. DOs use this information to gain a clear picture of how your lifestyle affects your overall well-being.Your DO will examine you by touching or pressing on different parts of your body. Depending on your symptoms, your DO may order imaging studies (like an X-ray or MRI) before starting OMT.AdvertisementWhat happens during OMT?During osteopathic manipulation, you’ll stand up, sit or lie down on an exam table. Your DO will touch your muscles and soft tissues and move your limbs in different positions. There are more than 40 OMT techniques. Your DO may use one technique or several of them.Depending on the technique, your DO may ask you to lay on your back, roll onto your side, or pull your knees to your chest. While you’re in these positions, your DO will use pressure and gentle manipulation to stretch your muscles and move your joints into proper alignment. Your DO may ask you to hold and release your breath at specific times.Your DO may use slow, continuous pressure or quick, sudden manipulations. Some of the movements may feel a little strange or awkward. But they shouldn’t hurt. If you feel pain or discomfort during treatment, tell your DO right away.What happens after OMT?Everyone responds to osteopathic manipulation differently. You may feel sore for a day or two after treatment. Some people feel tired after OMT. Others feel energized.After each treatment session, you should:Drink plenty of water: Staying hydrated allows toxins to flush out of your muscles after treatment.Go for a walk: A short walk helps your body “settle in” or adjust to the proper alignment and balance.Take it easy: Avoid rigorous physical activity for 24 hours after OMT. Focus on breathing and allowing your body time to rest.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentRisks / BenefitsWhat are the advantages of osteopathic manipulation treatment (OMT)?Osteopathic manipulative therapy treats conditions that affect every system in the body, including the musculoskeletal system, digestive system, nervous system and immune system. By realigning the body and restoring balance to bones and muscles, OMT allows your entire body to work better as a whole.Using OMT, your DO can:Address structural problems in the joints, muscles and tissues.Improve circulation (how blood and other fluids flow through the body).Prevent health problems and help the body heal itself by improving how the body works as a unit.Soothe tight muscles, relieve joint stiffness and improve range of motion.What are the risks or complications of OMT?OMT techniques are safe. There are no side effects involved with these procedures. Severe pain is not a normal side effect of OMT.Recovery and OutlookWhen can I go back to my usual activities after osteopathic manipulative treatment (OMT)?After an OMT session, you can usually go back to your usual activities in a day or two. You may feel a little sore for a couple of days after treatment, but you shouldn’t feel any pain. Talk to your provider about beginning or resuming an exercise program and other activities.When to Call the DoctorWhen should I see my healthcare provider about osteopathic manipulative treatment (OMT)?Call your DO if soreness lasts longer than a few days after treatment. See your provider right away if you have pain after OMT. Pain is not a normal side effect of osteopathic manipulative treatment.A note from Cleveland ClinicOsteopathic manipulation is a safe, effective treatment for back pain and a wide range of health conditions. Using this hands-on approach, DOs realign your body, restore balance and work with you to achieve optimum health. OMT helps prevent disease so you can live a healthy lifestyle. You may feel tired or sore for a little while after treatment, but you shouldn’t feel pain. You may need multiple treatments over several weeks.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/18/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2606Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"