"Ostomy: Definition, Types, Procedure, Care & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/OstomyAdvertisementAdvertisementAdvertisementOstomyAn ostomy is a surgery that creates an opening in the abdomen, changing the way that waste exits your body. This procedure is used to treat various diseases of the urinary or digestive systems.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional Common QuestionsOverviewWhat’s an ostomy?An ostomy is a surgical procedure that creates an opening in your abdominal wall. This opening goes from an area inside your body to the outside, usually through your abdominal muscles and skin. Ostomy surgery creates a new way for waste to leave your body. Ostomy procedures often remove fecal waste (poop), though they can involve urine (pee) as well.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat’s the difference between an ostomy and a stoma?A stoma is a general term referring to an opening created during an ostomy surgical procedure. A stoma may be made in different areas of your body depending on the goal of the surgery.What are the different types of stomas?There are several different types of stomas. Some of the most common examples include:Colostomy. This procedure creates an opening into your colon (large intestine) through your abdomen. This allows fecal waste to bypass a part of the colon that’s been damaged or diseased.Ileostomy. In this case, the opening is created into your small intestine through your abdomen. An ileostomy is needed when sections of your small intestine and colon (large intestine) have been bypassed or removed. Ileostomies allow for fecal waste to empty through an opening in your skin.Urostomy. This procedure bypasses your bladder by attaching tubes that carry urine to the stoma. People with diseased or damaged bladders can benefit from this type of ostomy.Ostomies may be temporary or permanent depending on your unique healthcare needs. For example, if you’ve recently undergone colorectal surgery, your healthcare provider may perform a temporary ileostomy so that your colon has time to heal. However, if your entire rectum, colon or anus has been bypassed or removed, you will need a permanent ileostomy.AdvertisementWho needs an ostomy?People with certain digestive or urinary issues may need ostomy surgery. For example, you may need an ostomy if you have:Colon or rectal cancer.An injury affecting your small or large intestine.A blockage in your bowel.Conditions that cause GI irritation, such as ulcerative colitis and Crohn’s disease.Diverticulitis, a condition characterized by the inflammation of small pouches in your colon.Bladder cancer.How common is ostomy surgery?Plenty of people have ostomy surgery. Approximately 1 in every 500 Americans lives with an ostomy.AdvertisementProcedure DetailsWhat happens before ostomy surgery?Prior to your ostomy surgery, you’ll meet with your medical team to discuss the details of your procedure. During this appointment, your healthcare provider will determine the location of your stoma by talking with you about your lifestyle, typical clothing choices and personal preferences.You’ll also learn how to properly care for your stoma. Additionally, your healthcare provider will demonstrate different types of ostomy appliances that can improve your quality of life.What happens during ostomy surgery?Ostomy surgery is performed under general anesthesia to keep you comfortable. Your surgeon may create a long incision in your abdomen, or they may perform the procedure laparoscopically. Laparoscopy requires smaller incisions, uses a camera to look inside your body, and typically allows for faster recovery. Your healthcare provider can let you know which type of incision you’ll have.The steps of ostomy surgery can vary depending on your specific needs. Here’s a look at the most common types of ostomy procedures:Colostomy. Your surgeon removes any damaged or diseased portions of your colon or rectum. Next, they bring the remaining colon through your abdominal wall and attach it to your skin to form a stoma. A colostomy bag is then pouched around the stoma.Ileostomy. During this procedure, your surgeon attaches the ileum (the lower part of the small intestine) to your abdominal wall to form a stoma. Finally, an ileostomy bag is attached to the ostomy stoma.Urostomy. This procedure is performed to redirect urine away from a defective or diseased bladder. During the surgery, a section from the beginning of the large intestine or the end of the small bowel is removed and relocated. Once in its new location, this portion of the small bowel creates a passageway that allows urine to pass through the kidneys and exit the body through your stoma.What happens after ostomy surgery?Most people will need to stay in the hospital after ostomy surgery. Hospital stay varies by stoma and surgical approach but can be as short as a day or two. During this time, your medical team will keep a close eye on you to ensure that you’re healing properly. You may need an intravenous (IV) drip to keep you hydrated. Additionally, a catheter may be placed to drain urine.Risks / BenefitsWhat are the advantages of ostomy?In many situations, ostomy surgery is life-saving. In other situations, the procedure treats a wide range of digestive and urinary diseases and helps people significantly improve their quality of life.What are the risks of ostomy?As with any surgery, there can be complications after ostomy surgery. They can range from mild to severe and may include:Diarrhea. This is common in people with ostomies. To counteract negative side effects, drink lots of fluids. This helps replace lost electrolytes and keeps your body hydrated.Blockage. This can occur when foods that are difficult to digest become stuck in the gastrointestinal tract. Blockages can usually clear on their own when you drink clear liquids to temporarily rest your bowel.Hernia. If your abdominal wall becomes weak around your stoma, you could develop a hernia. Stoma hernias often require surgical correction once they’ve become too large.Narrowing of the stoma: If your stoma becomes narrowed, it can be difficult for waste to pass through it. This condition often requires surgical repair.Prolapse. Sometimes your bowel pushes itself through the stoma. In some cases, the bowel can be pushed back through and held in place with a stoma shield. In other instances, you may require a larger ostomy pouch or surgical correction.Skin irritation. This is the most common complication for people living with an ostomy. If your ostomy pouch doesn’t fit correctly, then waste can leak out around the stoma, resulting in red or itchy skin. Many people use ostomy powder when changing their bags to reduce the risk of skin irritation.Bleeding. Ostomy surgery may cause internal bleeding in some cases. If too much blood is lost, you may require a blood transfusion.Infection. Your gastrointestinal tract contains millions of bacteria. They can leak out during surgery and cause an infection. If this occurs, your healthcare provider will treat the issue with antibiotics.Electrolyte imbalance. The large intestine absorbs water, electrolytes and nutrients from the foods you eat. If the large intestine is removed or bypassed, it can cause an electrolyte imbalance. People who have had their large intestine removed should ask their healthcare provider about diet tips that will help maintain electrolyte balance.Vitamin B12 deficiency. After your ostomy, you may not absorb Vitamin B12 as well as you used to. This can lead to anemia. Vitamin B12 deficiency can be treated with supplements.Phantom rectum syndrome. In some cases, people feel the need to make a bowel movement even though their rectum has been removed. This condition usually resolves on its own. However, if you have pain associated with phantom rectum syndrome, your healthcare provider can prescribe pain relievers.Short bowel syndrome. This refers to a group of issues caused by the malabsorption of nutrients. People with this condition can’t absorb enough of the water, vitamins and nutrients they need to sustain life. Treatment for short bowel syndrome may include medications, nutritional support or surgery.Rectal discharge. People with an ostomy who still have their colon, rectum and anus may notice an occasional discharge from their rectum. Though this condition cannot be cured, it can be managed with proper care.How long is ostomy surgery recovery?All in all, ostomy surgery recovery takes about eight weeks. Though you’ll need to limit your activity and take it easy, you should still get up and walk around as you’re able. Staying mobile will aid in healing, prevent infections and help your bowel work more quickly.Can you tell me about ostomy care?People who’ve had ostomy surgery will wear an ostomy bag or pouch. They must learn how to attach, empty and change the pouch. Most ostomy bags or pouching systems come with one or two pieces. The bag also comes with a barrier (which protects your stoma) and a disposable plastic pouch.How often should I change my ostomy bag?It depends on the type of pouch system you have. Most people will need to change their ostomy bag every three to seven days. However, some bags are designed to be changed daily. When changing your ostomy bag, be sure to:Wipe away any mucous on your stoma.Use warm water, mild soap and a washcloth to clean the skin around your stoma. (Avoid soaps with fragrances and oils.)Rinse your skin well.Dry the area completely.In addition to keeping your ostomy stoma clean, be sure to examine it daily to ensure it looks normal. If you notice any changes in its size, color or shape, contact your healthcare provider immediately.When can I go back to work or school?You can return to work or school after you’ve recovered from ostomy surgery and feel strong enough to maintain normal routines. You should also be comfortable emptying your ostomy bag without assistance.When to Call the DoctorIf you’ve recently undergone ostomy surgery, it can be challenging to know which symptoms warrant a call to your healthcare provider. You should always trust your instincts if something doesn’t seem quite right. Call your healthcare provider right away if you notice:Severe cramping that lasts more than three hours.A change in your stoma’s size or appearance.Nausea and vomiting.Excessive bleeding.Strange odor.A deep cut in your stoma.Skin irritation.Watery discharge that lasts more than six hours.Additional Common QuestionsCan ostomy surgery be reversed?Yes, in some cases. A temporary ostomy is performed when your bowel needs time to heal. Once your bowel is functioning properly again, your provider can perform stoma reversal surgery.Can I shower without my ostomy bag?Yes. Showering or bathing without your ostomy pouch is perfectly safe.Can I swim while wearing my ostomy bag?Yes. Pouching systems are waterproof. When sealed properly, they can be worn anytime you’re in water.What’s a j-pouch and how does it differ from an ostomy?The main difference is that a j-pouch involves creating a pouch inside the body while ostomy requires a pouch outside the body. In j-pouch surgery, the large intestine is removed and a portion of the lower intestine is used to create a small pouch. This pouch remains inside the body and is attached to the remaining rectum. People who have j-pouch surgery don't have a stoma. Instead, the waste collects in the pouch and is eliminated through the anus.That being said, many people who undergo J-pouch surgery must have a temporary ileostomy while they heal from their initial procedure. Once your bowel heals, however, the stoma is removed and fecal waste is moved through the internal J pouch.A note from Cleveland ClinicLiving with an ostomy can be a major adjustment. You may be discouraged or worried about how your ostomy will affect your social life or how others will perceive you. It’s important to express these concerns to your healthcare provider and find a support group that will help you cope with your new situation.Hundreds of thousands of people who’ve had ostomy surgery lead active, fulfilling lives. This procedure can help you regain your health and give you a new lease on life.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/14/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"