"Otoplasty (Cosmetic Ear Surgery): Procedure & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Otoplasty (Ear Reshaping)AdvertisementAdvertisementAdvertisementOtoplasty (Ear Reshaping)Otoplasty (cosmetic ear surgery) corrects ear abnormalities, including protruding ears, overly large ears or misshapen ears. This surgery can also correct ears that have been damaged by trauma. Otoplasty offers a permanent solution that can improve the appearance of your ears and boost your self-confidence.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is otoplasty?Otoplasty is surgery to correct structural ear abnormalities. This reshaping surgery aims to provide a more natural appearance to your ear and can improve self-confidence. It doesn’t impact or improve a person’s ability to hear sounds.Why do people get otoplasty?People might get otoplasty if they were born with:Misshapen ears or ear lobes.Protruding ears.Small, constricted ears.Ears with missing cartilage.The symptoms listed above are congenital conditions. (“Congenital” means you’re born with it.) But surgeons also perform otoplasty on people who sustained ear injuries or trauma during a traumatic event (like car wrecks, dog bites or sports-related injuries).Cauliflower ear is a common injury among boxers, wrestlers and mixed martial artists. If you have permanent damage as a result of cauliflower ear, your surgeon may recommend otoplasty.What’s the best age for otoplasty?Anyone with fully developed ears can get otoplasty. That said, surgeons perform the majority of otoplasty procedures on children after age 4. Some adults choose otoplasty as well.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the different types of otoplasty?There are different types of otoplasty, including:Ear pinning.Ear reduction.Ear augmentation.Ear pinningSurgeons recommend this type of otoplasty if you or your child have prominent ears that stick out. The goal of ear pinning is to bring your ears in closer to the sides of your head and reshape malformed cartilage.Ear reductionPeople with large or oversized ears (macrotia) may benefit from an ear reduction. During this procedure, a surgeon will remove tissue to make your ears smaller.Ear augmentationSometimes, people have misshapen ears, small ears or ears that haven’t fully developed (microtia). The goal of ear augmentation is to increase the outer portion of your ear. This usually requires cartilage or tissue grafting.Procedure DetailsHow should I prepare for otoplasty?Before you have otoplasty surgery, your surgeon will meet with you. During this visit, they’ll:Examine your ears.Talk with you about your expectations.Review your health history.Your surgeon will also give you a detailed list of pre-operative instructions. These can vary from person to person. But in general, you’ll likely need to:Avoid nonsteroidal anti-inflammatory drugs (NSAIDs) to reduce your risk of bleeding.Avoid smoking.Arrange for a trusted friend or family member to drive you to and from your appointment.AdvertisementWhat happens during otoplasty?Otoplasty is usually an outpatient procedure. This means you’ll be able to go home the same day.Before surgery begins, your healthcare provider will give you anesthesia to keep you comfortable. This is done under general anesthesia (where you’re completely asleep) or local anesthesia with sedation (where you’re sleepy, but can still respond to questions).The specific surgical steps vary depending on what type of otoplasty you’re having. General steps include:Making an incision (usually on the back of your ear or in the folds of your ear).Adding or removing tissue to your ear.Reshaping your ear.Closing the incision with stitches.How long does otoplasty take?Otoplasty surgery takes between one and three hours, depending on your specific situation.What happens after this procedure?After otoplasty, your surgeon will place a dressing over your ears. You’ll need to keep the dressing clean and dry. Your healthcare provider will tell you how to care for your dressing.During otoplasty recovery, you should:Avoid touching your ears.Choose clothes that you don’t have to pull over your head (like button-up shirts).Sleep on your back and avoid resting or putting pressure on your ears.Care at Cleveland ClinicSchedule Cosmetic Ear SurgeryFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the benefits of otoplasty?Otoplasty offers notable benefits, including:Correction of prominent, protruding or misshapen ears.Increased self-confidence.Safe treatment.Permanent results.What are the side effects of otoplasty surgery?Like any surgery, you can expect some side effects after otoplasty. Common side effects include:Soreness.Itchiness.Redness.Swelling.Bruising.Tingling or numbness.What are the risks or complications of otoplasty?Though rare, otoplasty carries certain risks, including:Perichondritis (infection of your ear cartilage).Auricular hematoma (bleeding around your ear cartilage).Scarring.Asymmetrical results.Overcorrection.Loss of skin sensation (usually temporary).Allergic reaction to anesthesia.Recovery and OutlookWhat is the recovery time?Full otoplasty recovery usually takes between six and eight weeks. But you’ll probably notice visual improvements in two to three weeks. Keep in mind that healing times vary from person to person.Will I need follow-up appointments after my otoplasty?Yes, your surgeon will want to check on you and make sure your ears are healing well. They’ll likely schedule your first follow-up about one week after your otoplasty surgery. At this point, they’ll remove your dressing (bandages).You’ll probably need to see your surgeon for one to two more follow-ups over the next few weeks to ensure your recovery is on track.When can my child go back to school?Following otoplasty surgery, your child can return to school in about one week. But they’ll still need to reduce physical activity, such as recess, sports or gym class.When to Call the DoctorWhen should I call my healthcare provider?Contact your healthcare provider immediately if you:Develop a fever.Experience excessive bleeding or swelling.Sustain trauma to your surgical site.Additional DetailsDoes otoplasty last forever?Otoplasty can last the rest of your life. Results from the procedure are typically permanent.Does insurance cover otoplasty (cosmetic ear surgery)?In general, insurance companies don’t cover otoplasty because they view it as a cosmetic procedure that isn’t medically necessary. But all insurance plans are unique, so it’s a good idea to call your company for details. In many cases, your surgeon can write a letter to your insurance company outlining the reasons for otoplasty.A note from Cleveland ClinicEar differences may cause social anxiety in all age ranges and may make children vulnerable to teasing. It’s important to listen to your child’s frustrations. Whether you’re the parent of a child with uniquely shaped ears or you want to improve the appearance of your own ears, otoplasty can help. Talk to your healthcare provider to find out if this solution is right for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/07/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Cosmetic Ear SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"