"Abdominoperineal Resection: What Is It, Procedure, Side Effects & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Laparoscopic Abdominoperineal ResectionAdvertisementAdvertisementAdvertisementLaparoscopic Abdominoperineal ResectionLaparoscopic abdominoperineal resection is a surgery to treat cancer low in the rectum or in the anus, close to the sphincter muscles. This surgery, which removes the anus, rectum, and sigmoid colon, is a less invasive technique that calls for five or six small incisions rather that one large incision.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is abdominoperineal resection surgery?An abdominoperineal resection (APR) is a surgery in which the anus, rectum and sigmoid colon are removed. This procedure is most often used to treat rectal cancers located very low in the rectum. Often this surgery occurs after you have completed radiation and/or chemotherapy treatments.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow should I prepare for laparoscopic abdominoperineal resection?Your healthcare provider will help you prepare for your abdominoperineal resection. They will talk to you about your medical history and discuss any prescription drugs or supplements you’re taking. You should also tell your healthcare provider if you have sleep apnea. If you use a CPAP device, bring it with you the day of your surgery.It’s recommended that you don’t smoke or drink alcohol in the weeks leading up to your surgery. These habits can hinder your healing and cause serious complications. It’s important to be honest with your healthcare provider about how much you drink or smoke. They can help you plan ahead for a successful recovery.How is abdominoperineal resection surgery performed?This procedure is performed under general anesthesia at a hospital. Abdominoperineal resection steps include:Preparing the sigmoid colon and rectum for removal: Your surgeon will complete several steps before removing the anus, rectum and sigmoid colon. First, the main blood vessels that serve the diseased sections of the bowel are divided. Next, your surgeon frees the sigmoid colon and rectum, then separates the sigmoid colon from the remaining large intestine.Preparing the anus for removal: Your surgeon then operates on the area between the legs (perineal region) to remove the anus. The anus, rectum, and sigmoid colon are removed from the body. The skin is sewn closed where the anus used to be located.Performing a colostomy: Once the anus and rectum are removed, a permanent colostomy is created. A colostomy involves bringing a portion of the colon (large bowel) to an opening at the surface of the skin. This new opening, called a stoma or colostomy, allows waste to pass out of the body. The stoma usually measures from 1 to 1½ inches in diameter. A pouch, or ostomy bag, is worn to collect gas and stool. This pouch is worn at all times since there is no longer conscious control of waste elimination from the body.AdvertisementHow long does abdominoperineal resection surgery take?Generally, abdominoperineal resection surgery takes about two to three hours. This timeframe can vary depending on your specific situation.What should I expect during abdominoperineal resection recovery?Following abdominoperineal resection surgery, most people stay in the hospital for several days. You’ll be fitted with an ostomy pouch immediately after surgery. However, it takes a few days for your digestive system to become active again. Your diet is slowly increased from liquids to solid foods as your intestines start functioning.While you are recovering in the hospital, your medical team will give you instructions for abdominoperineal resection postoperative care. This includes how to properly care for your stoma and how to change your ostomy bag when you return home from the hospital. Colostomy irrigation may be an option to help regulate bowel movements after the procedure.AdvertisementRisks / BenefitsWhat are the advantages of laparoscopic abdominoperineal resection surgery?There are several benefits to performing this procedure laparoscopically. Compared to traditional open surgery, the laparoscopic technique:Requires smaller incisions.Reduces pain.Decreases the amount of blood loss during the procedure.Reduces the risk for postoperative complications.Encourages faster healing and recovery.Are there any abdominoperineal resection complications?In rare instances, people can develop a perineal hernia after abdominoperineal resection. This is a weakness where the skin is closed after the anus is removed. This issue can be addressed with surgical hernia repair if necessary. Other abdominoperineal resection complications include:Bleeding.Perineal wound problems.Perineal sinus (a small hole in the skin).Treatment for these postoperative complications depends on the severity of the issue. Your healthcare provider may recommend a number of treatments, from antibiotics to corrective surgery.Recovery and OutlookHow long does it take to recover from abdominoperineal resection recovery?On average, recovery after abdominoperineal resection surgery takes about three to six weeks. This timeline can vary depending on your health history, type of surgery completed and other factors.When can I go back to work or school?Ask your healthcare provider when it’s safe for you to return to school, work or other activities. People with desk jobs may be able to return sooner than people who have physically demanding jobs.When to Call the DoctorWhen should I call my healthcare provider?If you’ve undergone abdominoperineal resection, be sure to call your healthcare provider if any worrisome symptoms occur. Symptoms may include:Abdominal pain.Nausea and vomiting.Redness, swelling or pain at the incision sites.No waste in your ostomy pouch for three days.A fever of 100.5° F or higher.Difficulty peeing.A note from Cleveland ClinicHearing that you need abdominoperineal resection surgery can be scary. Talk with your healthcare provider about any questions or concerns you have. You may also want to consider joining a support group. Learning what to expect can help you prepare for your procedure and maximize your quality of life after recovery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/02/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"