" Laparoscopic Surgery: Purpose, Procedure & What it Is800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Laparoscopic SurgeryAdvertisementAdvertisementAdvertisementLaparoscopic SurgeryLaparoscopic surgery uses the aid of a laparoscope, a thin rod with a camera attached, to visualize the abdominal and pelvic cavities through tiny keyhole incisions. This minimally invasive surgical technique is associated with faster recovery and better patient outcomes.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is laparoscopic surgery?Laparoscopic surgery is a minimally invasive surgical technique used in the abdominal and pelvic areas. It uses the aid of a laparoscope — a thin, telescopic rod with a camera at the end — to see inside your body without opening it all the way up. Instead of the 6- to 12-inch cut necessary for open abdominal surgery, laparoscopic surgery uses two to four small incisions of half an inch or less. One is for the camera, and the others are for the surgical instruments. Minimally invasive surgery may also be called “keyhole surgery,” referring to these small incisions.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is a laparoscopy?A laparoscopy is a kind of exploratory surgery using a laparoscope. The surgeon explores your abdominal and\\or pelvic cavities through one or two keyhole incisions. This is the less-invasive alternative to a laparotomy. It’s usually done for diagnostic purposes, to look for problems that imaging tests haven’t been able to identify. The surgeon may take tissue samples for biopsy during the exam. They may also be able to treat minor problems during the laparoscopy — for example, remove growths or blockages that they find during the exam.What surgeries are performed laparoscopically?Many common surgeries can be performed laparoscopically today. Whether you're a candidate for laparoscopic surgery will depend on how complicated your condition is. Some complicated conditions may require open surgery to manage. However, laparoscopic surgery is becoming the preferred default method for a growing list of common operations, due to its cost-saving benefits and improved patient outcomes. The list includes:Cyst, fibroid, stone, and polyp removals.Small tumor removals.Biopsies.Tubal ligation and reversal.Ectopic pregnancy removal.Endometriosis surgery.Urethral and vaginal reconstruction surgery.Orchiopexy (testicle correction surgery).Rectopexy (rectal prolapse repair).Hernia repair surgery.Esophageal anti-reflux surgery (fundoplication).Gastric bypass surgery.Cholecystectomy (gallbladder removal) for gallstones.Appendectomy (appendix removal) for appendicitis.Colectomy (bowel resection surgery).Abdominoperineal resection (rectum removal).Cystectomy (bladder removal).Prostatectomy (prostrate removal).Adrenalectomy (adrenal gland removal).Nephrectomy (kidney removal).Splenectomy (spleen removal).Radical nephroureterectomy (for transitional cell cancer).Whipple procedure (pancreaticoduodenectomy) for pancreatic cancer.Gastrectomy (stomach removal).Liver resection.Can laparoscopic surgery be used outside the abdomen and pelvis?Minimally invasive surgical techniques are used in many areas of the body. Outside of the abdominal and pelvic areas, the method may be similar, but it’s called something else. In the chest cavity, a surgeon may use a thoracoscope to view your lungs through a keyhole incision. In the knee area, a surgeon may use an arthroscope. The scopes are named differently for the parts of the body they are looking at, but they are all modified versions of the same thing.AdvertisementIs laparoscopic surgery major surgery?The terms “major surgery” and “minor surgery” don’t have specific established definitions. Healthcare providers use them variably to describe how complicated and/or dangerous they feel one operation is compared to another, and to set expectations for the recovery period. If you ask them about laparoscopic surgery, you may get different answers depending on what kind of operation you’re talking about and how extensive it is.On one hand, laparoscopic surgery is considered minimally invasive because the incisions are small and the organs aren’t exposed. Also, the kinds of operations that can be done laparoscopically tend to be less complicated ones. Surgeries that turn out to be more complicated than expected may not be able to be safely completed using the laparoscopic method, and may have to convert to open surgery, which is major surgery.On the other hand, laparoscopic surgeries include organ removals, and if you feel like any removal of an organ must be major surgery, you’re not wrong. These kinds of operations carry certain inherent risks no matter how they're done, such as risks of bleeding, damage to nearby organs, internal scarring and so on. But they are also common and have high success rates, and with the laparoscopic method, the recovery times will be shorter and easier.How safe is laparoscopic surgery?It's at least as safe as open surgery, and some risks are reduced. Smaller wounds reduce the risk of infection, blood loss and postoperative complications such as wound separation and incisional hernia. Laparoscopic surgery minimizes the direct contact between the surgeon and patient, which reduces the risk of any transmission of germs between the two. It also minimizes post-operative recovery time, which reduces the risks of prolonged bed rest, such as blood clots.How common is laparoscopic surgery?Research suggests over 13 million laparoscopic procedures are performed globally every year. These numbers are projected to grow by 1% over the next five years.Procedure DetailsHow should I prepare for my laparoscopic surgery?Since most laparoscopic surgeries are performed under general anesthesia, you’ll need to prepare for this in a few ways. You’ll need to avoid eating or drinking for about eight hours prior to surgery. This is to prevent nausea from the anesthesia. You should also arrange for someone to drive you home after the procedure. You’ll likely be able to go home the same day, but you may still be disoriented from the anesthesia. Your doctor may give you more specific instructions regarding your medications.AdvertisementWhat happens before the procedure?When you arrive at the hospital, you’ll change into a hospital gown and a nurse will take your vital signs to make sure you’re in good condition for surgery. In some cases, they may take other tests prior to the operation, such as a blood test or imaging test of the surgical site.When the testing is done, you’ll move to the operating room. You’ll have an IV (intravenous) line placed through a vein in your arm or hand to administer your fluids and anesthesia. The anesthesia will paralyze your muscles, stop any pain and put you to sleep. You’ll also have a breathing tube placed in your throat to make sure your airway stays open.What happens during the procedure?The surgery begins with a small incision near your belly button or pelvic bone. This first incision is used to pump carbon dioxide gas into your abdominal or pelvic cavity. Laparoscopic surgery uses narrow surgical tubes called trocars as ports for surgical instruments. The surgeon will insert the first trocar and then place the gas tube through the trocar to inflate your abdominal or pelvic cavity with gas. This helps separate your abdominal wall from your organs and makes organs easier to visualize on the video monitor.After inflating the cavity, the surgeon will remove the gas tube and place the laparoscope through the trocar. The laparoscope will project real-time video images of the surgical site to the video monitor. This will guide the placement of the other surgical instruments. Depending on the type of procedure, they may make one or several more keyhole incisions and place trocars in them. Laparoscopic surgery uses long, narrow instruments that are designed to fit through the trocars.For some operations, a surgical drain may be placed inside the cavity to draw out excess fluids, such as from inflammation. The fluids will drain through a small tube. For some conditions, the tube may need to remain in your body for some time after the operation to continue to drain fluids. Everything else will be sewn up after the operation. The gas will be let out of your body before the incisions are closed. Your surgical team will ensure that your vital signs are stable before withdrawing your breathing tube and your IV.What happens after the procedure?You’ll be moved to a postoperative recovery room, where your vital signs will continue to be monitored until you wake up. At this point, you may need a new kind of pain medication. One common side effect that people experience after laparoscopic surgery is gas pain from residual carbon dioxide in their body. It can feel like it’s in your shoulders. That’s because it’s triggering a nerve that refers pain to the shoulder area. This is normal and goes away on its own in a day or so.You may be able to go home the same day, or you may need to stay overnight, depending on your individual surgery and how your body responds. Your healthcare team will instruct you on how to take care of yourself when you go home. This includes wound care, drain care if you have one, and dietary guidelines, especially if you had abdominal surgery. You’ll also schedule a follow-up visit before you leave, to check on your healing and remove your fluid drain, if you have one.Care at Cleveland ClinicSchedule Pediatric SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of laparoscopic surgery?Less trauma to the abdominal wall.Less blood loss.Reduced risk of hemorrhage.Smaller scars.Reduced risk of wound infection.Shorter hospital stay.Less time in the hospital means less expense.Faster recovery time and return to activities.Less wound pain during healing.Less pain medication necessary.What are the possible risks or complications of laparoscopic surgery?Possible complications include:Trocar injuriesSince the original trocar may be inserted blindly before the laparoscope is inserted, there is some risk of injury from the original trocar insertion. Complications are rare but serious. They include:Blood vessel injury.Bowel injury.Nerve injury.Port-site hernia.Insufflation complicationsSome people may have an adverse reaction to the carbon-dioxide gas that is used to inflate the abdominal cavity for the procedure. You will be screened for any cardiopulmonary conditions that would put you at risk of these complications prior to surgery. Complications include:Hypercapnia (carbon dioxide retention).Pneumothorax (collapsed lung).Subcutaneous or mediastinal emphysema (air trapped under the skin or in the chest cavity).Hypothermia (if cold gas isn’t prewarmed).General surgical risksAll surgeries come with certain general risks. These include:Allergic reaction to anesthesia.Internal adhesions from scar tissue.Excessive bleeding.Wound infection.When is laparoscopic surgery not recommended?Contraindications for laparoscopic surgery include:Prior surgery in the area. This increases the likelihood of scars and adhesions that may interfere with the access and visibility of the laparoscopic tools.Excessive body mass in the area. This can make it too hard to see via laparoscope.Extensive infection or bleeding. This emergency situation requires immediate open access to manage.Cardiopulmonary conditions. These increase the risk of adverse reactions to carbon dioxide.Recovery and OutlookWhat is the recovery time from laparoscopic surgery?In most cases, you’ll be able to go home the same day. Full recovery time is about two to three weeks. During this time, you can expect some normal wound pain. This should be manageable with short-term pain medication and should improve over the first few days. If it doesn’t, let your doctor know.When to Call the DoctorWhen should I be concerned about my postoperative recovery?Contact your healthcare provider if you experience any of the following:High fever/chills.Persistent nausea and vomiting.Pain getting worse not better.Swelling or redness at the incision sites.Pain or swelling in a limb.Abnormal discharge or bleeding.A note from Cleveland ClinicLaparoscopic surgery tools and techniques continue to improve, enabling more complex surgeries to be safely completed through keyhole incisions. Many operations that were once considered too difficult for minimally invasive methods can now be done laparoscopically or with a combination of laparoscopic and manual or robotic assistance. These innovations can make surgery less daunting to consider, whether it is an elective, preventative or emergency operation before you. The burdens of risk and recovery are greatly reduced with laparoscopic surgery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/16/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Pediatric SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"