"Laparoscopy: Procedure Details, Safety & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/LaparoscopyAdvertisementAdvertisementAdvertisementLaparoscopyA laparoscopy is one way to get a closer look at the organs in your abdomen and your reproductive organs. This procedure can be used to help diagnose different medical conditions and take biopsies – samples of tissue that are tested. A laparoscopy is generally a safe procedure with few complications.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is laparoscopy?Laparoscopy is a type of diagnostic surgical procedure that your healthcare provider can use to look inside your body at your abdominal and reproductive organs. This procedure can also be used to collect samples of tissue (biopsies) for testing. A laparoscope — a thin tube similar to a telescope — is passed through a small incision (cut) in your abdomen. Using the laparoscope, your provider can look directly at the outside of your:Uterus.Ovaries.Fallopian tubes.Liver.Pancreas.Gallbladder.Spleen.Stomach.Your provider might recommend a laparoscopy if other diagnostic tests, such as ultrasound and X-ray, can't confirm the cause of your condition. Your provider might use laparoscopy to:Find the cause of pain in the pelvic and abdominal regions.Examine a tissue mass.Confirm endometriosis or pelvic inflammatory disease.Look for blockage of the fallopian tubes or for other causes of infertility.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow do I prepare for a laparoscopy?Please follow these guidelines before coming to the hospital for your laparoscopy:Do not eat, drink (including water) or smoke after midnight the day before your surgery.Wear low-heeled shoes the day of surgery. You might be drowsy from the anesthesia and unsteady on your feet.Do not wear jewelry. (Wedding rings may be worn.)Wear loose-fitting clothing. You will have some abdominal tenderness and cramping after surgery.Remove any nail polish before surgery.What tests are typically done before a laparoscopy?Your healthcare provider might need to do a few tests and gather some medical information about your health before your laparoscopy. This information can include:Previous X-rays from another facility.Film reports.Lab work.Operative report.Pathology report.Cytology slides.Tissue specimens.Your healthcare provider may also order additional tests, including:Ultrasound.Computed tomography (CT).Magnetic resonance imaging (MRI).AdvertisementHow is a laparoscopy performed?A laparoscopy is done while you’re lying down in a slightly tilted position, with your head lower than your feet. You’ll be given a general anesthetic to relax your muscles and prevent pain during surgery.Next, a small incision is made near the navel. The laparoscope is inserted through this incision. Your abdomen is inflated to make the organs easier to view. The laparoscope might also be equipped with surgical devices for taking tissue samples or removing scar tissue.Your provider might also make a second incision at the pubic hairline. This incision provides an additional opening for instruments needed for completing minor surgical procedures.After surgery, you’ll usually stay in a recovery room for about one hour. Then you will be taken to an outpatient surgery unit for continued observation.You will be discharged after you receive instructions for your home recovery. In most cases, you can leave the hospital about four hours after laparoscopy. It’s rare that a patient will need to stay in the hospital overnight after this procedure.You’ll be asked to return to your healthcare provider’s office for follow-up appointments within two to eight weeks of your laparoscopy. Please confirm your follow-up appointment schedule with your provider before leaving the hospital.One important thing to note before going in for surgery is that you won’t be able to drive for 24 hours after surgery. Make sure you have someone available to pick you and stay with you for those first 24 hours.Care at Cleveland ClinicSchedule General SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsIs laparoscopy safe?Laparoscopy is a very safe procedure. One benefit of this procedure is that it allows your healthcare provider to make an accurate diagnosis of your condition. When done in women, about three out of every 1,000 experience complications. Possible complications can include:Injury to nearby organs and blood vessels.Bleeding.Problems related to anesthesia.Infection.Inflammation of the abdominal wall.A blood clot that could enter the bloodstream, causing clotting in your legs, pelvis or lungs.A blood clot that could travel to your heart or brain, where it could cause a heart attack or stroke — this is very rare.Talk to your healthcare provider about any concerns you might have before your procedure. Your provider will be able to tell you about the possible complications and explain your risk for these issues.AdvertisementRecovery and OutlookWhat happens after a laparoscopy?In most cases, you can go home not long after your laparoscopy. You’ll need to wait until your anesthesia has worn off and your healthcare provider has made sure you aren’t experiencing any side effects from the procedure. In the days following your laparoscopy, you will recover at home.How do I recover at home from a laparoscopy?While you’re recovering at home after your laparoscopy, it’s good to keep a few things in mind. These tips include:Don't drink alcohol or drive for at least 24 hours after surgery.You can bathe any time after surgery.You can remove the bandage the morning after the surgery. Steri-strips — which look like tape — can be removed two to three days after surgery.You can typically return to work three days after surgery. If you need a doctor's letter excusing you from work, please request one at your pre-operative appointment.Do not be concerned if your urine is green. A blue dye might have been used to check if your fallopian tubes are open.Are there any uncomfortable feelings I might experience after a laparoscopy?Just like with many surgeries, you might experience some discomfort after a laparoscopy. These discomforts can include:Your abdomen might be swollen for several days after the surgery. You may take acetaminophen to relieve pain.You might have a sore throat for a few days. Try using a throat lozenge.You might have mild nausea. Try eating a light evening meal the day of surgery. Tea, soup, toast, gelatin or crackers might help relieve your nausea.Gas in the abdomen might cause discomfort in the neck, shoulders and chest for 24 to 72 hours after surgery. Try taking a warm shower, using a heating pad or walking.Can I expect vaginal bleeding after a laparoscopy?It’s normal to experience vaginal bleeding up to one month after laparoscopy. Many women do not have their next normal menstrual cycle for four to six weeks after surgery. When your normal cycle returns, you might notice heavier bleeding and more discomfort than usual.Wait two to three menstrual cycles before determining if laparoscopy has helped to relieve your condition.When can I resume sexual activity after laparoscopy?You can resume sexual activity one week after surgery. However, pregnancy can still happen during recovery. If you wish to prevent pregnancy, make sure to use a contraceptive.When to Call the DoctorWhen should I contact my doctor after laparoscopy?Contact your healthcare provider immediately if you experience any of the following:Persistent nausea and vomiting for more than 24 hours.Temperature over 100 degrees Fahrenheit for more than 24 hours.Redness, swelling, soreness, drainage or bleeding around your wound.Shortness of breath or any trouble breathing.After the first day of surgery: menstrual flow that is heavier than normal, heavy bleeding with clots or soaking a sanitary pad in less than two hours.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/25/2020.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule General SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"