"Laparoscopic Cholecystectomy: Gallbladder Removal800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Laparoscopic Cholecystectomy (Gallbladder Removal)AdvertisementAdvertisementAdvertisementLaparoscopic Cholecystectomy (Gallbladder Removal)Laparoscopic cholecystectomy is minimally invasive surgery to remove the gallbladder. It helps people when gallstones cause inflammation, pain or infection. The surgery involves a few small incisions, and most people go home the same day and soon return to normal activities. Call your healthcare provider if you have any problems after surgery.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a laparoscopic cholecystectomy?A laparoscopic cholecystectomy is surgery to remove your gallbladder.The surgeon makes a few small incisions on the right side of your abdomen (belly). The surgeon uses one incision to insert a laparoscope, a thin tube with a camera on the end. This shows your gallbladder on a screen. The gallbladder then gets removed through another small incision.A laparoscopic cholecystectomy is less invasive than an open cholecystectomy. This other form of gallbladder removal involves a larger incision.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is the gallbladder?The gallbladder is an organ the shape and size of a small pear. It stores a substance called bile made by the liver. It keeps the bile until the body needs it to digest fatty foods.Who needs to have gallbladder removal?A laparoscopic cholecystectomy helps people with gallstones that are causing pain and infection.Gallstones are crystals that form in the gallbladder. They can block the flow of bile out of the gallbladder into your digestive system. This roadblock causes cholecystitis (inflammation of the gallbladder). Gallstones can also move to other parts of the body and cause problems.Symptoms of gallstones include:Feeling bloated.Fever.Jaundice (yellow-looking skin).Nausea.Pain in the right side of the abdomen, which may reach the back or the shoulder.AdvertisementProcedure DetailsHow should I prepare for gallbladder removal?Before the procedure, your healthcare team will perform certain tests, such as:Abdominal ultrasound.Blood work.Urinalysis (evaluation of the urine).They will also talk to you about:Any medications you are taking.Your options for controlling pain during and after surgery.Your surgeon may ask you to avoid food and liquid for a few hours before the procedure.What happens right before laparoscopic cholecystectomy?You will receive general anesthesia so that you sleep and have no pain during the procedure. Once you’re out, your healthcare providers will place a tube down your throat to help you breathe. They’ll place another tube — an IV line — in your arm to deliver fluids and medications.AdvertisementWhat happens during laparoscopic cholecystectomy?Laparoscopic cholecystectomy takes about an hour or two. A surgeon will make a few small incisions in your abdomen. The surgeon will insert thin, hollow tubes into those incisions. The surgical team will then place a laparoscope and other surgical tools into the tubes.Your team may pump carbon dioxide into your abdomen. This step inflates the surgical area and makes it easier to see inside. Using the special tools, the surgeon will detach the gallbladder from the rest of the body and remove it. The team will then close the incisions with stitches, surgical clips or surgical glue.If any complications occur during laparoscopic cholecystectomy, the surgeon may decide to use an open cholecystectomy instead. That procedure involves a larger incision.What happens after laparoscopic cholecystectomy?Your team will watch you for a few hours after surgery. They want to make sure you wake up from the anesthesia without complications. They will check your heart, breathing, blood pressure and ability to urinate (pee).Care at Cleveland ClinicDigestive CareMake an AppointmentRisks / BenefitsWhat are the benefits of gallbladder removal?Removing the gallbladder will stop the pain and treat the infection caused by gallstones. It can also stop gallstones from coming back.If gallstones are not treated, pain and infection can get worse. The gallbladder may burst, which can be life-threatening.What are the benefits of laparoscopic cholecystectomy?Your healthcare provider or surgeon will determine whether open or laparoscopic cholecystectomy is right for you. The laparoscopic procedure has several benefits:Less pain.Lower risk of complications.Quicker recovery and return to regular activities.Smaller wounds and scars.What are the risks or possible complications of laparoscopic cholecystectomy?Like any surgery, laparoscopic cholecystectomy has some risks, but they are rare:Bile leaking in the body.Bleeding.Complications from anesthesia.Hernia.Injury to the bile ducts, liver or intestines.Numbness in the surgical area.Peritonitis (inflammation and infection in the abdomen).Small scars from the incisions.Urinary tract infection.Recovery and OutlookWhat is the recovery time after laparoscopic cholecystectomy?If you don’t have any complications, you can usually go home the same day as your laparoscopic cholecystectomy. With an open cholecystectomy, you may have to stay in the hospital for a day or two.What should I do to take care of myself after gallbladder removal?After surgery, do the following to help yourself recover:Avoid lifting heavy things.Drink plenty of water.Eat foods high in fiber to help your bowel movements (pooping).Follow your healthcare provider’s instructions about taking care of your wounds and taking medications.Slowly increase your activity.Walk a little bit every day to prevent blood clots.When can I go back to normal activities after laparoscopic cholecystectomy?Without complications, you should be able to drive and eat normally in a day or two. You usually can return to work and other daily activities in about a week, as long as they don’t involve lifting. You may need a week or two before you are physically or sexually active.When to Call the DoctorWhen should I seek medical attention after gallbladder removal?After you go home, call your healthcare provider right away if you develop any of the following:Chills.Cramps in your abdomen or severe pain.High fever (over 101 degrees Fahrenheit).Incision problems, like bleeding, swelling, redness or a funny smell.No bowel movement for three days.Vomiting.Yellow skin.A note from Cleveland ClinicGallstones can be very painful and dangerous. Laparoscopic cholecystectomy removes the gallbladder and prevents gallstones from coming back. Most people fully recover from the minimally invasive procedure in just a few weeks. But call your healthcare provider if you experience any problems after surgery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 01/20/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicDigestive CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"