"Laser Lipolysis: What To Expect, Sessions & Results800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Laser LipolysisAdvertisementAdvertisementAdvertisementLaser LipolysisLaser lipolysis is a safe in-office cosmetic procedure that uses laser energy to heat and remove fat cells. It’s ideal for shrinking various areas of the body. Laser lipolysis may be minimally invasive or noninvasive. Recovery is quick and the risks are minimal.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is laser lipolysis?Laser lipolysis is a body contouring procedure. It uses laser energy to remove excess fat from various areas of your body, including your:Abdomen.Back and neck.Calves.Hips and butt.Obliques (“love handles”).Thighs.Upper arms.Other names for laser lipolysis include laser liposuction, laser lipo and liposculpture.Types of laser lipolysisPlastic surgeons may perform:Minimally invasive laser lipolysis: Involves making a tiny incision in your skin to insert the laser applicator.Noninvasive laser lipolysis: Doesn’t involve any incisions, as the laser applicator is applied on top of your skin.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyDoes laser lipolysis really work?Both minimally invasive and noninvasive laser lipolysis are effective in reducing fat cells. It may take up to three months to see results.How many sessions of laser lipolysis are needed?While everyone’s situation is different, on average, people may need one to two treatments for each body part.AdvertisementWho is a good candidate for laser lipolysis?Good candidates for laser lipolysis include people who:Are in good overall health.Don’t smoke or can quit smoking weeks before treatment.Have realistic expectations about their results.Who isn’t a good candidate for laser lipolysis?In general, laser lipolysis may not be the best option for people who have:Excess weight (obesity).Loose skin.Medical conditions, such as diabetes, cardiovascular diseases or liver disease.Laser lipolysis also isn’t appropriate for people who are pregnant or trying to get pregnant. Your plastic surgeon will help you determine if minimally invasive or noninvasive laser lipolysis — or another type of body contouring — is right for you.AdvertisementIs laser lipolysis permanent?Laser lipolysis results are typically long-lasting. However, the slimming, tightening effects go away if you gain weight.Is laser lipolysis safe?For many people, laser lipolysis is a safe procedure with relatively minor risks and a quick recovery.Procedure DetailsHow should I prepare for laser lipolysis?Your plastic surgeon will give you special instructions to prepare for laser lipolysis, which may include:Quitting smoking.Stopping blood-thinning medication, such as aspirin and warfarin.What happens before laser lipolysis treatment?Laser lipolysis is an in-office procedure. Before minimally invasive laser lipolysis, a plastic surgeon applies local anesthesia to numb the area so you don’t feel any pain. You’ll be awake during the procedure.Noninvasive laser lipolysis doesn’t require any anesthesia, as there are no incisions.What happens during laser lipolysis treatment?Minimally invasive laser lipolysis takes about an hour. During that time, a plastic surgeon:Makes a small incision (cut) in your skin.Inserts the laser through the incision, which melts away fat cells.Inserts a small tube to suction out the melted fat.Closes and covers the incision.Noninvasive laser lipolysis takes about 25 minutes. Your healthcare provider puts a special laser applicator on the area of your body being treated. As the laser works, you’ll feel warm and cool sensations.What happens after laser lipolysis treatment?After laser lipolysis, the healthcare provider will give you special instructions. With minimally invasive laser lipolysis, you may have specific directions for incision care. You also might need to wear:A thin tube near your incision to drain fluid and prevent swelling.Compression garments to help you heal faster and enhance your results.Care at Cleveland ClinicPlastic Surgery CareMake an AppointmentRisks / BenefitsWhat are the benefits of laser lipolysis?Laser lipolysis reduces fat in specific areas of your body that are often difficult to change with diet and exercise.Compared to traditional liposuction, laser lipolysis has a lower risk of complications and faster recovery. There’s little to no downtime.What are the risks of laser lipolysis?Laser lipolysis risks are usually minimal and complications are uncommon. Your plastic surgeon should discuss the risks associated with the type of treatment you have.With noninvasive laser lipolysis, you may experience temporary:Redness.Swelling.Tenderness.Minimally invasive laser lipolysis may cause side effects, such as:Bruising.Collection of blood under the skin (hematoma).Redness.Scarring.Swelling.Recovery and OutlookWhat is the recovery time?With noninvasive laser lipolysis, there’s no recovery time. It may take a few days to recover from minimally invasive laser lipolysis.When can I go back to work and other activities?With noninvasive laser lipolysis, you can return to work right away or the next day. With minimally invasive laser lipolysis, you may need to wait a few days.Your healthcare provider might suggest waiting several weeks before participating in any strenuous activities, such as strength training.When to Call the DoctorWhen should I see my healthcare provider?See your healthcare provider immediately if you’re experiencing any signs of possible infection, such as:Discharge.Excessive bleeding.Pain.Severe swelling.A note from Cleveland ClinicLaser lipolysis is an effective way to reduce fat in various areas of your body, such as your thighs and upper arms. Treatment may be minimally invasive or noninvasive. Laser lipolysis results tend to be long-lasting unless you gain weight. Talk to your healthcare provider to see if you’re a good candidate for laser lipolysis or a different cosmetic treatment.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/09/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPlastic Surgery CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"