"Laxative Medications After Transplant800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Laxative Medications After TransplantAdvertisementAdvertisementAdvertisementLaxative Medications After TransplantTransplant medications often cause constipation as a side effect. If eating a fiber-rich diet, along with adequate amounts of fluid and exercise is not enough to counteract the constipation, your doctor may recommend an over-the-counter laxative.ContentsArrow DownOverviewProcedure DetailsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRecovery and OutlookOverviewWhy would I need to take laxative medicines?One of the common side effects of transplant medicines is constipation. If constipation becomes a problem for you, your doctor can recommend an over-the-counter (without a prescription) laxative that can encourage bowel movements to relieve constipation.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow and when should laxatives be used?Laxatives are to be used only to provide short-term relief of constipation, unless otherwise directed by your doctor. Remember to check with the Transplant Team if you would like to use a laxative that has worked for you in the past.Warning: If you have stomach pains, do not use an over-the-counter laxative without first talking to your doctor or a member of the Transplant Team.When taking an over-the-counter laxative, carefully read the instructions and follow any precautions on the label.Procedure DetailsWhat special instructions should I follow when using this medicine?If you have been prescribed a low-sodium or low-sugar diet, carefully read the ingredients listed on the label. Some laxatives contain large amounts of sodium or sugar, which could cause unwanted side effects.Certain medicines might cause unwanted side effects when used in combination with laxatives. The use of laxatives containing magnesium might reduce the effects of some of these medicines. Please tell your doctor if you are taking any of the following before you start taking an over-the-counter laxative:  Oral anticoagulants (blood-thinning medicines)Digitalis glycosides (heart medicine)Ciprofloxacin (Cipro®)Etidronate (Didronel®)Sodium polysterene sulfonateOral tetracyclines (medicine for infection)Do not take any laxative within two hours of taking other medicines, as you might reduce the desired effect of the other medicine.Do not take any type of laxative for more than one week unless otherwise instructed by your healthcare provider.Do not take any type of laxative if you do not need it; for example to “clean out your system” or to make you feel better.Call your healthcare provider if you notice a sudden change in bowel habits or function that lasts longer than two weeks, or keeps returning off and on.AdvertisementWhat types of laxatives will I be prescribed?The following are oral laxatives and may be purchased without a prescription. Remember to check with your Transplant Team if you would like to use a laxative that has worked for you in the past.Metamucil®What it is, how it works: This provides bulk (fiber) that allows natural elimination two to three times a day.How to take: Take one teaspoon mixed with a full glass of water.Colace® What it is, how it works: This is a stool softener that is often given in the hospital to prevent constipation.How to take: One to four Colace® tablets may be taken daily with plenty of water to maintain soft stools.Please note: Never take Colace® and mineral oil in the same day.Pericolace®What it is, how it works: This is a combination of stool softener and mild laxative.How to take: Take one or two capsules at bedtime. For severe constipation, take two capsules twice a day.Dulcolax®What it is, how it works: This is a stimulant laxative that increases bowel muscle function.How to Take: Take as directed. The tablets are effective in six to 12 hours.Milk of Magnesia®What it is, how it works: This is a reliable laxative to treat mild constipation.How to take: Take one or two tablespoons as needed.Recovery and OutlookHow do I prevent constipation?To prevent constipation, you need to maintain a diet rich in fiber and drink at least six to eight 8-ounce glasses of fluids a day. Prune juice, whole grain breads and cereals, and fresh fruit and vegetables are all fiber-rich foods to include in your daily diet to help prevent constipation. A regular exercise program also can help you prevent constipation.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/20/2019.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"