"Laxatives: What They Do, Types & How To Use800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/LaxativesAdvertisementAdvertisementAdvertisementLaxativesLaxatives treat constipation by softening hard stools or stimulating your bowels to get moving so you can poop. Common types include bulk-forming laxatives, osmotics, stool softeners, lubricants and stimulants. Most are available without a prescription. Take them as directed to prevent side effects, like bloating, gas or stomach cramps.What are laxatives?Laxatives are medicines that help you have a bowel movement (poop) if you’re constipated. Most of us are familiar with the tell-tale signs of constipation — struggling to poop, hard or dry stools and the feeling that your bowels aren’t empty even after you’ve passed some stool. It’s miserable.Usually, lifestyle changes can kick your digestive system into gear so you can poop. Eating high-fiber foods, taking probiotics, drinking more fluids and exercising often help.If you’ve tried these changes and you’re still having trouble, it may be time to try a laxative. You can buy them over the counter in pharmacies, grocery stores and online. They may be labeled as laxatives, stool softeners or fiber supplements.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs laxatives?Laxatives treat constipation in adults. You may need a laxative if:You’re experiencing occasional constipation that hasn’t improved with lifestyle changes.You have a chronic condition that causes constipation, like Crohn’s disease or ulcerative colitis.You need a bowel cleanse to flush stool out of your colon (large intestine) before a procedure on your digestive system.But laxatives aren’t safe for everyone with constipation. Check with your healthcare provider before taking laxatives if you’re pregnant. Never give your child a laxative unless their pediatrician recommends it. And some laxatives can counteract the effects of certain medicines, so talk with your healthcare provider before taking one if you’re on a prescription medication.How do laxatives work?Laxatives cause changes in your digestive system that make it easier for you to poop. Some work by making your stool softer so it’s easier to pass. Others stimulate the muscles in your colon to move the stool along. Some types do both. It all depends on the type you use.AdvertisementWhat are the types of laxatives?Most laxatives are available without a prescription. Although they work differently to relieve constipation, they’re generally used to treat occasional or short-term constipation. Taking them for long periods can cause side effects (sometimes, serious ones) and even worsen your constipation.You may need a prescription laxative if over-the-counter options aren’t working or if you have a chronic (long-term) condition that causes constipation.Bulk-forming laxatives (fiber supplements)These laxatives “bulk” up your stool or make it bigger. They add an ingredient to your poop called soluble fiber. Soluble fiber draws water from your body into your stool, making it bigger and softer. The size increase stimulates your colon to contract and push the stool out.These laxatives are generally considered the gentlest. They’re least likely to cause side effects and often the best laxative to try first — unless your provider recommends a different type.Bulk-forming laxatives include:Fybogel.Psyllium (Metamucil®).Polycarbophil (FiberCon®).Methylcellulose (Citrucel®).Osmotic laxativesOsmotic laxatives pull water from other body parts and send it to your colon. As the water collects, it softens your stool so it’s easier to pass. Saline laxatives are a type of osmotic laxative. They contain salt that holds water in your colon.Osmotic laxatives include:Polyethylene glycol (Gavilax®, MiraLAX®).Magnesium hydroxide solution (Dulcolax®, Ex-Lax®, Phillips’® Milk of Magnesia).Glycerin (Colace Glycerin®, Fleet Pedia-Lax®).Stool softener laxativesStool softeners are also called emollient laxatives. They increase the water and fat your poop absorbs, softening it.Stool softeners include docusate (Colace®).Lubricant laxativesLubricant laxatives coat your colon, making it slick. The coating prevents your colon from absorbing water from your stool, so it stays soft. It also makes for a slippery passage that makes pooping easier.Lubricant laxatives include mineral oil.Stimulant laxativesStimulant laxatives activate the nerves that control the muscles in your colon. They force your colon into motion so it moves your stool along. You may need a stimulant laxative if other over-the-counter types haven’t helped.Stimulant laxatives include:Bisacodyl (Dulcolax®).Senna (Fletcher’s® Laxative).Prescription-only laxativesYou may need a prescription laxative if you have chronic constipation, including constipation associated with a condition like irritable bowel syndrome (IBS). You may need a prescription if you’re taking opioids, which can cause constipation.Prescription laxatives that treat chronic constipation include:Lactulose (Duphalac®).Linaclotide (Linzess®).Lubiprostone (Amitiza®).Prucalopride (Prudac®, Motegrity®).Plecanatide (Trulance®).Lactulose (Cephulac®, Kristalose®).Lactitol (Pizensy™).Prescription laxatives that treat opioid-induced constipation include:Methylnaltrexone (Relistor®).Naloxegol (Movantik®).Naldemedine (Symproic®).How should I take a laxative?Take laxatives exactly as the instructions say, so they work correctly, while also reducing your risk of side effects. For example, you’ll need to take some types of laxatives during certain times of the day or only at night. Some laxatives need to be taken with food or drink, while others need to be taken alone. Some you shouldn’t take with other types of medicine.Most importantly, don’t take more of a laxative than the instructions (or your provider) say. It can be tempting to overdo it, especially when you’re looking for fast relief. But it’s possible to overdose on laxatives, even over-the-counter ones. Be patient if the laxative you’re using isn’t working. Reach out to a provider instead.Laxatives come in different forms, including:Pills: Some laxatives come in capsule or tablet form that you take by mouth.Powders: Some laxatives come in powder form that you can mix in water or other liquids and drink.Liquids or syrups: Some laxatives are liquids you can measure out and drink.Suppositories: Some laxatives are inside tiny dissolvable capsules you insert directly into your anus (butthole).Enemas: Some laxatives are inside small squeezable tubes. You inject the medicine into your anus by squeezing the tube.AdvertisementHow long does it take for laxatives to work?It depends on the type of laxative and how you take it. For example, the laxatives that will help you poop fastest (within minutes or hours) are enemas and suppositories that inject the medicine directly into your anus. But there are tradeoffs. These types have a greater risk of side effects, like diarrhea and stomach cramps.Gentler types of laxatives, like bulk-forming laxatives, are less likely to cause side effects, but it may take a few days (instead of a few minutes) for them to help you poop.Type of laxativeHow long it takes to help you poopEnemas and suppositories15 minutes to one hour.LubricantsSix to eight hours.StimulantsSix to 12 hours.Stool softeners12 hours to three days.Bulk-forming laxatives12 hours to three days.Osmotic laxativesOne to three days (saline types act quicker, from 30 minutes to six hours).Type of laxativeType of laxativeEnemas and suppositoriesHow long it takes to help you poop15 minutes to one hour.LubricantsHow long it takes to help you poopSix to eight hours.StimulantsHow long it takes to help you poopSix to 12 hours.Stool softenersHow long it takes to help you poop12 hours to three days.Bulk-forming laxativesHow long it takes to help you poop12 hours to three days.Osmotic laxativesHow long it takes to help you poopOne to three days (saline types act quicker, from 30 minutes to six hours).How long do laxatives last?Bulk-forming laxatives leave your body with your poop. Other types gradually break down in your digestive system. Timing depends on how much medicine you’re taking and its ingredients. A pharmacist can give you an idea of the timeline based on the type of laxative and the dose.How long will I poop after taking a laxative?Some people hesitate to take laxatives because they worry that once they start pooping, they may have trouble stopping. The thought can be just as concerning as constipation. Read the label on the medication. If you take it as directed, you should poop within the timeframe indicated.If you’ve tried a laxative that isn’t working, or if you’re experiencing side effects (like severe diarrhea), contact a provider.What are the side effects or complications of taking laxatives?Following the instructions on the medicine can prevent side effects. For example, laxatives that pull water from your body to soften your stools, like bulk-forming laxatives and osmotics, can cause dehydration. This is why the instructions say to supplement by drinking more liquid. Taking stimulant laxatives for longer than directed can cause you to lose muscle tone in your colon. This can prevent your colon from helping you poop, worsening constipation. It’s essential not to overdo it.If you’re taking a laxative, don’t skip reading the label to learn about potential side effects.General side effects include:Bloating and passing gas.Stomach cramps.Stomach upset.Dehydration (symptoms include feeling weak and having darker-than-normal pee).Overuse can lead to complications that sometimes require a visit to your provider or even the ER. These include:Electrolyte imbalance (imbalance of water and salt in your body).Chronic constipation.Blockage in your intestine.Severe diarrhea.One of the biggest downsides to taking laxatives is that it can delay your diagnosis if you have a condition causing constipation. Laxatives treat constipation symptoms, but they don’t treat the cause. Usually, the cause is easy to fix, like getting more fiber or drinking more water. But if you have a condition causing constipation, laxatives can mask the problem.This is why it’s essential to contact a healthcare provider if you try a laxative and it doesn’t work or if you find you’re frequently getting constipated.When should I contact my healthcare provider?Contact your provider if you’re having trouble pooping or if you’re uncertain about whether taking a laxative is safe for you. Reach out if you’ve tried one type of laxative, but it hasn’t helped. They may advise you to try a different kind of laxative, or they may recommend you come in so they can check for conditions that cause constipation.If nothing is working, don’t wait it out. It’s better to contact your healthcare provider to get the guidance (and relief) you need.A note from Cleveland ClinicLaxatives aren’t the first option you should try to relieve constipation, but they’re a good “plan B” if lifestyle changes haven’t done the trick. Moving stool naturally is always the best option. Eating high-fiber foods and getting plenty of water usually gets things moving. Exercise can sometimes help, too. If nothing’s working, a gentle laxative may do the trick. Read and follow the instructions closely. This increases your chances of experiencing relief — without the unpleasant side effects. If all else fails, contact your healthcare provider.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/10/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"