"Lead Extraction: Procedure, Recovery & What It Is800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Lead ExtractionAdvertisementAdvertisementAdvertisementLead ExtractionLeads are insulated wires that run from the heart to a pacemaker or implantable cardioverter-defibrillator (ICD). If there’s an infection or malfunction, it’s necessary to remove them. Extraction is a complicated procedure because it requires navigating tough scar tissue that holds leads in place.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is lead extraction?A lead extraction is the removal of one or more leads from inside your heart. (This procedure can’t remove leads placed outside of the heart during open-heart surgery.)After the initial device implant procedure, scar tissue forms, securing the lead in place. This tissue builds up over time, causing the lead to need more energy to function than the device can deliver. Healthcare providers call this an “exit block.”Scar tissue buildup also makes leads challenging to remove. Special instruments and the skills of an experienced cardiac provider are necessary to free the lead without damaging the blood vessel.What is a lead?A lead is a special wire surrounded by insulation that delivers energy from a pacemaker or implantable cardioverter-defibrillator to your heart. These devices are for people who have or are at risk for abnormal heart rhythms (arrhythmias). They help maintain a steady heart rhythm.How does a lead work?Depending on the device, there may be up to three leads. They extend along the inside of a vein from the pacemaker or implantable cardioverter-defibrillator (ICD) to the right side of your heart.When the device detects an arrhythmia, it releases a burst of energy that travels along the leads to your heart. This resets the heart to a normal rhythm.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy would I need a lead extraction?The most common reason for lead extraction is device infection usually spreading to the lead from an infection of the blood (bacteremia). Heart valves may also become infected (infective endocarditis). In both cases, your healthcare provider will remove the device and leads.Additional reasons for lead extraction include:Arrhythmia triggered by a lead.Blood clots or scar tissue disrupts blood flow through the vein.The inside or outside of the lead breaks.The lead malfunctions or the manufacturer recalls it.Too much scar tissue accumulates at the tip of the lead (exit block), affecting device performance.Procedure DetailsHow is a lead extraction performed?The subclavian approach is the most common. Your healthcare provider extracts the leads through an incision in your subclavian vein, under the collarbone (clavicle).The other approach is through an incision in the groin next to the femoral artery. Healthcare providers use this approach when the subclavian approach is not possible.AdvertisementWhat happens during a lead extraction procedure?Here’s what to expect:You undergo general anesthesia, which puts you to sleep and temporarily blocks sensation.Your healthcare provider places a special sheath (tube) in your vein and advances it to the lead. Your provider covers the lead with the sheath.A healthcare provider uses real-time imaging (fluoroscopy) to guide the sheath.Instruments at the sheath tip break up scar tissue, freeing a small section of the lead.The healthcare provider advances the sheath to the next portion of the lead that’s still in place.When the lead is free of scar tissue, the healthcare provider removes it along with the sheath.They close the incision and cover it with a bandage.What happens during laser lead extraction?Your provider can also use a laser device that’s attached to the tip of the sheath. Laser energy creates heat that vaporizes scar tissue.AdvertisementWill I receive new leads?Sometimes your provider will implant new leads during the extraction procedure, sometimes later. It depends on the reason for lead removal. If there is an infection, it’s essential to get rid of it before implanting new leads.Care at Cleveland ClinicGet Heart SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of lead extraction?The benefits of lead extraction depend on why you need the procedure. Extracting leads may result in:Fully functioning pacemaker or ICD if the lead had been malfunctioning or fractured.Improved pacemaker or ICD efficiency if there was an exit block.Relief from arrhythmias if they are due to interactions with the lead.Restored blood flow if blood clots or scar tissue from the lead was causing a blockage.Are there risks to having a lead extraction?As with any invasive procedure, there are risks. These include:Anesthesia complications.Breaking the lead.Major bleed requiring a blood transfusion.Perforating the heart with the lead tip.Tearing a blood vessel.Blood leaking around the heart.Recovery and OutlookHow long will I stay in the hospital?Patients typically need to stay in the hospital overnight, but sometimes longer. You may need to:Lie down: If your provider removed leads through your femoral artery, you need to lay flat for several hours after the procedure.Wait for your next procedure: If your device and leads are not replaced at the time of the extraction, you may stay in the hospital until your provider can perform the implantation.Take antibiotics: If lead extraction is due to an infection, you will likely receive antibiotics after the procedure.Undergo an X-ray: The morning after extraction, a chest X-ray checks the position of any newly implanted leads.When to Call the DoctorWhen should I contact my healthcare provider after a lead extraction?Call your healthcare provider if you experience:Difficulty breathing.Fever greater than 101°F.Swelling at the incision site or in your fingers or toes.Unusual bleeding or drainage.A note from Cleveland ClinicLead extraction is a procedure to remove heart device leads. You may need this procedure if the leads become infected, broken or defective. Lead extraction is a complex procedure due to scar tissue that holds the leads in place. For the best results, seek treatment from an experienced healthcare provider.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/12/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Heart SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"