"Left Atrial Appendage Closure (LAA)800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Left Atrial Appendage Closure (LAA)AdvertisementAdvertisementAdvertisementLeft Atrial Appendage Closure (LAA)Left atrial appendage (LAA) closure is a procedure that blocks or closes the opening to your LAA to keep blood clots from leaving there and going into your bloodstream. This prevents strokes in people with atrial fibrillation, but without blood thinners. This appendage in one of your heart’s upper chambers doesn’t have a function.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is left atrial appendage closure?Left atrial appendage closure is a surgical or minimally invasive procedure to seal off your left atrial appendage (LAA), a small sac in the muscle wall of your left atrium (top left chamber of your heart). Removing it or closing it off can reduce your risk of stroke and eliminate the need to take blood-thinning medication.Studies have shown that, among people with atrial fibrillation who don’t have valve disease, most of the blood clots that happen in the left atrium start in the LAA.It’s unclear what function, if any, the left atrial appendage performs. Your heart can continue to do its job with a closed left atrial appendage.Normal hearts contract with each heartbeat, and the blood in your left atrium and LAA is squeezed out of your left atrium into your left ventricle (bottom left chamber of the heart).In someone who has atrial fibrillation, the electrical impulses that control the heartbeat don’t travel in an orderly way through your heart. Instead, many impulses begin at the same time and spread through the atria. The fast and chaotic impulses don’t give your atria time to contract and/or effectively squeeze blood into your ventricles.Because the left atrial appendage is a little pouch, blood collects there and can form clots in the LAA and atria. When your heart pumps out blood clots, they can cause a stroke. People with atrial fibrillation are three to five times more likely to have a stroke than the general population.Types of left atrial appendage closure devicesDevices that block the left atrial appendage’s opening to keep blood clots that form in your LAA from going into your bloodstream: WATCHMAN™, Amulet™, WaveCrest™.Devices that clamp the base of the LAA to close it off: Disclosure: Cleveland Clinic has the potential to receive a royalty payment as a result of the sale of this clip.Devices that use a band or suture loop to close off your LAA: Lariat™, Sierra™.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs to have left atrial appendage closure?If you’re at risk of developing blood clots in your left atrium/left atrial appendage, your healthcare provider may recommend a procedure to seal off your LAA. This is an alternative to taking a blood thinner like warfarin (Coumadin® or Jantoven®) to reduce your risk of stroke from atrial fibrillation.Many people have concerns about, or dislike, taking warfarin. Some of the reasons for this are:Frequent blood draws are needed to measure your international normalized ratio (INR), or clotting time. The tests are needed to make sure you’re taking the right amount of medication.You need to limit certain foods you eat that contain vitamin K.The risk of bleeding is higher while taking warfarin.Some people don’t tolerate warfarin or have trouble maintaining a normal clotting time.Other medications — dabigatran and rivaroxaban — are available for people with atrial fibrillation who don’t have heart valve disease. However, some people have concerns and problems with these medications, such as:People who can’t take anticoagulants can’t tolerate these medications.Some people are concerned about the cost of the medication.These medications also increase the risk of bleeding.What does left atrial appendage closure treat?LAA closure reduces the stroke risk associated with atrial fibrillation. But, it doesn’t treat the AFib itself. Left atrial appendage closure can benefit people who need heart surgery and also have atrial fibrillation. The procedure is also helpful for those who have atrial fibrillation (but no other problems that require heart surgery) and choose to have a Maze procedure for atrial fibrillation.AdvertisementHow common are left atrial appendage closure procedures?Researchers who looked at more than 10,000 cardiac surgery records found that 37% of people had a left atrial appendage closure during their surgery.More than 150,000 people have received the WATCHMAN device that blocks the left atrial appendage’s opening.Procedure DetailsWhat happens before left atrial appendage closure?You’ll get a transesophageal echocardiogram (TEE) or cardiac CT. This gives your healthcare provider dimensions of your left atrial appendage. This is important because left atrial appendages vary from person to person. Researchers have compared the left atrial appendages’ shape to a chicken wing, cactus, windsock or cauliflower.Your provider may also do three-dimensional printing to help choose the correct device and the right size device.You’ll receive anesthesia of some type, depending on which procedure you’re having.AdvertisementWhat happens during left atrial appendage closure?During surgery for coronary artery disease or valve disease, your healthcare provider can remove your left atrial appendage and sew the area closed. They may staple it closed instead. This is a surgical left atrial appendage closure.In a minimally invasive approach, they can use a catheter to insert a special device to close or block your left atrial appendage. These devices may act as a plug in your left atrial appendage’s opening to your left atrium. Other devices tie or clamp your left atrial appendage closed.For a device your provider uses a catheter to implant:Your provider will insert a catheter (carrying the device) into a vein near your groin.They advance it to your right atrium and make a hole between your left and right atrium.The catheter goes through that hole and to your left atrial appendage.They put the device into your left atrial appendage to cover its opening. This seals off the left atrial appendage and keeps it from releasing clots.They remove the catheter.Fluoroscopy (video from X-rays), transesophageal echo (TEE) or intracardiac ultrasound (ICE) can help guide your provider.What happens after left atrial appendage closure?After your surgery or minimally invasive procedure, you may:Stay in the hospital overnight after the procedure (or longer after surgery).Have a transesophageal echo (TEE) within 48 hours of your procedure.Risks / BenefitsWhat are the advantages of left atrial appendage closure?People who get a left atrial appendage closure can:Reduce their risk of stroke.Stop taking blood thinners.Have the procedure done during heart surgery for another issue.Have a minimally invasive procedure for a left atrial appendage closure device.Can left atrial appendage removal prevent strokes?While there’s no surefire way to prevent strokes, removing or blocking your left atrial appendage reduces your risk significantly. This is because 90% of strokes that start in an upper heart chamber start in your LAA. People who have left atrial appendage closure devices have a lower risk of strokes as well, according to device studies.What are the risks or complications of left atrial appendage closure?Complications of LAA closure may include:A problem with the device itself.A reaction to anesthesia.Bleeding.Chest pain.Cardiac arrest.Abnormal heart rhythm.Infection.Pericardial effusion.Recovery and OutlookWhat is the recovery time?If you had your LAA closure as part of a heart surgery for another issue, your recovery afterward will vary depending on which other surgery you had.If you had a minimally invasive procedure using a catheter to put in a left atrial appendage closure device, your recovery will be quicker. With a minimally invasive treatment, you may be able to go home the next day.After getting a device, you’ll need to take warfarin and aspirin for 45 days. This is how long it takes your body’s tissue to form around the device so there aren’t any gaps around it. Then you’ll stop taking warfarin and switch to clopidogrel and aspirin for six months.You may be on aspirin for the long term.When to Call the DoctorWhen should I see my healthcare provider?You’ll have another transesophageal echo (TEE) at a follow-up appointment 45 days after your procedure. This helps your provider see if your left atrial appendage is completely blocked yet.If the transesophageal echo (TEE) shows that your left atrial appendage isn’t blocked, you’ll keep taking warfarin and have another TEE and follow-up appointment after six months.Once your left atrial appendage is blocked, you’ll have an annual follow-up appointment with your provider.You may also need an echocardiogram (echo) within 60 days of your procedure.You should contact your provider if you have:Fever or other signs of infection.Abnormal heart rhythms.Chest pain.A note from Cleveland ClinicDeciding on a left atrial appendage closure is a personal decision. After talking with your healthcare provider and discussing your options, you can make an informed decision. The procedure isn’t right for everyone. But if you have atrial fibrillation, it’s an option you can consider. Be sure to ask your provider any questions you have about the procedure. If you have a left atrial appendage closure procedure, keep taking your medicines until your provider tells you to stop. Follow-up appointments are important, too. These ensure you’re healing and your device is fitting well.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/24/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"