"What is Life Support? Life Support Measures800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Life SupportAdvertisementAdvertisementAdvertisementLife SupportLife support techniques can keep you alive until your body is functioning again. Life support replaces or supports a failing organ. Life support procedures include mechanical breathing (ventilation), CPR, tube feeding, dialysis and more. The decision to start, decline or stop life support is deeply personal.ContentsArrow DownOverviewProcedure DetailsAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsAdditional Common QuestionsOverviewWhat is life support?Life support refers to a variety of medical procedures that aim to keep you alive until your body is ready to take over again. Life support replaces or supports a body function that’s failing. Your healthcare providers may use life support until your body can resume normal functioning. Life support doesn't mean death. But sometimes your body never regains the ability to function without it.When making choices about specific forms of life support, gather the facts you need to make informed decisions. In particular, understand the benefit as well as the burden the treatment will offer you or your loved ones.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhen should life support be started?Your healthcare providers will start life support as soon as your body needs it. But they won't start life support if:You ask them not to.You’ve left written legal documents declining treatment.Your family members decline life support on your behalf.There’s no medical benefit to starting life support. Some treatments may be beneficial if they relieve suffering, restore functioning or enhance your quality of life. But the same treatment may be a burden if it causes pain or prolongs the dying process. Your decision to decline life support is deeply personal.When should life support be stopped?You can be on life support for an extended period of time. Your healthcare providers will let you or your loved ones know if continuing on life support is worthwhile. There are times when your body may not recover full functionality, but providers recommend continued support (like dialysis and tube feeds) because there’s a chance you can have a meaningful recovery. Other times, your provider may recommend ending life support if there is little chance for a meaningful recovery.Stopping treatment is a deeply personal decision. It's legally and ethically OK to end medical treatments that aren't beneficial anymore. You and your loved ones need to remember: it's the underlying disease — not the act of withdrawing treatment — that causes death.AdvertisementProcedure DetailsWhat are the different types of life support?When you think of life support, you may think of a machine or ventilator. While mechanical ventilation is one type, life support means any medical procedure that keeps your body running for you. There are several types of life support.Mechanical ventilationMechanical ventilation is used to support or replace the function of your lungs. A breathing machine called a ventilator (or respirator) forces air into your lungs. The ventilator is attached to a tube inserted through your mouth or nose and down into your airway (trachea). This is called intubation.Mechanical ventilation is often used to help you through a short-term problem. It's also used for prolonged periods in which irreversible breathing (respiratory) failure exists. This may be due to a spinal cord injury or a progressive neurological disease.If your loved one is dying, mechanical ventilation may only extend the dying process until another body system fails. It can supply air, but it can’t improve the underlying condition.Extracorporeal membrane oxygenationExtracorporeal membrane oxygenation (ECMO) is similar to mechanical ventilation. But breathing machines can only move air into your lungs. They can’t directly add oxygen to your blood or remove carbon dioxide from your blood. ECMO can directly exchange oxygen and carbon dioxide in place of your lungs.The ECMO process continuously pumps your blood out of your body. It sends your blood through a series of devices that add oxygen and remove carbon dioxide. Your blood is then pumped back into your body.Cardiopulmonary resuscitationCardiopulmonary resuscitation (CPR) is a group of treatments used when your heart and/or breathing stops. CPR is used in an attempt to support your body and restart your heart and breathing. Electric shocks (defibrillation), chest compressions and medications are used to support circulation and attempt to restart your heart.When used quickly in response to a sudden event like a heart attack or drowning, CPR can be life-saving. But the success rate is extremely low for people who are at the end of a terminal disease process. Critically ill patients who receive CPR often have a small chance of making a meaningful recovery and leaving the hospital.Automated external defibrillatorAn automated external defibrillator (AED) is a portable medical device that can be used to treat certain forms of cardiac arrest. Cardiac arrest can occur when your heart’s rhythm doesn't support a pulse or circulation.An AED analyzes your heart’s rhythm to determine if it’s beating too fast or irregularly. The AED delivers an electrical shock (defibrillation) that can help your heart get back to a normal rhythm.Artificial nutrition and hydrationArtificial nutrition and hydration (tube feeding) replaces or supplements ordinary eating and drinking. It involves providing a chemically balanced mix of nutrients and fluids through a tube placed either through your nose into your stomach or directly into your stomach itself. In some cases, when the normal function of your GI tract is altered, nutrition can be given intravenously — this is called total parenteral nutrition or TPN.Artificial nutrition and hydration can save your life when used until your body heals. Long-term use of tube feeding may be necessary if you have irreversible and end-stage conditions. Often, the treatment will not reverse the course of the disease itself or improve your quality of life.Kidney dialysisDialysis is used to replace the function of injured or non-functioning kidneys. It involves using a special machine to filter harmful wastes and excess fluid from your blood. This restores the blood to a normal, healthy balance.Dialysis isn't a cure for kidney failure and doesn’t affect the underlying function of your kidneys. If your kidneys don’t work and you stop dialysis, your kidneys will continue to fail. You can't live without at least one functioning kidney.For many people, the burdens of dialysis are outweighed by the improvement in quality of life that they experience. But for some people, the opposite is true and the burdens of dialysis outweigh the benefits, especially if they have a terminal condition in addition to kidney failure.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdditional Common QuestionsWhat is Basic Life Support?Basic Life Support (BLS) is the care you may receive during an emergency. First responders and healthcare providers may perform CPR and other techniques if you’re experiencing:Cardiac arrest.Respiratory distress.An obstructed airway.Anyone can learn these life-saving skills and earn basic life support certification. BLS training can help you improve health outcomes and provide the best possible care.AdvertisementWhat is Advanced Life Support?Advanced Life Support (ALS) is a set of life-saving skills that go beyond BLS techniques. ALS focuses on the importance of constant, high-quality CPR, in addition to more advanced skills. Your healthcare provider may perform ALS during cardiac emergencies. Only healthcare providers who’ve undergone more extensive training should perform ALS.Pediatric Advanced Life Support (PALS) includes life-saving techniques for babies and children. The techniques are similar to those used for adults. But because children are generally smaller than adults, special care is needed when treating them.A note from Cleveland ClinicLife support may help you or a loved one during a medical emergency or a long-term illness. Life support can be beneficial and support your body until it's ready to get back into action. However, sometimes life support prolongs the process of dying. It’s important to discuss your options with your healthcare providers and family members. Starting, declining and stopping life support are all deeply personal decisions.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/20/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementQuestions 216.444.2538Appointments & LocationsRequest an AppointmentFind a Primary Care ProviderFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"