"LifeVest for Sudden Cardiac Arrest800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/LifeVestAdvertisementAdvertisementAdvertisementLifeVestA LifeVest is a wearable defibrillator that can stop an abnormal heart rhythm without anyone’s help. People at risk of sudden cardiac arrest wear it while waiting for a more permanent solution. They wear it under their clothes and remove it only for bathing. This device has a high success rate for protecting people from dangerous heart rhythms.ContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a cardiac LifeVest?The LifeVest™ is a personal defibrillator children and adults can wear if they’re at risk for sudden cardiac arrest (SCA). It monitors your heart all the time. If a life-threatening arrhythmia starts, your LifeVest delivers a shock treatment to restore your heart to a normal rhythm.A LifeVest cardiac device consists of a garment and a monitor you wear all the time except in the shower or bathtub. You wear the lightweight fabric vest under your clothes. Electrodes inside the device pick up your electrocardiogram (EKG). You wear the monitor around your waist (like a fanny pack) or from a shoulder strap. The monitor is about the size of a paperback book.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat does a cardiac LifeVest do?The LifeVest monitor reads your electrocardiogram (EKG) continuously. If you have ventricular tachycardia (rapid heartbeat) or ventricular fibrillation (rapid, uncontrolled, ineffective heartbeat), the device sounds an alarm to verify that you’re not responsive.If you’re conscious, you have less than one minute to respond to the alarms by pressing two buttons to stop the treatment.If you don’t respond to the alarms, the device warns bystanders that you’re about to receive a shock. This warns them not to touch you so they avoid getting hurt.If the arrhythmia continues and you still don’t respond, you’ll get a treatment shock through the garment electrodes. When you’re unconscious, you won’t feel the shock from the LifeVest cardiac device.After the shock, if your heartbeat returns to normal, the alarms stop and the LifeVest returns to its normal monitoring mode.However, if your heartbeat doesn’t return to normal and the arrhythmia continues, the treatment cycle repeats. You can get up to five treatment shocks.How is the LifeVest different from an automated external defibrillator (AED)?An AED requires someone nearby to witness your arrhythmia event (such as ventricular fibrillation). They need to operate an AED and give you the treatment. In order to be effective, you need the shock within a few minutes after your abnormal heart rhythm happens. Your chances of survival drop about 10% for each minute after fibrillation starts, so a bystander must act quickly.With the LifeVest, you don’t need a bystander to help you. The device continuously monitors your EKG. If a lethal arrhythmia happens, the LifeVest delivers a treatment shock typically within one minute. The LifeVest cardiac device protects you even when you’re alone or sleeping. An AED can’t.AdvertisementHow is the LifeVest different from an implantable cardioverter defibrillator (ICD)?The ICD and the LifeVest provide continuous protection. Your healthcare provider places an ICD under your skin and in your veins, but you wear the LifeVest cardiac device under your clothes. It needs to fit well to have contact with your skin.What is a cardiac LifeVest used for?The LifeVest can provide protection from sudden cardiac arrest for people who are waiting:For an implantable cardioverter defibrillator (ICD).For a heart transplant.To see if their condition doesn’t improve and they need an ICD.To get another ICD after an infection or an ICD malfunction.LifeVest is an option for people who:Aren’t candidates for an ICD.Have had a heart attack and have reduced left ventricular ejection fraction.Will have or had bypass surgery or stent placement.Have cardiomyopathy.Have heart failure.AdvertisementWhat ejection fraction requires a LifeVest?You may need a LifeVest if your ejection fraction (how well your left ventricle can pump) is less than or equal to 35%. A normal ejection fraction ranges from 55% to 70%.How common are LifeVests?Tens of thousands of people are using LifeVest. The cardiac LifeVest received FDA approval in 2001.How long can you live with a LifeVest?People have worn a LifeVest for as long as about seven years. However, many people wear them for a few weeks or a few months.Risks / BenefitsWhat are the advantages of a LifeVest?Advantages of a LifeVest include:Protecting you from sudden cardiac arrest while you wear it.Not needing help from anyone nearby.Giving you a short-term solution until you get an ICD.Keeping EKG recordings for your healthcare provider.What are the risks or complications of a LifeVest?Risks or disadvantages of a cardiac LifeVest include:It doesn’t work if you don’t wear it.You need to be ready to respond to alarms at any time.You can’t wear it while bathing.You need to change the battery every day.People near you risk injuring themselves if they touch you while you’re receiving a shock.Recovery and OutlookWhat is the success rate of the LifeVest?Researchers found the LifeVest had a 99% success rate for treating ventricular tachycardia/ventricular fibrillation occurrence. It usually took only one shock to correct an abnormal rhythm.When to Call the DoctorWhen should I see my healthcare provider?Contact your provider when:You awaken after receiving a shock from your LifeVest.You have questions about your LifeVest.Your LifeVest isn’t working normally or fitting right.A note from Cleveland ClinicIf you’re at risk for sudden cardiac arrest, you may get peace of mind from having a wearable defibrillator. It’s important to understand how it works and how to care for your LifeVest cardiac device. Your family also needs to understand how it works. If you have questions about your LifeVest, don’t hesitate to ask your healthcare provider. They want you to be confident in knowing how to use it.Care at Cleveland ClinicArrhythmia TreatmentsFind a Doctor and SpecialistsMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/19/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicArrhythmia TreatmentsFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"