"Living Donor Liver Transplant: Requirements, Risks & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Living Donor Liver TransplantAdvertisementAdvertisementAdvertisementLiving Donor Liver TransplantA living donor liver transplant is a life-saving operation that allows a healthy volunteer to help someone they care about. You can take a piece of your healthy liver and donate it to someone in need. Both your piece and the transplanted piece will grow back to full size.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewWhat is a living donor liver transplant?Most organ donations for organ transplants come from deceased donors. But the liver is special. The liver is the only organ that can regenerate itself and grow from a small piece back to its full size. That means that a living donor can volunteer to divide their healthy liver and give one piece to someone else in need. After the transplant, both pieces of the donor liver will grow back to full size in six to eight weeks.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho can a living donor liver transplant help?More than 12,000 people each year join the waiting list for a liver transplant. Some have acute liver failure from toxic poisoning or viral hepatitis, with only days to recover. Some are in the end-stage of a long battle with chronic liver disease and cirrhosis. Some have primary liver cancer that can be cured by a liver transplant only if it doesn’t spread first. For all of these people, time is of the essence.The longer they wait for a liver transplant, the sicker they become. If they become too ill to survive the transplant surgery, or if their cancer advances beyond their liver, it will be too late to save them. Each year, more than 1,700 people die waiting for a liver transplant from a deceased donor. If one of them had a living donor, they could bypass the waiting list and schedule their transplant surgery right away.How common are living donor liver transplants?Only 5% of liver transplants in the U.S. currently come from living donors. However, the number is rising. The number of living donor liver transplants performed in 2019 was 30% higher than in 2018. Living donor transplants are much more common in other countries, especially in Asia and Eastern Europe, where the number of deceased donors is very limited.AdvertisementCould I be a living liver donor for someone?As long as you and your liver are in good health, you could be a living donor. But not necessarily for the person you know. For your liver to be a match with a transplant recipient, you have to share a compatible blood type and body size. Your body size determines the size of your liver, and size is important for the liver to work well. When you give part of your liver to another adult, it will grow back to the same size.Children are the exception to this rule. Adults can be living donors for children regardless of liver size, because a child’s body is still growing. Somehow, the liver knows how to grow along with the child’s body. It only takes a “sliver of your liver” — about 15% to 20% — to replace a child’s liver, as long as your blood type is compatible.Procedure DetailsLiving Donor Liver TransplantWhat are the basic requirements to become a living liver donor?When you volunteer to be a candidate, you’ll begin a process of thorough evaluation before you are approved. Your healthcare team will want to ensure:That you are between 18 and 60 years of age. Children and elders are not candidates.That you are in good physical condition for the surgery. Some health conditions may make the surgery unsafe for you, or raise the risk of complications to an unacceptable level.That your liver is in good health. Some people have liver disease without symptoms, and they don’t know it until someone takes a look at their liver. A donor liver needs to be free of disease.That you don’t have a habit or history of substance abuse. Alcohol and drugs affect the health of your liver.That you are in good mental and psychological health. Your team can’t accept your donation if they find that you are mentally or psychologically compromised. They’ll make sure that you fully understand the risks and the commitment involved and that you aren’t under any coercion.That you aren’t gaining financially by donating. It’s illegal to accept money or gifts in exchange for donating a piece of your liver. Your team needs to know that your offer is 100% free and voluntary.AdvertisementWhat are the criteria to donate to a specific person (“directed donation”)?To be a match with a specific liver transplant recipient, you have to have a compatible blood type with theirs. Some blood types can only mix with the same blood type. Some can mix with certain other types, and some can mix with any other type. You can match your blood type with the recipient’s blood type in the chart below:Recipient Blood TypeDonor Blood TypeOOAA or OBB or OABA, B, AB or ORecipient Blood TypeRecipient Blood TypeODonor Blood TypeOADonor Blood TypeA or OBDonor Blood TypeB or OABDonor Blood TypeA, B, AB or OWhen your blood type does not match with your recipient, you can participate in the Liver Paired Exchange program. This program was established to increase the opportunity for potential living liver donors who are approved to be liver donors but cannot donate their liver to their original intended recipient for various reasons. The program involves two incompatible pairs, which become compatible pairs by “swapping.”Can I donate to someone I don’t know?Yes. This is called a “non-directed donation\" Once you have been approved as a living liver donor, the transplant hospital can match you with a stranger on the waiting list. Maybe your liver wasn’t a match for the specific person you were hoping to donate to, but it could help someone else in need. You can donate anonymously, or you can choose to meet your transplant recipient if both parties wish to meet.Who pays for the medical expenses of the living liver donor?Typically, the recipient’s insurance covers them. Medical expenses include all of the pre-transplant evaluation and testing, transplant surgery and follow-up appointments. They don’t include incidental costs, such as travel, childcare or lost wages. The transplant recipient may offer to pay for these expenses. Charities, such as the National Living Donor Assistance Center (NLDAC), may also be able to help.How do I volunteer as a living liver donor candidate?Step 1: Call the transplant office. To begin the evaluation process, call the living donor office at the hospital. A coordinator will speak with you to gather some general information and answer your initial questions. They may give you a form to fill out or may interview you by phone. If they believe you are a candidate, they will arrange for you to continue the evaluation process in person.Step 2: Come to the hospital for medical tests and interviews. The next stage of the process involves several days of evaluations. You’ll take a variety of medical tests and meet with a variety of specialists. Tests may include, but are not limited to:Blood panels, including blood counts, liver function and kidney function tests, and coagulation study.Cardiac tests, such as an EKG and cardiac echo.Imaging tests of your liver, such as CT scan and MRI.Liver biopsy if the transplant provider feels it necessary.You will also consult with a:Social worker.Independent donor advocate.Liver specialist.Transplant surgeon.Anesthesiologist.Psychologist.Step 3: Await the decision of the review teams. A sequence of transplant teams will review the results of your evaluations. First, the donor advocacy team will review the results independently. Their primary concern is your safety as a donor. Based on the results, they will make a recommendation to the liver transplant selection committee. The liver transplant selection committee will make the final decision.What happens before the procedure?Donor preparations: Once you have been approved as a living donor, the transplant team will discuss with you and your recipient to schedule your surgery. This will give you and your recipient time to prepare. You can expect to stay in the hospital for a week after the surgery. Recovery time at home may take four to six weeks. You may need to take time off from work or arrange for help with childcare or household responsibilities.Surgical preparations: Your surgical team will also prepare in advance for the surgery by thoroughly image-mapping your liver. They will take a comprehensive series of images, including 3-D images, and analyze them to determine the best surgical approach. They’ll consider the size, where the blood vessels lie, how much of the liver your recipient needs and which section of the liver they should remove.How much of my liver can they safely remove?Up to two-thirds of your liver can be safely removed, as long as the tissue is healthy and able to regenerate. If you’re donating to an adult, your surgeon will typically take your left lobe (one-third of your total liver) or right lobe (two-thirds of your liver). If you’re donating to an adolescent, your surgeon will typically select your left lobe. For a child, your left lateral segment (15% to 20% of your liver) is sufficient.What happens during a living donor liver transplant?You and your recipient — whether you know each other or not — will have surgery at the same time. While one team works on your partial hepatectomy, another will perform a total hepatectomy on your recipient to prepare for the new transplant. Your operation will be shorter — about four to six hours. If circumstances allow, you may also be able to have your operation by minimally-invasive laparoscopic surgery.You’ll be asleep for the procedure under general anesthesia. If you’re having open surgery, your surgeon will make one long incision of 6 to 12 inches to open your abdominal cavity and access your liver. If you’re having laparoscopic surgery, your surgeon will perform the operation through three to four “keyhole” incisions about a half-inch long. They’ll use the first keyhole to install a tiny video camera called a laparoscope.Your surgeon will select the section of your liver that they have predetermined to remove. They will carefully separate it from the blood vessels and bile ducts. After removing the donor piece, your liver donation will be transported to your recipient. After closing your incision, they will finish your operation. The anesthesiologist usually wakes you up in the operating room.What happens after the procedure?You’ll spend the first night in intensive care under close observation for any signs of complications. When your condition is stable, you’ll transfer to a recovery wing for the rest of your stay. You’ll have a variety of tubes still installed in your body from the surgery, including:IV lines in your arm or neck to give you fluids and medications.Tubes in your stomach and your abdominal cavity to drain fluids.A catheter in your bladder to drain urine.Over the next several days, these tubes will be removed and you’ll begin to practice moving around. Your bowels will begin to move again and you’ll slowly return to eating solid foods. You’ll wean from your IV pain medication and transfer to an oral prescription to take home with you.You’ll have follow-up checkups with your surgeon after the surgery at:One week.One month.Three months.One year.Two years.Care at Cleveland ClinicLiver Transplant SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages to the recipient of having a living donor liver transplant?They won’t die waiting for a deceased donor liver.They can have surgery sooner, before they become sicker.Living donor livers tend to be healthier than deceased donor livers.One less person on the waiting list means one more person also gets a liver.What are the possible risks or complications of living liver donor surgery?Any surgery performed under general anesthesia comes with certain general risks, including:Bleeding.Infection.Blood clots.Nerve damage.Paralytic ileus and constipation.Hernia at the incision site.Additional risks associated with liver surgery include:Damage to the bile ducts, causing bile leakage or bile duct scarring.A build-up of fluid in the abdominal cavity (ascites).Post-operative pneumonia.Post-operative fatigue.Failure of the donated liver.Does donating part of your liver shorten your life?Under normal circumstances, you don’t lose anything by donating a part of your liver. Your liver grows back to its normal size in a matter of weeks. The energy resources it uses to do this won’t shorten your life. The surgery itself is relatively safe, but there is always a small risk of complications or death. The risk of death to living liver donors is 1 in 500.What other potential disadvantages should living liver donor candidates consider?A long recovery period with lost paid time off or lost wages.Some amount of pain and discomfort, despite medication.Anxiety and turmoil about the outcome of the surgery.You won’t be allowed to drive for three to four weeks.A lifelong scar (or several smaller scars).The possibility that the transplant may fail.Recovery and OutlookWhat is the recovery time for a living liver donor?Full recovery takes an average of three to six months, depending on your age and general health. If you have laparoscopic surgery, your recovery time will be shorter and your wounds will heal faster.How successful are living donor liver transplants?The success rate for living donor liver transplants is around 90%, which is slightly higher than the rate for liver transplants overall (85%). Success means the recipient’s body accepted the liver, the liver was functional, both liver pieces regenerated to full size and both parties recovered from the surgery.A note from Cleveland ClinicIf you’re considering becoming a living liver donor, you have a weighty decision before you with many variables to consider. It’s important to take as much time as you need to absorb all the information you’ll be presented with and to process all of the feelings involved. Make sure you fully understand the procedure, its potential risks and side effects, and the recovery process involved. Feel free to consult your transplant team with any additional questions and concerns as they arise. They’re here to help you make an informed and confident decision. Your team is entirely on your side, whatever you decide.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/15/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicLiver Transplant SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"