"Lobectomy: Procedure Details & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/LobectomyAdvertisementAdvertisementAdvertisementLobectomyA lobectomy is an operation to remove a lobe of your lung. Most often, surgeons do a lobectomy procedure for people with lung cancer. This can cure cancer that’s in an early stage, but may be less effective for larger tumors. It takes at least a month to recover from a lobectomy. A minimally invasive lobectomy can provide a faster recovery.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a lobectomy?A lobectomy is the surgical removal of a section (lobe) of your lung. Your right lung has three lobes. The left lung has two.When is a lobectomy performed?A lobectomy is the most common surgery for treating non-small cell lung cancer in its early stages. Depending on several factors — including size and location of tumors as well as lymph node status — surgeons may also consider removing smaller sections of your lung.A lobectomy isn’t just for lung cancer. You may need a lobectomy procedure if you have:Lung abnormalities present at birth.Damage to your lung from infection or radiation.Tumors that have spread from other sites in your body to your lungs.Bleeding from lung damage.Is minimally invasive lung removal possible?Yes. Surgeons use minimally invasive techniques for the majority of lung resections. There are two types of minimally invasive lobectomy procedures:Video-assisted thoracoscopic surgery (VATS).Robot-assisted thoracoscopic surgery (RATS).In both types, surgeons operate using tools they put between your ribs through small incisions in your chest. With this technique, providers don’t break or spread your ribs. The more invasive alternative involves making a large incision and spreading your ribs apart to reach your lung.Candidates for a minimally invasive lobectomy include people who have:Stage I to III non-small cell lung cancer.Carcinoid tumor of the lung.Stage I small cell lung cancer.Localized damage to the lung from infection involving a single lobe with chronic infection.Traditional thoracotomy remains an effective technique for more complicated lung resections.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before a lobectomy procedure?If you have lung cancer, your provider will order more tests to find out if cancer cells have spread from one or both lungs to other parts of your body. This is staging, and it helps your provider plan your treatment.Before lobectomy surgery, you’ll have pre-surgical tests, which may include:A complete physical exam.Chest X-ray.Computed tomography (CT) scan.Positron emission tomography (PET) scan.Breathing tests, such as a pulmonary function test.Quantitative perfusion scan.Bronchoscopy/endobronchial ultrasound guided biopsy.Transthoracic needle biopsy.Blood tests.Electrocardiogram or cardiac stress test.CT scan or magnetic resonance imaging (MRI) of your head.A cardiologist may evaluate you if you’ve had heart issues. Also, you’ll meet with an anesthesiologist who will discuss pain control during and after your surgery.Avoiding the use of tobacco products before surgery can make you less likely to have surgical complications.A provider will tell you in advance what time to stop eating and drinking the night before your surgery.What happens during a lobectomy?During your lobectomy surgery, you’ll be asleep and won’t feel any pain.A tube in your throat will manage your breathing.You’ll have an IV in your arm so you can receive medicine through it.Your surgeon will follow these lobectomy procedure steps:Make an incision on the side of your chest between your ribs. (For a VATS or RATS lobectomy, make two to three 1-inch incisions and one 2-inch incision in your chest to provide access to your chest cavity without spreading your ribs.)Place a thoracoscope (small video camera) and surgical instruments through the incisions. Your provider performs the surgery using the magnified image of your lung on screens in the operating room.Perform a wedge biopsy of the lesion if you didn’t get a diagnosis preoperatively. If they confirm cancer then or prior to the surgery, they then remove the lobe by dividing the branches of the blood vessels and airway going into that portion of your lung while preserving the vessels and airway to your remaining lung.Remove the specimen using a specialized bag to pull the tissue through one of the small incisions.Check to be sure that they’ve removed enough tissue around the tumor to be sure they got it all (surgical margins).Sample the lymph nodes in your chest to evaluate for microscopic cancer spread.Check to make sure that nothing is bleeding.Rinse out your chest cavity.Close your incisions.AdvertisementWhat happens after a lobectomy?After your lobectomy procedure, a provider will stop the medicine keeping you asleep. When you’re awake enough, they’ll remove your breathing tube in the operating room. At this time, you’ll go to a recovery area where your family can visit you. You’ll receive a pain medicine pump so that you can give yourself pain medicine within the limits your providers determined.The majority of people go directly to a regular hospital room after recovery. But some people may go to an intensive care room after surgery.You’ll have one or two drains in your chest to remove extra fluid and air from around your lung. A provider will remove the drains based on their output.Your healthcare providers will encourage you to cough regularly, which requires good pain control. During your hospital stay, your providers will keep an eye on your monitor for irregular heartbeats. You’ll also receive shots in your abdomen to prevent blood clots in your legs while you’re in bed. Your providers will encourage you to walk with assistance the day after surgery.Care at Cleveland ClinicLung Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of a lobectomy?Lobectomy surgery offers the best chance of a cure for people with early-stage lung cancer. Surgical outcomes of a minimally invasive lobectomy are comparable to traditional lobectomy outcomes.AdvertisementIs a lobectomy major surgery?Yes, a lobectomy is a major surgery. Some side effects can be serious. Your lungs are close to your heart, and your surgeon has to be very careful not to injure any parts of your heart or nearby blood vessels.What are the side effects of a lobectomy?Possible risks and side effects of lobectomy surgery may include:Bleeding that requires your surgeon to open your chest (thoracotomy) or transfuse blood.A persistent air leak (longer than seven days) from your lung.Blood clots in your legs.Irregular heartbeat called atrial fibrillation.Nerve injury that can affect diaphragm or voice function.Subcutaneous emphysema (air or gas in tissues under your skin).Infection.Will a lobectomy cause shortness of breath?Yes, it can when you exert yourself if you also have bronchitis or emphysema. If you don’t have other lung issues, you aren’t as likely to have limiting shortness of breath after a lobectomy.Is lobectomy dangerous?Yes, rarely. About 1% of people who have lung surgery die 30 days afterward. In most cases, a respiratory complication is the cause. These risks are lower in some healthcare facilities than others. This is why it’s important to choose a facility that performs a lot of lobectomies.Recovery and OutlookWhat is the recovery time?With the less invasive VATS or RATS lobectomy, your hospital stay is typically two to three days. Recovery overall tends to be faster due to diminished pain with VATS or RATS when compared to traditional thoracotomy. This translates into a faster return to work and regular activities.Lobectomy recovery after an open-chest surgery typically requires four to five days in the hospital.When you go home after VATS or RATS, you’ll have a one-week supply of narcotic pain medication. Most people don’t require a refill. When you leave the hospital, you should be functionally independent. This means you can care for yourself and don’t require someone to live with you. However, providers prefer that you have easy access to someone who can help you, as needed, to enhance your recovery.You may receive temporary supplemental oxygen after your hospital stay. The majority of people will need this temporarily while they recover from surgery.When can I drive or go back to work?Following a VATS or RATS, you can return to driving after stopping narcotic pain medications. You should see your provider seven to 10 days after discharge before you start driving. In general, you may be able to return to work without required lifting around two weeks from discharge. You should take four weeks to recover for jobs that require lifting or after a thoracotomy.Can lobectomy cure lung cancer?Yes, a lobectomy can cure cancer in people with stage I to III non-small cell lung cancer.What is the life expectancy after a lobectomy?Long-term survival after a lobectomy depends on the ultimate stage of the tumor determined in the surgical pathology report. Notably, your provider considers you cured of your cancer if you have no evidence of disease five years later.When to Call the DoctorWhen should I see my healthcare provider?You’ll have a follow-up appointment seven to 21 days after your surgery. Your provider can discuss the results of your cancer and lymph node analysis with you at that time. You’ll have a chest X-ray and your surgeon will assess your wounds and your recovery. Also, they’ll give you more guidelines about your activities, return to work and diet.Depending on your stage, your provider may refer you to a medical oncologist for further therapy. Regardless of your stage, you’ll have a survivorship plan that will include surveillance CT scans over the five years following your surgery.A note from Cleveland ClinicA lung cancer diagnosis can bring uncertainty and emotional stress, but a lobectomy is a trusted treatment. Ask questions if there’s anything you don’t understand about your operation. This is a major surgery, so give yourself time to recover. Make a plan for friends and family to help you with grocery shopping or housework while you recover. Also, you can cook meals and freeze them so they’re ready to reheat with little effort during your recovery. Be sure to let your provider know if you notice signs of depression.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/16/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicLung Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"