"Lung Volume Reduction Surgery (LVRS)800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Lung Volume Reduction Surgery (LVRS)AdvertisementAdvertisementAdvertisementLung Volume Reduction Surgery (LVRS)Lung volume reduction surgery (LVRS) is a surgical procedure performed to remove diseased, emphysematous lung tissue. The surgery has been shown to help improve breathing ability, lung capacity and overall quality of life in selected patients.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewWhat is lung volume reduction surgery?Lung volume reduction surgery (LVRS) is a surgical procedure to remove diseased, emphysematous lung tissue. This procedure reduces the size of an over-inflated lung and allows the expansion (growth) of the remaining, often more functional lung.Lung volume reduction surgery is used for some patients with severe emphysema, a common type of chronic obstructive pulmonary disease (COPD), disabling dyspnea (shortness of breath, difficulty breathing), and evidence of severe air trapping (air is “trapped” in the lung and cannot get out because of the emphysema or other lung disease).Emphysema is an ongoing and progressive disease caused largely by cigarette smoking. The disease damages the lungs and makes breathing difficult.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho is a candidate for lung volume reduction surgery?Lung volume reduction surgery has been shown to help improve breathing ability, lung capacity, and overall quality of life in selected patients. The effectiveness of this surgery depends on the location or extent of the diseased tissue, as well as the patient's exercise tolerance and ability to tolerate surgery.Lung volume reduction surgery may be an appropriate treatment for select patients who meet established criteria. The results of the National Emphysema Treatment Trial (NETT) study, first published in 2003, identified four sub-groups of patients who had different risks and benefits from LVRS:Group 1: Mostly upper lobe emphysema and low exercise capacity. These patients are more likely to live longer and are more likely to function better after LVRS than after medical treatment. This patient group may receive the most benefit from LVRS, as compared with the other patient groups.Group 2: Mostly upper lobe emphysema and high exercise capacity. These patients are more likely to function better after LVRS than after medical treatment.Group 3: Diffuse emphysema and low exercise capacity. These patients have similar survival rates and function after LVRS as after medical treatment.Group 4: Diffuse emphysema and high exercise capacity. These patients have worse survival rates after LVRS than after medical treatment, and do not appear to benefit from surgery.Patients who fall into Group 1 are the best candidates for LVRS. Your thoracic surgeon and pulmonologist (doctor who specializes in treatment of the lung and respiratory tract) will discuss your treatment options to determine the best treatment for you.Procedure DetailsWhat tests are needed to determine if lung volume reduction surgery is needed?Your physician can determine if LVRS is an appropriate treatment for you by performing the following tests:Chest x-rayPulmonary function testsArterial blood gas (to measure levels of carbon dioxide and oxygen in the blood)Electrocardiogram (EKG)High-resolution computed tomography scanOxygen titrationSix-minute walkCardiopulmonary exercise testRight heart catheterization (only if additional tests are required)Cardiac stress testPulmonologist consultationAdvertisementHow is lung volume reduction surgery completed?The goal of LVRS is to remove up to 30 percent of each lung, making the lungs smaller and allowing them to function better. Lung volume reduction surgery can be performed by either a sternotomy or with a minimally invasive technique called thoracoscopy. Your surgeon will carefully evaluate you to determine the safest surgical approach to treat your medical condition.Sternotomy: The median sternotomy involves cutting through the breastbone to open the chest. Both lungs (a bilateral approach) are reduced at the same time in this procedure.Thoracoscopy: A minimally-invasive technique, the thoracoscopy requires 3 to 5 small incisions made on both sides of the chest, between the ribs. A videoscope is inserted through one of the incisions to allow the surgeon to see the lungs. A stapler and grasper are inserted in the other incisions and are used to remove the most damaged areas of the lung. The stapler is used to reseal the remaining lung.Thoracoscopy can be used to operate on either one (unilateral) or both lungs (bilateral) and allows the surgeon to assess and resect (cut out) any part of the lungs.Care at Cleveland ClinicEmphysema TreatmentFind a Doctor and SpecialistMake an AppointmentRisks / BenefitsWhat are the benefits and risks of lung volume reduction surgery?The National Emphysema Treatment Trial (NETT)'s results confirm that LVRS is beneficial for patients who have predominant upper lobe disease and low exercise capacity, as compared with medical treatment.While effective for some patients, there are risks involved with lung reduction surgery, including:Air leakage (occurring when air leaks from the lung tissue, coming from the suture line into the chest cavity)Pneumonia or infectionStrokeBleedingHeart attackDeath (due to worsening of one of the above complications)AdvertisementAre there alternatives to surgery for lung volume reduction?Approaches are currently being investigated that use endobronchial valves to perform lung volume reduction without the need for incisions. These valves are placed in the inside of the lung through a bronchoscopy. During a bronchoscopy, a long, thin tube called a bronchoscope is passed through the nose or mouth and down the airway as far as necessary. A small camera sends the images to a television monitor.Recovery and OutlookHow long will I be in the hospital after lung reduction surgery?You should expect to stay in the hospital for 5 to 10 days after lung reduction surgery. Pulmonary rehabilitation usually begins within the first 4 to 6 weeks after surgery, and is a very important part of your recovery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/17/2019.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicEmphysema TreatmentFind a Doctor and SpecialistMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6503Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"