"Lung Resection Surgery: Procedure, Details and Recovery 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Lung ResectionAdvertisementAdvertisementAdvertisementLung ResectionLung resection is a type of surgery used to diagnose and treat lung disorders. Surgeons remove part or all of your lung. Providers perform lung resection through open surgery, video-assisted surgery or robotic-assisted surgery. Though recovery can take weeks or months, most people can return to a full range of activities after this time.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewLung resection removes a portion or all of a damaged or diseased lung.What is a lung resection?A lung resection, also called a pulmonary resection, is surgery to remove part or all of your lung.Surgeons may perform a lung resection either with minimally invasive surgery or open surgery (thoracotomy). Today, most lung resections are performed by minimally invasive techniques that use one to four 1-inch incisions on the side of your body, a video camera and specialized instruments — including a surgical robot to remove portions of your lung. The entry is between your ribs so your ribs are not broken for the procedure. Less commonly, surgeons use a thoracotomy incision (3.5 inches or 8 centimeters) under your shoulder blade, and your ribs are spread to gain access to the chest.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs to have a lung resection?Healthcare providers perform a lung resection when your lung has been damaged or diseased, such as with lung cancer or lung disease. Surgery isn’t possible for everyone with lung cancer, however. You also may have a lung resection if your provider needs to diagnose lung disease.What are the parts of your lung?You have two lungs, one on either side of your chest. Your right lung has three lobes:Upper lobe.Middle lobe.Lower lobe.Your left lung is a little smaller to make room for your heart. It has two lobes:Upper lobe.Lower lobe.Each of your lungs has a tube called a bronchus that connects your lung to your trachea (windpipe).Blood flows from your heart into your lungs through the pulmonary artery and then returns to the heart by the pulmonary veins.What are the types of lung resection?There are five types of lung resection:Wedge resection: Removal of a wedge-shaped section of diseased or damaged lung tissue.Segmentectomy: Removal of one to four portions of a lobe of the lung while preserving the remaining portion.Lobectomy: Removal of one lobe of your lung.Bilobectomy: Removal of two lobes of the right lung while preserving the remaining lobes.Pneumectomy: Surgeons remove your entire lung.What are the types of lobectomy?Providers remove one lung lobe in a regular lobectomy. Other types of lobectomy include:Sleeve resection: Surgeons remove one lobe. They also remove part of the main bronchus from your lung. They then reattach the end of the main bronchus to the bronchus of a healthy lobe.Arterioplasty: During removal of the lobe, your surgeon removes a portion of the main feeding artery to your lung. This requires temporary blockage of blood flow to the lung so that your surgeon can remove a portion of the artery and sew in a patch to replace it.AdvertisementWhy is a lung resection done?A lung resection lets surgeons remove part of your lung that is damaged or diseased. In other cases, providers may use a lung resection to diagnose lung conditions. They take part of your lung to examine the tissue more closely to understand the cause of a lung problem.What does a lung resection treat?A lung resection treats:Lung Cancer.Metastatic tumor to the lungs from other sites.Benign lung tumors.Damaged lung tissue, such as bronchiectasis, emphysema, abscess and trauma.AdvertisementWhat does a lung resection diagnose?Healthcare providers may use a lung resection to obtain tissue samples. These samples can help them to diagnose:Cancer, either from the lung or spread to the lung.Lung infection, such as tuberculosis.Pulmonary nodules (abnormal growths).Inflammatory diseases of the lung, such as pulmonary fibrosis.Procedure DetailsWhat happens before a lung resection?Before a lung resection, your provider will ask about your health history. Your hospital will give you specific instructions, including how long before your surgery to stop eating and drinking. If you smoke, you should stop smoking as far before your surgery as possible.To check your health before your procedure, you also may need:Blood tests.Breathing tests (pulmonary function tests).Chest X-ray.CT (computed tomography) scan.Heart tests, such as an electrocardiogram or an exercise stress test.Magnetic resonance imaging (MRI).PET (positron emission tomography) scan, which is a nuclear medicine scan.Bronchoscopic assessment of lung lesions and lymph nodes.What happens during a lung resection?During your lung resection, you will get general anesthesia, which will help you sleep. A surgeon can use one of two types of surgery for a lung resection: minimally invasive surgery (thoracoscopic or robotic surgery) or open surgery (thoracotomy).What is thoracoscopic surgery?Thoracoscopic surgery is a minimally invasive approach. Your surgeon may use either of two types of minimally invasive surgery:Video-assisted thoracoscopic surgery (VATS), where your surgeon uses specialized instruments and views images on a screen.Robotic video-assisted thoracoscopic surgery (RVATS), where your surgeon guides robotic instruments with three dimensional video guidance from a separate robot console.Thoracoscopic surgery usually takes about three hours. During this procedure:Your surgeon makes one to four incisions on your side.The surgeon inserts a thoracoscope (tube with a light and small camera) into the chest.The thoracoscope sends images to a monitor, which helps guide your surgeon.Your surgeon inserts specialized instruments through the incisions to remove tissue.What is a thoracotomy?A thoracotomy usually takes three to six hours. During this procedure, your surgeon:Makes an incision in your chest and spreads your ribs apart.Performs planned lung resection.Closes the incision.What happens after a lung resection?After a lung resection, your surgeon will insert tubes into your chest. This helps drain excess fluid. It also lets excess air escape to relieve pressure in your chest so that you can breathe well while your lung heals. Most people will keep the chest tubes for 48 to 72 hours after their surgery. In some circumstances, tubes must remain in longer.The length of your hospital stay will depend on the type of lung resection you have and how well you’re recovering. On average, people spend about two to three days in the hospital after a lung resection.You may feel short of breath after your surgery. Your healthcare providers may teach you coughing or deep breathing exercises to help keep your lungs clear. You may need to be discharged temporarily with supplemental oxygen to speed your recovery.Care at Cleveland ClinicLung Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of a VATS or RVATS lung resection?People who have VATS or RVATS instead of thoracotomy tend to have:Less pain.Fewer complications.Shorter recovery time.Faster return to all activities.What are the risks or complications of a lung resection?Because lung resections are major surgical procedures, risks and complications may occur. Complications may include:Air leak.Arrhythmia (irregular heartbeat).Bronchopleural fistula (an abnormal passageway between large airways of your lungs and spaces between membranes lining your lungs).Hemothorax (chest cavity bleeding).Infections, including pneumonia.Pulmonary embolism (blood clots in your legs that travel to your lungs).Reactions to anesthesia.Challenges with pain management due to intolerance to routine pain medications.Recovery and OutlookWhat is the recovery time after a lung resection?Your recovery after a lung resection can take anywhere from weeks to months. How fast you recover depends on:Type of your resection.Your overall health.Whether you had open or minimally invasive surgery.Other medical conditions you have.When can I go back to work or school, drive or eat?If you have a thoracotomy, you will generally need to limit your activity for one month. Usually, people who have VATS or RVATS may return to their regular activities in two weeks. Your healthcare provider will offer guidance suitable for your recovery.After a thoracotomy, you can eat your regular diet. Try to drink plenty of fluids to keep your bowel movements regular. If your bowel movements aren’t regular, you can try a fiber supplement. Constipation is common. You may also notice some swelling in your legs. If you notice that this worsens after discharge, contact your surgeon.###When to Call the DoctorWhen should I see my healthcare provider?Talk to your healthcare provider if you have any of these symptoms after your surgery:Blood that soaks through your incision bandage.Coughing up excessive mucus or discolored mucus.Discolored or smelly fluid around the incisions.Fever.Nausea or vomiting.Pain that medication doesn’t help.Call 911 immediately if you:Cough up blood.Have severe breathing trouble.Have sudden chest pain with shortness of breath.Lose consciousness.Additional Common QuestionsCan a lung resection cure cancer?Lung resection is the primary treatment modality for early-stage lung cancer. This means the cancer is present only in the lung.Lung resections are most effective for early-stage non-small cell lung cancers and carcinoid tumors (a type of slow-growing cancer). You may need chemotherapy or radiation after a lung resection to completely treat cancer.A note from Cleveland ClinicLung resection is surgery to remove part or all of a damaged or diseased lung. Providers also use this procedure to help diagnose a lung condition. Surgeons can perform a lung resection through open surgery with a long incision or minimally invasive surgery with smaller incisions depending on your particular needs. Recovery from a lung resection may take weeks or months. Usually, people who can have minimally invasive surgery recover faster.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/06/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicLung Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6503Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"