"Lymphatic Drainage Massage: What it Is, Benefits & How To Do It800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Lymphatic Drainage MassageAdvertisementAdvertisementAdvertisementLymphatic Drainage MassageLymphatic drainage massage, also known as manual lymphatic drainage, relieves swelling that happens when medical treatment or illness blocks your lymphatic system. Lymphatic drainage massage involves gently manipulating specific areas of your body to help lymph move to an area with working lymph vessels.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a lymphatic drainage massage used for?Lymphatic drainage massage, also known as manual lymphatic drainage, is a gentle form of massage used to relieve painful swelling in your arms and legs caused by lymphedema. Lymphedema often affects people recovering from breast cancer surgery.Lymphedema happens when your tissues retain fluid left behind after your cardiovascular system sends blood to your tissues and organs.The remaining fluid is called lymph. Normally, your lymphatic system collects your lymph and returns it to your heart via a network of lymph vessels and lymph nodes. When something disrupts your lymphatic system's process, lymph collects in your arms and legs, making them swell.A massage therapist uses lymphatic drainage massage techniques to move lymph from your tissues to your lymph nodes, which eases the swelling in your tissues.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyDo lymphatic drainage massages work?Healthcare providers are still studying whether lymphatic drainage massages make a difference. Some studies show people age 60 and below benefitted by having lymphatic drainage massages.Procedure DetailsHow are lymphatic drainage massages done?A lymphatic drainage massage is a two-step process:Clearing: This step releases lymphatic fluid in your tissues.Reabsorption: This step moves your lymphatic fluid to your lymph nodes.AdvertisementAre there other ways to remove lymphatic fluid from my tissues?Some people benefit from a mechanical process. In this process, you put a sleeve on the swollen arm or leg. The sleeve is attached to a pneumatic pump that pulsates and helps your lymph to drain from your tissues to your lymph nodes.Care at Cleveland ClinicBreast Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are some conditions that can benefit from lymphatic drainage massage?Lymphatic drainage massages are often used to relieve lymphedema following breast cancer surgery. Other conditions that benefit from lymphatic drainage massages are:Rheumatoid arthritis: This is ongoing arthritis in your joints causing joint pain, swelling and stiffness.Fibromyalgia: This condition causes chronic muscle and joint pain.Chronic venous insufficiency: This happens when your leg veins aren't working effectively, making it hard for your blood to return to your heart from your legs.Lipedema: This happens when excess fat accumulates in your lower body, blocking your lymphatic pathway and causing lymphedema.AdvertisementAre there any risks associated with lymphatic drainage massage?Generally speaking, lymphatic drainage massage is a safe treatment to relieve lymphedema. There are some conditions and circumstances where lymphatic drainage massage is not recommended:You have a heart condition.You have kidney failure.You have blood clots.You have an infection.Talk to your healthcare provider if you’re concerned your physical health might be affected by lymphatic drainage massage.Recovery and OutlookWill lymphatic drainage massages make my lymphedema go away?You might not see immediate results from lymphatic drainage massages. If you have several sessions without result, ask your healthcare provider about alternative treatments.How can I drain my lymphatic system myself?Talk to your healthcare provider about learning lymphatic draining massage techniques. They will have information to help you decide if you would benefit from doing lymphatic draining massage yourself or by working with a trained massage therapist.What happens if I'm feeling sick after a lymphatic drainage massage?Few people have negative reactions to lymphatic drainage massage. Some people, however, complain of headaches, nausea and fatigue. When that happens, you should ask your healthcare provider about managing your side effects.When to Call the DoctorWhen should I see my healthcare provider if I'm doing a lymphatic drainage massage?You should call your provider if your lymphedema appears to be getting worse.A note from Cleveland ClinicLymphedema causes swelling and raises your risk of infection. It's an unfortunate and uncomfortable outcome of some treatments for cancer and other illnesses. Lymphatic drainage massage is one way to relieve your lymphedema symptoms. Ask your healthcare provider if a lymphatic drainage massage might be helpful.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/02/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicBreast Cancer TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"