"Kangaroo Care (Skin to Skin): What It Is & Benefits800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Kangaroo CareAdvertisementAdvertisementAdvertisementKangaroo CareKangaroo care is a method of holding your baby to your chest for skin-to-skin contact. It has many benefits for babies, especially those born early or with low birth weight. Kangaroo care can support your baby’s physical health, help with breastfeeding and nurture the bond between you and your baby.What is kangaroo care?Kangaroo care is a method of holding your baby to your chest. Your baby wears only a diaper and possibly a hat and socks to help stay warm. They rest against your bare chest, allowing for skin-to-skin contact. This type of touch is a special experience that can help you and your baby bond. It also has medical benefits, particularly for babies with a low birth weight or babies born preterm.You can do kangaroo care in the hospital, including in the neonatal intensive care unit (NICU), as well as at home. How long you hold your baby in each session is up to you and varies depending on your situation and your baby’s medical needs. Your baby’s care team can offer specific guidance on how soon after birth to begin kangaroo care and how long each session should be. They’ll also check whether kangaroo care is safe and doable for babies connected to IVs or other medical equipment, and they’ll tell you when kangaroo care isn’t possible.“Kangaroo mother care” is another name for kangaroo care. Most research focuses on the benefits of a mother or birthing parent providing such care. But other caregivers can practice kangaroo care, too. These include fathers, other family members and trained volunteers.How to do kangaroo careYour nurse will help you get started with kangaroo care in the hospital. Each session can vary in length, but researchers generally advise longer sessions for more benefits. For example, one study shows that a two-hour session is more beneficial than a one-hour session when performed at least seven days in a row. Your care team can tell you more about what’s best for your baby.Here are a few basic tips for getting started:Dress comfortably. There are no strict guidelines for what to wear. But you should wear something that you can easily open in front because your baby will rest against your bare chest. You’ll also need to remove your bra if you wear one. You can use a hospital gown that opens in front if you’d like.Place your baby on your chest. Your baby should be in an upright position with their head resting to one side against your chest. Your baby will typically wear only a diaper, hat and socks. The hat and socks help keep your baby warm.Cover your baby. Once you’re settled skin-to-skin, drape a blanket over your baby’s back. Keep your baby warm and comfortable while snuggled against your chest. Your care provider may suggest using a wrap to secure your baby against your chest.Relax together. During your session, try and relax as you hold your baby. Remember to breathe normally. This is a great time to let your baby rest and relax, too. Allow your baby to snuggle in and fall asleep. Avoid playing with your baby or rousing their attention.Plan on multiple sessions. Your care team will tell you the ideal schedule for you and your baby. Ask if anything is unclear or if you have other questions or concerns.What to avoid during kangaroo careTo make kangaroo care safe and comfortable for your baby, you should:Put away phones or other electronic devices. These can distract your focus away from your baby. Focusing on your baby is important for bonding and also for keeping your baby safe as you hold them.Make sure your skin is clean and healthy. Don’t do kangaroo care if you have a rash, open cuts or cold sores. Clean your skin beforehand and don’t apply any perfumes or lotions.Avoid smoking. Don’t smoke before or during kangaroo care. Secondhand smoke poses many health risks for your baby.Avoid doing kangaroo care if you’re sick. Your baby’s immune system doesn’t fully mature until they’re two to three months old. So, in these early weeks, it’s crucial to limit your baby’s exposure to germs. If you’re sick, see if another caregiver can take your place until you’re feeling better. Or ask your healthcare provider if it’s safe for you to do kangaroo care while wearing a facemask.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the benefits of kangaroo care?Kangaroo care has many benefits, particularly for babies born preterm or at low birth weight. Research shows that kangaroo care can help:Stabilize your baby’s heart rate.Improve your baby’s breathing pattern and make their breathing more regular.Support healthy sleep, including more quiet sleep and longer cycles.Encourage your baby’s growth.Relieve pain your baby might feel during certain procedures like a heel prick test.Lower your baby’s risk of hypothermia, serious infections or death (these outcomes relate specifically to babies born in resource-limited nations).Kangaroo care also helps you:Bond with your baby.Establish breastfeeding and increase your milk supply.Feel confident in your ability to care for your baby and respond to their needs.What is the definition of kangaroo care?Kangaroo care generally refers to skin-to-skin contact with your baby soon after birth. Researchers agree that skin-to-skin contact is beneficial for all infants and helps you bond with your new baby. Most research defines and explores kangaroo care as a practice that helps babies born early or with low birth weight. But if your baby doesn’t fall into these categories, they can still benefit from skin-to-skin contact.The World Health Organization (WHO) defines kangaroo care as skin-to-skin contact between a mother and baby along with exclusive breastfeeding. (If the mother or birthing parent isn’t able to do this, another caregiver can step in.) This contact should begin as early as possible after birth and happen for as many hours as possible per day. Ideally, the WHO recommends skin-to-skin contact for eight to 24 hours daily. These recommendations apply to all babies born preterm or with low birth weight.Some healthcare providers use slightly different definitions of kangaroo care. For example, some use the term to refer to skin-to-skin contact without exclusive breastfeeding. Some definitions encourage early discharge from the hospital and follow-ups once you’re home. Definitions also vary in terms of how soon after birth you should begin skin-to-skin contact and how long each session should be.The key takeaway here is that you shouldn’t worry too much about strict definitions. Your exact method of kangaroo care depends on many factors, including your baby’s health, your own health and constraints like time and privacy. Follow your healthcare provider’s guidance in your unique situation.AdvertisementWhat is the history of kangaroo care?Resting your baby against your chest is a natural practice that’s gone on throughout history. But kangaroo care as a named, clinically defined process began in Bogota, Columbia, in the late 1970s. Preterm babies there at this time had a high mortality rate.Two doctors in Bogota — Edgar Rey, MD, and Hector Martinez, MD — went in search of a solution to help the babies they cared for. They found one through a conversation with a village wet nurse. She explained how she bundled newborns up against her chest, and this supported the babies’ health and growth.Drs. Rey and Martinez tried such skin-to-skin positioning with mothers and babies at their hospital. They termed this practice “kangaroo mother care” to describe how bundling your baby against your chest resembles preterm kangaroos crawling inside their mother’s pouch and latching on to a nipple for feeding. The baby kangaroos stay in the pouch for many months until they’re old enough to search for food on their own.The doctors’ efforts in Bogota were very successful, leading to a 70% drop in deaths among preterm babies within the first year.Meanwhile, in the 1970s, researchers in the U.S. were investigating how skin-to-skin contact can help babies and parents. They discovered the minutes and hours immediately after birth are crucial bonding times for parents and their infants.In the decades that followed, researchers have continued to uncover benefits of kangaroo care and its hallmark feature of skin-to-skin contact. For example, they learned that kangaroo care helps babies sleep better and breathe more regularly. It also helps support breastfeeding and healthy parent-infant attachment.Researchers today are looking further into the benefits of kangaroo care and how it can help babies thrive in different settings. In nations with limited access to medical technologies, kangaroo care can be lifesaving. In resource-rich nations, kangaroo care can still play a valuable role in supporting your baby’s health and well-being while also helping the two of you bond.Your baby’s care team can tell you more about kangaroo care and its evolving place in newborn care.A note from Cleveland ClinicThe birth of your baby brings all sorts of questions to mind, as well as countless new challenges. If your baby was born early or has a low birth weight, you may be wondering how to support their health and help them grow. Lean on your baby’s care team for advice tailored to your situation and know that kangaroo care might be one of the recommendations. Your care team will help you learn more about how to do kangaroo care, how long to do it and specific benefits you may see.Full-term babies also benefit from skin-to-skin time as they greet the world and get to know you and your family. If you have questions or concerns at any time, don’t hesitate to reach out to your baby’s care team. They’ll help you navigate these early weeks and months and learn what’s best for your baby’s needs.Care at Cleveland ClinicFind a Pediatric Primary Care ProviderFind a Doctor and SpecialistsSchedule a Pediatric Primary Care AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/11/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Pediatric Primary Care ProviderFind a Doctor and SpecialistsSchedule a Pediatric Primary Care AppointmentAdAdvertisementAdvertisementAdvertisementCall Appointment Center 24/7 866.320.4573Questions 216.444.2200Request an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"