"Kegel Exercises for Men: How & Why To Do Them800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Kegel Exercises for MenAdvertisementAdvertisementAdvertisementKegel Exercises for MenPelvic floor muscles run from your tailbone to pubic bone and support your bladder and bowels. They’re often recommended for people assigned female at birth but can also benefit people assigned male at birth.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsOverviewWhat are Kegel exercises?Kegel exercises are ones designed to tighten up your pelvic floor muscles. These muscles help you control your bladder and bowels. It also helps you with your erections.The pelvic floor muscles, along with other tissues, stretch from your tailbone in the back to your pubic bone in the front. The muscles support your bladder and your bowel. The urethra, which takes urine (pee) out of your body, and your rectum, which allows feces (poop) to move out of your body, pass through the muscles and tissues of the pelvic floor.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy would men do Kegel exercises?People assigned male at birth (AMAB) with certain health and sexual health issues can benefit from doing Kegel exercises. These exercises may help you:Improve urinary or fecal incontinence.Manage prostate pain and swelling that occurs with prostatitis and benign prostatic hyperplasia (BPH).Increase your sexual pleasure through greater control of ejaculation and improved orgasm sensation.Procedure DetailsWhat happens before you can do Kegel exercises?To do Kegel exercises, you have to find the muscles that you need to exercise. There are three muscles you need to find and flex to complete a correct Kegel exercise.One muscle is the bulbocavernosus (BC) muscle that you use to push blood into the penis and to squeeze urine and semen out of your urethra and penis.Another muscle is the pubococcygeus (PC) muscle. This muscle is one that helps you pee and poop and contracts during orgasm. It supports your lower organs.The third muscle is the iliococcygeus muscle (IC), which supports your organs and is involved in moving your anus (butthole) back into place after you poop.The BC muscle is the main one involved in doing Kegel exercises, with the other two muscles doing less of the work. You can find this muscle by stopping your urine stream while you’re peeing.You can try feeling your PC muscle by attempting to draw your penis in toward your body, making it shorter. You may feel like your scrotum is being pulled upward.You can find your IC muscle by making the motion you would use to try to hold in diarrhea or stop yourself from passing gas.AdvertisementWhat happens while you’re doing Kegel exercises?Like any exercise program, you should start with small steps.You can do Kegel exercises anywhere, but you might want to start by lying or sitting on your bed.Squeeze your pelvic floor muscles for about five seconds. To keep from holding your breath, try counting out loud. Then relax for another five seconds.Do this 10 times per session. Try to do three sessions per day. If you get tired, stop.Try to reach the point where you’re holding for 10 seconds and then relaxing for 10 seconds.You shouldn’t feel pain while you’re doing Kegel exercises. If you have pain, you may be doing them incorrectly. At this point, speak to your healthcare provider. They may have suggestions about how you can improve your technique or be able to provide you with a physical therapy program for pelvic floor exercises that may include biofeedback.It’s also important to learn how to relax your pelvic floor muscles to avoid pain and to help with proper muscle functioning.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentRisks / BenefitsWhat are the advantages of Kegel exercises for men?Kegel exercises can help improve your bladder and bowel health, and possibly your sexual performance. These exercises can be helpful for people who are preparing for prostate cancer surgery, too.AdvertisementWhat are the risks or complications of Kegel exercises for men?Kegel exercises shouldn’t cause damage if you learn to relax the muscles, as well as strengthen them. You shouldn’t do Kegel exercises to excess. You also shouldn’t spend too much time trying to stop your urine flow.Don’t do Kegel exercises if you have a urinary catheter in place.How long should it take before you feel a difference from doing these exercises?It may take as long as six weeks to notice improvements from Kegel exercises. You need to make them a permanent part of your routine to continue getting the benefits.A note from Cleveland ClinicMuscles need exercise to stay strong, something that’s also true for the muscles in your pelvic floor. You can speak with your healthcare provider about the correct way to do Kegel exercises for your pelvic floor muscles. These exercises can help you stop leaking urine or feces and may improve your sexual performance and enjoyment. It may seem embarrassing to talk about, but these situations can be improved. It’s worth the effort to make your life more enjoyable.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/22/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"