"Ketogenic Diet For Epilepsy / Seizures800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Ketogenic Diet (Keto Diet) for EpilepsyAdvertisementAdvertisementAdvertisementKetogenic Diet (Keto Diet) for EpilepsyThe ketogenic diet is a way of treating patients with unmanaged epilepsy. The diet —  high in fats and low in carbs —  works by changing how the brain gets energy to function. Although not well understood, this diet has successfully reduced seizures in many patients.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is the ketogenic diet?The ketogenic diet, or keto diet, is a medical or therapeutic diet — a diet designed to help manage or treat a medical condition. The keto diet is suggested for children with epilepsy that continues despite medication.The keto diet is high in fat, adequate in protein and very low in carbohydrates (carbs). A typical keto diet consists of 70% to 80% fats, 20% proteins and 5% to 10% carbohydrates.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat medical conditions may benefit from a keto diet?Doctors typically recommend the keto diet to treat epilepsy in children of all ages, including infants. Ketogenic diets usually are not preferred by adults, because the limited food choices make the diet hard to maintain in long run.The keto diet has been used in other neurological (brain-related) conditions, including Alzheimer’s disease and autism spectrum disorder.People with diabetes or class III obesity also may benefit from the keto diet. The keto diet can be easier to observe than other diabetes diet recommendations, and it can retrain the bodies of people with obesity to start burning fat.What happens in your body when you follow a keto diet?The ketogenic diet resets how your body uses food. Usually, carbohydrates in your diet (like sugars and starches) provide most of the energy. The keto diet lowers the amount of carbs you eat and teaches your body to burn fat for energy instead.AdvertisementProcedure DetailsWhat happens when your child starts a ketogenic diet?Starting the keto diet is not a one-step process. Your child will likely be admitted to the hospital for monitoring when the diet begins. The hospital’s ketogenic diet team may include a neurologist, a registered dietitian and a registered nurse.Your child’s ketogenic team will:First, give your child small amounts of water or sugar-free liquids.Within 24 hours, begin your child’s new diet. For infants, premixed ready-to-use ketogenic formulas may be used.Blood sugar will be monitored closely in the initial 48 hours of starting the diet and hypoglycemia may occur during the initiation of the keto diet.Continually assess needs for supplements like calcium or vitamins.How does the ketogenic diet help epilepsy?The ketogenic diet has been used to reduce seizures since the 1920s. The mechanism by which the seizures are regulated is poorly understood. Both the low sugar component and high fat component uniquely alters the ‘excitability’ of the brain, thereby reducing the tendency to generate seizures.Care at Cleveland ClinicEpilepsy and Seizures TreatmentFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the risks of the ketogenic diet?Despite its success treating seizures, the keto diet is not risk free. Side effects occurring with long-term diet use include:Low bone density and bone fractures.Constipation.High cholesterol.Kidney stones.Slower growth than typical.Sluggishness (tiredness).How will a doctor know when to use the keto diet?Your child’s healthcare provider may suggest the ketogenic diet if other epilepsy treatments have not stopped or reduced seizures. While on the keto diet, your child will visit the provider every month to three months for blood and urine tests.These blood and urine tests check for nutritional or other problems.Recovery and OutlookHow effective is the keto diet for managing seizures?The keto diet has proven effective over time to help epilepsy. About 40% to 50% of children who start the keto diet have 50% fewer seizures. And roughly 10% to 20% of children achieve more than 90% reduction in seizures.Can I do the keto diet on my own?The keto diet needs to be closely monitored by healthcare providers, so you should not try the diet on your own. Speak to your healthcare provider before starting the keto diet.When to Call the DoctorWhen should I call my doctor?You should call your child’s healthcare provider if:Seizures worsen or continue even with the diet.Your child has an allergic reaction to any of the foods in the diet.Additional DetailsHow long can I continue the keto diet for managing epilepsy?Your healthcare provider may stop your child’s keto diet after a few years if the epilepsy is well managed. Ask your healthcare provider whether to continue a ketogenic diet for medical reasons.A note from Cleveland ClinicEpilepsy is challenging to live with for children and parents. About two-thirds of patients with epilepsy can achieve seizure management with the use of the right medications. When epilepsy is drug-resistant, other options like epilepsy surgery and a ketogenic diet should be considered. Talk to your healthcare provider about trying the keto diet if your child has epilepsy.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/06/2020.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicEpilepsy and Seizures TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"