"Kidney & Pancreas Transplant800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Kidney and Pancreas TransplantAdvertisementAdvertisementAdvertisementKidney and Pancreas TransplantCombined transplantation of the kidney and pancreas is performed for those who have kidney failure as a complication of insulin-dependent diabetes mellitus. Kidney and pancreas transplant candidates might be currently on dialysis or might require dialysis in the near future.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsOverviewWhat is a kidney and pancreas transplant?Combined transplantation of the kidney and pancreas is performed for those who have kidney failure as a complication of insulin-dependent diabetes mellitus (also called Type I diabetes). Kidney and pancreas transplant candidates might be currently on dialysis or might require dialysis in the near future.After combined transplantation of the kidney and pancreas, the kidney will be able to filter and excrete wastes so dialysis will not be needed. The transplanted pancreas will produce insulin to manage the diabetes.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAm I a candidate for the double transplant?If you have Type I diabetes and you have kidney failure, or if your doctor thinks that kidney failure is beginning, the double transplant (combined kidney and pancreas) can be considered as a treatment option. Your doctor and transplant surgeon can determine if the double transplant is needed based on your medical condition, your overall health, and the results of a pre-transplant evaluation. A pre-transplant evaluation includes a complete physical, consultations with a transplant coordinator and surgeon, and a series of tests, including heart and bladder evaluations.Where does my new kidney and pancreas come from?Kidneys for transplantation come from two sources: living donors and deceased (non-living) donors. Living donors are usually immediate family members or sometimes spouses. Deceased donor kidneys come from people whose families give permission for organ donation at the time of death. Three out of four kidney transplants are performed with deceased donor kidneys.Combined kidney and pancreas transplants and single pancreas transplants are only performed with deceased donor organs.All donors are carefully screened to prevent any transmissible diseases or other complications. The donor is also carefully evaluated to make sure there is a suitable match to your tissue and blood type.AdvertisementHow long will I have to wait before I receive my transplant?It is impossible to predict how long a wait there will be before a deceased donor kidney and pancreas become available. The average wait is about 24 to 36 months; however, it's possible the wait could be from a few days to many years. Some people might have to wait longer than others for their transplants because their blood and tissue types might be less common, so it takes longer to find a compatible match.Are pancreas transplants performed without kidney transplants?In some circumstances, a pancreas transplant can be performed without a kidney transplant. The pancreas transplant might be performed for patients who have already had a kidney transplant or for patients who do not have kidney failure, but who have complications of Type I diabetes.The rate of pancreas transplant complications is similar to that of a kidney and pancreas transplant, but the chances of long-term success are not as good. However, newer drugs and better tissue-matching procedures can offer a reasonable success rate. Your doctor and transplant surgeon can determine if the pancreas transplant is needed without the kidney transplant, based on your medical condition.AdvertisementProcedure DetailsWhat is the procedure for receiving a deceased donor kidney and pancreas for transplant?After your doctor and transplant surgeon have determined the double transplant is needed, you will be placed on a waiting list to receive a deceased donor kidney and pancreas. Your name and blood test results will be placed on the United Network for Organ Sharing's (UNOS) national list.When a deceased donor kidney and pancreas become available for transplantation, they are given to the best possible match, based on blood type, tissue (HLA) type, cross-match compatibility, and the length of time the recipient has been waiting. If a perfect match (six antigen match) is identified through the national list, the recipient matching the donor will be notified.What happens during the kidney and pancreas transplant surgery?Kidney and pancreas transplantation involves placing a healthy kidney and pancreas into the body where they can perform all of the functions that a failing kidney and pancreas cannot.The new kidney is placed on the lower left side of the abdomen where it is surgically connected to nearby blood vessels. Placing the kidney in this position allows it to be easily connected to blood vessels and the bladder. The vein and artery of the new kidney are attached to your vein and artery. The new kidney's ureter is attached to your bladder to allow urine to pass out of your body.The new pancreas is placed on the lower right side of your abdomen where it is surgically connected to nearby blood vessels. The vein and artery of the new pancreas are attached to your vein and artery.The kidney and pancreas transplant surgery takes from 5 to 7 hours. Transplant patients generally stay in the hospital about 8 to 12 days.Care at Cleveland ClinicKidney Transplant SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat is the success rate of the kidney-pancreas double transplant?After the double transplant is performed, there is an 80 to 85% chance that the patient will require no insulin and no dialysis for one year. In addition, there is a 70% chance that this success will continue over the next five years.What are the benefits of double organ transplantation?A successful kidney and pancreas transplant gives you increased strength, stamina, and energy. After transplantation, you should be able to return to a more normal lifestyle and have more control over your daily living. You can have a normal diet and more normal fluid intake.If you were dependent on dialysis before the transplant, you'll have more freedom because you won't be bound to your dialysis schedule. The pancreas transplant will keep your blood sugar normal. Frequently after transplantation, your blood sugar level before eating will be 90 or less. After a meal, it might reach 140 -- all without insulin. Further complications of diabetes might be delayed with better blood sugar management.What are the risks of double organ transplantation?Since two organs are transplanted, the risk of surgical complications is about twice that of a single organ transplant (such as a kidney-only transplant). Since the pancreas is joined to the bladder during the operation, some loss of fluids occurs. You might need to drink more than usual after the transplant surgery in order to prevent dehydration.There is also a risk of rejection after any type of transplant surgery. Rejection is your body's way of not accepting the new kidney and pancreas. Since your body recognizes the new organs as foreign objects, it will normally try to get rid of them or \"reject\" them. However, you are given medicines to prevent rejection. You will need to take these medicines for life and have your blood work drawn as scheduled to prevent rejection episodes.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/01/2017.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicKidney Transplant SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"