"Kidney Transplant: Surgery, Purpose, Procedure & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Kidney TransplantAdvertisementAdvertisementAdvertisementKidney TransplantA kidney transplant is a procedure where a new donor kidney is placed in your body. This is typically done to treat kidney failure. Once attached, your new kidney will start to do the job of the failing organ. The transplanted kidney is usually placed on either the lower right or left side of your abdomen.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewDuring a kidney transplant, a donor kidney is placed in your lower abdomen. Your own kidneys aren't removed unless they're causing problems.What is a kidney transplant?A kidney transplant is a surgery that involves taking a healthy kidney from a donor and placing it into a person whose kidneys are no longer working properly.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhere does my new kidney come from?Kidneys for transplantation might come from living donors or deceased organ donors. Immediate family members, spouses and friends may qualify for kidney donation. Deceased donor kidneys come from those who have elected to donate their organs upon death.Potential kidney donors are carefully screened to make sure they’re a match. This helps prevent complications.Why are kidney transplants done?Kidney transplants are done to help people with chronic kidney disease or end-stage renal (kidney) failure. When your kidneys can no longer filter waste properly, you’ll need either dialysis (which uses a machine to remove waste from your bloodstream) or a kidney transplant.AdvertisementProcedure DetailsWhat are the kidney transplant requirements?Each hospital has its own criteria for accepting people as kidney transplant recipients. But in general, candidates should have:End-stage renal failure and be on dialysis.Late-stage chronic kidney disease, approaching the need for dialysis.A life expectancy of at least five years.A full understanding of postoperative instructions and care.What is the best age for kidney transplant?While most kidney transplant recipients are between the ages of 45 and 65, there really is no upper age limit. However, to ensure the best results, your healthcare provider will likely look for a donor who is close to your own age.How many kidney transplants can a person have?In some cases, people can have two and even three or four kidney transplants in their lifetime. Your healthcare provider can tell you if this is an option for you.What disqualifies you from getting a kidney transplant?Kidney transplants are approved on a case-by-case basis. However, there are some general factors that could make a person ineligible for a kidney transplant, such as:A serious health condition that makes it dangerous to have surgery.Recurring (returning) infection.A short life expectancy.Drug or alcohol abuse.No matter what your situation, your healthcare provider can determine whether a kidney transplant is a safe treatment option.What happens during a kidney transplant procedure?Kidney transplantation involves placing a healthy kidney into your body, where it can perform all of the functions that a failing kidney cannot.Your new kidney is placed on the lower right or left side of your abdomen where it’s surgically connected to nearby blood vessels. Placing the kidney in this position allows it to be easily connected to blood vessels and your bladder. The vein and artery of your new kidney are attached to your vein and artery. The new kidney's ureter is attached to your bladder to allow urine to pass out of your body.What happens to my old kidneys?In most cases, your surgeon will leave your diseased kidneys inside your body. However, there are three conditions that might require the removal of your old kidneys:Infection that could spread to your new, transplanted kidney.Unmanaged high blood pressure caused by your original kidneys.Reflux or a backup of pee (urine) into your kidneys.How long is kidney transplant surgery?On average, kidney transplant surgery takes two to four hours to complete.AdvertisementWhat happens after a kidney transplant?Most people spend about three days in the hospital after a kidney transplant. This way, your medical team can keep a close eye on you and make sure you’re recovering well.Your new transplanted kidney may start working immediately. Or, you may need dialysis temporarily until it starts working. This might take several days or weeks.You’ll also need to start taking medications to keep your immune system from rejecting your new transplanted kidney.What will my kidney transplant scar look like?Your scar will be about 2 to 5 inches long, on the right or left side of your lower abdomen.How long does a kidney transplant last?How long a kidney transplant lasts can vary from person to person. In general, kidneys donated by a living person last longer than kidneys donated by a deceased person. On average, however, transplanted kidneys last approximately 10 years.Care at Cleveland ClinicKidney Transplant SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of kidney transplant?A successful kidney transplant gives you increased strength, stamina and energy. After transplantation, you should be able to return to a more normal lifestyle and have more control over your daily living. You can have unrestricted diet and fluid intake.If you were dependent on dialysis before the transplant, you'll have more freedom because you won't be bound to your dialysis schedules.Anemia, a common problem with kidney failure, might be corrected after transplantation. If you have hypertension (high blood pressure), you could be on fewer blood pressure medications after transplantation.What are the risks of kidney transplant?The risks of kidney transplantation are the same as those of any surgery. There is the risk of bleeding, infection or breathing problems. You also might experience some side effects from the medications, and you could be more prone to infections since the medicine you will take after transplantation lowers your body's ability to fight infection.Kidney transplant rejectionSince your body recognizes the new kidney as a foreign object, it will normally try to get rid of it or \"reject\" it. However, you’ll be given medicine to prevent rejection.Because of years of experience, research, and improved medicines that prevent rejection, kidney transplants are very successful with few complications after transplantation.Is kidney transplant better than dialysis?While both options have pros and cons, kidney transplant is often the preferred treatment for chronic kidney disease. This is because lifelong dialysis can be taxing. Kidney transplant offers a better quality of life for most people, and studies show that those who have a successful kidney transplant live longer on average compared to those who receive dialysis.Recovery and OutlookWhat is the recovery time after a kidney transplant?On average, kidney transplant recovery time is about six weeks. This timeline is different for everyone, though. It depends on your overall health and other factors.What are some things I can do to take care of myself during recovery?It’s important to closely follow any instructions given by your healthcare provider. Here are some general guidelines:Avoid lifting heavy objects and strenuous physical work for at least six to eight weeks following surgery. It’s important that you don’t lift anything heavier than 20 pounds for two to three months, and nothing heavier than 40 pounds for four to six months from the date of your surgery.Avoid driving for at least six weeks following surgery. Plan ahead so a friend or family member can help out during this time. When you’re in a moving vehicle, always use your seat belt.Exercise. Your provider will recommend beginning with stretching exercises and walking. Other excellent exercises include jogging, hiking, bicycling, tennis, golf, swimming and aerobics. All of these can help you regain your strength and you can start gradually after your incision has healed.Avoid contact sports since they might cause injury to your transplanted kidney. If you have doubts about any activity, talk to your healthcare provider.Are there foods that I should avoid after my kidney transplant?When it comes to the food and drinks you consume, there are a few tips you should follow:Stay hydrated. One of the keys to a successful recovery is staying well-hydrated. You should drink plenty of water — typically 2 liters (about 68 ounces) — per day. It’s also a good idea to limit caffeine. It’s a weak diuretic and contributes to dehydration.Don’t eat raw or undercooked foods. With your weakened immune system, eating raw or undercooked foods — especially undercooked meat or undercooked eggs — at any time after a transplant puts you at risk for severe illness.Get plenty of protein in your diet. Eating a well-balanced diet with a few special dietary considerations is important. Protein is especially helpful because it helps you build muscle and recover lost weight. Your provider or a dietitian can help you figure out how much protein you need. It’s possible to overdo it, but you can usually avoid this issue by avoiding protein supplements.Avoid grapefruit and grapefruit juice. These fruits can cause a strong reaction with medications that suppress your immune system.Don’t take nonsteroidal anti-inflammatory drugs (NSAIDS). Some very common over-the-counter (OTC) drugs, including ibuprofen and naproxen, can cause kidney dysfunction. You may also want to avoid taking antihistamines and antacids. These medications, and other OTC drugs, can sometimes affect other drugs or change absorption. Talk to your healthcare provider about the safety of these medications and possible alternatives you could try.Avoid certain vitamins and herbal supplements. St. John’s wort, Schisandra, and some herbal teas and other natural supplements interact with transplant medications. You should discuss these supplements with your provider before using them to make sure they are safe to use.How long can a person live with a kidney transplant?People can live for many years after receiving a transplanted kidney. On average, a kidney from a living donor lasts about 12 to 20 years, while a kidney from a deceased donor lasts about eight to 12 years. Some people receive more than one kidney transplant in their lifetime.Can you live a normal life with a kidney transplant?Yes. Many people lead healthy, fulfilling lives after their kidney transplant. Currently, the one-year kidney transplant survival rate is 95%. The average three- to five-year survival rate is 90%. This means that 9 in 10 people who receive a transplanted kidney will still be alive five years after their surgery.Survival rates are estimates. They can’t tell you how you’ll respond to treatment or how long you’ll live. To learn more about kidney transplant survival rates, talk to your healthcare provider.When can I go back to work after my kidney transplant?Many kidney transplant patients are able to return to work within a few months following a successful surgery. However, various aspects of the recovery process can affect the timing of your return.You will need to discuss returning to your job with your surgeon. When the time approaches, your provider will give you a “return to work” letter. This will let your employer know when you may begin working and what limitations you have if any.When to Call the DoctorWhen should I contact my healthcare provider?Following your kidney transplant, you’ll see your medical team for regular follow-ups. However, if you experience any of the following symptoms, you should contact your healthcare provider immediately:A fever of 100° F or higher.New pain or tenderness around your kidney.Swelling (edema).Flu-like symptoms including chills, headaches, dizziness or nausea and vomiting.A noticeable decrease in the amount of pee (urine) you produce.A note from Cleveland ClinicIf you have chronic kidney disease or end-stage renal failure, a kidney transplant can eliminate the need for dialysis and give you a new lease on life. Before deciding on treatment, be sure to discuss all of your options with your healthcare provider. You may also want to explore additional resources provided by organizations like the American Kidney Fund, National Kidney Foundation and Transplant Recipients International Organization (TRIO). Staying knowledgeable can empower you and help you make well-informed decisions about your health.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/14/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicKidney Transplant SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"