"Knee Braces: What They Do & How To Wear One800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Knee BraceAdvertisementAdvertisementAdvertisementKnee BraceKnee braces come in lots of types, shapes and sizes. They support your knee and take pressure off your joint.\n\nVisit a healthcare provider if you’re feeling new or worsening knee pain. They’ll diagnose what’s causing it and (if you need one) suggest the right type of brace.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewUnloader braces are the most common brace providers suggest for people with knee arthritis.What is a knee brace?A knee brace is a medical device that stabilizes your knee joint and holds it in place. Healthcare providers use braces to protect and support your knee after an injury or knee surgery. Providers sometimes call knee braces orthoses.What do knee braces treat?Healthcare providers use knee braces to treat common knee injuries, including:Knee sprains.Knee ligament injuries.Patellofemoral pain syndrome (PFPS, or runner’s knee).Patellar (kneecap) instability.Patellar tendinitis or other tendon issues.Patellar dislocations.You might need to wear a knee brace to treat some health conditions that affect your muscles or joints, including:Peripheral neuropathy.Knee arthritis.Conditions that can make your knee joint weak or loose (like joint hypermobility syndrome or Ehlers-Danlos syndrome).Your provider might also suggest you wear a knee brace to prevent sports injuries or to manage knee pain.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat does a knee brace do?A knee brace supports your knee and holds it in place. Knee braces work by keeping your knee in alignment. They’re usually made of stiff plastic or metal with cushions and straps that wrap around your knee and leg.A knee brace helps you avoid stressing your knee joint and keeps it from moving too far or too suddenly. How much resistance and support a brace gives you depends on which type you need.Types of knee bracesThe most common types of knee brace include:Unloader knee braces: Unloader braces get their name from how they support your knee. They help absorb some of your weight and “unload” pressure off your knee to other parts of your leg that are strong enough to bear it. They’re the most common type of brace providers suggest for knee arthritis.Patellofemoral knee braces: Patellofemoral braces protect and support your kneecap (your patella) and the front of your knee.Knee immobilizer braces: These are knee braces you wear while you’re recovering from surgery. They’re usually stiffer and prevent some (or all) movement.Functional knee braces: Like their name sounds, functional braces help you safely use your knee. They let you move your knee, but prevent it from moving too much or too far in one direction. They’re the most common type of brace people wear after a knee injury.Prophylactic braces: Athletes wear these braces to prevent knee injuries. They’re especially popular among people who play contact sports like football or rugby. Ask your healthcare provider if you should wear a prophylactic knee brace before you buy one.Your healthcare provider will tell you where you can get a knee brace and if you’ll need it custom-fitted. Some braces are available over the counter (OTC) or at retail stores. Other types are only available with a prescription.Knee sleevesKnee sleeves are made of tight elastic material that lightly squeezes your knee. They’re not actually braces the way other types on this list are, but they’re the most common type of knee support people wear.How do I put on a knee brace?Most knee braces fit around your knee with stretchy elastic or Velcro® straps. The brace should be snug and secure without being too tight. It shouldn’t hurt or feel like it’s cutting off circulation to your leg.It might feel strange or like the brace is pushing your knee into alignment (especially at first), but it should never hurt or make knee pain worse. Talk to your healthcare provider or physical therapist before wearing a new brace. They’ll help you get used to putting it on, wearing it and moving with it.Care at Cleveland ClinicKnee Pain TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of wearing a knee brace?Knee braces are a quick, easy way to support your knee joint and relieve symptoms like pain and stiffness. They can also help you heal safely and prevent future injuries. Braces are usually easy to put on and adjust. This is especially helpful if you’re experiencing swelling right after an injury.AdvertisementWhat are the risks of wearing a knee brace?Knee braces have very few risks. Some complications can include:Skin irritation.Pressure sores.Nerve compression.There’s always a chance that using a knee brace might not improve your symptoms or prevent an injury. Talk to your provider about what you can expect, and which other treatments might help you manage your symptoms.Recovery and OutlookHow long do I need to wear a knee brace?How long you need to wear a knee brace depends on why you need it in the first place. If you’re recovering from an injury or healing after surgery, your healthcare provider will give you a timeline based on how your recovery goes.Some people need to wear a knee brace when they’re physically active or during sports. Your provider may suggest that you always wear a brace, or they’ll tell you when it’s safe to train, work out or play without one.AdvertisementWhen to Call the DoctorWhen should I call my healthcare provider?Visit your provider if you’re experiencing any of the following symptoms:Severe pain.Swelling that’s getting worse.Discoloration or bruising.Tingling.Numbness.You can’t move your knee or leg.Additional Common QuestionsDo knee braces work?Knee braces definitely help protect and support your knee after surgery or while you’re recovering from an injury. Braces can help you feel safer and more confident. Many people also find that wearing a knee brace helps relieve pain and other symptoms (especially if they have knee arthritis).It’s tougher to say for certain if knee braces can prevent injuries. That’s because there haven’t been studies that can prove for sure that people would’ve gotten hurt if they weren’t wearing a brace. Many people who wear prophylactic knee braces feel safer and more secure, and that extra peace of mind is all they need to stay active or compete.Remember, wearing a knee brace isn’t a good substitute for seeing a healthcare provider. Visit a provider or talk to a physical therapist before buying or wearing a knee brace. They’ll help you choose the right type and make sure it fits your knee properly.A note from Cleveland ClinicKnee braces come in lots of different shapes and sizes. You might even be able to pick your favorite color. No matter why you need one, a knee brace is a common way people support their knees and help themselves safely stay active.Even if you can get a brace over the counter, talk to your healthcare provider or physical therapist before you start using one. They’ll help you understand how to wear and adjust your brace to make sure it works correctly and keeps your knee joint supported.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/15/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicKnee Pain TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2606Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"