"da Vinci Surgery: Treatment & Recovery 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/da Vinci SurgeryAdvertisementAdvertisementAdvertisementda Vinci SurgeryThe da Vinci Surgical System is a tool that helps surgeons perform a variety of surgeries including gynecological surgeries, urological, head and neck, thoracic, colorectal, cardiac and general surgeries. Because the da Vinci only uses small cuts, it’s less traumatic on your body, resulting in less pain, fewer complications and a shorter recovery time.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWARNING: These videos may display graphic, surgical content. Please be advised.What is a da Vinci surgery? What is the da Vinci Surgical System?A da Vinci surgery is when your surgery is performed using the da Vinci Surgical System, a machine that uses four thin robotic arms. The robotic instruments have a wider range of motion than the human hand. Surgeons can use the surgical system for a variety of procedures.The machine is made up of three different parts:The console/control center. Your surgeon operates while seated at a console unit, using hand and foot controls and with a magnified, 3D, high-definition view.The patient cart. The cart holds surgical instruments and the camera.The vision cart. This cart has a video screen so that the healthcare providers in the room can see what’s happening during the surgery.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat’s the difference between a da Vinci surgery and an open surgery?Use of the system makes your surgery “minimally invasive” (smaller incisions). The procedure uses small cuts (less than or equal to 1 centimeter long), tiny surgical instruments, fewer stitches and a laparoscope (a telescope) which is a thin tube with a light and a camera lens. This is different than traditional surgeries that use larger, more invasive cuts through skin, tissues and muscles.What procedures can be performed with a da Vinci surgery?The da Vinci Surgical System is designed to do several types of surgeries. However, not every type is available in every country, or at every hospital. Talk to your healthcare providers about whether or not your surgeon will use this machine. Possible surgeries include:Cardiac (heart) surgeries:Mitral valve repair.Coronary artery bypass.Colorectal surgeries:Crohn’s disease.Colorectal cancer.Diverticulitis.Ulcerative colitis.Abscesses, blockages and ruptures of the large intestine.Rectal prolapse.General surgeries (abdomen and digestive tract):Liver conditions.Stomach conditions.Pancreas conditions.Conditions of the intestines.Gallbladder conditions.Gynecology surgeries:Hysterectomy.Endometriosis.Pelvic pain.Abnormal bleeding.Fibroids.Pelvic organ prolapse.Incontinence procedures.Incompetent Cervix.Cancers.Head and neck surgeries.Cancers.Thoracic (chest) surgeries.Cancers.Urology surgeries:Enlarged prostate.Cancers.Benign tumors.AdvertisementHow common are da Vinci surgeries?Worldwide, there have been over seven million surgeries performed using the da Vinci system.Are da Vinci surgeries available everywhere?No. The da Vinci surgical system is available only in certain countries. Ask your healthcare provider if the surgeons they work with use one.AdvertisementProcedure DetailsHow does the da Vinci surgical system work?For a hysterectomy, which is a procedure that removes the uterus, the surgeon makes four or five small cuts instead of one long incision. The robotic surgical instruments are inserted into the holes and, sitting at the console, the surgeon uses the controls to remove the organ.What kind of healthcare provider performs a da Vinci surgery?Surgeons who use the da Vinci Surgical System go through additional training to learn how to use the machine.How do I prepare for a da Vinci surgery?You prepare for a da Vinci surgery the same way you prepare for an open surgery. Specific preparations depend on the type of surgery you’re getting, so you should ask your healthcare providers about the details.How long does a da Vinci surgery last?This depends on the procedure. On average, da Vinci surgeries tend to last an hour more than an open surgery.Will I be asleep during the da Vinci surgery?Yes. You will be under general anesthesia.Risks / BenefitsWhat are the benefits of a da Vinci surgery?The da Vinci System enables surgeons to perform even the most complex and delicate procedures through very small, precise incisions. Benefits may include:During the procedure:Less blood loss.Less trauma.Smaller cuts.After the procedure:Less pain.Less scarring.Fewer complications.Shorter hospital stays.Shorter recovery time.Quicker return to normal daily activities.Fewer infections.Women who were previously not candidates for laparoscopic myomectomy to remove uterine fibroids now have an option that can preserve their uterus and potentially their fertility.What are the risks/potential complications of a da Vinci surgery?There are always risks with surgery, including reactions to anesthesia and bleeding. There are two disadvantages of the da Vinci surgery:Your surgery will take longer.The surgery may cost you more than a traditional surgery. Talk to your hospital’s billing department about costs.Recovery and OutlookHow effective are da Vinci surgeries?Although they take longer and may cost more, da Vinci surgeries are just as effective as open surgeries.How long will I be in the hospital?How long you’ll be in the hospital depends on the type of surgery you have and your healthcare providers’ recommendations. Studies have shown that if you have a da Vinci surgery, you’re likely to have a shorter hospital stay and may go home on the same day.How long does it take to recover from a da Vinci surgery?Again, this depends on the type of surgery. Talk to your healthcare providers about how long your particular healing process might take.When to Call the DoctorWhen should I see my healthcare provider after a da Vinci surgery?Be sure to attend all follow-up appointments with your healthcare provider. You should also see a healthcare provider if you experience any of the following:Redness, swelling, drainage or tenderness at the incision site. These are signs of infection.A fever of 100.4 degrees Fahrenheit (or higher).Excessive bleeding.When should I go to the emergency department?Don’t hesitate to call 911 or go to the emergency department if you have suspicious symptoms. Remember, no matter what procedure you had, you should always see a healthcare provider right away if you experience:Trouble breathing.Chest pain.Fainting.Uncontrolled bleeding.Pain that gets worse and is not relieved by your pain medication.A note from Cleveland ClinicNot every surgeon uses the da Vinci Surgical System. It’s not available at every hospital or for every type of surgery. However, da Vinci surgeries are becoming more and more popular as more healthcare providers learn about it. Speak with your own healthcare providers about the possibility of replacing an open surgery with a da Vinci surgery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/24/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"