"Defibrillator: Types, Uses and Purpose800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/DefibrillatorAdvertisementAdvertisementAdvertisementDefibrillatorA defibrillator can save your life if you’re in cardiac arrest. This device provides an electrical charge that stops your heart’s abnormal rhythm so your heart can get back to a normal rhythm. Even with defibrillation, cardiac arrest is fatal for many people. It’s not unusual for survivors to require multiple types of therapy to recover.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a defibrillator?A defibrillator is a device that provides an electric shock to your heart to allow it to get out of a potentially fatal abnormal heart rhythm, or arrhythmia, — ventricular tachycardia (with no pulse) or ventricular fibrillation — and back to a normal rhythm. Both of these arrhythmias happen in your heart’s ventricles or lower chambers.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho can use a defibrillator?People who have the above arrhythmias can get help in a hospital or a place that has an automated external defibrillator available. However, if you have a high risk of a life-threatening heart rhythm, you may need your own defibrillator that’s with you all the time.Defibrillators for personal useA shock from a personal defibrillator can be painless or feel as if someone kicked you in the chest.People who are at high risk for a life-threatening heart rhythm may have these defibrillator types:A wearable cardioverter defibrillator you wear like a vest under your clothes. The sensors make contact with your skin, and the device can send a shock after sensing an abnormal rhythm.An implantable cardioverter defibrillator (ICD). Like an internal watchdog for arrhythmias, an ICD can send the right amount of charge when it’s needed. While t’s similar to a pacemaker in its ability to keep the heart beating, a defibrillator has the added ability to provide a shock to the heart when a fatal rhythm is detected.Why is a defibrillator used?While cardiopulmonary resuscitation (CPR) provides temporary assistance, a defibrillator can help you survive sudden cardiac arrest. You can even use a defibrillator if someone already has a pacemaker or implantable cardioverter defibrillator (ICD).AdvertisementProcedure DetailsDemonstrating how to use an AEDHow does a defibrillator work?You should continue giving CPR while waiting for a defibrillator to be ready to use.Before you deliver the shock, make sure no one is touching the person who’s about to receive the shock (or their bed).If you’re using an automated external defibrillator (AED), it can review your heart’s rhythm to decide if it needs a shock. An AED charges itself and provides verbal instructions on how to use it.A first responder or healthcare provider will do the following:Put two defibrillator paddles or sticky pads (connected to the defibrillator) on your chest. One paddle or pad goes below your right shoulder and the other below your left nipple. To prevent burns, conducting material is already in the pads. However, your provider will need to put conducting material on your chest before using paddles.For sticky pads, push a button on the machine to give the shock. For handheld paddles, push the button on each paddle at the same time.A defibrillator makes your heart muscle stop moving briefly so your heart can create an electrical impulse that starts a normal rhythm. In essence, defibrillation restarts your heart.What happens after using a defibrillator?Your first responder or provider will give CPR again for two minutes. Then they’ll check for a pulse and look at whether your heart rhythm is back to normal. If you need it, they’ll give you more CPR and another electrical shock. If defibrillation didn’t work the first time, they’ll also give you medications (epinephrine or amiodarone) to try and correct the abnormal rhythm.If your blood is flowing, but you’re still not responsive, your provider may need to bring your body temperature down to 89.6 to 96.8 degrees Fahrenheit (32 to 36 degrees Celsius) to help protect and promote recovery of your brain function. Once your condition is stable, your provider may do cardiac catheterization.Care at Cleveland ClinicArrhythmia TreatmentsFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the advantages of a defibrillator?A defibrillator can save your life if it’s used for the correct arrhythmia and it’s done within 10 minutes after the abnormal rhythm starts.What are the risks or complications of a defibrillator?A defibrillator needs to be used for ventricular tachycardia (without a pulse) or for ventricular fibrillation. If you use it for any other kind of arrhythmia, it could give someone ventricular fibrillation and cardiac arrest.Recovery and OutlookWhat is the recovery time?After cardiac arrest and defibrillation, recovery is a long-term process that takes months or years. Up to 40% of cardiac arrest survivors have some impairment that doesn’t allow them to go back to work or do regular activities after leaving the hospital. Fatigue may limit your ability to do what you want. It may take time to recover from a rib fracture that happened during CPR and to manage other problems, such as trouble walking or seizures. It’s possible that you’ll need occupational, physical and/or speech therapy.When to Call the DoctorWhen should I see my healthcare provider?If you witness someone collapsing, call 911.After surviving ventricular fibrillation, you have a high risk of experiencing it again. Your provider will treat the cause of your ventricular fibrillation, which may include giving you an ICD. Regular checkups are important to make sure your ICD continues to work properly. After five years or so, you’ll need to get a new ICD battery.A note from Cleveland ClinicIf you have an ICD or someone used a defibrillator to help you, keep taking medicines your healthcare provider prescribed for you. Be sure to see your provider regularly to ensure that your ICD is working correctly. If your provider used a defibrillator for you in an emergency situation, it may take months or years for your body to recover. Physical therapy and other types of therapy can help you rehabilitate, but it’ll take patience and time.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/10/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicArrhythmia TreatmentsFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"