"Deflux: Treatment for Vesicoureteral Reflux800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Deflux: Treatment for Vesicoureteral RefluxAdvertisementAdvertisementAdvertisementDeflux: Treatment for Vesicoureteral RefluxHyaluronic Acid/Dextranome (Deflux®) is an injectable gel used to treat vesicoureteral reflux (VUR). VUR is a condition in which urine backflows into the ureters and kidneys. Deflux is injected into the wall of the bladder where the ureter joins the bladder. The gel forms a bulge that acts like a valve, making it harder for urine to flow backwards.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewDisclaimer: The brand name Deflux® is used for identification purposes only and does not imply any endorsement from Cleveland Clinic.What is Deflux®?Deflux® (hyaluronic acid/dextranome) is a treatment option for vesicoureteral reflux (VUR). Deflux is an injectable gel that is made of two types of sugars and a filler substance. It adds bulk to the tissue where it’s injected.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is vesicoureteral reflux (VUR)?Normally urine flows downward through the structures of the urinary tract – from the kidneys, down through the tube-like structures called the ureters, to the storage organ called the bladder and out of the body through the urethra.Vesicoureteral reflux (VUR) is the backward flow – “reflux” – of urine from the bladder into the ureter(s) and, in some, cases, to one or both kidneys.VUR mostly affects newborns, infants and young children ages two and under, but older children and adults (rarely) can also be affected.VUR is diagnosed with a voiding cystourethrogram (VCUG). During this test, a catheter is inserted into the urethra and contrast dye is injected into the bladder until it's full. The test uses X-rays to get images of the bladder. Pictures of the bladder will be taken before and during the test, as well as during and after urination. This allows doctors to see if the urine flows backward into the ureters.Procedure DetailsHow is Deflux used to treat vesicoureteral reflux?During the Deflux procedure, the gel-like mixture is injected into the wall of the bladder where the ureter joins the bladder. The gel adds bulk – in the form of a bulge – to that area of the bladder wall. This bulge acts like a valve that makes it harder for urine to flow backward toward the kidney. However, urine can still flow forward (as it normally should) into the bladder.AdvertisementWhat happens during a Deflux procedure?This is an outpatient procedure, but your child will be given general anesthesia to go to sleep. Your child’s urologist will use a special tube with a camera on its end, called a cystoscope, to see inside your child’s bladder. During the procedure, the cystoscope is inserted into the urethra and moved up into the bladder. The cystoscope helps guide where to inject the Deflux.How long is the Deflux procedure?The procedure takes about 30 minutes to complete.AdvertisementWhat happens after the Deflux procedure?Your child may be a little drowsy right after the procedure. This will not last long, and your child will be able to go home that day. No incisions are needed.The Deflux gel is slowly broken down by your child’s body. It’s replaced by your child’s own tissue as he or she develops and grows, keeping the ureter tunnel length intact.Your child may need to repeat the VCUG to make sure this procedure was successful.Care at Cleveland ClinicUrology CareMake an AppointmentRisks / BenefitsWhat are the risks of the Deflux procedure?Most of the risks are those related to using a cystoscope. These may include:Bruising and swelling.Bladder damage.Bleeding.Infection.Failure of the procedure.Blockage of the ureter.The biggest risk of the Deflux procedure is that infections continue despite treatment. In these cases, a second or even third injection may be needed.Another possible risk of using Deflux is that the ureter may become blocked due to the bulking effect. This happens in about one out of 33 children who have the procedure.What are the benefits of the Deflux procedure?After the Deflux procedure, your child can go back to his or her normal activities the next day. Less healing time is needed when Deflux is used instead of ureteral reimplant surgery.The Deflux gel itself is very safe and durable. It combines well with the body and slowly dissolves. It has been shown to cause little reaction in nearby tissues. It does not move from where it is injected to other places in the body.How effective is Deflux for treating vesicoureteral reflux?There have been many studies of Deflux for the treatment of VUR. Each study reports a slightly different success rate with this treatment. In general, success rates of between 70% and 93% have been reported.What should I watch for after the Deflux procedure?As a result of the cystoscope being inserted through the urethra, your child may be sore for a day or two after treatment. You might notice some changes in your child. He or she might not want to pee (urinate) or complain of a stinging or soreness when trying to pee.Bladder spasms, which can feel like cramps or a strong urge to go to the bathroom, may occur. If the spasms are severe, your child might not be able to hold urine and might even wet the bed for a few days. You might also notice pink-tinged urine.Your child might not want to drink fluids. These effects will go away in a few days. Try to get your child to drink as much fluid as he or she can.When to Call the DoctorWhen should I call my child’s doctor after the Deflux procedure?Call your child’s urologist after the Deflux procedure if your child:Hasn’t gone to the bathroom to pee in 8 to 10 hours.Has pain when peeing more than two days after the procedure.Refuses to go to the bathroom to pee.Has severe pain in the belly/back/flank.Has a fever higher than 101.5 degrees F (38.6 degrees C).Has worsening bladder spasms that do not decrease within 24 hours.Vomits a lot.Has pain in the back and hips.How do I know if Deflux will work for treating vesicoureteral reflux (VUR) in my child?You and your child’s urologist should review all options for treating VUR, including no treatment (child may grow out of it), long-term antibiotic treatment, ureteral reimplant surgery and the Deflux procedure. The Deflux procedure may be an appropriate option depending on the cause of the VUR and the severity of the abnormality. Working together with your child’s urologist, you’ll review the risks and benefits of all treatment methods and the unique situation of VUR in your own child and decide on the best treatment approach.Protecting your child’s kidneys is important. Kidney infections from ongoing VUR can damage or scar the kidneys, which causes kidney disease, high blood pressure and other health problems.Who is not suitable for treatment with Deflux?Children with any of the following medical conditions shouldn’t be treated with Deflux:Hutch diverticulum.High grade VUR.Ongoing urinary tract infections.Kidneys that don’t function.Ureterocele.Acute voiding dysfunction.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/05/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicUrology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"