"Dental Fillings: Materials, Types, Sensitivity & Allergy Issues800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Dental FillingsAdvertisementAdvertisementAdvertisementDental FillingsWhat are the advantages and disadvantages of dental filling materials? What are indirect fillings? Are silver amalgams safe? Can you be allergic to amalgam fillings? These and other popular questions are answered.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookAdditional DetailsOverviewWhat are dental fillings?Dental fillings are single or combinations of metals, plastics, glass or other materials used to repair or restore teeth. One of the most popular uses of fillings is to “fill” an area of tooth that your dentist has removed due to decay – “a cavity.” Fillings are also used to repair cracked or broken teeth and teeth that have been worn down from misuse (such as from nail-biting or tooth grinding).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat materials are dental fillings made from?Dental filling materials include:Gold.Porcelain.Silver amalgam (contains mercury mixed with silver, tin, zinc, and copper).Tooth-colored, plastic and glass materials called composite resin fillings.The location and extent of the decay, cost of filling material, your insurance coverage and your dentist’s recommendation help determine the type of filling that will best address your needs.Are there advantages and disadvantages to various filling materials?Yes. Advantages and disadvantages of the various dental filling materials are as follows:Advantages:Gold: Lasts at least 10 to 15 years, some say gold presents a pleasing appearance.Silver fillings (amalgams): Lasts at least 10 to 15 years, less expensive than composite fillings.Tooth-colored composite fillings: Shade can be closely matched to color of existing teeth, bonds to existing tooth providing additional support, commonly used for repairs other than cavity filling, sometimes less tooth needs to be removed compared with amalgams.Ceramics/porcelain: Lasts more than 15 years, more resistant to staining than composite resin material.Glass ionomer (acrylic and a specific type of glass material): Mostly used for fillings below the gum line, releases fluoride that can help protect from further tooth decay.Disadvantages:Gold: More expensive than other materials, may require more than one office visit to place.Silver: May require more tooth to be removed to make space large enough to hold filling, creates grayish hue to the surrounding tooth structure, may have higher risk of tooth cracks and fractures due to wider degree of expansion and contraction, allergic potential in some people.Tooth-colored composite fillings: Lasts at least five years (less than the 10 to 15 years of other materials), may chip off tooth depending on location, can cost up to twice as much as amalgams, can take more time to place and/or additional visits.Ceramics: Can cost as much as gold.Glass ionomer: Is weaker than composite resin, more likely to wear and prone to fracture, lasts five years or less, costs comparable to composite fillings.AdvertisementWhat are indirect fillings?Indirect fillings are similar to composite or tooth-colored fillings except that they are made in a dental laboratory and require two visits before being placed. Indirect fillings are considered when you don’t have enough tooth structure remains to support a filling, but your tooth is not so severely damaged that it needs a crown.During the first visit, decay or an old filling is removed. An impression is taken to record the shape of the tooth being repaired and the teeth around it. The impression is sent to a dental laboratory that makes the indirect filling. A temporary filling (described below) is placed to protect the tooth while your restoration is being made. During the second visit, the temporary filling is removed, and the dentist checks the fit of the indirect restoration. If the fit is acceptable, it will be permanently cemented into place.There are two types of indirect fillings – inlays and onlays.Inlays are similar to fillings but the entire work lies within the cusps (bumps) on the chewing surface of the tooth.Onlays are more extensive than inlays, covering one or more cusps. Onlays are sometimes called partial crowns.Inlays and onlays are more durable and last much longer than traditional fillings – up to 30 years. They can be made of tooth-colored composite resin, porcelain or gold. Inlays and onlays weaken the tooth structure, but do so to a much lower extent than traditional fillings.Another type of inlay and onlay – direct inlays and onlays – follow the same processes and procedures as the indirect, the difference is that direct inlays and onlays are made in the dental office and can be placed in one visit. The type of inlay or onlay used depends on how much sound tooth structure remains and cosmetic concerns.What's a temporary filling and why would I need one?You might need a temporary fillings:If more than one appointment is needed for your filling. For example, before placement of gold fillings and for indirect fillings that use composite materials.Following a root canal.To allow your tooth’s nerve to “settle down” if the pulp became irritated.If emergency dental treatment is needed (such as to address a toothache).Temporary fillings are just that; they are not meant to last. They usually fall out, fracture, or wear out within one month. Be sure to keep your appointment to have your temporary filling replaced with a permanent one. If you don’t, your tooth could become infected or you could have other complications.AdvertisementProcedure DetailsWhat steps are involved in filling a tooth?First, your dentist will numb the area around the tooth to be worked on with a local anesthetic. Next, a drill, air abrasion instrument or laser will be used to remove the decayed area. The choice of instrument depends on your dentist's comfort level, training, and investment in the particular piece of equipment as well as location and extent of the decay.Next, your dentist will probe or test the area during the decay removal process to determine if all the decay has been removed. Once the decay has been removed, your dentist will prepare the space for the filling by cleaning the cavity of bacteria and debris. If the decay is near the root, your dentist may first put in a liner made of glass ionomer, composite resin, or other material to protect the nerve. Generally, after the filling is in, your dentist will finish and polish it.Several additional steps are required for tooth-colored fillings and are as follows. After your dentist has removed the decay and cleaned the area, the tooth-colored material is applied in layers. Next, a special light that “cures” or hardens each layer is applied. When the multilayering process is completed, your dentist will shape the composite material to the desired result, trim off any excess material and polish the final restoration.Care at Cleveland ClinicGet Dental CareFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsAre silver amalgam fillings safe?The American Dental Association (ADA), the FDA and numerous public health agencies say that silver (mercury based) amalgam fillings are safe. However, the FDA recently issued updated recommendations about the use of amalgam fillings in certain individuals. They state that the following individuals may be at greater risk for potential harmful health effects of mercury vapors and should avoid getting these fillings whenever possible.People at greater risk include:Pregnant women and their developing fetuses.Women who are planning to become pregnant.Nursing women and their newborns.Children, especially those younger than six years of age.People with pre-existing neurological diseases including Alzheimer's disease, multiple sclerosis or Parkinson’s disease.People with impaired kidney function.People with sensitivity or allergy to mercury or other components of dental amalgam.The FDA does not recommend removing dental amalgam in people at higher risk if the amalgam is in good condition, suggesting that to do so would increase exposure to mercury vapor and result in more risks than benefits.Recovery and OutlookHow should I care for my teeth with fillings?To maintain your fillings, you should follow good oral hygiene practices:Visiting your dentist regularly (twice a year) for cleanings.Brush with a fluoride-containing toothpaste.Floss at least once daily.Call your dentist if:Your tooth is extremely sensitive.You feel a sharp edge.You notice a crack in a filling or if a piece of the filling is missing.Your dentist will take X-rays if he or she suspects that one of your fillings might be cracked or is “leaking” (when the sides of the filling don't fit tightly against the tooth, debris and saliva can seep down between the filling and the tooth, which leads to decay).What causes tooth sensitivity after getting a dental filling?Tooth sensitivity after placement of a filling is fairly common. Your tooth may be sensitive to pressure, air, sweet foods, or temperature. Usually, the sensitivity goes away on its own within a few weeks. Until then, avoid the cause of the sensitivity. You usually don’t need to take a pain reliever.Contact your dentist if the sensitivity doesn’t go away within two to four weeks or if your tooth is extremely sensitive. He or she may recommend using a desensitizing toothpaste, may apply a desensitizing agent to the tooth, or possibly suggest a root canal procedure.Why do I feel pain around my dental filling?There are several reasons why you might have pain after a dental filling. Each has a different cause.Pain when you bite: Your filling is interfering with your bite. Return to your dentist and have the filling reshaped.Pain when your teeth touch: Your pain is likely caused by the touching of two different metal surfaces (for example, the silver amalgam in a newly filled tooth and a gold crown on another tooth with which it touches). This pain should go away on its own within a short period of time.Toothache-type pain: This pain might occur if the decay was very deep to the pulp of the tooth. This “toothache” response may mean this tissue is no longer healthy and a root canal procedure is needed.Referred pain: Referred pain is pain or sensitivity in other teeth besides the one that was filled. There’s likely nothing wrong with your teeth. The filled tooth is simply passing along “pain signals” it’s receiving to other teeth. This pain should decrease on its own over one to two weeks.Why or when would a dental filling need to be replaced?There are three main reasons why dental fillings would need to be replaced.Normal wear and tear: Constant pressure from chewing, grinding or clenching can cause dental fillings to wear away, chip or crack. Although you may not be able to tell that your filling is wearing down, your dentist can identify weaknesses in your restorations during a regular check-up.Filling fails and decay develops: If the seal between the tooth enamel and the filling breaks down, food particles and decay-causing bacteria can work their way under the filling. You then run the risk of developing additional decay in that tooth. Decay that is left untreated can progress to infect the dental pulp and may cause an abscessed tooth.Filling and/or decay is large: If the filling is large or the recurrent decay is extensive, there may not be enough tooth structure remaining to support a replacement filling. In these cases, your dentist may need to replace the filling with a crown.What causes a new filling to simply fall out?New fillings that fall out are probably the result of improper cavity preparation, contamination of the preparation prior to placement of the restoration or a fracture of the restoration from bite or chewing trauma. Older restorations will generally be lost due to decay or fracturing of the remaining tooth.Additional DetailsCan a person be allergic to amalgam fillings?It’s possible but fewer than 100 cases have ever been reported, according to the ADA. In these rare occasions, mercury or one of the metals used in an amalgam restoration is thought to trigger the allergic response. Symptoms of amalgam allergy are similar to those experienced in a typical skin allergy and include skin rashes and itching. If you've had an allergic reaction to an amalgam, it’s likely that you have a medical or family history of allergies to metals. Once an allergy is confirmed, another restorative material can be used.Does dental insurance cover the cost of composite fillings?Most dental insurance plans cover the cost of the composites up to the price of the silver filling, then you would need to pay the difference. It’s always best to contact your dental care insurance provider before procedures if you have questions or concerns about cost.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/23/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Dental CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"