"Dental Bone Graft: Process, Healing & What It Is800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Dental Bone GraftAdvertisementAdvertisementAdvertisementDental Bone GraftA dental bone graft is necessary when bone loss has occurred in the jaw. This procedure is commonly performed prior to dental implant placement or when bone loss is negatively affecting neighboring teeth.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewDental Bone Graft: Why You Would Need One and What to ExpectWhat is a dental bone graft?A dental bone graft adds volume and density to your jaw in areas where bone loss has occurred. The bone graft material may be taken from your own body (autogenous), or it may be purchased from a human tissue bank (allograft) or an animal tissue bank (xenograft). In some instances, the bone graft material may be synthetic (alloplast).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow does a dental bone graft work?Once the bone graft has been placed, it holds space for your own body to do the repair work. In other words, a dental bone graft is like a scaffold on which your own bone tissue can grow and regenerate.In some cases, your dental provider may combine a dental bone graft with platelet-rich plasma (PRP). This is taken from a sample of your own blood and is used to promote healing and tissue regeneration.Who needs a dental bone graft?A person with bone loss in their jaw usually needs a dental bone graft. This procedure may be recommended if you:Are having a tooth extracted.Plan to replace a missing tooth with a dental implant.Need to rebuild the jaw before getting dentures.Have areas of bone loss due to gum (periodontal) disease.AdvertisementHow common are dental bone grafts?Dental bone grafts are extremely common. They may be performed by a general dentist or a specialist, such as a periodontist or an oral surgeon.Are there different types of bone grafts?Yes. There are four main types, including:Socket preservation. Sometimes called ridge preservation, this type of graft is placed in the socket immediately after a tooth extraction. It fills the void left behind by the missing tooth and prevents the sides of the socket from caving in.Ridge augmentation. If your teeth have been missing for a while, the supporting jawbone may be thinner than it was before. Ridge augmentation increases the width and volume of the jawbone so it can provide a stable foundation for implants or other restorative options.Sinus lift. The maxillary sinuses sit just above your upper back teeth. If the upper back teeth are missing, the sinuses can drop down and invade the space once occupied by the teeth roots. In this scenario, you wouldn’t want to place implants because they would penetrate the sinus membrane. To address this problem, your oral surgeon or periodontist can perform a sinus lift. This procedure raises the sinus back to its proper position. A dental bone graft is then placed underneath the sinus, creating a solid foundation for dental implants later on.Periodontal bone graft. Infection from gum disease can erode the bone that supports the teeth. This can cause the teeth to become loose. A periodontal bone graft is placed around an existing tooth to reduce mobility and provide additional support.In most cases, bone grafts for dental implants must heal completely before the actual implant is placed. Because each person is unique, recovery times vary. In rare instances, your dentist may be able to place a bone graft and a dental implant at the same time. But this is decided on a case-by-case basis.AdvertisementProcedure DetailsWhat happens before dental bone graft placement?Your dentist will perform an oral examination to check the health of your teeth, gums and jaw. Dental X-rays or scans will be taken to determine the extent of your bone loss. Next, your dentist will discuss your treatment options with you and create a personalized treatment plan to meet your needs.What happens during dental bone graft surgery?First, your dental provider will numb the area with local anesthetic. Next, they'll create a small incision in your gums. Gum tissue is moved back slightly so that the jawbone is visible. After cleaning and disinfecting the area, your dentist adds bone grafting material to repair the defect. In many cases, the bone graft is covered with a membrane for additional protection. Finally, the gum tissue is repositioned and the incision is closed with stitches.What happens after a dental bone graft?Following a dental bone graft, you may have pain, swelling and bruising. These are normal side effects that should diminish in a few days. Symptoms can be managed with pain relievers. Your dentist may give you antibiotics as well. These should be taken exactly as prescribed.You might notice small fragments of bone coming out of the site over the first few days. These pieces often resemble grains of salt or sand. This usually isn’t a cause for concern, but call your dentist to make sure that you’re healing as expected.How painful is a dental bone graft?Most people who have dental bone grafts report little to no pain. Just be sure you take all medications as prescribed and follow your post-operative instructions closely.Are you put to sleep for a dental bone graft?Typically, placement of a bone graft does not require being put to sleep; it can be done easily with local anesthesia. Many dental providers can offer sedation for your comfort, including nitrous oxide, oral sedation and IV sedation. If your case is more involved, general anesthesia may be recommended. Ask your dentist which option is right for you.Can dental bone grafts fail?Dental bone grafts have impressively high success rates. However, as with any procedure, failure is a possibility — especially among people who smoke or have certain medical conditions. Signs of dental bone graft failure include:Pain or swelling that worsens after the first week.Pus or drainage from the bone graft site.Gum recession (when the gums pull away from the teeth).No improvement in jawbone volume.Care at Cleveland ClinicGet Dental CareFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of dental bone grafts?Dental bone grafts can increase your eligibility for dental implants and other restorative treatments. This procedure restores your jaw to its original form following trauma, tooth loss or gum (periodontal) disease.What are the risks or complications of dental bone grafts?Bone grafts in your mouth are generally safe. However, the procedure carries some risks, including:Infection.Heavy bleeding.Nerve damage.Complications from anesthesia.Recovery and OutlookHow long does it take to recover from a dental bone graft?Though you will probably feel back to normal within a week or two, complete dental bone graft healing can take between three and nine months – sometimes longer. Recovery times depend on several factors, including the type of graft, the area in which the graft was placed and your body’s healing capacity.When can I go back to work or school?In most cases, people can return to work or school the day after the procedure. If you choose sedation, you may need to take an extra day or two to recover at home.What are the dental bone graft healing stages?As mentioned above, recovery times can vary significantly for each person. Once the bone graft is placed, your dentist will monitor your healing. If you’re waiting to undergo dental implant surgery, they will let you know when your new bone is strong enough to support the implant.When to Call the DoctorWhen should I contact my healthcare provider?If you’ve had a dental bone graft placed, keep an eye out for troubling symptoms. Call your dentist if you experience:Severe pain.Increased swelling.Pus around the grafting site.A fever of 101° or higher.A note from Cleveland ClinicJawbone loss is detrimental to your oral health and can cause a domino effect of problems, including mobility and tooth loss. Dental bone grafts help improve your candidacy for dental implants and other restorative procedures. If you think you have jawbone deterioration, dental surgery can restore your oral health, function and overall quality of life.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/27/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Dental CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"