"Dental Implants: Tooth Implants, Dentures, Dental Crowns & Bridges800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Dental ImplantsAdvertisementAdvertisementAdvertisementDental ImplantsDental implants take the place of a lost tooth root. These permanent metal screws secure artificial or fake teeth — such as dental crowns, dental bridges or dentures — in place. A dental implant can replace one or more missing teeth.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewOnce a dental implant heals, your dentist can place a crown on top to restore function and appearance.What are dental implants?Dental implants are small threaded posts that replace missing teeth roots. Most dental implants are titanium, but some are ceramic. Both of these materials are safe and biocompatible (friendly to the tissues inside of your mouth).How do dental implants work?A surgeon places a dental implant into your jaw during an oral surgery procedure. Once the implant heals, your dentist can place a crown on top. Depending on your oral health goals, your dentist can restore your implants with crowns, bridges or dentures.Who might need dental implants?People who have one or more missing teeth can benefit from dental implants. You might need a dental implant if you have tooth loss due to:Cavities (tooth decay).Tooth root fracture.Bruxism (clenching or grinding your teeth).Gum disease.Facial injury.Congenitally missing teeth (you were born without certain teeth).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow should I prepare for a dental implant?Before the dental implant procedure, you should:Give your dentist a current list of medications and supplements you take. It’s important to tell your dentist if you’re taking a blood thinner (anticoagulant). Your dentist will decide in coordination with your primary care provider whether you need to stop taking any medications before your implant procedure.Make sure that you’ve seen your primary care provider recently for a checkup and blood work to ensure that there aren’t any conditions that would interfere with implant success.Talk to your dentist about sedation options. Most surgeons offer sedative medications that help you relax during your dental implant surgery.If you plan on having sedation, arrange for a trusted friend or family member to drive you home after your procedure.What happens during dental implant surgery?During dental implant surgery, your surgeon will:Give you anesthesia. They’ll administer local anesthesia to numb your gums. If you opted for sedation, they’ll give you those medications as well.Create an incision. Once you’re comfortable, your surgeon will make an incision (cut) in your gums where the dental implant will go. This exposes the bone underneath so your surgeon can place the implant.Prepare your jaw. Your surgeon will use a series of specialized instruments to create an opening in your jawbone. They’ll widen the opening until it’s just the right diameter for your new dental implant.Place the dental implant. Next, your surgeon will carefully place the dental implant into your jaw.Close the incisions. Finally, your surgeon will reposition your gums and close the incision with stitches.The steps for dental implant placement are generally the same for everyone. But sometimes, a surgeon can place a dental implant and restoration (like a crown or bridge) all in one visit. Most of the time, however, you’ll need a few months for the implant to heal before your dentist can safely place a final restoration. In these cases, your dentist can make a temporary (usually removable) restoration for you to wear during the healing phase.AdvertisementWhat happens after dental implant placement?Your surgeon will give you a detailed list of postoperative instructions. They’ll also prescribe antibiotics to prevent infection. There are several things you can do to reduce your risk of soreness and discomfort:Take all medications exactly as prescribed by your healthcare provider.Avoid exercise or heavy lifting for at least 72 hours. (An elevated heart rate can result in increased pain and swelling.)Chew on the other side of your mouth. (If you had implants placed on both sides, eat soft foods for a few days, and then add other foods as your comfort level allows.)Brush and floss every day.Clean the implant site as directed by your surgeon.Care at Cleveland ClinicGet Dental ImplantsFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of dental implants?Dental implants offer a wide range of advantages. They can:Improve speech and chewing ability.Enhance the appearance of your smile.Secure permanent or removable bridges and dentures.Provide teeth replacement without altering (shaving down) your neighboring teeth. (This is necessary for dental bridges.)In addition, dental implants can’t get cavities. (But they’re not invulnerable to gum disease, so it’s still important to practice good oral hygiene.)AdvertisementWhat are the risks or complications of dental implants?Like any surgery, dental implant placement carries the potential for complications. Possible risks include:Infection.Sinus damage.Nerve damage.Improper implant placement.Allergic reaction to titanium (very rare).When an experienced surgeon places implants, the risk of complications is minimal. If you’re thinking about getting dental implants, be sure to find a provider you trust.Who shouldn’t get dental implants?Certain risk factors can affect dental implant candidacy. Dental implants may not be right for you if you:Are under the age of 18. (Most surgeons won’t place dental implants unless your jaw has stopped growing.)Smoke or use tobacco products.Have significant bone loss in your jaw.Have poor oral hygiene.Have extensive tooth decay.Have active or untreated gum disease.Have certain health conditions, such as bone disorders or autoimmune diseases.Every person is different with a unique health history. To find out for sure if you qualify for dental implants, talk to your dentist.Recovery and OutlookHow long does it take to recover from dental implant surgery?Dental implant recovery times can vary, but most people can resume normal activities in about three days. Even so, it can still take several months for your jawbone to fuse around the implant. This process is osseointegration, and it’s critical for the long-term success and stability of your dental implant.Following your dental implant placement, your surgeon will periodically check on your progress. Once the dental implant has fused with your jaw, it’s safe to add the restoration on top. Placing a dental restoration too soon can result in implant failure.How long do dental implants last?Currently, dental implants are the longest-lasting teeth replacement option available. With proper care and maintenance, they can last a lifetime. However, the restoration on top of your dental implant will need replacing at some point. Most crowns and bridges last around 15 years and most dentures last at least seven years, but this timeline varies.When to Call the DoctorWhen should I see my dentist?If you have tooth loss that’s interfering with your quality of life, schedule an appointment with a dentist to discuss your replacement options. They can help determine if dental implants are the right solution for you.Additional DetailsAre dental implants painful?Dental implant placement is a surgical procedure. Like any surgical procedure, some discomfort is normal. But nonsteroidal anti-inflammatory drugs (NSAIDs), such as ibuprofen, can help reduce pain and swelling associated with dental implant surgery.You can also reduce your risk of pain by avoiding the gym for a few days. Raising your heart rate, especially within the first 72 hours, can result in increased pain, swelling and bruising.Are dental implants safe?Yes, dental implants are safe when placed by a skilled and experienced surgeon. Dentists have recommended dental implants for over 50 years. As long as you have healthy teeth and gums and commit to practicing good oral hygiene, dental implants can be a lifelong solution to tooth loss.What if a dentist told me that I don’t qualify for dental implants due to bone loss?If a dentist has told you that you’re not a candidate for dental implants due to bone loss, there’s nothing wrong with getting a second opinion. While it’s true that some people don’t qualify for dental implants, you might be eligible for regenerative procedures like dental bone grafts or sinus lifts. These procedures can add density to areas of bone loss and potentially increase your candidacy for dental implants.If you’re not eligible for regenerative procedures, there are other teeth replacement options that can help. Ask your dentist which is best for you.A note from Cleveland ClinicTooth loss can take a toll on everyday life. When you’re missing teeth, it might be difficult to chew or speak properly. Dental implants offer a long-term solution, and your dentist can tailor treatment to your unique needs. Whether you’re missing one tooth, several teeth or all of your teeth, dental implants might be an option for you. To learn more, talk to your dentist.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/21/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Dental ImplantsFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"