"What Are Dentures? Types, Care & Benefits800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/DenturesAdvertisementAdvertisementAdvertisementDenturesDentures are removable oral appliances that replace missing teeth. There are many types of dentures, including full, partial and implant-supported dentures. With proper care and maintenance, the average lifespan of a denture is seven to 10 years.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewPartial dentures replace several missing teeth, while full dentures replace an entire arch of missing teeth.What are dentures?Dentures are removable oral appliances that replace missing teeth in your upper jaw, lower jaw or both. Dental technicians craft dentures from materials like acrylic, resin, nylon, metal and porcelain.Types of denturesThere are many different types of dentures. The option that’s right for you depends on your unique oral health needs.Full denturesAlso called a complete denture, this appliance replaces an entire arch of missing teeth. A full denture rests atop your gums and relies on your palate (the roof of your mouth) or lower jawbone ridge for support. You may need to use denture adhesive (a special type of glue) to keep your appliance firmly in place.Full dentures are likely what comes to mind when you think about traditional dentures. They consist of artificial teeth and a gum-colored base.People who wear dentures usually take them out at night to clean them and give their gums a rest.Partial denturesIf you’re missing several or most of your teeth in one or both jaws, partial dentures may be an option. Partial dentures are similar to full dentures, as they also rely on your gums and underlying bone for support. But partial dentures also have special clasps that hook around your remaining natural teeth, providing additional stability.Immediate denturesSometimes people need tooth extractions before they can wear dentures. An immediate denture is a device you wear right after extractions.In some cases, immediate dentures are temporary appliances. Once you’ve healed, your dentist will replace them with your final dentures. In other cases, you might be able to wear your final denture immediately after surgery. Your dentist can tell you what to expect in your situation.Implant-retained denturesInstead of relying on your jawbone ridge and gums for support, implant-retained dentures attach to dental implants. Dental implants are small, threaded posts that surgeons place in your jawbone to replace missing teeth roots.Like traditional dentures, implant-retained dentures are removable. You take them out at night to clean and soak them.Implant-retained dentures typically offer more stability than traditional dentures because they “snap on” to implants embedded in your jaw. You won’t need denture glue to secure them in your mouth. For this reason, some people call them “snap-in dentures.”Implant-supported denturesUnlike other types of dentures, implant-supported dentures (also called permanent dentures or hybrid dentures) are non-removable. They don’t snap in and out, and only your dentist can remove them.Dentists recommend implant-supported dentures for people who don’t want removable oral appliances. The downside of a nonremovable denture is that it requires more thorough daily cleaning, including flossing underneath your denture.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens during a denture consultation?A dentist will examine your mouth, including your jaws, gums and any remaining teeth. They’ll also take dental X-rays to check the thickness of your jawbone.If your dentist determines that you’re eligible for dentures, they’ll discuss your denture options with you. The denture that’s right for you depends on several factors, including:How many teeth you’re missing.How long your teeth have been missing.Whether you prefer a removable or nonremovable appliance.The density and volume of your jawbone.The relationship between your upper and lower jaws.Your personal preferences.How are dentures made?Fabricating a denture requires several steps:Taking dental impressions. First, your dentist will take impressions of your upper and lower jaws. This includes your gums and any remaining teeth. Oftentimes, you’ll need two impressions — a preliminary and a final.Making a dental model. Your dentist will send your impressions to a dental lab. A dental technician will use your dental impressions to craft a stone model (replica) of your mouth. They’ll use this model to create your custom denture.Customizing the denture. Building your denture starts with wax registration blocks. These blocks help the dental technician determine where to place the artificial teeth. Next, the technician will use a variety of materials (like acrylic, nylon or resin) to build up the base of your new denture. Finally, they’ll add the artificial teeth and ensure that the upper and lower teeth fit together correctly.Polishing the denture. Once the technician creates your new denture, they’ll polish it to a natural-looking shine and send it back to your dentist for your fitting.AdvertisementWhat happens during a denture fitting?Your dentist will place your new dentures in your mouth and check the fit. They’ll carefully look for any areas that put excess pressure on your gums and make any necessary final adjustments to your denture.It’s important to know that it usually takes several office visits to achieve the desired fit. This is because the soft tissues in your mouth will need time to adjust to your denture.Care at Cleveland ClinicGet Dental CareFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of dentures?Dentures offer a number of benefits, including:Improved chewing function.Enhanced appearance.Improved speech function.Better nutrition (due to improved chewing function).AdvertisementWhat are the drawbacks of dentures?Dentures also have their share of challenges — especially traditional removable dentures. For instance, many traditional denture wearers complain that their appliances shift, wobble or slip out of place when they’re speaking or chewing. In addition, your jawbone gradually shrinks following tooth loss, leading to facial collapse (like sunken-in cheeks).Recovery and OutlookHow long does it take to get used to dentures?The answer to this question is different for everyone. It can take time — weeks or sometimes months — to get used to your new dentures. Keep in mind you may need several adjustments during the first couple of weeks to achieve your desired fit.How long do dentures last?The average lifespan of a denture is seven to 10 years. Most people will need replacement dentures at this point.You should also get a denture reline every one to two years — or whenever you notice changes in the way your denture fits. During this process, your dentist will add material to your denture to ensure a more comfortable fit.How can I take care of my dentures?Proper care and maintenance helps keep your dentures in good condition. Here are a few general guidelines to make sure your appliance lasts as long as possible:Remove your dentures at the end of every day.Clean your dentures using a denture brush and paste.Soak your dentures overnight in a denture solution.Brush your gums, tongue, inner cheeks, roof of your mouth and any remaining teeth twice a day to remove plaque and debris.When to Call the DoctorWhen should I call my dentist?You should make a dental appointment if your dentures:Feel loose.Hurt or pinch your gums.Click when speaking.Have damage or discoloration.Are more than 10 years old.If you have any of the signs mentioned above, it might be time for replacement dentures.Additional DetailsWhat are some alternatives to dentures?There are two main alternatives to dentures: dental implants and dental bridges.Dental implantsDental implants are the most common alternative to dentures. Dental implants stimulate the nerves in your jaw and halt bone loss (just like natural teeth roots do). Your nerves send signals to your brain, and in return, your brain sends nutrients to your jaw, keeping it strong and healthy.Dental implants are typically more expensive than dentures, but they can last a lifetime with proper care.Dental bridgesDental bridges are an effective alternative if you still have several healthy teeth. Bridges work best for people with one to three missing teeth in a row.A dental bridge consists of crowns (abutments) with artificial teeth (pontics) in between. A dentist bonds the crowns to your natural teeth on either side of the gap, and the artificial teeth fill in the space to complete your smile.Is it OK to sleep with dentures in?Most people sleep without their dentures because it’s more comfortable and it gives the tissues in their mouth a rest. Whether you sleep with or without them, it’s important to take them out for at least eight hours every day.Leaving your dentures out for at least eight hours a day:Gives your gums a break.Reduces harmful oral bacteria.Keeps your jawbone as strong as possible.A note from Cleveland ClinicTooth loss has a negative impact on routine tasks like eating and speaking. Replacing missing teeth is key for long-term oral health. Dentures are removable appliances that restore oral health and function. Talk to your dentist to learn more about the different types of dentures and whether this treatment is right for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/10/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Dental CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"