"Alternative Treatment for Depression: Options & Remedies 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Depression: Alternative TherapiesAdvertisementAdvertisementAdvertisementDepression: Alternative TherapiesClinical depression is typically treated with psychotherapy and medication in Western medicine. If those treatments aren’t working, then it might be time to try alternative therapies. Scientists have yet to agree on the effectiveness of herbal supplements, acupuncture and other treatments, but many patients with depression say they’re helpful.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat are alternative therapies?A health treatment that is not classified as a standard Western medical practice is referred to as \"alternative,\" or \"complementary,” or “integrative.” Alternative therapy encompasses a variety of disciplines that includes everything from your diet and exercise to your mental conditioning and your lifestyle. Examples of alternative therapies include:Herbal remedies.Acupuncture.Reflexology.Exercise.Meditation.Massage.Guided imagery.Yoga.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is depression?“Major” or “clinical” depression is a mental health disorder characterized by an intense and relentless sense of hopelessness, worthlessness, emptiness and/or despair. Clinical depression interferes with working, eating, sleeping and more aspects of your life. It can be caused by one or more factors, including chemical imbalances, high levels of stress, traumatic experiences, life transitions and more. Approximately 10% of people in the United States suffer from depression.The two most common treatments for clinical depression in Western medicine are psychotherapy and medications. A therapist provides counseling (talk therapy) and a family healthcare provider or psychiatrist provides medicine (such as SSRIs, selective serotonin reuptake inhibitors). These treatments can be very effective. However, if you don’t respond to them, or if you want to supplement your treatment, you might want to consider alternative therapies.What alternative therapies are recommended for depression?No alternative therapy is guaranteed to cure depression, but the same can be said about several Western medicines and psychotherapies. To be safe, be sure to consult with your healthcare provider before you try one or more of these recommended therapies:Herbal remedies: Herbal remedies are made from plants. Of the wide variety of available herbal therapies, St. John's wort and ginkgo biloba are the products most often used for treating depression.Acupuncture: Acupuncture is an ancient Chinese method of healing that prevents and cures specific diseases and conditions.Reflexology: For this treatment, the reflexologist applies pressure to different pressure points on your feet, hands, ears and face.Exercise: In general, exercise is a safe and easy way to improve your well-being.Meditation: Meditation is a form of relaxation and introspection.Massage: Massage uses touch to promote relaxation while decreasing tension and stress.Guided imagery: Guided imagery is a form of focused relaxation that helps create harmony between the mind and body.Yoga: Yoga is a type of exercise and spiritual practice.Deep breathing: Taking slow, deep breaths in, then slowly exhaling, while your mind focuses on the breath.AdvertisementProcedure DetailsHow does alternative therapy for depression work?Each alternative therapy is unique. Some involve movement, others involve being still, etc. Here is how each therapy works:Herbal remedies: St. John's wort has been used for medical purposes for thousands of years, despite the fact that it has not been scientifically proven to treat moderate to severe depression. Ginkgo biloba is thought to improve memory and other intellectual functions, although the evidence is not consistent. Herbal remedies are taken by mouth.Acupuncture: Acupuncture involves sticking very fine, solid needles into specific points on the body. It stimulates the body's ability to resist or overcome illness by correcting imbalances. It also prompts the body to produce chemicals that decrease or eliminate painful sensations.Reflexology: The nerves in the hands and feet are related to various parts of the body. Reflexologists believe that the healing process is stimulated by applying pressure to specific points on the body.Exercise: Walking, running, swimming etc. has been shown to reduce symptoms of depression. A recent study suggests that 150 minutes/week of moderate intensity exercise reduces symptoms of anxiety and depression.Meditation: While the body is at rest, the mind is cleared by focusing on one thought, which could be a word, phrase, or particular scenery. Meditation is usually practiced regularly — for at least 10 minutes each day.Massage: Massage therapists use their hands to rub your body. Massage supports the mind-body connection, allowing for a better awareness of what is happening in our bodies. Some variations of massage that can support the mind-body connection and general relaxation are Swedish massage techniques, Reiki, aromatherapy and craniosacral therapies.Guided imagery: Guided imagery coaches you in creating calm, peaceful images in your mind — a \"mental escape\" for therapeutic purposes. It can be a powerful psychological strategy to enhance a person's coping skills.Yoga: Practicing yoga teaches you breathing techniques that can help to energize you when you are feeling down or to help calm you when you are feeling anxiety. The breath is the link between your mind and your body. Changing your breath can help you feel better mentally and physically.Deep breathing: When we are feeling stressed, we often take quick breaths, or have a hard time catching our breath. When you take a slow, deep breath in, your lungs will fill with oxygen, which helps to lower your heart rate. By focusing our mind on the breathing process, we shift the focus away from whatever is causing the stress.Risks / BenefitsWhat are the benefits and risks of alternative therapies for depression?Risks with alternative therapies increase if you’re pregnant or breastfeeding. Check with your healthcare provider for help determining what therapies are safe for you.Herbal remedies: Check with your healthcare provider before you start using an herbal remedy to make sure there are no drug interactions with your antidepressants or other medications.Acupuncture: In a recent clinical study, acupuncture has been shown effective in decreasing depression at three months, compared to usual care. For people who suffer from both pain and depression, acupuncture may be better than counseling and standard of care at reducing both.Reflexology: Reflexology is thought to improve your mood, help you sleep and relieve tension.Exercise: Different forms of exercise can lower your stress, reduce depression and increase your energy level, balance, flexibility and ability to relax.Meditation: Meditation has many benefits including helping you with stress and anxiety and entering a place of stillness and calm.Massage: The release of serotonin and dopamine, and the decrease of cortisol during a massage may help improve the symptoms of depression, lessen pain and improve sleep.Guided imagery: It can help people cope with — and possibly overcome — stress, anger, pain, depression and insomnia with or without associated physical illness.Yoga: The postures and movements in yoga teach you how to hold your body in a way that can make you feel stronger, better able to breathe and function and to create an improved sense of overall wellbeing.Deep breathing: Focusing on taking slow, deep breaths, by counting to give when inhaling, then counting to five while exhaling, helps depression both physically and mentally.AdvertisementRecovery and OutlookWhat is the prognosis (outlook) for people who use alternative therapies for depression?Scientists have yet to agree about the effectiveness of the alternative therapies listed here. It is difficult to predict a prognosis. Part of the journey of using alternative therapies is that you will have to do some experimentation to figure out what works and what doesn’t work for you. Some people who have used alternative therapies have had success, and others haven’t. Stay in contact with your healthcare provider while you use these therapies.When to Call the DoctorWhen should I contact my healthcare provider?Contact your healthcare provider immediately if you experience thoughts about suicide, hurting yourself, or hurting others. Remember, you should always follow your healthcare provider’s instructions. Never stop taking your medications or start an alternative therapy without approval and supervision.Additional DetailsDoes insurance cover alternative therapies for depression?Many alternative therapies are not covered by insurance. You might have to pay out-of-pocket. However, there are free resources where you can learn about yoga and meditation, and you can exercise on your own (under your healthcare provider’s supervision). Do some research about resources in your community and ask your healthcare provider for referrals.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 12/22/2020.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"