"Dermaplaning: What It Is, Benefits & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/DermaplaningAdvertisementAdvertisementAdvertisementDermaplaningDermaplaning is a minimally invasive procedure that shaves away the top layers of your skin. It can help reduce the appearance of acne scars or pitted skin. Some people get dermaplaning to remove unwanted hair.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewIn dermaplaning, your healthcare provider shaves away the top layers of your skin, reducing the appearance of scars or signs of aging.What is dermaplaning?Dermaplaning is a minimally invasive cosmetic procedure for your skin. Your healthcare provider uses a special instrument to shave away the uppermost layers of your skin.Dermaplaning can help reduce the appearance of acne scars or other skin imperfections by revealing newer, undamaged skin. It can make your skin look younger; though, it doesn’t stop the aging process. Some people also get dermaplaning for hair removal. This is only a temporary fix because your hair will grow back.Most people get the procedure on their face, but you can do it anywhere on your body.Dermaplaning vs. dermabrasion vs. microdermabrasion: What’s the difference?Dermaplaning, dermabrasion and microdermabrasion are all skin resurfacing procedures. Each procedure uses different tools and takes off different amounts of skin. Dermaplaning uses a scalpel (knife) or razor to remove skin. Dermabrasion is a surgical procedure. Microdermabrasion is a nonsurgical procedure that uses an exfoliating blade to sand away your skin to smooth it and remove the appearance of scars.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho gets dermaplaning?You may consider dermaplaning if you have skin concerns such as:Acne scars.Actinic keratosis (scaly skin patches that can lead to skin cancer).Dull or dry skin.Peach fuzz (light, soft hair on your face).Skin damaged by sun exposure.Fine lines (wrinkles).Who shouldn’t have dermaplaning?Some people with preexisting skin concerns shouldn’t have dermaplaning. Before getting this procedure, talk to your healthcare provider if you have:An active case of acne.Cold sore outbreaks.Eczema.Moles, freckles, skin tags or other skin growths.Psoriasis.Skin burns, such as those from radiation therapy.Skin rashes (contact dermatitis).AdvertisementProcedure DetailsWhat happens before dermaplaning?A plastic surgeon, dermatologist or cosmetologist might perform dermaplaning. Before the procedure, your healthcare provider will:Discuss your goals for the procedure.Examine your skin to make sure it’s healthy enough for the procedure.Explain what you can expect before, during and after dermaplaning.Review your health history.Sometimes, your healthcare provider will take photos of the area that needs treatment. The photos help you compare the “before” and “after” results of dermaplaning.Your healthcare provider will also let you know if there are any special instructions you need to follow before the procedure, such as not smoking for a few weeks. Not smoking may help you heal faster after the procedure.What happens during dermaplaning?Dermaplaning doesn’t require general anesthesia, but your healthcare provider might put a numbing cream or spray on your face about half an hour before the procedure.You might feel a scratching or stinging sensation on your skin, but dermaplaning usually isn’t painful.Your healthcare provider uses a special instrument called a dermatome to remove hair and skin cells. The tool looks a bit like an electric razor. The dermatome has a small blade that moves back and forth across your skin. It doesn’t make cuts in your skin, but gently shaves off the top layers of skin.Afterward, they may apply a soothing gel or ointment to your skin to reduce redness, swelling or irritation.The treatment can last anywhere from a few minutes to an hour and a half. The length of the procedure depends on the size of the area that needs treatment.AdvertisementWhat happens after dermaplaning?Your skin will likely be red, swollen and slightly tender after the dermaplaning procedure. Your healthcare provider may recommend over the counter pain medication to help with any discomfort. If you notice swelling lasts longer than a week or worsens, contact your healthcare provider.Care at Cleveland ClinicGet Dermatology CareMake an AppointmentRisks / BenefitsWhat are the risks of dermaplaning?Dermaplaning is generally considered a safe cosmetic procedure. However, it does carry the following risks:Infection.Scarring such as keloid or hypertrophic (raised) scars.Skin discoloration (skin that turns lighter or darker than the surrounding skin).What are the benefits of dermaplaning?Dermaplaning can help minimize the appearance of acne scars, fine lines, wrinkles and dull skin. The procedure can reveal smoother, firmer and healthier skin.Recovery and OutlookWhat can I expect after dermaplaning?Recovery is different for everyone in the weeks and months after dermaplaning, but you can expect:After 1 week: Redness and swelling should subside. You may notice enlarged pores or small whiteheads on your skin, which usually go away with the swelling. Don’t shave the treated area.After 2 weeks: A scab may form over the treated area, which falls off. The skin underneath will look tight and pink. It might be itchy. Most people can return to work after two weeks, but you should avoid strenuous activities.After 4–6 weeks: You can gradually get back to playing sports or other activities, but you should stay out of the sun.After 6–12 months: Continue staying out of the sun until the treated area has returned to your normal skin color.Will I need multiple dermaplaning procedures?Some people get multiple dermaplaning procedures to achieve their desired results. However, it’s important for your skin to heal completely between treatments. Talk to your healthcare provider to make sure it’s safe to have additional dermaplaning procedures.What if I have very deep acne scars?Dermaplaning may not reduce the appearance of deep or raised acne scars. Some people need more intense treatments, such as laser surgery.When to Call the DoctorWhen should I see my healthcare provider?Contact your healthcare provider if you notice the treated area is:Bleeding.Blistered.Infected.Swollen for longer than a week.Additional Common QuestionsWhat should I ask my healthcare provider about dermaplaning?You may want to ask your healthcare provider:Are there skin care products I should use or avoid after dermaplaning?Can I perform dermaplaning on myself at home?Should I combine dermaplaning with another type of facial resurfacing, such as a chemical peel?Will my hair grow back darker and thicker after dermaplaning?A note from Cleveland ClinicDermaplaning is a minimally invasive cosmetic procedure that helps reduce the appearance of acne scars, improves skin brightness and addresses other skin concerns. Some people get microplanning to remove hair. Your healthcare provider uses a special razor to remove the top layers of your skin. Most people can return to normal activities a few weeks after the treatment.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/06/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Dermatology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"