"Dialectical Behavior Therapy (DBT): What It Is & Purpose800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Dialectical Behavior Therapy (DBT)AdvertisementAdvertisementAdvertisementDialectical Behavior Therapy (DBT)Dialectical behavior therapy (DBT) is a type of talk therapy for people who experience emotions very intensely. It’s a common therapy for people with borderline personality disorder, but therapists provide it for other mental health conditions as well.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is dialectical behavior therapy (DBT)?Dialectical behavior therapy (DBT) is a type of talk therapy (psychotherapy). It’s based on cognitive behavioral therapy (CBT), but it’s specially adapted for people who experience emotions very intensely.Cognitive behavioral therapy (CBT) is a type of talk therapy that helps people understand how thoughts affect emotions and behaviors.“Dialectical” means combining opposite ideas. DBT focuses on helping people accept the reality of their lives and their behaviors, as well as helping them learn to change their lives, including their unhelpful behaviors.Dialectical behavior therapy was developed in the 1970s by Marsha Linehan, an American psychologist.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is dialectical behavior therapy (DBT) used for?Dialectical behavior therapy (DBT) is especially effective for people who have difficulty managing and regulating their emotions.DBT has proven to be effective for treating and managing a wide range of mental health conditions, including:Borderline personality disorder (BPD).Self-harm.Suicidal behavior.Post-traumatic stress disorder (PTSD).Substance use disorder.Eating disorders, specifically binge eating disorder and bulimia.Depression.Anxiety.It’s important to note that the reason DBT has proved effective for treating these conditions is that each of these conditions is thought to be associated with issues that result from unhealthy or problematic efforts to control intense, negative emotions. Rather than depending on efforts that cause problems for the person, DBT helps people learn healthier ways to cope.How do I find a DBT therapist?A therapist can be a psychiatrist (a medical doctor who can prescribe medications), psychiatric nurse, psychologist, social worker or family therapist.Finding the right therapist is often a time-consuming task, and DBT therapy isn’t any different. Try not to become discouraged. Talk to people you trust to give you a referral for a therapist who uses dialectical behavior therapy, whether it’s your primary healthcare provider or a friend or family member.You can also search for therapists online through local and state psychological associations.Be sure that any therapist you’re interested in seeing is a state-certified and licensed mental health professional and that they treat your area of concern (for example, eating disorders, borderline personality disorder, self-harm, etc.).Most therapists’ websites list the conditions and problems they treat. If you have questions, call or email the therapist’s office before you choose.It may be helpful to ask a potential DBT therapist the following questions:What is the nature of your training in DBT?Do you provide comprehensive DBT or a modification? If not comprehensive DBT, why not?Do you belong to a DBT consultation team?What’s your policy on phone calls and emails during the week?How much time will you initially ask me to commit to for the entire therapy process?AdvertisementProcedure DetailsHow does dialectical behavior therapy (DBT) work?The main goal of therapists who use dialectical behavior therapy (DBT) is to strike a balance between validation (acceptance) of who you are and your challenges and the benefits of change. Your therapist will help you learn new skills to improve emotion regulation.The structure of dialectical behavior therapy can vary some from therapist to therapist, but, in general, DBT involves these four types of sessions:DBT pre-assessment.Individual therapy.Skills training in groups.Telephone crisis coaching.DBT pre-assessmentYour therapist may offer an assessment before starting DBT. They’ll determine how suitable DBT is for you by asking you questions and explaining how DBT works. If you decide that DBT is the right therapy for you, they’ll ask you to commit to the treatment and the length of treatment.Individual DBT therapyIndividual DBT therapy involves weekly sessions with your therapist. Each session lasts about 40 minutes to 60 minutes.Individual DBT therapy sessions have the following goals:To help keep you safe by reducing suicidal and self-harming behaviors, if applicable.To limit behaviors that get in the way of productive therapy.To help you reach your goals and improve your quality of life by addressing what’s blocking your progress, such as mental health conditions or relationship issues.To help you learn new skills to replace unhelpful behaviors.Your therapist will likely ask you to keep a diary to track your emotions and actions and to look for patterns of behavior. You’ll bring this diary with you to your sessions so you and your therapist can decide what to work on for each session.DBT skills training in groupsIn these sessions, your therapist will teach you skills in a group setting. This isn’t to be confused with group therapy, in which you discuss your problems with others. Think of it more like a teaching and learning session in a classroom setting.DBT skills aim to help enhance your capabilities in day-to-day life. The four skills your therapist will teach include:Mindfulness: This is the practice of being fully aware and focused in the present instead of worrying about the past or future.Distress tolerance: This involves understanding and managing your emotions in difficult or stressful situations without responding with harmful behaviors.Interpersonal effectiveness: This means understanding how to ask for what you want and need and setting boundaries while maintaining respect for yourself and others.Emotion regulation: This means understanding, being more aware of and having more control over your emotions.Telephone crisis coachingDBT often involves telephone crisis coaching to support you in your daily life. This means you can call your therapist at certain times for support between sessions.Examples of when you may need to call your therapist include:When you need help with an immediate crisis, such as wanting to self-harm.When you’re trying to use the DBT skills you learned but want some advice on how to do it.However, your therapist will set clear boundaries about when you can call them, such as during an agreed-upon range of time during the day.Crisis coaching functions on an as-needed basis. The calls are usually brief, and they shouldn’t replace the work of individual or group sessions.Care at Cleveland ClinicMental Health CareMake an AppointmentRisks / BenefitsWhat are the benefits and risks of dialectical behavior therapy (DBT)?Dialectical behavior therapy (DBT) has been proven to help people with their mental health conditions in several studies. For people with borderline personality disorder, in particular, DBT results in:Less self-harm behavior and anger.Fewer days of inpatient hospitalization.Less drug and alcohol misuse.Improved depressive symptoms.However, DBT isn’t for everyone, and it can be very difficult. DBT is more likely to work for you if you:Are committed to making positive changes.Are ready to fully commit to therapy and do homework assignments.Are ready to focus mostly on your present and future, rather than your past.Feel able to do some sessions in a group with others.AdvertisementRecovery and OutlookHow long will I need dialectical behavior therapy?Dialectical behavior therapy (DBT) usually takes at least six months to a year. However, each person is unique, and mental health conditions are complex. You shouldn’t expect to be completely free of symptoms or no longer have problematic behaviors after one year of DBT.Many therapists believe that the treatment for borderline personality disorder, in particular, can often take several years.Try not to get discouraged by how long it may take to be able to better manage your emotions and have a better quality of life. The important thing is that you’re seeking help. Any progress is good progress.When to Call the DoctorWhen should I see my healthcare provider or therapist while doing DBT?It’s important to go to all of your scheduled individual DBT therapy sessions and group skill training sessions.If you’re experiencing a crisis, such as feeling suicidal, and can call your therapist, do so.If your therapist is unavailable, call the Suicide and Crisis Lifeline at 988. Someone will be available to talk with you 24 hours a day, seven days a week. You can also call 911 or go to the nearest emergency room.A note from Cleveland ClinicDialectical behavior therapy (DBT) is an effective treatment to help people who experience very intense, negative emotions. Although it may be difficult and time-consuming to find the right DBT therapist for you, it’s important to keep trying. The sooner you can start therapy — and stay committed to it — the sooner you’ll have an improved quality of life.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/19/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicMental Health CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 866.588.2264Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"