"Dialysis: Types, How It Works, Procedure & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/DialysisAdvertisementAdvertisementAdvertisementDialysisDialysis is a treatment for individuals whose kidneys are failing. There are two types of dialysis, hemodialysis and peritoneal dialysis, that both perform normal kidney functions, filtering waste and excess fluid from the blood.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is dialysis?Dialysis is a treatment for people whose kidneys are failing. When you have kidney failure, your kidneys don’t filter blood the way they should. As a result, wastes and toxins build up in your bloodstream. Dialysis does the work of your kidneys, removing waste products and excess fluid from the blood.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs dialysis?People who have kidney failure, or end-stage renal disease (ESRD), may need dialysis. Injuries and conditions like high blood pressure, diabetes and lupus can damage kidneys, leading to kidney disease.Some people develop kidney problems for no known reason. Kidney failure can be a long-term condition, or it can come on suddenly (acute) after a severe illness or injury. This type of kidney failure may go away as you recover.There are five stages of kidney disease. In stage 5 kidney disease, healthcare providers consider you to be in end-stage renal disease (ESRD) or kidney failure. At this point, kidneys are carrying out around 10% to 15% of their normal function. You may need dialysis or a kidney transplant to stay alive. Some people undergo dialysis while waiting for a transplant.What do the kidneys do?Your kidneys are part of your urinary system. These two bean-shaped organs sit below your ribcage on each side of your spine. They clean toxins from your blood, returning filtered, nutrient-rich blood to the bloodstream.The waste and extra water make urine, which moves from the kidneys into the bladder. Your kidneys also help regulate your blood pressure.AdvertisementProcedure DetailsWhat are the types of dialysis?There are two ways to get dialysis:Hemodialysis.Peritoneal dialysis.What is hemodialysis?With hemodialysis, a machine removes blood from your body, filters it through a dialyzer (artificial kidney) and returns the cleaned blood to your body. This 3- to 5-hour process may take place in a hospital or a dialysis center three times a week.You can also do hemodialysis at home. You may need at-home treatments four to seven times per week for fewer hours each session. You may choose to do home hemodialysis at night while you sleep.AdvertisementWhat happens before hemodialysis?Before you start hemodialysis, you’ll undergo a minor surgical procedure to make it easier to access the bloodstream. You may have:Arteriovenous fistula (AV fistula): A surgeon connects an artery and vein in your arm.Arteriovenous graft (AV graft): If the artery and vein are too short to connect, your surgeon will use a graft (soft, hollow tube) to connect the artery and vein.AV fistulas and grafts enlarge the connected artery and vein, which makes dialysis access easier. They also help blood flow in and out of your body faster.If dialysis needs to happen quickly, your provider may place a catheter (thin tube) into a vein in your neck, chest or leg for temporary access.Your provider will teach you how to prevent infections in your fistula or graft. This provider will also show you how to do hemodialysis at home if you choose to do so.What happens during hemodialysis?During hemodialysis, the dialysis machine:Removes blood from a needle in your arm.Circulates the blood through the dialyzer filter, which moves waste into a dialysis solution. This cleansing liquid contains water, salt and other additives.Returns filtered blood to your body through a different needle in your arm.Monitors your blood pressure to adjust how fast blood flows in and out of your body.What happens after hemodialysis?Some people experience low blood pressure during or immediately after hemodialysis. You may feel nauseous, dizzy or faint.Other side effects of hemodialysis include:Chest pain or back pain.Headaches.Itchy skin.Muscle cramps.Restless legs syndrome.What is peritoneal dialysis?With peritoneal dialysis, tiny blood vessels inside the abdominal lining (peritoneum) filter blood through the aid of a dialysis solution. This solution is a type of cleansing liquid that contains water, salt and other additives.Peritoneal dialysis takes place at home. There are two ways to do this treatment:Automated peritoneal dialysis uses a machine called a cycler.Continuous ambulatory peritoneal dialysis (CAPD) takes place manually.What happens before peritoneal dialysis?About three weeks before you start peritoneal dialysis, you’ll have a minor surgical procedure. A surgeon inserts a soft, thin tube (catheter) through your belly and into the peritoneum. This catheter stays in place permanently.A healthcare provider will teach you how to perform peritoneal dialysis at home and prevent infections at the catheter site.What happens during peritoneal dialysis?During peritoneal dialysis, you:Connect the catheter to one branch of a Y-shaped tube. This tube connects to a bag that has dialysis solution. The solution flows through the tube and catheter into the peritoneal cavity.Disconnect the tube and catheter after about 10 minutes, when the bag is empty.Cap off the catheter.Go about your usual activities while the dialysis solution inside the peritoneal cavity absorbs waste and extra fluids from the body. This process can take 60 to 90 minutes.Remove the cap from the catheter and use the other branch of the Y-shaped tube to drain the fluid into a clean, empty bag.Repeat these steps up to four times a day. You sleep with the solution in your stomach all night.Some people prefer to do peritoneal dialysis at night. With automated peritoneal dialysis, a machine called a cycler pumps the fluid in and out of the body while you sleep.What happens after peritoneal dialysis?The liquid in your belly can make you feel bloated or full. It might feel uncomfortable, but the treatment isn’t painful. Your stomach may stick out more than usual when it’s filled with fluid.Care at Cleveland ClinicChronic Kidney Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the potential risks or complications of hemodialysis?Some people have problems with the AV fistula or graft. You may develop an infection, poor blood flow or a blockage from scar tissue or a blood clot.Rarely, the dialysis needle comes out of your arm, or a tube comes out of the machine, during dialysis. A blood leak detection system alerts you or the medical staff to this problem. The machine temporarily shuts off until someone fixes the problem. This system protects you from blood loss.What are the potential risks or complications of peritoneal dialysis?Some people develop skin infections around the catheter. You’re also at risk for peritonitis, an infection that occurs when bacteria get inside the abdomen through the catheter. You may experience fever, abdominal pain, nausea and vomiting.Using the abdominal catheter and pumping your belly full of fluid can weaken abdominal muscles over time. You may develop a hernia. This condition occurs when an organ like the small intestine pokes through the abdominal muscles. You may feel a bulge near the belly button or in the groin area between the abdomen and upper thigh. Your doctor can repair a hernia with surgery.During peritoneal dialysis, your body absorbs dextrose, a sugar, from the dialysis solution. Over time, this extra sugar can lead to weight gain.Recovery and OutlookWhat’s the outlook (prognosis) for someone on dialysis?It’s possible to live 10 to 20 years on dialysis. The outlook varies depending on your age, overall health, the cause of kidney failure and other factors. If you get a kidney transplant, you can stop dialysis when your new kidney starts working.Will I have activity restrictions while I’m on dialysis?Many people on dialysis continue to live active lives, working, raising families and traveling. When you travel, your healthcare provider can help arrange for you to get dialysis at a center at your new location. If you’re doing either type of self-dialysis, you can take dialysis solution bags and the portable home dialysis machine (if needed) with you.People who use peritoneal dialysis may need to limit exercise or certain physical activities when the abdomen fills with dialysis solution. Otherwise, exercise is typically OK for people on dialysis. You should ask your provider about participating in specific activities or sports.When to Call the DoctorWhen should I call the doctor?You should call your healthcare provider if you experience:Difficulty urinating.Dizziness, fainting, unusual thirst (dehydration) or other signs of low blood pressure.Nausea and vomiting.Signs of infection, such as fever or oozing and redness at the AV fistula or catheter site.Severe abdominal pain.Unusual bulge in the abdomen or groin (hernia).A note from Cleveland ClinicDialysis is a lifesaving treatment for people with kidney failure or end-stage renal disease (ESRD). You may stay on dialysis indefinitely or just until you can get a kidney transplant. There are different types of dialysis. Some people prefer to do dialysis at home, while others want to go to a hospital or dialysis center. Your healthcare provider can review dialysis options with you to find the treatment that works best for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/18/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicChronic Kidney Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"