" Digoxin: What It Is & Normal Levels800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/DigoxinAdvertisementAdvertisementAdvertisementDigoxinDigoxin is a medicine that can help people with certain heart issues. However, reaching and staying at normal digoxin levels can be a challenge. Various factors affect how much of the drug your body absorbs and excretes. Digoxin levels that are too high can be life-threatening.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is digoxin?Digoxin is a medication you take once a day for certain heart issues if first-line (first-choice) drugs don’t work or if you need additional medications. Healthcare providers prescribe other medicines first because too much digoxin can lead to dangerous and sometimes fatal arrhythmias. A toxic amount of digoxin isn’t much more than the amount that helps.Digoxin, which comes from the foxglove plant, is a type of cardiac glycoside.It treats several heart conditions, including:Heart failure.Atrial flutter.Atrial fibrillation (Afib).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat does digoxin do?Digoxin can:Help your heart muscle pump with more force.Slow down your heart rate.How does digoxin work?Digoxin restricts an enzyme that controls how much sodium and potassium go in and out of your heart. This allows sodium and eventually calcium to build up, which helps your heart pump more blood.Digoxin also makes electrical signals move more slowly in your atrioventricular (AV) node. Your AV node plays a role in telling your heart when to beat. Slowing down these signals brings down your heart rate.Care at Cleveland ClinicCardiology CareMake an AppointmentAdvertisementRisks / BenefitsWhat are the potential benefits of digoxin?Digoxin can:Cut down on hospital admissions.Help people with heart failure symptoms.Improve quality of life for people with heart failure.Slow down heart rates in people with certain arrhythmias such as atrial fibrillation.What are the risks or complications of digoxin?Side effects of digoxin may include:Upset stomach.Yellow, green or blurry vision.Dizziness.Lightheadedness.Sleepiness.Headache.Rash.Atrial tachycardia.Heart block, which is an abnormally slow heart rate.Enlarged male breast tissue (gynecomastia).AdvertisementWhat do digoxin levels indicate?Digoxin levels indicate that you have enough medicine in your system to help your heart issue but not so much that it’s harmful to you.Certain foods or drugs may affect how much digoxin your body absorbs.These foods or drugs include:Fiber supplements or foods with a lot of fiber.Drugs to treat infections (macrolides).Metoclopramide, an anti-nausea drug.Antacids.Certain medicines that lower cholesterol.If you take or eat any of these, you may need to allow time between eating or taking them and taking digoxin. Ask your provider if you’re not sure what’s safe to take with digoxin.Your kidney function also affects your digoxin levels, so if you have kidney disease, it’s important to talk to your provider to make sure you’re on the right dose.When should digoxin levels be checked?A provider will check your digoxin level a week after you start taking the medicine. They’ll check your blood six to eight hours after your last dose. You’ll need to have a provider check your digoxin level regularly. They’ll tell you how often you need to do this.What is a normal digoxin level?Providers recommend a normal digoxin level range of 0.5 to 2 ng/mL (nanograms per milliliter). A nanogram is one billionth of a gram.What happens if my digoxin level is high?A high digoxin level can lead to toxicity and then an abnormal heart rhythm. This can be fatal. You may also get a high potassium level (hyperkalemia) from an overdose.If you have digoxin toxicity, you’ll need to get fluids (through an IV) and electrolytes. A provider can give you digoxin immune fab to reverse digoxin’s effects if you have an overdose of digoxin.About 4% to 5% of people taking digoxin have toxicity. Toxicity is fatal for 9% of people who have it.What indicates digoxin toxicity?Digoxin levels may be too high if they’re above 2.0 ng/mL. An electrocardiogram (EKG), which tracks your heart’s activity, can also help your provider know if you have too much digoxin in your blood based on changes that occur when digoxin levels are high.How digoxin toxicity occursSome people can have digoxin toxicity at levels lower than 2.0 ng/mL if they have:Kidneys that aren’t working well.Low body weight.Low potassium (hypokalemia).Even if you don’t have kidney disease, your age can affect how quickly you can clear digoxin out of your body. Your glomerular filtration rate (the amount of blood your kidneys can filter) drops 25% to 50% between the ages of 20 and 90. This is why older people can’t get rid of the medicine as quickly as younger people. The older you get, the harder it is to move the medicine out of your body.Certain heart medications and antibiotics also affect how well you can clear digoxin from your body. This means they may cause you to have a higher concentration of digoxin in your body. If you’re taking these drugs, your provider may need to decrease your digoxin dose by 50%.Recovery and OutlookHow long will it take for me to feel better?Allow a few weeks or months for digoxin to help your heart failure symptoms feel better.Digoxin toxicity that requires hospitalization can improve rapidly with medication.Is there anything I can do to make digoxin treatment easier on me?Several factors (like age, kidney function and other medicines) can cause you to have too much digoxin in your system. This is why you need to manage the things you can modify to keep your digoxin levels normal.Follow your healthcare provider’s instructions about how much digoxin to take and when.Go to your appointments to have a provider check your digoxin level.Check with your provider before taking other medicines, including over-the-counter (OTC) drugs.When to Call the DoctorWhen should I call my healthcare provider?Contact your healthcare provider right away if you:Have trouble breathing.Don’t feel like eating.Are throwing up or have diarrhea.Have swelling in your hands or feet.Have changes in your vision.A note from Cleveland ClinicTaking digoxin safely can be tricky. Make sure you understand your provider’s instructions about how much digoxin to take. It’s important to have a safe digoxin level in your body so the medicine can help you without harming you. Your provider prescribed digoxin so it can help you. Let them know if you’re having issues with the medicine.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/14/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicCardiology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"