"Dilation and Curettage (D&C): Treatment, Risks, Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Dilation and Curettage (D & C)AdvertisementAdvertisementAdvertisementDilation and Curettage (D & C)Dilation and curettage, often called a D&C, is a minor surgical procedure done to remove tissue from a person's uterus.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewFemale Pelvic AnatomyWhat is dilation and curettage (D&C?)A D&C is a minor surgical procedure to remove tissue from your uterus. A gynecologist or obstetrician performs this surgery in their office or a surgery center. It’s usually an outpatient procedure, so you go home the same day.A D&C gets its name from:Dilation of the cervix: Your provider dilates, or opens, your cervix. Your cervix is the opening of your uterus, where it meets the top of your vagina. Usually, your cervix only dilates during childbirth.Curette: The provider uses this thin instrument to scrape your uterine wall and remove tissue.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs a dilation and curettage (D&C?)You may need a D&C if you have or had:A miscarriage.Leftover tissue in your uterus after an abortion.Unexplained bleeding between menstrual periods.Sometimes, you have a D&C and hysteroscopy. During this procedure, your provider inserts a device into your cervix to see the inside of your uterus. You may have a hysteroscopy with a D&C if your provider is trying to diagnose a problem.Procedure DetailsWhat happens before a dilation and curettage (D&C)?Occasionally, before beginning the D&C, your provider may begin to dilate your cervix using a laminaria stick. They insert this thin rod into your cervix and leave it there for several hours. You can get up and walk around while the laminaria stick is inside. The laminaria stick absorbs fluid from your cervix. When that happens, your cervix opens and gives access to your uterus.AdvertisementWhat happens during a dilation and curettage (D&C)?Before the procedure, your provider will give you medicine to make you comfortable. You may have general anesthesia, where you’re asleep for the procedure. Or your provider may give you medication to relax and sedate you, but you remain awake for the procedure. Your provider will recommend the best anesthesia option for you.During the procedure, you lie on a table with your feet in stirrups, like during a gynecologic exam. Your provider will:Insert a speculum into your vagina. This smooth device, shaped like a duck’s bill, helps open your cervix.Use a clamp to hold your cervix in place.Make sure your cervix is sufficiently dilated, using a series of rods to open it slowly.Use a curette, a type of suction or scraping device, to clean out tissue from your uterus.Send a sample of the tissue to a laboratory for analysis.How long does a dilation and curettage (D&C) take?The procedure itself takes about five to 10 minutes. But the process may be longer. And you’ll need to wait in the recovery room for a few hours after the procedure before you go home.AdvertisementDoes a dilation and curettage (D&C) hurt?You may feel cramps similar to menstrual cramps. Over-the-counter pain medication can relieve the cramps.Care at Cleveland ClinicRetained Products of Conception TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of a dilation and curettage (D&C)?A D&C can help your provider figure out why you have abnormal bleeding. It can also help detect abnormal endometrial cells, which may be a sign of uterine cancer. After a D&C, your provider sends the sample of cells to a laboratory where pathologists can identify if you have normal or abnormal tissue, polyps or cancer.A D&C may also be important for your health after a miscarriage or abortion. It removes any leftover tissue to prevent heavy bleeding and infection.What are the risks of a dilation and curettage (D&C)?A D&C is a safe, routine procedure. But like any surgery, it has some risks. D&C risks include:Uterine perforation (a small tear in your uterus), which may happen if the tip of the curette passes through your uterine wall.Uterine infection.Uterine bleeding.In rare cases, if you had a D&C after a miscarriage, you may develop Asherman’s syndrome. This condition occurs when adhesions, or bands of scar tissue, form in your uterus. In Asherman’s syndrome, scar tissue builds up between your uterine walls. The walls then stick together. This condition can cause infertility and change your menstrual flow. But providers can usually treat the adhesions with surgery.###Recovery and OutlookWhat’s the follow-up care for a dilation and curettage (D&C)?You’ll need someone to drive you home from the procedure. You can usually go home a few hours after a D&C. You might have mild pain or light bleeding for a few days. Use pads, not tampons, for the bleeding. Within a week, you should be able to get back to your regular activities. You usually return to your provider about a week or two after the procedure.Will a dilation and curettage (D&C) affect my menstrual cycle?After having a D&C, your next period may be early or late. You’ll need to avoid using tampons or having sex for a while after the procedure. Until your cervix returns to its normal, closed state, you’re at higher risk of bacteria entering your vagina and causing an infection. Your provider will tell you when you can resume having sex and using tampons.When to Call the DoctorWhen should I call my healthcare provider about a dilation and curettage (D&C)?Complications from a D&C are treatable when they’re diagnosed early. If you notice symptoms after a D&C, call your provider so they can diagnose and treat the problem. Symptoms may include:Abdominal (belly) pain.Fever.Heavy bleeding.Severe cramps.Unusual or bad-smelling discharge, the fluid that leaks from your vagina.Additional DetailsIf I had a miscarriage, do I need a dilation and curettage (D&C)?About half of women who miscarry don't need a D&C procedure. If the miscarriage occurs before 10 weeks of pregnancy, it'll most likely happen on its own and not cause any problems. After the 10th week of pregnancy, there’s a higher risk of having an incomplete miscarriage. In that case, you may need a D&C procedure to make sure your uterus is clean.You may be able to decide if you want to miscarry naturally or have a D&C procedure. Talk to your provider to decide what’s right for you.A note from Cleveland ClinicA D&C, or dilation and curettage, is a procedure to remove tissue from your uterus. Your healthcare provider can use a D&C and hysteroscopy to diagnose unexplained bleeding. So, it may help your provider find answers you've sought for a long time. Or it may be the last step after an incomplete miscarriage or abortion. If you had a miscarriage or have bleeding between your periods, talk to your healthcare provider to see if you need a D&C.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/15/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicRetained Products of Conception TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"