"Direct Thrombin Inhibitors800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Direct Thrombin InhibitorsAdvertisementAdvertisementAdvertisementDirect Thrombin InhibitorsDirect thrombin inhibitors provide another option for people who have blood clots or need to prevent them. These medications have predictable results and don’t require frequent blood clotting checks. But the IV forms don’t have an antidote. The pill type doesn’t stay in your body long, so you have to be sure not to miss doses.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat are direct thrombin inhibitors?Direct thrombin inhibitors are anticoagulants (“blood thinners”), which prevent blood clots. They use ingredients similar to a protein from a medicinal leech’s saliva, which some discontinued forms of the drug used.With heart disease as the world’s top cause of death, the need to prevent blood clots is as important as ever. When blood clots block blood flow to critical organs, heart attacks and strokes can happen. Researchers are always looking for better ways to protect people from these risks.What conditions are treated/managed with direct thrombin inhibitors?Direct thrombin inhibitors can treat or prevent:Acute coronary syndrome, an issue with blood flow to your heart stopping or slowing.Blood clots in your heart.Heparin-induced thrombocytopenia (HIT), a clotting issue.Venous thromboembolism (VTE), a blood clot in a vein.Blood clots or stroke in people who have atrial fibrillation (Afib) without heart valve issues.Blood clots after hip replacement surgery.Deep vein thrombosis (DVT), a blood clot in your leg.Pulmonary embolism, a blood clot in your lung.You may also get a direct thrombin inhibitor when you have an angioplasty to open your coronary arteries.What drugs are direct thrombin inhibitors?Direct thrombin inhibitor drugs that healthcare providers currently use include:Argatroban (IV injection).Bivalirudin (IV injection).Dabigatran (pill form).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow do direct thrombin inhibitors work?Direct thrombin inhibitors attach to thrombin directly and inhibit it, or keep it from working, like their name says. Thrombin is an enzyme that plays a key role in clotting, so blocking it has a big impact. You can think of a direct thrombin inhibitor as someone who stands in the way of someone trying to make clots. Without thrombin being able to play its part in the process of making blood clots, the process fails.At times, people taking this medicine may bleed too much. You can reverse the effects of the oral (by mouth) anticoagulant, dabigatran, with a idarucizumab injection through an IV (intravenous, or through your vein).Direct thrombin inhibitors you get through an IV don’t have an antidote. But stopping an infusion limits the drug’s effects fairly quickly.How long will I need direct thrombin inhibitors?Some people only need to take direct thrombin inhibitors for a short time, like a month after a hip replacement. Others need to take them for a longer time — even indefinitely — because they have a high risk of blood clots.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentRisks / BenefitsWhat are the potential benefits of direct thrombin inhibitors?Direct thrombin inhibitors have these benefits:They provide more predictable results than heparin because they only attach to thrombin. This means you can take the same dose and expect the same results each time.They don’t cause thrombocytopenia (low levels of platelets, which are blood cells that help your blood clot).They don’t require frequent checking of how easily your blood clots (unlike some other anticoagulants).The pill type has lower bleeding rates and fewer drug interactions than warfarin (Coumadin® or Jantoven®).With doses once or twice a day, the pill type is convenient.They provide another option for people who can’t have heparin.How successful are direct thrombin inhibitors?Studies have found that direct thrombin inhibitors are as safe and work as well as traditional anticoagulants like warfarin or heparin, except in people who have certain valve conditions, including those with mechanical valves.But direct thrombin inhibitors don’t stay in your system as long as a traditional blood thinner. You may still have 50% of a warfarin dose in your body 20 to 60 hours after taking it. With dabigatran, you may have 50% of a dose in your body after only 12 to 14 hours.This is why it’s important that you don’t skip a dose. Missing a dose can leave you at risk of a blood clot.AdvertisementWhat are the risks or complications of direct thrombin inhibitors?Direct thrombin inhibitors’ side effects — some of which can be serious — include:Bleeding complications.Dyspepsia (indigestion).Belly pain.Urine (pee) that’s brown or pink.Headache.Hypotension (low blood pressure).Chest pain.Dizziness.Shortness of breath.Fever.Sepsis (reaction to an infection).Cardiac arrest (your heart stops pumping).Recovery and OutlookHow long does it take for a direct thrombin inhibitor to work?Direct thrombin inhibitors you get through an IV start to work right away. The pill form starts to work in a few hours.AdvertisementWhen to Call the DoctorWhen should I call my healthcare provider?Contact your provider if you’re having side effects from taking direct thrombin inhibitors. You’ll need emergency treatment if you’re experiencing heavy bleeding or other serious issues.Additional Common QuestionsAre direct thrombin inhibitors the same as heparin?No, but both keep your blood from clotting too much. Heparin is an indirect thrombin inhibitor, which is a different kind of anticoagulant.A note from Cleveland ClinicIt can be scary to think about a blood clot keeping blood and oxygen from reaching your organs. But medicines like direct thrombin inhibitors can help bring down your risk of clots. There are different types of blood thinners. Direct thrombin inhibitors may or may not be a good fit for you. Talk with your healthcare provider about the best choice of anticoagulant for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/30/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"