"Diuretics: Types, Uses and Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/DiureticsAdvertisementAdvertisementAdvertisementDiureticsDiuretics, or water pills, help your kidneys put extra salt and water into your urine or pee. This is how diuretics clear extra fluid out and bring down your blood pressure. Diuretics also help when you have too much fluid collecting because of heart failure or other medical problems.ContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is a diuretic?Diuretics ― also known as water pills ― are medicines that help you move extra fluid and salt out of your body. They make you pee more frequently, which is why you should take them in the morning if you can. You may need to take diuretics once or twice a day at the same time each day.Types of diuretics include:Thiazide diuretics, such as hydrochlorothiazide (Microzide® or Oretic®) or chlorthalidone (Hygroton® or Thalitone®).What they do: They make your kidneys pull salt and extra water into your pee.Selected side effects:Headache.Loss of appetite.Hair loss.Loop diuretics, such as furosemide or bumetanide.What they do: They affect part of your kidneys (the loop of Henle) to get salt and excess water out of your body.Selected side effects:Dizziness.Diarrhea.Upset stomach.Potassium-sparing diuretics, such as triamterene or amiloride.What they do: They help your kidneys clear salt and water out of your body, but don’t let you lose too much potassium in the process.Selected side effects:Gas.Nausea.Headache.A mixture of two types in one pill, like triamterene and hydrochlorothiazide (Dyazide® or Maxzide®)What they do: They make your kidneys move salt and extra water out while keeping you from losing too much potassium.Selected side effects:Headache.Peeing often.People usually take diuretics by swallowing diuretic pills, but your provider can give some diuretics through an IV in your arm during a hospital stay. Most people can take diuretics without getting serious problems from them.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow do diuretics work?Diuretics make your kidneys take away your body’s extra salt and water by putting them into your urine (pee).Who needs diuretics?People who have high blood pressure or have too much fluid collecting in their bodies need diuretics.AdvertisementWhy do providers prescribe diuretics?Diuretics bring down blood pressure because they help your blood vessels get wider. Also, there’s a smaller amount of fluid in your blood to pump. Diuretics also help your body clear out extra fluids.What do diuretics treat?Diuretic medications can help with:High blood pressure.Heart failure.Cardiomyopathy.Pulmonary edema.Ascites.Renal failure.Nephrotic syndrome.Diabetes insipidus.High intraocular pressure.High intracranial pressure.AdvertisementHow common are diuretics?Diuretics are very common. A list of America’s most frequently prescribed drugs includes two diuretic drugs in the top 15.Risks / BenefitsWhat are the advantages of diuretics?Diuretics give many people ― even older adults ― good results, especially for treating high blood pressure. Also, people generally don’t have bad side effects with diuretics.What are the risks or complications of diuretics?Usual side effects of diuretics include:Peeing more than usual.Dizziness.Tiredness.Headache.Gout.Difficulty getting an erection.Low potassium (unless you’re taking a potassium-sparing type of diuretic).Muscle cramps.Heart palpitations.Higher blood sugar in people with diabetes.Dehydration.Unbalanced electrolytes.Your provider will want to make sure your kidneys are working right and your potassium level is normal when you’re taking diuretic pills. If you’re pregnant, breastfeeding, an older adult or have problems with your kidneys or liver, discuss the risks of diuretics with your provider.Recovery and OutlookHow quickly do diuretics work?Diuretics usually start working an hour or two after you take them.When to Call the DoctorWhen should I see my healthcare provider?Contact your provider when you:Aren’t following the instructions for taking diuretics.Have diuretic side effects that bother you.Additional Common QuestionsWhat are diuretics used for?Diuretics help your body dispose of extra fluid and salt. They also treat a variety of medical problems, such as heart failure and high blood pressure.Can diuretics cause dehydration?Yes, if you’re taking too high a dose of a diuretic or not drinking enough fluids, you can get dehydrated.Do diuretics make you pee?Yes, diuretics make you pee more frequently than you would if you weren’t taking a diuretic.Will diuretics cause constipation?Yes, diuretics can cause constipation if you don’t drink enough fluids.A note from Cleveland ClinicDiuretics can help you manage your high blood pressure and other conditions, but you need to take them the right way. Keep taking the same dose on schedule unless your provider tells you to change what you’re doing. If the diuretic you’re taking is giving you side effects, ask your provider if you can switch to a different diuretic.Care at Cleveland ClinicCardiology CareMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 10/01/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicCardiology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"