"Dix-Hallpike Maneuver: Test, Purpose & Results800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Dix-Hallpike ManeuverAdvertisementAdvertisementAdvertisementDix-Hallpike ManeuverThe Dix-Hallpike maneuver is a test that healthcare providers use to diagnose BPPV — a common type of vertigo. It consists of a series of movements you perform while your provider observes your response. The Hallpike test only takes a few minutes.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewProviders use the Dix-Hallpike maneuver to diagnose BPPV, a common type of vertigo.What is the Dix-Hallpike maneuver?The Dix-Hallpike maneuver is a test that healthcare providers use to diagnose benign paroxysmal positional vertigo (BPPV). BPPV is a common inner ear disorder that causes a sudden spinning sensation when you move your head into certain positions. It happens when tiny calcium carbonate crystals (called canaliths or otoconia) detach from the utricle in your inner ear and float into your semicircular canals instead. (Your semicircular canals are fluid-filled tubes that help with balance.)Since 1952, healthcare providers have used the Dix-Hallpike Maneuver to diagnose BPPV. It’s still the gold standard in use today.The name of this test comes from neurotologist Margaret Ruth Dix and surgeon Charles Skinner Hallpike, who published key research on vertigo and ways to diagnose and treat it. Other names for the Dix-Hallpike maneuver include Dix-Hallpike test and Hallpike test.Epley maneuver vs. Dix Hallpike test: How are they different?Both of these procedures help people with BPPV. The Dix-Hallpike test diagnoses the condition and the Epley maneuver treats it by encouraging the tiny calcium carbonate crystals to move back where they belong.The Epley maneuver is one of several canalith repositioning procedures. It only works for BPPV, though. So, it’s important that a healthcare provider diagnose the issue first, so they can treat it properly.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsDo I need to prepare for the Dix-Hallpike maneuver?No, there’s nothing you need to do to prepare for the Hallpike test. It only takes a few minutes to complete in your healthcare provider’s office.What happens during the Hallpike test?The Dix-Hallpike test involves a short series of movements. Here’s how it works, step-by-step:You’ll sit on an exam table with your head turned to one side and your legs stretched out in front of you.A healthcare provider will ask you to turn your head at a 45-degree angle, to either the right or left.At this point, they’ll ask you to keep your eyes open. (It’s important that they observe your eyes during the test.)They’ll gently hold your head and help you lean back with one ear pointing down toward the floor. You’ll remain in this position for a minute or two. Your provider will support the weight of your head during this process.While you’re in this position, they’ll check your eyes for nystagmus (a condition that causes involuntary eye movement).If you have nystagmus, then it probably means you have BPPV. If you don’t have nystagmus, then your vertigo is likely the result of something else.How long does the Dix-Hallpike maneuver take?The Dix-Hallpike test only takes a few minutes. If you get inconclusive results, you may need to repeat the test — either with the same ear or with your other ear.AdvertisementWhat do my results mean?Your healthcare provider should be able to tell you results of the Hallpike test right away. Your results will be either positive or negative.Dix-Hallpike maneuver positiveA positive result means that your vertigo symptoms result from BPPV. If you get a positive result, your healthcare provider can perform the Epley maneuver to shift the calcium carbonate crystals out of your semicircular canals. They can usually do this during the same appointment.Dix-Hallpike maneuver negativeIf you get a negative result, it probably means there’s something else causing your vertigo symptoms, like an inner ear infection, migraine or vestibular neuritis (inflammation of the nerves in your inner ear).Your healthcare provider will likely run more tests to determine the cause of your symptoms.Care at Cleveland ClinicVertigo and Balance Disorders TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of the Dix-Hallpike maneuver?The Dix-Hallpike maneuver is a noninvasive diagnostic test. You don’t need to prepare, and it only takes a few minutes to complete.When performed properly, the Hallpike test can identify BPPV. Then, healthcare providers can treat the condition with the Epley maneuver, providing instant relief in many cases.AdvertisementWhat are the risks or complications of the Dix-Hallpike test?While the Dix-Hallpike test is generally safe, healthcare providers may choose not to perform the procedure on people with certain health conditions — particularly those with neck or back issues. They may also avoid performing it on pregnant people or those who’ve had a recent stroke.Your healthcare provider will review your health history in detail before performing the Dix-Hallpike test.Recovery and OutlookHow accurate is the Dix-Hallpike test?The Dix-Hallpike test has an accuracy rate of up to 88%. In some cases, healthcare providers may perform the Hallpike test in combination with other tests to diagnose BPPV.When to Call the DoctorWhen should I call my healthcare provider?You should tell a healthcare provider anytime you develop lingering BPPV symptoms, including dizziness, nausea or a spinning sensation. They can use the Dix-Hallpike test to determine if your symptoms result from BPPV or another health condition.A proper diagnosis is important because the Epley maneuver only works for BPPV — not for other types of vertigo.Additional DetailsCan I do the Dix-Hallpike maneuver at home?While your healthcare provider can show you how to treat BPPV at home with canalith repositioning procedures (like the Epley maneuver), only a provider should perform diagnostic tests like the Dix-Hallpike maneuver.A note from Cleveland ClinicHealthcare providers have been using the Dix-Hallpike maneuver to diagnose BPPV for over 70 years. It’s a quick, noninvasive and still one of the most accurate diagnostic tests available. The Dix-Hallpike maneuver can’t treat BPPV, but it can tell your provider whether you have BPPV so they can recommend appropriate treatment.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/30/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicVertigo and Balance Disorders TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"