"Donor Lymphocyte Infusion: Procedure, Purpose & Benefits800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Donor Lymphocyte InfusionAdvertisementAdvertisementAdvertisementDonor Lymphocyte InfusionDonor lymphocyte infusion is a procedure that transfers healthy white blood cells (lymphocytes) from your bone marrow or stem cell donor to your blood. An infusion of healthy lymphocytes helps your immune system get rid of remaining cancer cells if you have a relapse after a bone marrow or stem cell transplant for blood cancer.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is donor lymphocyte infusion?Donor lymphocyte infusion (DLI) is a procedure that transfers (infuses) healthy white blood cells from a donor to a recipient. Lymphocytes are cells that help your immune system fight cancer and infections.If you received donor blood or a bone marrow stem cell transplant to treat blood cancer, but then the cancer came back, donor lymphocyte infusion can help.What conditions do healthcare providers treat with donor lymphocyte infusion?Your healthcare provider might recommend donor lymphocyte infusion if you have a relapse after receiving donor blood or undergoing bone marrow stem cell transplantation.Healthcare providers use DLI to treat:Acute myeloid leukemia (AML).Chronic lymphocytic leukemia (CLL).Chronic myeloid leukemia (CML).Graft vs. host disease (GvHD).Multiple myeloma.Myelodysplasia (MDS).Non-Hodgkin lymphoma.Your provider may also recommend DLI if your bone marrow contains a mix of your cells and donated cells after transplant. This condition, known as mixed chimerism, can increase your risk of relapse. DLI helps make sure all of your bone marrow cells are from your donor. This maximizes the effectiveness of treatment.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow should I prepare for donor lymphocyte infusion?Your healthcare provider does a physical examination and talks with you about your symptoms. They may also run tests, which may include:Bone marrow biopsy.Complete blood count (CBC).Kidney function test.Liver function test.If you have a biopsy, a pathologist examines tissue samples to check if cancer cells remain. If you have a high level of cancer cells, you may need chemotherapy before the DLI procedure to reduce the amount of cancer.How are lymphocytes collected from the donor for DLI?The same person who donated their stem cells to you donates lymphocytes for DLI. A healthcare provider collects the lymphocytes from your donor’s blood. Sometimes, providers freeze the lymphocytes. (They may do this step when your donor initially donates stem cells.)To collect lymphocytes:A provider inserts a flexible tube (catheter) into a vein in your donor’s arm to remove blood.Blood travels through a machine that separates mononuclear cells (which contain the lymphocytes) in a process called apheresis.Blood flows from the machine to a catheter and back into a vein in your donor’s other arm.AdvertisementWhat happens during donor lymphocyte infusion?Here are the steps that occur during donor lymphocyte infusion:Your provider inserts a catheter into your arm or chest.Lymphocytes collected from your donor travel through the catheter into your blood.Your provider removes the catheter.If you have a central line (central venous catheter), your provider flushes the line or may remove the catheter.Donor lymphocyte infusion may cause graft vs. tumor effect (GvT). When GvT occurs, donated T-cells find and get rid of cancer cells that remain after bone marrow or stem cell transplant. GvT is a sign that the donor’s immune system is fighting against the blood cancer.How long does donor lymphocyte infusion take?It typically takes up to 30 minutes to receive your lymphocyte infusion. You may have several doses over a few weeks or months.Care at Cleveland ClinicBlood and Marrow Transplant and Cellular TherapiesFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of donor lymphocyte infusion?For years, if people had a relapse after bone marrow transplant (BMT), the only option was another bone marrow transplant. But a second BMT often comes with higher risks of complications. DLI can help cancer go into remission (when you don’t have blood cancer symptoms) — and it can do it without using drugs that suppress your immune system.AdvertisementWhat are the risks or complications?Your healthcare provider will watch for potential side effects from DLI. If they preserved the donor lymphocytes in dimethyl sulfoxide (DMSO), you might have a reaction to the preservative or notice a strange smell.DLI can also cause some complications. You may develop graft vs. host disease (GvHD). When this happens, the immune cells from the donor (graft) see the cells in your body (host) as a threat and attack them. Symptoms of GvHD include:Diarrhea.Jaundice.Nausea and vomiting.Skin rash.Other risks of DLI include myelosuppression (bone marrow suppression). This condition can cause low blood cell count (anemia, leukopenia and low platelets). Leukopenia makes you more vulnerable to infections. Anemia may make you feel more tired and short of breath. Low platelets may result in bleeding.How do providers treat DLI complications?If you develop GvHD, your healthcare provider may prescribe immunosuppressants. These medications help keep the donated lymphocytes from attacking your cells.Leukopenia often gets better without treatment. If it doesn’t, your provider may recommend medications that stimulate the production of new white blood cells. Your provider can treat anemia and low platelets with transfusions. If your blood counts don’t recover, your provider may recommend another injection of donor blood stem cells to boost your blood counts.Recovery and OutlookWhat is the recovery time after donor lymphocyte infusion?Talk to your healthcare provider about when you can resume normal routines after DLI. You’ll have follow-up appointments and blood tests to track your response to DLI. Your provider also checks for symptoms of graft vs. host disease.Will donor lymphocyte infusion help me?The donor lymphocyte infusion success rate varies depending on your health situation. Factors that affect the success of DLI include:How advanced the cancer is (cancer stage).Immune system health.Transplant type.Whether you have chemotherapy before DLI.When to Call the DoctorWhen should I call my healthcare provider after DLI?Call your provider if you develop fevers, bleeding, shortness of breath or any symptoms of graft vs. host disease.Additional Common QuestionsIs donor lymphocyte infusion immunotherapy?Donor lymphocyte infusion is a type of immunotherapy. During DLI, you receive an infusion of healthy T-cells from your donor. The healthy T-cells attack cancer cells left behind after bone marrow or stem cell transplant.A note from Cleveland ClinicYou hoped cancer treatments were over after your stem cell transplant, but now you’re facing the news that cancer has returned. If you have a relapse after treatment for blood cancer, there is hope. An infusion of new healthy white blood cells may help. Lymphocytes from your stem cell donor may help strengthen your immune system and get rid of any remaining cancer cells after transplant.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/17/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicBlood and Marrow Transplant and Cellular TherapiesFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"