"Double Chin Surgery: Procedure, Risks800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Double Chin SurgeryAdvertisementAdvertisementAdvertisementDouble Chin SurgeryDouble chin surgery, such as a chin tuck, neck lift or chin liposuction, may help you look younger or thinner. The procedures can shape the area, remove excess fat and smooth the skin. But the surgeries come with certain risks. Talk to your healthcare provider or consult a plastic surgeon to see if you’re a good candidate.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is double chin surgery?Surgery for a double chin is a procedure to remove loose skin and extra fat in the neck area. A plastic surgeon may use one of several types of surgeries, or a combination, depending on your goals:Chin liposuction (lipo): Liposuction sucks excess fat out from under the skin.Chin tuck (submentoplasty): A chin tuck focuses only on the chin and upper neck. It tightens the skin and removes extra fat.Neck lift (lower rhytidectomy): A neck lift is more extensive than a chin tuck. It removes excess skin and tightens the muscles. It covers the chin and the entire neck area.Kybella® injections: An injectable medication. If there isn’t excessive fat and skin laxity, Kybella injections may be an option. This medicine helps lead to a breakdown of fat, and the by-products are eventually eliminated.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy do people have a neck lift or chin tuck?Getting older or losing weight may give the chin and neck a saggy, loose, wrinkled appearance. Some people may also inherit the look of loose skin around the chin and neck.Cosmetic surgery on the chin and neck can:Eliminate a double chin.Help you look thinner or younger.Reduce wrinkles.Remove saggy skin.How commonly is surgery for a double chin performed?Plastic surgeons perform more than 50,000 of these procedures in the United States per year.AdvertisementHow much does a neck lift or chin tuck cost?Cosmetic surgery on the chin and neck ranges from about $1,200 to $12,000, depending on:Anesthesia used.Facility where the surgery is performed.Surgeon’s experience.Type of procedure.Most health insurance companies don’t cover cosmetic surgery of the neck or chin.Procedure DetailsWhat happens before double chin removal surgery?Before you have cosmetic surgery to remove a double chin, you’ll meet with a plastic surgeon. You and the surgeon will discuss:Your goals.Your medical history, including health conditions, allergies and previous surgeries.Any medications you’re taking, including vitamins and over-the-counter drugs.Use of alcohol, tobacco or illegal drugs.The surgeon will also:Examine and measure your face and neck.Draw on the area with a marker or pen.Take pictures of your face and neck.Discuss your options for cosmetic surgery and make recommendations.Review your options for anesthesia to control pain and tell you about any risks of surgery.If you are a good candidate for double chin surgery and decide to move forward, the surgeon’s team will ask you to sign a consent form. By signing it, you give permission to the surgeon to perform the procedure. You also agree that you understand the risks of the procedure and have realistic expectations.Before surgery, the plastic surgeon may ask you to:Get blood work or have a physical exam with your primary care provider.Stop smoking.Stop taking certain medications (for example, aspirin, NSAIDs and herbal supplements).AdvertisementWhat happens during double chin surgery?Most neck lifts and chin tucks take place in a surgeon’s office, surgical center or hospital. It can last 45 minutes to a few hours, depending on the type of procedure(s) being done.The surgical team will :Give you a hospital gown to wear.Position you on a surgical table.Administer anesthesia to control pain.Clean and prepare the skin in the surgical area.Mark the skin with a pen or marker.Make incisions (cuts) around the ear and hairline. Incisions for a neck lift are larger than for a chin tuck.Cut, reposition or shape tissue and excess fat to create the look you want.Tighten muscles by sewing them down.Trim extra skin.Suck out excess fat using liposuction.Close any incisions when the procedure is complete, using stitches or skin glue.Apply bandages and possibly a chin strap to support the skin as it heals.What happens after a double chin removal procedure?Most people who have cosmetic surgery on the chin and neck go home the same day. You should have someone drive you home and stay with you the first night.You may have a thin tube near one or more incisions to drain fluid and prevent swelling.Your surgical team will give you recovery instructions. They may ask you to:Avoid ice near the surgical area.Care for the drains and changing the bandages.Keep your head elevated above your heart.Move your neck as little as possible (for example, don’t pull clothes over your head or turn your head suddenly).Report any complications.Stay out of the sun.Use certain medications (for example, ointments or pills) to control pain or prevent infection.###Care at Cleveland ClinicPlastic Surgery CareMake an AppointmentRisks / BenefitsWhat are the advantages of surgery for a double chin?Many people who have this cosmetic surgery report:More defined, well-shaped chin and neck.Younger, thinner appearance.Smoother skin.What are the risks of double chin removal?Neck and chin plastic surgery is generally safe, but the procedures do come with certain risks:Asymmetry in the face (both sides don’t look the same).Bleeding or blood clots.Complications from anesthesia, such as nausea, vomiting or trouble waking up.Damage to nerves, blood vessels, muscles or organs.Hair loss near incisions.Hematoma (a pocket of blood under the skin), which may have to be drained.Incisions that don’t heal properly.Infection.Nerve injury that could cause weakness, numbness or changes in the way the skin feels.Pain or swelling that lasts longer than expected.Problems with the heart or lungs.Results you don’t like, which could require follow-up surgery.Scarring, rippling or discoloration of the skin.Skin irregularities and discoloration.Recovery and OutlookWhat is the recovery time after double chin surgery?After a chin tuck or neck lift, you’ll have some discomfort, swelling and bruising. Your skin may feel tight. These effects get better over time and last about two weeks.Incisions may take several months to heal fully. If you had drains near the incisions, the healthcare team will remove them a few days after the procedure.When can I go back to work and other normal activities?Most people can go back to work and other daily activities within a week or two. Recovery after a chin tuck is generally faster than with a neck lift. Your surgical team will give you instructions based on your surgery and recovery.When to Call the DoctorWhen should I call a healthcare provider after double chin removal surgery?Your surgical team will give you instructions on when to schedule follow-up appointments. But call your surgical team immediately if you have any of the following signs of infection:Bleeding, drainage, redness or swelling at the incision site.Chest pain.Dizziness.Fever higher than 100.5 degrees Fahrenheit.Severe pain not helped with medicine.Nausea or vomiting.A note from Cleveland ClinicIf you have a double chin, or your chin or neck is saggy, you might be considering cosmetic surgery. A plastic surgeon can shape the area, remove excess fat and smooth the skin. But chin tucks, neck lifts and chin liposuction are surgical procedures and come with certain risks. Talk to your healthcare provider about your options and whether you’re a good candidate for surgery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/29/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPlastic Surgery CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"