"Duodenal Switch Surgery: What it Is, Procedure & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Duodenal SwitchAdvertisementAdvertisementAdvertisementDuodenal SwitchThe duodenal switch is a weight-loss surgery designed to treat people who have severe obesity. It combines a sleeve gastrectomy with an intestinal bypass. The duodenal switch is the most complicated but also the most effective bariatric surgery. It’s especially effective against Type 2 diabetes.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewWhat is duodenal switch surgery?The duodenal switch is a weight-loss operation that modifies your stomach and your small intestine. It combines a gastrectomy (removal of part of your stomach) with an intestinal bypass, which makes the path your food takes through your intestines shorter. This restricts how much food your stomach can hold, and also how much nutrition your small intestine can absorb from your food. (This makes it a “malabsorptive” procedure). It also reduces the hunger hormones that your stomach and small intestine normally produce.There are currently two different forms of the duodenal switch in practice. The original form is called the biliopancreatic diversion with a duodenal switch (or sometimes, the gastric reduction duodenal switch). This is the version with the most history and research behind it. The newer version, the loop duodenal switch, was developed to simplify the procedure and reduce complications.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is it done?Your healthcare provider may recommend bariatric surgery if you have clinically severe obesity (class III), which means you're at high risk of or are already experiencing obesity-related diseases. These include metabolic syndromes such as high blood pressure, high cholesterol and high blood sugar, which are precursors to heart disease, kidney disease and diabetes. You may be diagnosed with class III obesity if you have a BMI of 40 or higher, or if you have a BMI of 35 and one of these related diseases.Your healthcare provider may recommend duodenal switch surgery if your obesity and related conditions are more severe. That may mean a BMI of 50 or higher, or a severe form of obesity-related disease. The duodenal switch has the most profound weight loss results of all bariatric procedures, and it dramatically improves metabolic syndromes such as Type 2 diabetes. It also has a higher rate of complications. But for people with more severe conditions, the benefits outweigh the risks.How does the duodenal switch compare with other common weight-loss surgeries?The duodenal switch is less commonly performed than other bariatric surgeries because it is more complicated and more extreme. It involves more cutting and stitching in your digestive system and takes out or bypasses more of your gastrointestinal tract than other procedures do. This makes it somewhat riskier for complications, both during the procedure and afterward. However, the duodenal switch is also the most effective weight-loss surgery method, with the most profound and lasting results.What is the difference between duodenal switch vs. gastric bypass surgery?The duodenal switch is similar to the Roux-en-Y gastric bypass. Both involve reducing your stomach (weight loss by restriction) and bypassing part of your small intestine (weight loss by malabsorption). In general, the duodenal switch leans more on malabsorption, while the Roux-en-Y gastric bypass leans more on restriction. The duodenal switch reduces the size of your stomach by about 60% to 70% (vs. 70% to 80% with the Roux-en-Y). But it also bypasses about 75% of the small intestine (vs. about 30% with the Roux-en-Y).What is the difference between the duodenal switch vs. the gastric sleeve?The duodenal switch is a two-part surgery that begins with a gastric sleeve. In fact, the sleeve gastrectomy was originally developed as the first part of the duodenal switch. The gastric sleeve procedure reduces the stomach to a small, tubular “sleeve,” about 75% of its original size. The second part of the duodenal switch goes a step further by bypassing much of the small intestine. This second part produces greater weight loss than the gastrectomy alone, but also more potential side effects.AdvertisementHow much weight can you lose with a duodenal switch?The average weight loss with a duodenal switch is 80% of excess weight over a two-year period. That’s well above the average weight loss from bariatric surgery overall, which is 50% to 60%. People who have duodenal switch surgery also maintain more weight loss over the long term. Studies show an average sustained weight loss of 70% of excess weight over ten years. That means that if you were 200 lbs. overweight, you would lose an average of 140 lbs., and keep it off.How effective is the duodenal switch?Duodenal switch surgery has a 90% success rate for weight loss. That means that 90% of people lose at least 50% of their excess weight. Most lose more. The surgery has a similar success rate for remission of related health conditions. As much as 90% of people with Type 2 diabetes are able to discontinue their medications after a duodenal switch. Because of its higher success rate, some people who fail to lose enough weight with other bariatric surgeries choose to have revision surgery with a duodenal switch.AdvertisementWhat obesity-related conditions can duodenal switch surgery help treat?Obesity raises the risk of disease in nearly every body system. Duodenal switch surgery helps reduce the risk and the effects of developing these diseases, including:Cardiovascular disease: hypertension, arterial disease, vascular disease, heart attack, stroke.Respiratory diseases: asthma, obstructive sleep apnea, obesity hypoventilation syndrome.Metabolic diseases: hyperlipidemia, insulin resistance and diabetes.Gastrointestinal diseases: nonalcoholic fatty liver disease, nonalcoholic steatohepatitis.Reproductive diseases: polycystic ovary syndrome, infertility.Musculoskeletal pain: back strain, weight-bearing osteoarthritis.Cancer: especially colorectal cancer and liver cancer.Procedure DetailsWhat happens before duodenal switch surgery?If your healthcare provider believes you are a good candidate for surgery, you will enter a screening process. This will likely involve:Standard medical testing to make sure you are in good condition for surgery.Screening for alcohol, tobacco and drug use and therapy to help you quit if necessary.Psychological screening or counseling to make sure you are mentally and emotionally prepared for the big life changes ahead and the discipline that your new digestive system will require.Demonstrating that you have tried and failed to lose weight by other means.Enrolling in a seminar on bariatric surgery to make sure you understand what’s involved.Once you’ve met these benchmarks and scheduled your surgery, your healthcare provider will put you on a preoperative diet for a couple of weeks. Losing a little weight before your procedure will make it safer.How is a duodenal switch done?Open vs. laparoscopic: Duodenal switch surgery can be done as a traditional open surgery or laparoscopic surgery. The laparoscopic method is less invasive, using narrow tools through small “keyhole” incisions instead of opening your abdominal cavity. Surgeons and patients often prefer to use minimally invasive surgery techniques, when possible, but some people may require open surgery to manage their conditions. Sometimes a surgery that begins as laparoscopically may need to convert to open surgery.Two steps: The duodenal switch is a two-step surgery that begins with a sleeve gastrectomy. Some people have the sleeve gastrectomy as a standalone procedure, but if you have it as part of a duodenal switch, your surgeon will remove slightly less of your stomach — about 65%. The next step in the process, the intestinal bypass, can be done in the same surgery or as a second surgery sometime later. Your surgeon may advise two separate surgeries if they believe this would be safer for you based on your conditions.Two methods: There are two methods to the duodenal switch: the original (biliopancreatic diversion) and the modified (loop) duodenal switch. The differences are in the second part of the surgery — the intestinal bypass. Both versions begin the bypass by dividing your small intestine near the top, in the section called the duodenum. Then they bring a lower section of your small intestine up to attach to the top, bypassing the middle. In this way, the duodenum is “switched” with a lower part of your small intestine.The original duodenal switch bypasses most of your small intestine — about 80-90%. This drastically reduces how much nutrition your small intestine can absorb from your food, leading to significant weight loss but also a high risk of malnutrition. The modified (loop) version bypasses only about 50-60% to reduce this risk. The other difference is that the original duodenal switch divides and reconnects your small intestine in two different places. The modified duodenal switch is simpler, with only one division and reconnection.What happens after duodenal switch surgery?You will have frequent follow-up appointments with your healthcare provider in the following year to two years, and periodic appointments for the rest of your life. The first two years will be your most dramatic weight-loss period. During this time, your provider will continuously monitor your progress and health. You’ll have regular blood checks for nutritional deficiencies for the rest of your life. You’ll also have to take daily nutritional supplements for life. This is essential to prevent malnutrition.Care at Cleveland ClinicSchedule Bariatric SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsIs duodenal switch surgery safe?The risks of duodenal switch surgery are similar to those of any other abdominal surgery. They include:Wound infection.Excessive bleeding.Reactions to anesthesia.Blood clots.Complications more specific to gastric bypass surgery can include:Hernias. Hernias occur when one of your organs pushes through a gap in your muscle wall.Small bowel obstruction. Scar tissue can cause narrowing or obstruction of your small intestine.Anastomotic leaks. The intestinal bypass involves surgically severing and reconnecting your small intestine (anastomosis). If the connection point leaks, it can lead to serious infection inside your abdominal cavity.These are rare. Minimally invasive techniques reduce these risks, and so does the modified version of the duodenal switch. The risk of death from duodenal switch surgery is a little over 1%.What are the advantages of the duodenal switch?Highest success rate of all bariatric surgeries with greatest overall weight loss.Improves hunger, metabolism, blood lipid and blood sugar levels long-term.Total remission of Type 2 diabetes.Slightly larger gastric sleeve than other procedures, allowing for slightly larger meals.Rarely causes dumping syndrome, so you don’t have to completely avoid sugar or fats.Longer life with significantly reduced risk of death by any cause.What are the possible long-term complications or side effects of duodenal switch surgery?Malnutrition. This is the most important risk of duodenal switch surgery. However, it is preventable and treatable as long as you and your healthcare provider stay attentive to the risk. Now that your small intestine will not be able to absorb as much nutrition from your food, you’ll have to take nutritional supplements daily. Your healthcare provider will also continue to test you periodically for nutritional deficiencies for the rest of your life. Deficiencies are possible even when you do take supplements, but as long as your healthcare provider catches them, they can treat them.Diarrhea. This is another side effect of malabsorption in your small intestine. Your small intestine won’t be able to digest your food as thoroughly as before or extract as much water. This can make for loose, smelly stools and gas. It can also make stools more frequent. Some people find that these side effects level out after their digestive systems adjust to the surgery.Bile reflux. Surgery that affects the pyloric valve, the opening between your stomach and your small intestine, can cause it to malfunction. If the pyloric valve doesn’t close properly, one possible result is bile reflux. That means the bile that your gallbladder sends to your small intestine to help digest food can backwash into your stomach. Bile reflux can erode your stomach lining, leading to gastritis and stomach ulcers. Bile reflux is more of a risk with the modified duodenal switch (although a low risk). The original is designed to prevent it.Gallstones. Rapid weight loss sends a large load of cholesterol to your liver to process. When your liver sends bile to your gallbladder, it carries extra cholesterol with it. This extra cholesterol can build up in your gallbladder, forming cholesterol gallstones. Gallstones don’t always cause problems, but they can be dangerous if they travel and get stuck in your bile ducts. Your healthcare provider may give you a prescription medication to prevent gallstones after surgery.Recovery and OutlookWhat is the recovery time from duodenal switch surgery?You’ll likely spend a few days recovering in the hospital, then a few weeks recovering at home before you feel ready to go back to work. During your recovery, your body will be going through huge changes, including rapid weight loss. You may have some temporary symptoms during this time, including:Fatigue.Nausea.Hormone swings.Mood shifts.Hair loss.Body aches.Feeling cold.You’ll also have strict dietary guidelines to follow during recovery, for what you eat as well as how you eat. This is to give your digestive system time to heal and adjust to the new changes. It may take one to two weeks to progress through each stage on your way back to a normal diet, including:Clear liquid diet.Full liquid diet.Pureed foods.Soft diet.What is the weight-loss timeline following duodenal switch surgery?Weight loss will vary from person to person, but there are some general trends. The most rapid weight loss happens in the first three months after surgery. During this time, you can expect to lose about 30% of your excess weight. Weight loss slows down a bit for the next three months after that. By the one-year mark, you may have lost 50% to 75% of your excess weight. Weight loss typically peaks between 12 and 18 months after surgery. It may be 75% to 85% of your excess weight.A note from Cleveland ClinicDuodenal switch surgery is a serious intervention for a serious condition. It makes dramatic changes to the way your digestive system works, but it also has dramatic results. The most significant risk of the surgery is the risk of nutritional deficiencies. But if you’re prepared to keep up with your supplements and regular testing for life, you and your healthcare provider can chart a course to prevent this. With effective and lasting weight loss, you’ll also be steering away from the risks of obesity-related diseases.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/06/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Bariatric SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"