"Gamma Knife Surgery: What it Treats, How Performed, Risks & Benefits800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Gamma Knife SurgeryAdvertisementAdvertisementAdvertisementGamma Knife SurgeryGamma Knife surgery is a painless computer-guided treatment that delivers highly focused radiation to tumors and lesions in the brain. Gamma Knife surgery is used to treat brain tumors, arteriovenous malformations, trigeminal neuralgia, acoustic neuroma and tremors.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorResourcesContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorResourcesOverviewGamma KnifeWhat is Gamma Knife® surgery?Gamma Knife® surgery is a treatment method that uses radiation and computer-guided planning to treat brain tumors, vascular malformations and other abnormalities in the brain. Despite its name, this procedure does not involve any incisions, not even a skin incision. The Gamma knife is actually a treatment that delivers beams of highly focused radiation. Some 192 \"beamlets\" of radiation converge and are precisely focused on the targeted area of brain, specifically in the shape of the tumor or lesion, while sparing the surrounding normal tissue.Gamma Knife surgery is a type of stereotactic radiosurgery. It's also known as Gamma Knife radiosurgery and Gamma Knife radiation.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat conditions does Gamma Knife surgery treat?Gamma Knife surgery can treat several brain disorders, including:Brain tumors (both cancer [malignant] and non-cancer [benign]): These tumors including brain metastases, pituitary adenomas, pinealomas, craniopharyngiomas, meningiomas, chordomas, chondrosarcomas and glial tumors.Acoustic neuroma (vestibular schwannomas): This is a non-cancerous tumor that develops around the balance and hearing nerves that connect the inner ear with the brain.Arteriovenous malformations (AVMs): This is an abnormal, snarled tangles of blood vessels.Tremors: Tremors due to conditions including essential tremor or Parkinson’s disease.Trigeminal neuralgia: This is an ongoing condition that affects a certain nerve in the face, causing extreme pain.Some types of epilepsy.The Gamma Knife may be helpful if you have a brain lesion or tumor that can’t be reached by traditional surgery techniques or if you’re unable to undergo surgery due to your condition or age. It can also be combined with traditional surgery to prevent tumor regrowth. The Gamma Knife is also used for some conditions that require urgent treatment.Procedure DetailsWhat happens before the Gamma Knife procedure?Medical reviewYour neurosurgeon gathers your medical history and perform a complete physical exam. You may undergo additional tests.Tell your provider if you have any of the following: heart pacemaker, aneurysm (brain) clip, implanted medication pump, implanted nerve stimulator, metal implants, metal from trauma, cochlear implant, spine stabilization hardware, severe lung disease, esophageal reflux or are unable to lay flat on your back for 30 to 60 minute periods.Tell your provider if you are sensitive to or are allergic to any medications, latex, tape, contrast dyes, iodine or general or local anesthetic agents.Eating, drinking, medicationDon’t eat or drink anything after midnight the evening before your procedure (for AVM procedures only).Take your morning medications with sips of water the morning of your treatment. Bring all prescribed and over-the-counter medications, including inhalers, with you.Hair prep, clothingWash your scalp the night before your Gamma Knife procedure. Wear your hair loose. Don’t use clips, pins or bands. Your head will not be shaved.On the day of the procedure, wear slip-on shoes; comfortable pants, slacks, skirt or shorts; and a button-up or zip-front shirt with loose-fitting or short sleeves. Don’t wear a shirt that must be put on/taken off over your head.DriverA family member or friend will need to bring you on the day of the procedure and drive you home after treatment. They don't necessarily need to stay during the procedure itself.AdvertisementHow is Gamma Knife surgery performed?Gamma Knife treatment involves several steps.The initial steps are different if the Gamma Knife system uses an external rigid head frame or uses a frameless mask. If using a head frame:First, a box-shaped head frame is positioned on your head. The head frame is made of aluminum and weighs less than two pounds. The head frame acts as a \"frame of reference\" in the planning of your treatment and is essential in keeping the target perfectly aligned during the precision treatment. Your neurosurgeon positions the frame.You’ll receive four injections of a local anesthetic, one on each side of your forehead and two in the back of your head. These are the areas where specials pins are placed to fasten the head frame to your skull. You may feel pressure as the pins are tightened, but this usually only lasts a few minutes. After the head frame is positioned, a radiation therapist will take measurements of your head. Typically an imaging scan, such as CT or MRI scan is performed with the head frame in place. These measurements and the scans are used for planning your treatment.Frameless Gamma Knife systems use a thermoplastic mask that is placed over your face. The mask is then secured to an existing frame on the Gamma Knife table. Your head is held completely still.These remaining steps are the same for both the frame-based and frameless systems.You may have an IV line inserted into your arm. This allows contrast agent (a type of dye) to be delivered for your computed tomography (CT) and/or magnetic resonance imaging (MRI) scan. These scans and dye determine the exact location, size and shape of the tumor or lesion to be treated. The scanning usually takes about 30 minutes to complete.The IV line can also be used to deliver a small amount of sedation to help you relax (if needed). Most patients are awake but under light sedation during the procedure. Under certain circumstances (usually children), general anesthesia is used.Based on the results of the scans and other information, your neurosurgeon, the radiation oncologist and other team members plan your treatment on a computer. They will decide the area(s) to treat, radiation dose and how to target the lesion for best results. You can remain in your room with family or friends during this time. Plan to spend several hours up to 12 hours at the treatment center. Your treatment team will give you a more accurate estimate based on your unique condition.Next, your treatment begins. Your head frame or frameless mask is secured to the framework of the Gamma Knife table you lie on so your head doesn’t move during treatment. The Gamma Knife table slowly moves into the Gamma Knife machine that delivers the radiation. The treatment team will be immediately outside the room while you receive your treatment, but you will constantly be observed by cameras and monitored. There is a microphone near your head so you will be able to easily talk with the staff during your treatment.Most treatments take 30 minutes to three hours (for the treatment itself), depending on the size, shape, and location of the lesion and number of radiation doses.After your treatment, the table moves out of the machine and the staff will enter the room. Your head frame/mask and IV are removed.Depending on the type and size of the tumor or lesion, more than one treatment session may be needed. Your neurosurgeon and/or radiation oncologist will review your treatment plan with you.How will I feel during the Gamma Knife procedure?The actual Gamma Knife treatment is painless. There is no heat or noise nor will you feel any discomfort during the treatment. You may listen to music or nap during the procedure.AdvertisementWhat happens after the Gamma Knife procedure?Your head frame is removed (if you had an external rigid head frame). The pin sites are cleaned with hydrogen peroxide and an antibiotic ointment and bandages are applied.If you experience a headache or nausea or vomiting, you’ll be given medication.Staff will review discharge instructions with you and your adult driver companion. You will be observed for 30 minutes to one hour before being discharged.Keep your head elevated on a couple of pillows for one week. This helps lessen swelling at the pin sites (if you’ve had the external head frame) and pressure within your head.You may wash your hair/scalp 48 hours after your surgery. This allows the pin sites to begin to heal and prevents infection from developing in the wounds.You may take non-aspirin pain medication such as ibuprofen (Advil®, Motrin®) or acetaminophen (Tylenol®) if you are having any discomfort.You may remove the bandages from the pin sites the morning after your procedure. Clean the sites twice a day with hydrogen peroxide or mild soap and water. You may then apply a small amount of antibiotic ointment such as neosporin or bacitracin to the pin sites for three to four days. Applying bandages over the pin sites for two to three days is sufficient.Care at Cleveland ClinicSchedule Gamma Knife SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the risks and/or side effects of Gamma Knife surgery?While risks related to the procedure are typically low, risks and/or side effects of Gamma Knife surgery may include:Swelling of the brain.Headache.Nausea and vomiting.Numbness/tingling sensation on the scalp at the pin placement sites.Hair loss (only occasionally if tumor is close to the scalp and hair follicles are irradiated).Seizures.Bleeding (brain hemorrhage).Feeling tired.What are the benefits of the Gamma Knife procedure compare with traditional surgery?There are many benefits of Gamma Knife surgery over traditional surgery. Gamma Knife surgery:Doesn’t require incisions or general anesthesia.Can target tumors/lesions deep in the brain that can’t be safely reached by traditional surgery.Can target multiple tumors/lesions at the same time.Avoids other risks and complications of surgery (such as bleeding and infection from incisions).Limits damage to the surrounding healthy tissue.Results in little to no post-treatment discomfort or pain.Is usually performed as an outpatient procedure (rarely requires an overnight stay).Allows return to usual activities in a day or two.Usually doesn’t require physical therapy or other rehabilitation.It’s covered by most insurance and Medicare (but always check with your insurance provider).Recovery and OutlookBenefits to Gamma KnifeWhat’s the outlook after undergoing the Gamma Knife procedure?The success of the Gamma Knife procedure depends on the size, location, type of lesion, your personal medical history, and other factors. Discuss your expectations and outlook with your neurosurgeon and your radiation oncologist before treatment.The goal of Gamma Knife surgery is for the radiation to stabilize, shrink or destroy the tumor or lesion. Depending on your condition, you may or may not need additional Gamma Knife treatment or traditional now-more-manageable surgery. You will have follow-up CT and/or MRI scans to check on treatment progress.It may take weeks, months, a year (or sometimes longer) to see the full effects of treatment. For example, pain relief if you have trigeminal neuralgia can occur anytime between one day and six months, with most people improving within one month. Cancerous tumors typically become stable or get smaller over a period of weeks to months. Many noncancerous tumors stop growing immediately (the main goal), but may not get smaller in size. Arteriovenous malformations may take two to three years to resolve after treatment.When to Call the DoctorWhen should I call the doctor after having the Gamma Knife procedure?Call if you feel or notice any of the following symptoms:The pin sites feel hot to the touch (if you’ve had the external head frame).A cloudy or foul smelling drainage is coming from the pin sites.You have a fever of 101 degrees F or higher.If you experience nausea, vomiting, severe headache, visual changes, difficulty speaking, a seizure, or any other symptom unusual for you, contact your physician immediately or go to the nearest emergency room.A note from Cleveland ClinicGamma knife is a highly effective treatment with minimal or no associated adverse effects. Because of its ability to stabilize or reduce the size of a tumor or lesion, often only one treatment is required; however, occasionally gamma knife can be repeated safely and successfully.ResourcesFor more information download our Gamma Knife Treatment Guide.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/16/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Gamma Knife SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementCancer Answer Line 866.223.8100Appointments & LocationsRequest an AppointmentSearch Clinical TrialsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"