"Gene Therapy Definition, Pros & Cons800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Gene TherapyAdvertisementAdvertisementAdvertisementGene TherapyGene therapy is an innovative approach to medicine that uses genetic material to prevent, treat and potentially even cure disease. In gene therapy, genetic material is delivered to your cells and changes how your cells produce proteins. While still in its earliest stages, gene therapy has the promise to be a life-changing medical treatment.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewWhat is gene therapy?Gene therapy is a medical approach that uses genetic material to prevent and treat disease. The technique allows healthcare providers to treat certain conditions by changing your genetic makeup instead of using traditional treatment methods like medication and surgery. In this way, providers can address the underlying cause of the disease or instruct your own body to mass-produce desirable medication or proteins.In gene therapy, genetic material is transferred to your cells. This genetic material then changes how your cells produce proteins. It can:Reduce levels of certain disease-causing proteins.Increase production of working proteins.Produce new or modified proteins within a cell.How can gene therapy help me?Your body’s genetic information is kept in chromosomes inside the nucleus of your cells. Each chromosome is made up of DNA that stores information to determine your unique traits. Specific sections of DNA are called genes. Genes provide instructions for how to make proteins. Proteins play an important role in how your body functions. A small change to the DNA within your genes can alter how proteins work.Gene variants (genetic changes) occur as cells age or after exposure to certain chemical or environmental factors. Cells often recognize these genetic changes and repair them. Other times, they can cause a disease or disorder and you‘ll need treatment. Your biological parents can also pass along these gene variants, causing disease from an early age. By using gene therapy, healthcare providers aim to address the underlying cause of disease. If genes are like the blueprint of your body, gene therapy can fill in missing parts or correct errors in the drawings.What is gene therapy used for?Most gene therapies are still in the clinical trial phase. Clinical trials play an important role in finding treatments that are safe and effective. Clinical trials are investigating gene therapy for the treatment of cancer, macular degeneration and other eye diseases, certain genetic conditions and HIV/AIDS.The U.S. Food and Drug Administration (FDA) has approved two gene therapies for use in the U.S.:Luxturna®: Approved in December 2017, Luxturna is a one-time treatment used to improve vision in people with genetic vision loss due to certain inherited retinal (eye) diseases.Zolgensma®: The FDA approved Zolgensma in May 2019 to treat spinal muscular atrophy in children younger than 2 years old.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow does gene therapy work?Gene therapy works by replacing or inactivating disease-causing genes. In some cases, gene therapy introduces new genes into your body to treat a specific disease.With gene therapy, healthcare providers deliver a healthy copy of a gene to cells inside your body. This healthy gene may replace a damaged (mutated) gene, inactivate a mutated gene or introduce an entirely new gene.Gene addition: Gene addition inserts a new copy of a gene into your cells. The working gene has instructions for the cell to produce more of the specific protein it needs. This method most often uses an adeno-associated virus (AAV) to carry the gene to the cells.Gene silencing: Gene silencing transfers genetic material that prevents the activity of a gene that’s already in a cell. This method decreases the amount of a specific protein the cell is making by targeting messenger RNA (mRNA).Gene editing: Gene editing modifies parts of your DNA by altering or deleting elements within your gene. Genetic material is delivered to edit or change pieces of DNA located within a cell, which corrects the protein that the DNA is producing. Gene editing uses technology like CRISPR/cas9.How is the genetic material delivered?The genetic material needs help getting where it needs to go, like being wrapped in a package with an address label. This package is known as a vector. Viruses are usually used as vectors because they’ve evolved to be very good at getting into cells. Scientists use the same ability to deliver the genetic material into your cells. Any disease-causing part of a virus is removed, allowing it to enter your cells without making you sick.There are two main ways to receive gene therapy: in vivo and ex vivo.In vivo: In vivo gene therapy means the gene is delivered directly into your body, like through an injection.Ex vivo: Ex vivo gene therapy removes your cells and delivers the gene to these cells outside your body. These modified cells are then returned to your body.Healthcare providers decide on the right approach based on the best way to target the specific disease.Care at Cleveland ClinicSchedule Genetic CounselingFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the pros and cons of gene therapy?The use of gene therapy comes with many benefits and risks.Benefits include:New, hopeful treatment options: Gene therapy provides hope for new treatments for diseases that currently don’t have many other options. Without treatment, many diseases and disorders lead to disability or premature death. With gene therapy, research shows that the progression of these conditions has slowed down or even stopped.Earlier treatment: If you receive gene therapy earlier in your treatment, it can prevent any damage before it occurs. Research is still underway to show to what extent gene therapy may reverse damage.Targets the underlying cause of disease: Gene therapy makes it possible to create treatments that can specifically target any of the genes in your body.Risks may include:Not guaranteed: Research into the science of gene therapy is only just beginning. These therapies can’t guarantee to cure your disease or provide beneficial results. There’s a chance the treatment won’t work or will have unexpected side effects.Complicated process: Delivering foreign material into your body can cause an immune response that may exclude you from future treatments or clinical trials.Unknown long-term effects: The use of gene therapy can produce both good and bad long-term effects that can last a lifetime. Because the science is so new, the effects are unknown.AdvertisementWhen to Call the DoctorWhen should I ask my healthcare provider about gene therapy?Researchers are investigating gene therapy to treat many different health conditions, including cancer, eye diseases, some genetic conditions and HIV/AIDS. If you’re interested in participating in a clinical trial involving gene therapy, speak with your provider. They can help determine whether gene therapy might treat your condition.A note from Cleveland ClinicThere are still many challenges to overcome for those seeking gene therapy as a potential treatment option. One challenge is time — it’s a lengthy process to test potential treatments in clinical trials and then undergo the FDA approval process. But advances in gene therapy research allow us to better understand how we could treat, and hopefully someday prevent, rare and debilitating diseases.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 12/04/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule Genetic CounselingFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementQuestions 216.444.2538Appointments & LocationsRequest an AppointmentFind a Primary Care ProviderFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"