"Genicular Nerve Block: What It Is, Procedure & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Genicular Nerve BlockAdvertisementAdvertisementAdvertisementGenicular Nerve BlockA genicular nerve block is an injection in your knee that can provide temporary pain relief. Healthcare providers use them for chronic knee pain and to manage pain after knee surgery. The results can vary from person to person. Some people experience pain relief, while others don’t.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewHealthcare providers can target many genicular nerves for a nerve block.What is a genicular nerve block?A genicular nerve block is an injection of medication close to certain nerves in your knee to provide temporary pain relief. Some injections provide prolonged pain relief. An injection of steroid medication combined with local anesthetic that may help with pain.Your knee joints function with the help of several branches of the following nerves:Femoral nerve.Common peroneal nerve.Saphenous nerve.Tibial nerve.Obturator nerve.These branches around your knee joint are known as genicular nerves. “Genicular” means “relating to the knee.” Genicular nerves provide sensory innervation to your knee and include the:Superolateral genicular nerve (SLGN).Superomedial genicular nerve (SMGN).Inferomedial genicular nerve (IMGN).Inferolateral genicular nerve (ILGN).Healthcare providers can safely target all of these nerves for a genicular nerve block except for the ILGN. This is because the ILGN is too close to your peroneal nerve.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is a genicular nerve block used for?A genicular nerve block has two main purposes:To alleviate chronic knee pain: If you have chronic knee pain that hasn’t responded to conservative treatments, like physical therapy, NSAIDs or steroid knee joint injections, your healthcare provider may recommend a genicular nerve block. It may provide pain relief. Chronic knee pain can have several possible causes, such as injury and knee osteoarthritis.To alleviate moderate to severe postoperative knee pain: If you’re having a knee surgery, such as a total knee arthroplasty (knee replacement), your anesthesiologist or surgeon may give you a genicular nerve block before the surgery to manage pain after the surgery. They use this in addition to general anesthesia and other peripheral nerve blocks.Procedure DetailsHow should I prepare for a genicular nerve block?You usually don’t have to do anything special to prepare for a genicular nerve block.In some cases, your healthcare provider may recommend sedation for the procedure. If you’re receiving sedation, you’ll need to fast for six to eight hours before it. You’ll also need someone else to drive you home after the procedure.In any case, your healthcare provider will let you know what to do. Be sure to follow their instructions. Don’t hesitate to ask questions.AdvertisementWhat happens during a genicular nerve block?Healthcare providers typically perform genicular nerve blocks for pain management in an outpatient setting. This means you’re not admitted to a hospital for the procedure and can go home shortly after it.In general, you can expect the following when you receive a genicular nerve block:You’ll lie on your back on a procedure table. A provider will put a small pillow under your affected knee to prop it up slightly.You may receive a mild sedative through an IV line in your arm to help you relax.The provider will clean the skin on your knee with an antiseptic solution. They’ll give you an injection of a local anesthetic to numb the area where you’ll receive the nerve block. You may still feel a pinch or some discomfort as the needle enters your skin.The provider may use imaging guidance, such as ultrasound or fluoroscopy, to locate the exact spot where the injection needs to go. They’ll then inject the medication as close to the affected nerve(s) as possible.After the procedure, you’ll rest until the medication takes effect.The procedure takes about five to 10 minutes to complete.What happens after a genicular nerve block?After the injection, you’ll rest for 15 to 30 minutes to let the medication take effect. A nurse will also observe you during this time to make sure you don’t have any unexpected side effects. You’ll then be able to go home.Care at Cleveland ClinicGet Orthopaedic CareMake an AppointmentAdvertisementRisks / BenefitsWhat are the benefits of a genicular nerve block?Potential benefits of a genicular nerve block include:Temporary or permanent pain relief, which may help you function better day to day.Temporary or permanent reduction of inflammation in the affected nerves, which may help them heal.Temporary pain relief after knee surgery.A pain relief option for people who can’t undergo knee surgery due to health issues.Some people may feel relief in a few hours, or it may take a couple of weeks for the steroid to take effect. It’s important to note that not everyone experiences pain relief from nerve blocks. You may need to try other treatment options if this is the case.If you experience effective pain relief following a genicular nerve block, your healthcare provider may recommend genicular nerve ablation (GNA) to treat your knee pain. GNAs typically provide pain relief for about 18 months.What are the risks or possible complications of a genicular nerve block?You may have some soreness and slight bruising at the site of the injection, but this is usually mild and should go away within a couple of days.Complications of genicular nerve blocks are rare. But, in general, risks and complications of nerve blocks include:Infection at the injection site.Bleeding at the injection site.Accidental delivery of the medication into your bloodstream.Accidental delivery of the medication into your knee joint.Accidental delivery of the medication to your common peroneal nerve, which could cause foot drop.Recovery and OutlookCan you walk after a genicular nerve block?Yes, you should be able to walk out of the room after the genicular nerve block injection. It’s a good idea to take it easy for the rest of the day, but you can return to your normal activities.How long does a genicular nerve block last?Pain relief from a genicular nerve block can vary significantly. It may last a few days, several weeks, months or even years. But, on average, it lasts about three months. Each person responds differently. Some people don’t experience any pain relief.When to Call the DoctorWhen should I call my healthcare provider?Contact your healthcare provider immediately if you experience any new symptoms or complications from the genicular nerve block, such as an infection or nerve issues like burning pain, weakness or tingling.A note from Cleveland ClinicGenicular nerve blocks can help treat chronic pain in your knee. But the results can vary considerably from person to person. If you’re feeling anxious about receiving a genicular nerve block injection, don’t hesitate to ask your healthcare provider about it and the procedure. They can answer any questions you may have.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/17/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Orthopaedic CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7243Questions 216.444.9134Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"