"Glaucoma Surgery: What To Expect & How To Prepare for Surgery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Glaucoma SurgeryAdvertisementAdvertisementAdvertisementGlaucoma SurgeryGlaucoma can damage your optic nerve and vision. Surgery may be an option to lower pressure and help you get off medication. There are laser and traditional procedures.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewWhat is glaucoma surgery?If you have glaucoma, your healthcare provider may recommend surgery as a way to treat or manage it. Glaucoma is a general term for disorders that damage your optic nerve.A glaucoma surgery aims to improve drainage of aqueous humor by doing one of two things: making it easier for the fluid to flow or reducing the amount of fluid your eyes produce.How common is this procedure?In the United States, about 2.7 million people have glaucoma, a number forecasted to rise to 4.2 million by 2030. Not everyone who has glaucoma will have surgery.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are types of glaucoma surgeries?There are laser surgeries typically performed in the office and incisional surgeries performed in the operating room. Incisional refers to surgeries that cut into your body parts. Your eye care provider will talk with you about whether surgery is a good idea for you and which type would be best.There are different types of glaucoma laser surgeries. They include:Laser trabeculoplasty.Laser peripheral iridotomy (LPI).Cyclophotocoagulation (CPC).Laser trabeculoplasty to treat glaucomaLaser trabeculoplasty is the most common surgery to treat glaucoma and is a short in-office procedure. There are two types: argon laser trabeculoplasty (ALT) and selective laser trabeculoplasty (SLT).Both lasers reduce eye pressure by targeting the blockage in the natural drainage system of the eye, also called the trabecular meshwork. ALT has been mostly replaced by the newer version, SLT, because it’s more selective or targeted and is repeatable, unlike ALT.Recent studies support the use of this laser treatment as first-line therapy in the treatment of open-angle glaucoma. Your provider may also suggest laser treatment in addition to medical therapy for glaucoma. Though this laser treatment can be successful in controlling eye pressure for many people with glaucoma, it isn’t suitable for people with certain types of glaucoma, including closed-angle glaucoma.Laser peripheral iridotomy to treat glaucomaLPI is a procedure that uses a laser to make a tiny hole in your iris that lets fluid move freely. The iris is the colored part of your eye. LPI works for people with closed-angle glaucoma. LPI can be a glaucoma treatment, but your provider may suggest it as a way to prevent closed-angle glaucoma if you have narrow angles in your eyes.Cyclophotocoagulation to treat glaucomaCyclophotocoagulation (CPC) treats glaucoma because it uses lasers to make the ciliary body produce less fluid. You may have this treatment if you already have low vision along with glaucoma.There are two types of CPC:Transscleral CPC: The surgeon applies the laser outside the eye to treat the ciliary body. There are two applicators. One applies continuous treatment for a set time and adjustable energy. A second applicator cycles with on and off settings of laser application. Your provider may suggest this for glaucoma that hasn’t responded well to other therapies.Endoscopic CPC: You may have this type of CPC while you’re having cataract surgery or if you’ve had cataract surgery.Incisional surgery to treat glaucomaThe traditional filtering surgery is a trabeculectomy. Your surgeon will create an opening into the white part of your eye (your sclera) and intentionally damage some of the trabecular meshwork. The opening lets fluid move freely and helps to bypass the natural drainage system of the eye to lower eye pressure.Another option is a tube shunt. Your surgeon will place a small tube into an opening made into the part of your eye where your cornea and your sclera come together. Your provider may suggest a shunt based on the severity of your disease and the type of glaucoma. Many factors go into deciding on treatments, and this requires a thoughtful discussion with your surgeon.More recently, surgeons can offer micro-invasive or minimally invasive glaucoma surgery (MIGS), a technology that features tiny instruments and devices. Incisions are smaller, recovery is typically faster and you may be able to have treatment earlier in the disease. If you have mild or moderate glaucoma, your provider may suggest that the surgeon perform a MIGS procedure at the same time as cataract surgery.Procedure DetailsHow should I prepare for glaucoma surgery?Before you have glaucoma surgery, your surgeon will meet with you. During this visit, they’ll:Do an eye examination with diagnostic testing.Talk with you about your expectations.Review your health history and the types of prescription and over-the-counter (OTC) medicines you take.Your surgeon will also give you a detailed list of pre-operative instructions. These can vary from person to person. In general, you’ll probably need to:Avoid nonsteroidal anti-inflammatory drugs (NSAIDs), aspirin or other blood thinners to reduce your risk of bleeding.Possibly arrange for a friend or family member to drive you to and from your appointment. You’ll need a driver if you’ll have sedatives or anesthesia.Be clear about what medications you can or can’t take before the procedure.Stop drinking or eating a certain number of hours before the surgery, depending mostly on the anesthesia you’ll get.AdvertisementWhat happens during glaucoma surgery?What happens depends on the type of surgery you’re having. Glaucoma surgeries are generally outpatient procedures, meaning you’ll come home the same day.Laser surgeries, except for the cyclophotocoagulation procedures, usually happen in the ophthalmologist’s office. Your surgeon will probably do CPC procedures in an operating room.For procedures your eye specialist performs, you’ll have local anesthesia, numbing eye drops and/or numbing injections for your eyes.If you have a trabeculectomy, tube shunt surgery, MIGS procedures or a CPC procedure, you’re likely to be in an operating room. You’ll probably need intravenous (IV) sedation or general anesthesia. With IV sedation, you’ll have minimal pain or discomfort, but you’ll be awake. You won’t be awake if you have general anesthesia.How long does glaucoma surgery take?Most laser procedures take only minutes. MIGS procedures vary in length, depending on the procedure and if your surgeon is doing cataract surgery at the same time. The time needed for MIGS procedures is usually less than traditional incisional surgeries, like trabeculectomy and tube shunts, which could take up to approximately one hour.What happens after glaucoma surgery?Your provider will check on your eyes after laser surgeries, especially your eye pressure.If you’ve had an in-office procedure with local anesthesia, you can leave and return to your day. If you have a procedure with anesthesia or sedation, you’ll need a driver to take you home.After most of these procedures, you’ll have to return to your provider for follow-up appointments to monitor your eye pressure and recovery.AdvertisementIs glaucoma surgery painful?Surgeons use numbing medications and anesthesia to make sure you won’t feel pain during the surgery. You may have some soreness and irritation after the procedure.Care at Cleveland ClinicGlaucoma TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat is the recovery time for glaucoma surgeries?The recovery time varies depending on the type of procedure you have.For some in-office procedures, you’ll only need a day to rest and then you can get back to your normal activities. For other surgeries, you may need to limit some activities, like heavy lifting, for up to a month.Typically, you’ll need eye drops and will get a schedule of upcoming appointments to monitor your vision and eye pressure.You may have a bandage over your eye that you’ll have to keep dry for a certain amount of time. You shouldn’t rub your eye until your surgeon tells you that it’s OK to do so.When to Call the DoctorWhen should I call my healthcare provider?Your surgeon will send you home with directions on when to call and when to see them for follow-up appointments. Typically, you should call your provider if you have:Severe pain.Vision loss.Worsening redness, tearing or discharge.A note from Cleveland ClinicIf you have glaucoma, your provider may suggest a procedure that will help drain aqueous fluid in your eye. They’ll work with you to decide which procedure will be best for managing your condition. Surgery may allow you to take less medicine and have fewer side effects. Contact your provider if you have any questions or concerns about your surgery.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/22/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGlaucoma TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2020Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"