"Glossectomy: Procedure Details & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/GlossectomyAdvertisementAdvertisementAdvertisementGlossectomyA glossectomy is the surgical removal of your tongue. The procedure is used to treat tongue cancer when other treatment methods haven’t been successful. Some people only need a portion of their tongue removed, while others need their entire tongue removed. In some cases, tissue is taken from other parts of your body to create a new tongue.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a glossectomy?A glossectomy refers to the surgical removal of your tongue. Some people only need a portion of their tongue removed (partial glossectomy). Others may need half of their tongue removed (hemiglossectomy). Sometimes, it’s necessary to remove the entire tongue (total glossectomy).Glossectomy is most often used to treat tongue cancer. In some cases, a glossectomy procedure can treat obstructive sleep apnea and macroglossia (an enlarged tongue).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens before a glossectomy?First, a healthcare provider will perform a physical examination. They’ll likely order imaging tests, like CT scans or MRI scans. They’ll also perform a biopsy of your tongue. During a biopsy, your healthcare provider takes a small sample of tissue and sends it to a pathology lab for analysis.Prior to your glossectomy procedure, your healthcare provider will give you a list of preoperative instructions. You should follow these guidelines closely.What happens during a glossectomy procedure?First, your provider will give you general anesthesia for your comfort during the procedure.If you’re having a partial glossectomy, your surgeon will remove the diseased portion of your tongue. Then, they’ll close the incision with sutures (stitches). Sometimes, your surgeon places a tissue graft to fill the hole left behind.If you’re having a hemiglossectomy, half of your tongue removed, you may also need a tracheostomy. Your provider will let you know if this is something you should prepare for.For a total glossectomy, your surgeon removes your entire tongue. They’ll reconstruct your tongue with tissue from somewhere else on your body. To ensure blood flow, your surgeon will connect any remaining blood vessels to the new piece of tissue.In some cases, your surgeon can create a new tongue. To do this, they’ll take a tissue graft from your forearm, chest or thigh. Your healthcare provider can talk to you about your options prior to your surgery.AdvertisementWhat happens after a glossectomy?Following glossectomy, most people need to stay in the hospital for about a week. During this time, your medical team will monitor your recovery.You’ll also meet with a speech and language pathologist. They’ll help you re-learn how to speak and swallow properly after your glossectomy.In some instances, your healthcare provider may recommend radiation therapy to kill any remaining cancer cells. This helps reduce the risk of recurrence (return).Care at Cleveland ClinicHead and Neck CancerFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of glossectomy?A glossectomy can effectively treat cancers of the tongue and is the primary treatment for mobile tongue cancer. (“Mobile tongue” refers to the part of your tongue that moves freely.)AdvertisementWhat are the risks of glossectomy?Like any surgical procedure, glossectomy carries certain risks. Possible complications include:Bleeding.Infection.Difficulty swallowing.Nerve injury or damage.Airway blockage due to swelling.Rejection of transplanted skin.Cancer recurrence (return).Recovery and OutlookWhat is the recovery time after glossectomy?After glossectomy surgery, length of recovery time is totally dependent on how much of your tongue your surgeon had to remove. Some people may be able to eat and drink normally after two weeks. People who have a total glossectomy may lose swallowing function. Your provider can tell you what to expect in your situation.You’ll still need to work with a speech and language pathologist following your glossectomy.Can you talk after a glossectomy?It depends on how much of your tongue your surgeon had to remove. People who’ve had a partial glossectomy may still be able to form most sounds and words. Those who’ve had a total glossectomy will need to use a pen and paper or technology (such as a tablet or computer) to communicate.Can you taste after a glossectomy?Research indicates that people who still have at least half of their tongue base have good taste sensation. However, if your surgeon had to remove over half of your tongue during glossectomy, you may have trouble distinguishing certain tastes (dysgeusia). It’s important to note, though, that some people who undergo total glossectomy can still taste and enjoy food.How does glossectomy affect speech?While glossectomy is certain to affect speech, the degree of language impairment varies depending on how much of your tongue your surgeon had to remove. But speech therapy plays a key role in developing language skills after glossectomy.One way that healthcare providers measure communication skills is through something called speech intelligibility. Speech intelligibility refers to how well others can understand a person when they’re speaking. Your speech and language pathologist will work with you to improve speech intelligibility after your glossectomy.One research study looked at speech intelligibility scores following glossectomy and how much these scores improved after speech therapy:Type of Glossectomy ProcedureSpeech Intelligibility Before Speech TherapySpeech Intelligibility After Speech TherapyPartial glossectomy6% to 24%24% to 46%Total glossectomy0% to 8%18% to 42%Type of Glossectomy ProcedureType of Glossectomy ProcedurePartial glossectomySpeech Intelligibility Before Speech Therapy6% to 24%Speech Intelligibility After Speech Therapy24% to 46%Total glossectomySpeech Intelligibility Before Speech Therapy0% to 8%Speech Intelligibility After Speech Therapy18% to 42%When to Call the DoctorWhen should I see my healthcare provider?If you’ve recently undergone a glossectomy, there are certain warning signs to watch for. Call your healthcare provider immediately if you develop:Heavy bleeding from your mouth.Swelling that gets worse after the first few days.The inability to eat or drink.Nausea or vomiting.Fever, chills or other signs of infection.Choking.Difficulty swallowing.Severe pain that doesn’t go away with medication.A note from Cleveland ClinicA glossectomy is the surgical removal of your tongue. The choice to undergo a glossectomy is an extremely personal one. Talk to your healthcare provider and make sure you understand all of your treatment options. Your medical team can give you additional resources that will help you weigh the pros and cons of this procedure. Recovery can be challenging, but a speech and language pathologist can help you re-learn how to speak, swallow and improve your overall quality of life.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/13/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicHead and Neck CancerFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"