"GLP-1 Agonists: What They Are, How They Work & Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/GLP-1 AgonistsAdvertisementAdvertisementAdvertisementGLP-1 AgonistsGLP-1 agonists are medications that help lower blood sugar levels and promote weight loss. There are many different types. And they’re just one part of your treatment plan if you have Type 2 diabetes or obesity. Your healthcare provider can help you decide if they’re right for you.ContentsArrow DownOverviewRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewRisks / BenefitsWhen to Call the DoctorOverviewWhat are GLP-1 agonists?GLP-1 agonists are a class of medications that mainly help manage blood sugar (glucose) levels in people with Type 2 diabetes. Some GLP-1 agonists can also help treat obesity.GLP-1 agonists are most often injectable medications, meaning you inject a liquid medication with a needle and syringe. You give the shots in the fatty tissue just under your skin (subcutaneous injection). Areas of your body you can give the injections include your belly, outer thighs, upper buttocks and the backs of your arms.Other names for this medication class include:Glucagon-like peptide-1 agonists.GLP-1 receptor agonists.Incretin mimetics.GLP-1 analogs.These medications are relatively new. The U.S. Food and Drug Administration (FDA) approved the first GLP-1 agonist (exenatide) in 2005. Researchers are still learning about their other potential uses and benefits.GLP-1 agonists alone can’t treat Type 2 diabetes or obesity. Both conditions require other treatment strategies, like lifestyle and dietary changes.List of GLP-1 agonistsGLP-1 agonist medications currently available on the U.S. market include:Dulaglutide (Trulicity®).Exenatide (Byetta®).Exenatide extended-release (Bydureon®).Liraglutide (Victoza®).Lixisenatide (Adlyxin®).Semaglutide injection (Ozempic®).Semaglutide tablets (Rybelsus®).There’s also a similar class of medications called dual GLP-1/GIP receptor agonists. There’s currently one of these medications on the market. It’s called tirzepatide (Mounjaro®).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow do GLP-1 agonists work?To understand how GLP-1 agonists work, it helps to understand how the naturally occurring GLP-1 hormone works.GLP-1 is a hormone that your small intestine makes. It has several roles, including:Triggering insulin release from your pancreas: Insulin is an essential hormone that allows your body to use the food you eat for energy. It lowers the amount of glucose (sugar) in your blood. If you don’t have enough insulin, your blood sugar increases, leading to diabetes.Blocking glucagon secretion: Glucagon is a hormone your body uses to raise your blood sugar levels when necessary. So, GLP-1 prevents more glucose from going into your bloodstream.Slowing stomach emptying: Slower digestion means that your body releases less glucose (sugar) from the food you eat into your bloodstream.Increasing how full you feel after eating (satiety): GLP-1 affects areas of your brain that processes hunger and satiety.GLP-1 agonist medications work by mimicking this hormone. In medication terms, an agonist is a manufactured substance that attaches to a cell receptor and causes the same action as the naturally occurring substance. In other words, GLP-1 medications bind to GLP receptors to trigger the effects (or roles) of the GLP-1 hormone. The higher the dose of the GLP-1 agonist, the more extreme the effects.If you have Type 2 diabetes, the medications help manage your blood sugar by triggering your pancreas to release more insulin. The slowed digestion also helps decrease blood sugar spikes.The satiety effect of GLP1-agonists reduces your food intake, appetite and hunger. These combined effects often result in weight loss.When would I need to take a GLP-1 agonist?Healthcare providers prescribe GLP-1 agonists for two conditions: Type 2 diabetes and obesity.GLP-1 agonists for Type 2 diabetesThe FDA approves the use of GLP-1 agonists to help manage Type 2 diabetes (T2D). This is because GlP-1 agonists help lower blood sugar levels.There are several other types of diabetes medications, like oral (taken by mouth) medications. One type of oral medication, metformin, is the go-to medication for treating T2D. But your healthcare provider may recommend a GLP-1 agonist if:Metformin isn’t helping manage T2D.It’s unsafe for you to take metformin (you have a contraindication).You have an A1C that’s higher than your target.You haven’t reached your target A1C within three months of treatment and you have additional conditions, like atherosclerosis, heart failure or chronic kidney disease.It’s important to remember that the most effective management of T2D involves several therapies, like:Lifestyle and diet modifications.Exercise.Medications.Together, you and your healthcare provider will determine a treatment plan that works best for you. Providers often prescribe GLP-1 agonists with other medications to achieve the best blood glucose management.Can I take a GLP-1 agonist if I have Type 1 diabetes?Researchers are currently studying the safety and effectiveness of GLP-1 agonists for people with Type 1 diabetes (T1D). So far, some studies show that these medications can help lower A1C and help with weight loss in people with T1D.The FDA hasn’t approved GLP-1 agonists for the treatment of T1D. But some healthcare providers prescribe it off-label. Talk to your provider to see if this is an option for you.GLP-1 agonists for obesityThe FDA currently approves the use of semaglutide and high-dose liraglutide to help treat obesity. This is because these GLP-1 agonists have weight loss effects. Obesity is a chronic condition in which you have a body mass index (BMI) of 30 or higher.Healthcare providers may also prescribe semaglutide or high-dose liraglutide for people who have overweight along with other health conditions if losing weight can help manage the coexisting conditions. Overweight is when you have a BMI of 25 to 29.9.Obesity is a complex condition. Effective management often requires several therapies, like:Dietary changes.Exercise.Medications.Behavior modification programs.Bariatric (weight loss) surgery.If you have obesity or overweight, talk to your healthcare provider to see if a GLP-1 agonist is right for you.Treatment DetailsAdvertisementHow often do you take GLP-1 agonists?Your healthcare provider will tell you when and how often to take your medication (usually injections). Be sure to follow their instructions.But, in general, the frequencies of the injections are:Dulaglutide: Once a week.Exenatide: Twice a day.Exenatide extended-release: Once a week.Liraglutide: Once a day.Lixisenatide: Once a day.Semaglutide: Once a week.Tirzepatide: Once a week.Semaglutide tablets are a daily medication.Risks / BenefitsWhat are the potential benefits of GLP-1 agonists?Other than lowering blood sugar levels and reducing weight, studies show that GLP-1 agonists may have other potential benefits, like:Lowering blood pressure.Improving lipid disorders.Improving fatty liver disease.Reducing your risk of heart disease and kidney disease.Delaying the progression of diabetes-related nephropathy.AdvertisementWhat are the side effects of GLP-1 agonists?The most common side effects of GLP-1 agonists include:Loss of appetite.Nausea.Vomiting.Diarrhea.These side effects are more likely to happen when you start the medication or if you’re taking an increased dose.Other side effects can include:Dizziness.Mild tachycardia (increased heart rate).Infections.Headaches.Indigestion (upset stomach).You may also have temporary mild itchiness and/or redness on your skin at the site of the injections.Severe — but rare — side effects can include:Pancreatitis.Medullary thyroid cancer.Acute (sudden) kidney injury.Worsening diabetes-related retinopathy.What are the risks or complications of GLP-1 agonists?GLP-1 agonists are generally safe. But there are a few risks to consider, including:Allergic reactions.Use during pregnancy.Low blood sugar (hypoglycemia).GLP-1 agonists and allergic reactionsSome people form antibodies to GLP-1 agonists, particularly with exenatide. This can cause issues with the effectiveness of the medication. But it can also cause allergic reactions at the injection site and potentially anaphylaxis, a severe allergic reaction.If you notice persistent itchiness, redness or other symptoms of an allergic reaction at injection sites, talk to your healthcare provider.If you have symptoms of anaphylaxis, call 911 or get to the nearest emergency room.Symptoms of anaphylaxis include:Shortness of breath or wheezing.Hives.Difficulty swallowing.Red rash.Abdominal (belly) pain.Chest tightness.A feeling of doom or dread.GLP-1 agonists and pregnancyGLP-1 agonists aren’t safe to take during pregnancy. Animal studies show that these medications cause developmental abnormalities in the fetus.If you’re able to become pregnant, you should use effective and reliable birth control while taking a GLP-1 agonist. If you become pregnant while taking the medication, see your healthcare provider immediately.GLP-1 agonists and hypoglycemiaThere’s a low risk of mild low blood sugar (hypoglycemia) episodes if you take a GLP-1 agonist. It can become a serious risk if you take GLP-1s with other medications that lower blood sugar, like sulfonylureas or insulin.Hypoglycemia is blood sugar that’s lower than 70 mg/dL. Without proper treatment, severe hypoglycemia can be life-threatening. Hypoglycemia symptoms include:Shaking or trembling.Sweating and chills.Dizziness or lightheadedness.Weakness.Faster heart rate.Intense hunger (hyperphagia).Difficulty thinking and concentrating.Pale skin (pallor).Nausea.To treat hypoglycemia, you need to consume sugar or carbohydrates, like half a banana or half a cup of apple juice.When to Call the DoctorWhen should I call my healthcare provider?You should have regular appointments with your healthcare provider when taking a GLP-1 agonist to assess how well it’s working.Otherwise, talk to your provider in the following situations:If you develop bothersome side effects.If you don’t think it’s working to manage your condition.If you’re thinking of stopping the medication.If you become pregnant or are thinking of becoming pregnant.A note from Cleveland ClinicThere’s no “best” way to manage Type 2 diabetes or obesity. Every person is unique and so is each treatment plan. But GLP-1 agonists may help. Talk to your healthcare provider to see if a GLP-1 agonist is right for you. They’re available to help.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/03/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6568Appointments & LocationsRequest an AppointmentVirtual Visits for DiabetesFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"