"Radioactive Iodine Therapy: What is it, Treatment, Side Effects800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Radioiodine (Radioactive Iodine) TherapyAdvertisementAdvertisementAdvertisementRadioiodine (Radioactive Iodine) TherapyRadioactive iodine (RAI) is treatment for overactive thyroid (hyperthyroidism) and certain types of thyroid cancer. The term “radioactive” may sound frightening, but it is a safe, generally well-tolerated, and reliable treatment that targets thyroid cells so there is little exposure to the rest of your body’s cells.ContentsArrow DownOverviewRisks / BenefitsContentsArrow DownOverviewRisks / BenefitsOverviewWhat is radioactive iodine (RAI) therapy?Radioactive iodine (RAI) can be used for the treatment of overactive thyroid (hyperthyroidism) and certain types of thyroid cancer. The term “radioactive” may sound frightening, but it is a safe, generally well-tolerated, and reliable treatment that targets thyroid cells so there is little exposure to the rest of your body’s cells.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow does radioactive iodine treat hyperthyroidism?Your thyroid, a butterfly-shaped gland located in the lower front of your neck, produces hormones that regulate your body’s metabolism and other functions. Hyperthyroidism speeds up the body’s processes causing nervousness and anxiety, rapid heartbeat, missed or light menstrual periods, sleep problems, hand tremors and other problems.The thyroid gland needs iodine to make these hormones. The thyroid is the most efficient organ at concentrating iodine. RAI treats hyperthyroidism by damaging or destroying thyroid cells through radiation.RAI is taken in an oral capsule form. You don’t need to be hospitalized unless the dose is very high, which is rarely needed. You will be prompted to drink lots of water after taking the pill to flush the remaining radioactive iodine out of your system.Most patients need only one dose before their hyperthyroidism is resolved, which may take a few weeks to several months. If your symptoms are still there after six months, you may have to receive a second dose.How does radioactive iodine treat thyroid cancer?The most common types of thyroid cancer (papillary and follicular) can usually be treated with large doses of radioactive iodine. (The dosages of RAI are much higher than with hyperthyroidism treatment.) The therapy is usually given after removal of the thyroid gland to destroy any remaining thyroid tissue.A “tracer” dose of radioactive iodine can also be used to track remaining thyroid tissue and/or cancer that could have spread to other parts of the body. These tests show if iodine concentrates in areas that contain thyroid cancer, and whether large amounts of RAI are needed to destroy the tumor implants.AdvertisementRisks / BenefitsWhat are the side effects of radioactive iodine?Permanent hypothyroidism (or underactive thyroid, when the thyroid does not produce enough hormones) is an expected side effect of RAI treatment for hyperthyroidism. Fortunately, hypothyroidism is much easier to treat than hyperthyroidism using hormone replacement therapy. This is a lifelong treatment that is safe, reliable and inexpensive.Temporary side effects of RAI may include:Neck tenderness and swelling.Nausea.Swollen salivary glands.Loss of taste or taste change.Dry mouth/insufficient salivary production.Dry eyes.Excessive tearing from the eyes.What precautions should be taken with radioactive iodine therapy?Women who are pregnant or nursing should not receive RAI therapy. Pregnancyshould be delayed at least six to 12 months after RAI treatment for thyroid cancer. Breast feeding should be stopped at least six weeks before RAI and should not be resumed.In the days immediately following your RAI therapy, be aware of these general precautions to prevent radioactive exposure to others. Your healthcare provider will give you specific instructions on how many days to follow these precautions, which will depend on the strength of your dose of RAI.  Avoid prolonged, close physical contact with others, especially children and pregnant women.For the first few days stay a distance of at least 6 feet away from others. Avoid public places.Sleep alone in a separate bed (at least 6 feet away from another adult).Do not share kitchen and cooking utensils, bedding, towels and personal items with others.Do dishwashing and laundering of the items you use separately.Wash your hands often and shower daily.Care at Cleveland ClinicThyroid Disorders TreatmentFind a Doctor and SpecialistsMake an AppointmentMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/08/2020.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicThyroid Disorders TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6568Appointments & LocationsRequest an AppointmentVirtual Visits for DiabetesFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"