"Radio Frequency (RF) Skin Tightening: Benefits & Dangers 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Radio Frequency (RF) Skin TighteningAdvertisementAdvertisementAdvertisementRadio Frequency (RF) Skin TighteningDuring radio frequency (RF) skin tightening, providers use an electromagnetic device that generates heat to stimulate the production of collage, elastin and new skin cells. This nonsurgical facelift firms and lifts sagging skin. The results are temporary, but they’re similar to a surgical facelift.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is radio frequency (RF) skin tightening?Radio frequency (RF) skin tightening is a nonsurgical skin treatment to firm sagging skin. The procedure can give you a more youthful appearance.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyHow does radio frequency skin tightening work?Radio frequency devices use safe levels of low-frequency electromagnetic waves to generate heat. This heat penetrates deep into your skin’s layers. There, it stimulates new skin cell production (regeneration). The treatment also stimulates the production of collagen and elastin. These proteins give skin cells more strength and flexibility. As a result, sagging skin regains its firm shape and feel.How common is radio frequency (RF) skin tightening?More than 188,000 Americans received some type of skin tightening procedure in 2020. This type of nonsurgical facelift works on all sexes and skin tones. And there’s very little risk of skin discoloration (hyperpigmentation). It’s most effective on younger people who are just starting to show signs of aging. It’s not as effective on severely sagging skin.AdvertisementWho gets radio frequency (RF) skin tightening?People who don’t want the extra expense, pain or recovery time of cosmetic surgeries may choose radio frequency skin tightening. The procedure:Improves skin tone, texture and firmness.Minimizes the appearance of sun damage.Provides a more youthful appearance.Reduces the effects of aging skin like wrinkles, fine lines and saggy skin.What does radio frequency (RF) skin tightening treat?Healthcare providers use radio frequency skin tightening treatments for:Body contouring.Face, neck, arms and hands.Vaginal rejuvenation.AdvertisementProcedure DetailsWho performs radio frequency skin tightening?Many providers perform radio frequency skin tightening procedures. These include dermatologists, plastic surgeons and cosmetic surgeons. You can also get the treatment at a medical spa (medspa or medispa) from a licensed aesthetician (skin care specialist).What happens before radio frequency skin tightening?During your consultation, your provider examines your skin and learns more about your treatment goals. They may take pictures so you can see before-and-after results. You should let your provider know if you have an active skin disease, are getting any skin treatments or are pregnant.What happens during radio frequency skin tightening?Radio frequency skin tightening is an outpatient procedure. It takes about one hour, depending on the treatment area. You go home soon after the procedure.During the procedure, your provider:Cleans and sterilizes your skin.Moves a hand-held radio frequency electrode device over the treatment area.The treatment area may feel warm. And you may experience tingling vibrations or mild discomfort. You should alert your provider if you feel an uncomfortable burning sensation.How long does radio frequency skin tightening take to work?It takes time for your skin to produce new skin cells, collagen and elastin. You should see changes to your skin tone and appearance within two to six months. If you don’t get the desired results, your provider may recommend another treatment. Some people need two to six treatments.How long does radio frequency skin tightening last?Your skin is always aging. But with proper skin care, the effects of radio frequency skin tightening may last for one to three years.Care at Cleveland ClinicGet Dermatology CareMake an AppointmentRisks / BenefitsWhat are the benefits of radio frequency skin tightening?Radio frequency skin tightening can give you the results of a facelift (rhytidectomy) without the need for surgery. Other benefits include:Gradual, natural-looking skin changes.Fast, relatively painless procedure.Less expensive and invasive than cosmetic surgeries.No peeling skin or scarring.Speedy recovery with no missed work or activities.What are the risks of radio frequency skin tightening?Radio frequency skin tightening is a relatively safe procedure. You may have some mild redness and swelling (edema) after the procedure. These side effects should go away within 24 hours.In rare instances, extreme heat from radio frequency treatments can cause burns. It’s important to choose a healthcare provider who has experience with radio frequency treatments. Your provider should only use radio frequency devices approved for use on the skin by the U.S. Food and Drug Administration (FDA). These devices have safety features that lower the risk of burns.Recovery and OutlookWhat is recovery like after radio frequency skin tightening?Depending on the size of the treatment area, your recovery should be easy. You may be able to return to work after the treatment and resume activities within a day. You can wear makeup immediately after the procedure.When to Call the DoctorWhen should I call the doctor?You should call your healthcare provider if you experience:Redness or swelling that lasts for several days.Skin rash or unexplained skin changes.Additional Common QuestionsCan you get other treatments at the same time as radio frequency skin tightening?Depending on your treatment goals, your healthcare provider may recommend getting other nonsurgical cosmetic procedures during the same appointment. These treatments include:Botulinum toxin injections (Botox®).Dermal fillers like jawline filler or dissolving lip filler.Microneedling.Do radio frequency skin procedures increase your risk of cancer?The World Health Organization (WHO) lists radio frequency waves as potentially carcinogenic. This means they might increase your risk of cancer. However, studies haven’t found a link between radio frequency waves and cancer in people.Microwave ovens, TVs, computers and smartphones use radio frequency waves. The radio frequency waves for cosmetic skin procedures are extremely low. At present, this skin treatment doesn’t appear to increase your risk of cancer.A note from Cleveland ClinicRadio frequency (RF) skin tightening can give you a more youthful appearance without the need for a surgical procedure like a facelift. Heat from a radio frequency device penetrates deep into your skin. It stimulates the production of collagen, elastin and new skin cells. The procedure firms sagging skin, making you look younger. Your healthcare provider can discuss the different nonsurgical and surgical cosmetic treatments that can help you get the results you seek.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/04/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Dermatology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"