"Reconstructive Surgery: What Is It & Different Types 800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Reconstructive SurgeryAdvertisementAdvertisementAdvertisementReconstructive SurgeryReconstructive surgery fixes defects you were born with, defects caused by disease and defects caused by injury. You may need, for example, a breast reconstruction after a mastectomy, or hand surgery to fix congenital webbed fingers. Reconstructive surgery is different from cosmetic because it’s for medical reasons.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is reconstructive surgery? Why is it done?Reconstructive surgery repairs parts of your body affected by defects you were born with, defects that have developed because of disease, or defects caused by an injury. Cleft lip and palate repair and breast reconstructions are examples of reconstructive surgery.The word “reconstructive” means to rebuild after something has been damaged or destroyed.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat are the different types of reconstructive surgery procedures?Some of the more common conditions addressed by reconstructive surgery include:Breast conditions:Breast reconstruction (typically after a full or partial mastectomy).Breast reduction (reduction mammoplasty). This might be needed if you experience discomfort, a rash underneath your breasts, or back pain. Note that whether a breast reconstruction is considered a cosmetic procedure or a reconstructive procedure depends on the amount of breast tissue removed. This depends on your health insurance’s guidelines and policies.Limb salvage:If you’re facing the amputation of a limb, reconstructive surgery may be able to help by using tissue to fill in space.Facial reconstruction:Facial reconstruction can be necessary after tumor resection or after a trauma.Jaw straightening is called an orthognathic surgery.Hand procedures to improve or fix the following (some surgeons specialize in the hand):Improve strength.Improve flexibility.Improve function.Fix webbed fingers.Fix carpal tunnel syndrome.Fix arthritis.Fix trauma.Other types of procedures include:Cleft lip and palate repair.Craniosynostosis surgery (head reshaping).Gender confirmation surgeries (transfeminine/transmasculine).Lymphedema treatment.Migraine surgery (chronic headache relief).Panniculectomy (body contouring).Septoplasty (deviated septum correction).This list is just a small percentage of procedures. Reconstructive surgery covers all sorts of trauma, cancers and problems caused by infections.How often is reconstructive surgery performed? How common is it?Nearly one million reconstructive surgery procedures are performed each year.AdvertisementAre these treatments inpatient or outpatient?It depends on what type of reconstructive surgery you’re having. For example, if your surgeon is reconstructing a nipple and areola, that’s an outpatient procedure. Larger, more complicated procedures may require you to spend a night or longer in the hospital.Reconstructive surgery is done at a clinic, surgery center, your healthcare provider’s office or at a hospital.What’s the difference between cosmetic surgery and reconstructive surgery?Cosmetic surgery is done to make you look and feel better – even better than “normal” (supranormal). It is not needed for medical reasons, unlike reconstructive surgery. Reconstructive surgery aims to restore normal form and function of tissue after it has been compromised by infection, trauma, cancer surgery, or for congenital reasons.Rhinoplasty (nose surgery) is an example of how it can get confusing to categorize a procedure as cosmetic surgery or reconstructive surgery. A rhinoplasty is performed to improve the nose’s appearance. With that in mind, it would seem like a cosmetic surgery. However, rhinoplasties are also performed to fix nasal the person’s breathing after their nose gets broken. That would be a reconstructive surgery.This is important to note because your insurance company might cover reconstructive surgeries, but not cosmetic.AdvertisementWhat’s the difference between plastic surgery and reconstructive surgery?Plastic surgery is the name of the field to which reconstructive procedures and cosmetic procedures belong. Reconstructive surgery is a type of plastic surgery.Procedure DetailsHow will the surgeon evaluate my case?Each person's unique situation will be evaluated on an individual basis. Your surgeon will take a detailed medical history and evaluate your case based on your desired results and medical necessity. That is, do you have a traumatic burn that affects underlying muscles and impacts your mobility? Have you had cancer and require surgery for multiple body parts? Your surgeon will evaluate the severity of your case and advise you on the available options. Together, the two of you can decide which surgical procedure best suits your needs and expectations.What happens before a breast reconstructive surgery?Some women get breast reconstruction surgery (to use that as an example of reconstructive surgery) following a surgery that was part of their cancer treatment (such as a mastectomy where one or both breasts are removed). This type of surgery rebuilds or creates a new breast mound, imitating the look and shape of your breast to make your chest look balanced, to help clothes fit better, to keep you from having to use an external prosthesis and restore a sense of self.Before the procedure your surgeon will likely warn you of the risks of breast reconstruction surgery. The surgeries are imperfect. Your breasts might not turn out the way you imagined them. You will also have scars.Rebuilt breasts have little feeling, or no feeling at all. However, new techniques are being developed to improve the sensation after mastectomy. Healing will take time.What happens in breast reconstructive surgery? How is the procedure performed?Breast reconstruction can be performed with breast implants or with your own tissues. When your own tissues are used this is called a “flap.” If you and your surgeon decide on a flap, many different areas of the body can be used to donate tissue to make new breasts such as the lower abdomen, thighs, buttocks and back. Using your own tissues requires a longer surgery and an inpatient hospital stay. However, your breasts will look more natural and will decrease the need for future surgeries.If you decide on implants, your recovery may be slightly faster and the procedure may be done on an outpatient basis, but you might need future surgeries to maintain the implant.How long does reconstructive surgery last?This also depends on the procedure. Some take a longer time, such as hours, while some are shorter, such as just one hour.What happens after breast reconstructive surgery?Immediately following the procedure you’ll be monitored as the anesthesia wears off. You’ll probably feel groggy and might need medicine for the pain.After the procedure you’ll have to be careful to take good care of the surgical sites. Be sure to attend all follow-up appointments with your surgeon and other healthcare providers.Care at Cleveland ClinicPlastic Surgery CareMake an AppointmentRisks / BenefitsWhat are the advantages of reconstructive surgery?Reconstructive surgery is a procedure that restores your body after an injury, after a disease, or it corrects defects you were born with. It not only restores your body, but your comfort and confidence.What are the risks or complications of reconstructive surgery?All surgeries come with risks. Common ones related to reconstructive surgery include:Problems with anesthesia.Bleeding.Blood clots.Infection.Healing problems.Fatigue (tiredness).Discuss any concerns about the risks with your healthcare providers.Recovery and OutlookHow effective is reconstructive surgery?Before you have any type of reconstructive surgery, be sure to clarify with your surgeon how effective the procedure will be. You don’t want to expect something and then not receive it.When can I go back to work/school?Depending on the type of reconstructive surgery, you may be able to return to work/school right away, or not for several weeks. Talk to your surgeon about a timeline.When to Call the DoctorWhen should I contact my healthcare provider?If you’ve undergone breast reconstruction, contact your surgeon immediately if you notice the following symptoms:New skin changes.Swelling.Lumps.Pain.Fluid leaking.Other reconstructive surgeries will have their own unique symptoms for you to keep an eye out for. Don’t hesitate to get in contact with your healthcare providers if you have any other symptoms that concern you.Don’t neglect the mental and emotional effects of reconstructive surgery. Surgery is stressful, recovery takes time and it can be difficult to adjust to your new body and how it looks. Get in touch with a therapist for counseling.Additional DetailsWill insurance cover reconstructive surgery?Unlike elective cosmetic procedures, insurance carriers do cover reconstructive surgery. To be safe, be sure to have your surgeon write a letter and take photos detailing your case.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 02/02/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPlastic Surgery CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"