"Rectocele Repair: Surgery, Complications & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Rectocele RepairAdvertisementAdvertisementAdvertisementRectocele RepairA rectocele is a bulge, or herniation, of the front wall of the rectum into the back of the vagina. Rectocele occurs as a result of thinning and weakening of the band of tissue that separates the vagina from the rectum. If it causes symptoms such as difficult bowel movements or discomfort, it needs to be repaired.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookAdditional DetailsOverviewWhat is a rectocele?A rectocele is a bulging of the front wall of the rectum into the back of the vagina. The bulge occurs as a result of thinning and weakening of the band of tissue that separates the vagina from the rectum. This thinning has a number of causes, including:Advanced age.Multiple vaginal childbirths or trauma during childbirth (for example, the use of forceps or the tearing of tissue during delivery).Repeated surgeries in the area of the pelvic floor or rectum.Chronic straining during bowel movements due to long-term constipation.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat symptoms would I have with a rectocele?Many women with a rectocele have no symptoms, and the condition is only seen in a pelvic examination. In general, if a rectocele isn’t causing you symptoms or discomfort, it can be left alone.When symptoms are present, you may have:Difficulty having bowel movements.A sense of bulging or fullness in your vagina.Problems with sexual intercourse.The need to manually reduce the bulge in your vagina to have a bowel movement.A rectocele should be treated only if your symptoms interfere with your quality of life.Procedure DetailsHow is a rectocele repaired?Both non-surgical and surgical options are used to treat a rectocele. You should have a thorough physical exam and talk with your provider before deciding on the best treatment.AdvertisementWhat are non-surgical repairs for a rectocele?Most symptoms of a rectocele can be kept under control without surgery. Strategies include:Avoid constipation by following a high-fiber diet (more than 25 grams of fiber per day) and drinking six to eight 10-ounce glasses of water per day.Avoid straining during bowel movements and long periods of sitting on the toilet.Use stool softeners if needed.Follow exercises designed to strengthen and retrain the muscles of the pelvic floor.Go to your provider to be fitted with a pessary, a device placed into the vagina to reduce the bulge.What types of surgical repairs are available for a rectocele?If non-surgical methods do not help control rectocele symptoms, surgery may be needed. Talking with a reconstructive surgeon who specializes in pelvic floor conditions can help women decide upon the best approach. In most cases, surgery is done under general anesthesia and takes about one hour.The most common surgical repair is a transvaginal rectocele repair, also called a posterior repair. The rectocele is reached through the vagina. It offers the chance to correct not only the rectocele but a thinned perineum and widened vaginal opening. It also has the advantage of not disturbing any tissue in the rectal area. This is the traditional approach to rectocele repair by urologists and gynecologists.A rectocele can also be repaired by a colorectal surgeon through a transanal repair. The rectocele is reached through the anus. This method is preferred by many colorectal surgeons because it allows for correction of problems in the anal or rectal area, in addition to repairing the rectocele.Other types of repairs or approaches may be used when additional procedures are required, such as for uterine or bladder prolapse (cystocele) or rectal prolapse through the anus.AdvertisementRisks / BenefitsWhat complications can occur after rectocele repair?Risks of surgical rectocele repair include the following:Bleeding.Infection.Pain during sexual intercourse.Development of a fistula (an open channel) between the vagina and rectum.Recurrence of the rectocele.Recovery and OutlookWhat is the long-term outlook following rectocele repair?The degree of success after rectocele repair depends on a number of factors, including:Type of symptoms present.Length of time the symptoms have been present.Surgical method and approach taken.Studies show about 75% to 90% of patients have significant improvement but this level of satisfaction decreases over time.Additional DetailsWhat are non-surgical repairs for a rectocele?Most symptoms of a rectocele can be kept under control without surgery. These methods include:Avoiding constipation by following a high-fiber diet (more than 25 grams of fiber per day) and drinking 6 to 8 10-ounce glasses of water per day.Avoiding straining during bowel movements and long periods of sitting on the toilet.Using stool softeners if needed.Following exercises designed to strengthen and retrain the muscles of the pelvic floor.Being fitted with a pessary, a device placed into the vagina to reduce the bulge.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/20/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"