"Rectal Prolapse Surgery (Rectopexy): Recovery & Complications800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Rectal Prolapse Surgery (Rectopexy)AdvertisementAdvertisementAdvertisementRectal Prolapse Surgery (Rectopexy)Adults with rectal prolapse need surgery to put rectal tissue that slips into their anus back where it belongs. Rectal prolapse surgery (rectopexy) may take place through your abdomen or perineum (a perineal rectosigmoidectomy). Without surgery, rectal prolapse can worsen fecal incontinence and lead to more serious issues.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is rectal prolapse surgery (rectopexy)?Rectal prolapse surgery is a procedure that fixes rectal prolapse. In rectal prolapse, the end of your colon (rectum) starts to slide into your anus (butthole). This can happen as you age, during or after pregnancy, or after an injury or illness. It might feel like pressure or a bulge in your anus after you poop.Rectal prolapse isn’t a medical emergency, but it gets worse over time if it isn’t fixed with rectal prolapse surgery. Your surgeon can put the tissue back where it belongs so you don’t develop pain, problems with pooping (incontinence or constipation) or other serious complications.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs rectal prolapse surgery (rectopexy)?Rectal prolapse isn’t common. It only occurs in about 0.5% of people. The condition affects people of all ages, including children. But it’s more common in people over 50 and those assigned female at birth (AFAB). Without surgery, rectal prolapse in adults gets worse and can lead to serious complications.This isn’t usually the case with children. Kids often develop rectal prolapse after having chronic constipation, diarrhea or a parasitic infectious disease. With time and the proper treatments for the underlying cause, the muscles that support your child’s rectum heal and get strong enough to hold their rectum in place. It’s rare for a child with rectal prolapse to need surgery.Procedure DetailsWhat are the types of rectal prolapse surgeries (rectopexies)?Rectal prolapse surgery may take place through your:Abdomen.Perineal area (the area of skin between your anus and your genitals).AdvertisementWhat happens before rectal prolapse surgery (rectopexy)?You should follow your healthcare provider’s instructions to prepare for rectal prolapse surgery. You may need to:Consume only clear liquids for a certain amount of time.Stop taking certain medications.Take laxatives or prescribed medications to clean out your bowels.What happens during rectal prolapse surgery?What happens during rectal prolapse surgery depends on the approach your surgeon takes. Your surgeon thinks about your overall health and how big the prolapse is as they decide which approach is best for you.Abdominal proceduresThere are different ways to perform rectal prolapse surgery through your abdomen. No matter which approach your surgeon chooses, they’ll give you general anesthesia.Abdominal rectopexy with possible bowel resection: Your provider cuts (incision) in your abdomen (belly). They pull your rectum into the back wall of your pelvis (sacrum) and secure it with permanent stitches and, sometimes, a mesh sling. Over time, scar tissue forms to hold your rectum in place. Your provider may also perform bowel resection surgery (colectomy). This procedure removes part of your large intestine and eases chronic constipation.Laparoscopic rectopexy: Your provider inserts a thin tube with a camera (laparoscope) and medical instruments through several small abdominal incisions. Then, they secure your rectum into place. You may also get a bowel resection.Robotic rectopexy: This procedure is similar to the laparoscopic one (above), but your provider uses a robotic device to help repair the prolapse. They may also perform a bowel resection, or place a mesh sling, if needed.Perineal proceduresPerineal surgery (also called perineal proctosigmoidectomy) takes place through a small incision in your perineal area. You may receive general anesthesia or an epidural.There are different methods for treating rectal prolapse, the most common being surgery. Types of rectal prolapse surgery include:Altemeier procedure: Your provider pulls your prolapsed rectum and a portion of your sigmoid colon (the last part of your large intestine that connects to your rectum) through your anus. They perform a proctocolectomy to cut and remove these sections. Next, they attach the remaining part of your rectum to your large intestine. They may also sew your pelvic floor muscles closer together to tighten them (levatorplasty).Delorme’s procedure: For rectal mucosa prolapses or small rectal prolapses, your provider removes the lining of your rectum. Next, they fold over the muscular layer of your rectum and stitch it together inside your anal canal. This doubled muscular wall holds your rectum in place.AdvertisementWhat happens after rectal prolapse surgery (rectopexy)?You may stay in the hospital for two or three days after perineal surgery or up to a week after abdominal surgery. Your discharge time depends on several factors, like when you’re able to have solid foods, pass gas and poop (have a bowel movement). These signs indicate that your digestive system is working properly.After surgery, you may experience:Pain and tenderness in your rectal area and the incision sites.Rectal bleeding or blood in your stool.What is the best surgery for rectal prolapse?Your healthcare provider will select the best surgical method for your unique diagnosis. Certain factors can make perineal surgery a better option than abdominal surgery.These factors include:Age: People who are older may recover more easily from less-invasive perineal surgery.Sex: There’s a small risk (about 2%) of nerve damage during abdominal surgery that can cause sexual dysfunction in males.Health conditions: Obesity, diabetes and other health issues can make recovery from abdominal surgery more difficult.Prolapse severity: The perineal approach may be best if you have a mild prolapse or your rectum is stuck outside of your anus (an “incarcerated rectum”).Care at Cleveland ClinicDigestive CareMake an AppointmentRisks / BenefitsWhat are the benefits of rectal prolapse surgery (rectopexy)?Surgery is the only way to treat rectal prolapse in adults. Failing to get rectal prolapse surgery can lead to:Constipation.Fecal (bowel) incontinence.Gangrene from an incarcerated (stuck) rectum.Rectal ulcers and anemia.What are rectopexy complications?Abdominal surgery for rectal prolapse requires one larger incision or multiple smaller incisions. These make the procedure slightly riskier than perineal surgery, but it also has a lower risk of the prolapse happening again. All surgeries carry a risk of complications like bleeding, blood clots and scarring.Complications of rectal prolapse surgery (rectopexy) include:Anal fistulas.Anastomotic leak.Large bowel (intestinal) obstruction.Sexual dysfunction.Worsening constipation.Recovery and OutlookHow long is the recovery from rectal prolapse surgery (rectopexy)?After you leave the hospital, it can take a few to several weeks to return to normal. Bowel function after the surgery may be the same, worse or better. It sometimes takes several months to determine what bowel function will be like long term.After treatment, you may need to:Take steps to prevent constipation — get more fiber in your diet and drink more water.Try not to strain when pooping.Use stool softeners.How successful is rectal prolapse surgery (rectopexy)?There’s some evidence that abdominal rectal prolapse surgery provides better long-term results than perineal surgeries.Less than 5% of people who get abdominal rectopexy have another rectal prolapse. But as many as 1 in 4 people have another prolapse after perineal rectopexy.When to Call the DoctorWhen should I see my healthcare provider?You should call your healthcare provider if you experience:Excessive rectal bleeding.Severe or recurrent constipation.Signs of another rectal prolapse.Signs of infection, such as fever or redness at the surgical site.Additional Common QuestionsIs rectal prolapse surgery painful?You should expect to feel some pain or discomfort in your rectal area after surgery. If you had an abdominal procedure, your abdomen may also be tender. Follow your healthcare provider’s recommendations for pain relief.A note from Cleveland ClinicYou might feel embarrassed to talk about things like anal pain or itching. But it’s important to let your healthcare provider know if you’re experiencing these symptoms. Rectal prolapse won’t go away without surgery (rectopexy). In fact, the problem will only get worse the longer you wait. Getting rectal prolapse surgery can stop symptoms and improve your quality of life.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/05/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicDigestive CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"