"Restorative Dentistry: What It Is, Types & Procedures800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Restorative DentistryAdvertisementAdvertisementAdvertisementRestorative DentistryRestorative dentistry focuses on repairing or replacing damaged or missing teeth. These procedures help improve oral health and function. Common dental restorations include crowns, bridges and implants.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is restorative dentistry?Restorative dentistry focuses on repairing or replacing teeth. The main goal of restorative dentistry is to improve oral health and chewing function.General dentists — sometimes called family dentists — perform restorative dentistry. Examples of restorative dental procedures include crowns, bridges, implants and dentures.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs restorative dentistry?You may need restorative dentistry if you have:Cavities/tooth decay.Damaged or broken teeth.Missing teeth.What’s the difference between restorative dentistry and cosmetic dentistry?Restorative dentistry focuses on improving oral health and function. Cosmetic dentistry focuses on improving the appearance of your smile.Some dental procedures offer both functional and cosmetic improvements (aesthetic restorative dentistry). For example, a dental crown restores chewing function, but it can also make your smile look more uniform.AdvertisementWhy is restorative dentistry important?Restorative dentistry gives you the best chance at long-lasting oral health. Your dentist can help restore your smile to full function by fixing damaged or decayed teeth. This improves your ability to eat, speak and chew.Procedure DetailsWhat are the types of dental restoration?There are several different types of dental restorations, depending on your unique oral health needs:FillingsWhen bacteria eats away your tooth enamel and causes a hole, it’s called a cavity. Smaller cavities are usually repaired with dental fillings.During this procedure, your dentist removes the decayed portion of your tooth, then fills in the hole with a tooth-colored composite material. This halts the progression of tooth decay and reduces the risk of further damage.CrownsDentists use dental crowns to repair large cavities or restore broken teeth. Sometimes called a cap, a crown fits over your entire tooth.In order to place a crown, your dentist must remove some of your natural tooth enamel. So, they’ll alter your tooth (shave part of your tooth down), then place a crown over it.Inlays and onlaysSometimes a cavity is too big for a filling, but too small for a crown. In a case like this, your dentist might recommend an inlay or onlay. These custom restorations fit into your natural tooth structure like puzzle pieces. Your dentist permanently bonds them into place.Inlays and onlays are similar. While an inlay fills the area between the cusps of your teeth, an onlay also covers at least one cusp.Root canal therapySometimes a cavity or crack goes deep enough into your tooth that it reaches the pulp. If bacteria get into the pulp of your tooth, it can cause a painful infection. In these cases, root canal therapy is necessary.During this procedure, your dentist removes the diseased pulp, including the tiny nerves and blood vessels inside of your tooth. Next, they’ll thoroughly clean and disinfect the inside surfaces of your tooth, then fill the canals with a rubbery dental material called gutta percha. Then, they’ll place a filling to seal the tooth and prevent bacteria from entering.In most cases, people who undergo root canal therapy also need a crown to provide additional strength and support.BridgesA dental bridge can replace a single missing tooth or a row of missing teeth. A bridge consists of artificial teeth with dental crowns on either side. Your dentist will alter (shave down) your natural teeth on both sides of the gap. Next, they’ll bond the bridge to your natural teeth. The crowns fit over your natural teeth and the artificial teeth span the gap in between them.Dental implantsA dental implant is a small, threaded post that replaces a missing tooth root. Once your dentist adds a crown to your implant, it functions just like a natural tooth.Your dentist can restore dental implants with crowns, bridges and even dentures. Unlike traditional crowns and bridges, implants don’t require alteration of your natural teeth. Many dentists consider implants to be the golden standard of teeth replacement.DenturesDentures are another traditional teeth replacement option. Full dentures replace an entire arch of missing teeth. Partial dentures replace several missing teeth in different areas. Dentures rest on top of your gums, and the jawbone underneath supports them.You can also opt for implant-supported dentures. These appliances are similar to traditional dentures. But instead of resting atop your gums for support, they attach to dental implants. This offers much more stability compared to conventional dentures.Care at Cleveland ClinicGet Dental CareFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the advantages of restorative dentistry?Restorative dentistry offers a wide range of benefits for people of all ages. For example, it can:Restore oral health.Improve chewing function.Eliminate dental pain.Reduce the risk of dental issues in the future.Improve the appearance of your smile.What are the risks of restorative dentistry?The most common risk is sensitivity or general discomfort after a restorative dentistry procedure. Very rarely, you may get an infection or have an allergic reaction to the metals used.Dental restorations have very few risks. But crowns, for example, may become chipped or loosened. If you have deep cavities or delay getting cavities filled, that can lead to root canal therapy or tooth extraction. Contact a dentist right away if you have a problem with your teeth.Recovery and OutlookWhat’s the recovery time after a restorative dentistry procedure?It depends on a few factors, including the type of procedure and the number of teeth that need treatment. For example, someone who has one cavity filled will be able to resume normal activities immediately. However, someone who has four dental implants placed may need a couple of days off to recover. Your dentist can tell you what kind of recovery timeline to expect in your situationWhen to Call the DoctorWhen should I see my dentist?If you have decayed, damaged or missing teeth, schedule a consultation with a dentist. They can help restore your smile’s health, function and appearance.You should also visit your dentist regularly for routine dental check-ups and cleanings. In addition, be sure to practice good oral hygiene at home in-between visits.If you have a dental restoration that feels “off” or causes a bad taste, call your dentist right away for further instructions.A note from Cleveland ClinicThe goal of restorative dentistry is to repair damaged teeth and improve overall oral health and function. Undergoing a dental procedure can feel scary, especially if it’s one you’ve never had before. But the sooner you treat a dental issue, the less likely you are to develop other problems later on. This can save you lots of time and worry in the long run.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/02/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Dental CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"