"Retinol: Cream, Serum, What it is, Benefits, How to Use800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/RetinolAdvertisementAdvertisementAdvertisementRetinolRetinol, a form of vitamin A, is an ingredient added to skin creams, lotions and serums. It has anti-aging effects and can help clear acne. Products containing retinol are widely available over-the-counter, and stronger concentrations of retinoids are available by prescription.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional DetailsOverviewWhat is retinol?Retinol is a form of vitamin A with many uses in skin care. It’s used to treat acne and has anti-aging effects. You can buy retinol over the counter (without a prescription) or visit your healthcare provider to discuss how retinol might best fit into your skincare routine. Your provider may prescribe medications that contain higher concentrations of retinoids than you can get over the counter.Retinol is a topical treatment meaning you apply it on top of your skin. Retinol comes in many forms, including:CreamsGels.Lotions.Ointments.Serums.Retinol is also sometimes used as an ingredient in cosmetic products.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat does retinol do for your skin?Retinol increases skin cell production (proliferation). It helps unclog pores. Retinol also exfoliates your skin and increases collagen production, which can reduce the appearance of fine lines and wrinkles, giving your skin a fresher, plump appearance.What are the different types of retinol products?Medications that you put on your skin are called “topical.” There are many topical retinoid products available, including:Adapalene (Differin®, Epiduo®).Alitretinoin (Panretin®).Bexarotene (Targretin®).Tazarotene (Tazorac®, Avage®).Tretinoin (Atralin®, Avita®, Refissa®, Renova®, Retin-A®, Tretin-X®).AdvertisementHow long does it take retinol to work?Retinol starts to work in your cells right away, but it will take several weeks before you see an improvement in the look and feel of your skin. In fact, your skin condition may look worse at first as you adjust to the new regimen.What does retinol treat?Several over-the-counter retinol products are marketed to improve the appearance of your skin. If these don’t work, you can consult a dermatologist (a medical doctor who specializes in skin conditions) about prescription-strength products that are more effective. Studies show that topical retinoids can help treat acne and acne scars and stretch marks. Retinol also has anti-aging effects. Specifically, retinol is good for the following conditions:Retinol for acneAcne is a common skin condition. When your pores become blocked with dead skin cells and/or oils, you can develop blackheads, whiteheads or other types of pimples. Retinol works for acne by preventing clogged pores. You may still see pimples for the first couple of months of treatment – your skin might even look worse (this is sometimes referred to as the retinol purge). But if you stick with it, you’ll see clearer skin.Retinol for acne scarsAcne scars develop as a result of injury and inflammation. These pink, red or dark spots on your skin can appear as your acne heals, and may last for several weeks. Additionally, picking or popping your pimples causes more injury to the skin and may leave permanent scars. Topical retinol treatments can help reduce the swelling and inflammation that come with breakouts and help prevent further breakouts. But topical retinol treatment doesn’t always work on severe acne scars that are sunken or raised.Retinol for dark spotsDark spots (hyperpigmentation) can develop as a result of sun damage to your skin. If you have light to dark brown spots on your face, hands, neck or arms, what you’re seeing is a buildup of melanin, which gives your skin color (pigment). Also called sun spots, age spots and liver spots, these spots are painless, but if you don’t like how they look, there are procedures and topical treatments that may help. Some people find that topical retinol lightens their skin spots, though it takes months and can be irritating to your skin. It’s a good idea to see a dermatologist (a medical doctor who specializes in conditions of the skin) if you’re concerned about dark spots.Retinol for large poresA pore is an opening at the surface of your skin that allows body hair and oils to pass through. When these pores become clogged with dead skin cells or oil, your pores become bigger and more noticeable. Topical retinol treats large pores by increasing skin cell turnover — which makes your skin thicker — and preventing the development of clogged pores.Retinol for Kaposi sarcoma lesionsKaposi sarcoma is a rare cancer that can affect people with weakened immune systems. People with Kaposi sarcoma commonly develop dark-colored patches or blotches that may be flat or bumpy. They might be blue, black, pink, red or purple. Alitretinoin is a retinoid that can slow the growth of Kaposi sarcoma cells. Though it doesn’t cure cancer, your healthcare provider may recommend applying alitretinoin gel to your Kaposi sarcoma lesions to slow their progression.Retinol for melasmaMelasma is another common skin disorder that leads to dark spots or patches on sun-exposed areas. Exposure to light, heat and certain hormone levels increases the amount of melanin you produce, which causes these flat or freckle-like patches that are light brown, dark brown or blue-gray. Melasma is most common during pregnancy. If you’re pregnant, you should talk to your healthcare provider before using oral or topical medication or supplements. If you aren’t pregnant, a topical retinoid (tretinoin) may help fade melasma spots.Retinol for psoriasisPsoriasis is a skin disorder that people get with inflammation that causes new skin cells to grow too fast. The new cells build up, creating a thick, scaly rash that is pink or red. Topical retinol slows skin cell overgrowth and reduces inflammation, which may help with the rash. But since retinol can also further irritate your skin, your healthcare provider will usually recommend using retinol in combination with topical steroids.Retinol for stretch marksStretch marks are scars that develop when our skin is stretched by pregnancy, weight gain, extreme weight loss or rapid muscle growth. These marks are pink, red or purple at first, and then gradually fade until they appear silver or white. Topical retinol can help make stretch marks less noticeable but talk to your healthcare provider before using them during pregnancy or while breastfeeding.Retinol for wrinklesA number of factors can cause wrinkles in your skin. As you age, your skin cells divide more slowly. The middle layer (dermis) of your skin begins to thin, it becomes harder to retain moisture, and your skin has less elastin and collagen. Topical tretinoin and tazarotene can improve the appearance of fine lines and wrinkles by slowing the breakdown of collagen and making your skin more elastic. It usually takes several months of topical retinol use to notice a difference.AdvertisementIs retinol good for your skin?Retinol is a powerful tool against aging skin and acne, but it’s not for everyone. If you’re prone to allergies or have sensitive skin, you might want to try skincare products with alternative anti-aging or skin-clearing ingredients. Importantly, retinol makes your skin more sensitive to sunlight so be sure to use sunscreen and avoid the sun as much as you can while you use retinol products.Procedure DetailsHow do you use retinol?Before you use a retinol product for the first time, try a little bit on a small area of skin (a patch test) to see if you have any negative reactions. If, after a couple of days, your skin patch isn’t very red or itchy, you can add retinol to your skincare routine at bedtime.To use retinol, follow the instructions on the package or your provider’s recommendations for application. In general, here are the steps you take:Clean your skin with a gentle cleanser and pat it dry. Don’t scrub your skin while using retinol products.Apply retinol in a thin layer to your entire face (be careful not to get it in your mouth, nose and eyes). You should use a dose that’s about the size of a pea. For the first couple weeks of treatment, apply retinol only every other day.Finish with a facial moisturizer that won’t clog your pores (non-comedogenic).How often can you use retinol?Since retinol can irritate your skin, it’s best to start slow. After a patch test, you might use a product once every few days, and then gradually ramp up to once or twice per day. At first, you might experience redness, itching or burning, but these symptoms go away as your skin gets used to the treatment.Care at Cleveland ClinicGet Dermatology CareMake an AppointmentRisks / BenefitsWhat are the benefits of retinol?Retinol has many skin-clearing and anti-aging benefits. Retinol increases the thickness and elasticity of your skin, slows the production of melanin, reduces inflammation and prevents clogged pores.What are the side effects of retinol?Side effects from topical retinol treatment are usually temporary. They include:Dry, irritated skin.Itching or burning.Redness, peeling, flaky or scaly skin.Sunburn.These side effects should gradually go away as your skin gets used to the new treatment.How can you manage the side effects of retinol?Making small adjustments to your skincare routine may help reduce the redness and irritation that can come with using retinol. It might help to:Use only one retinol product at a time.Use retinol every other day rather than every day.Wait 30 minutes after washing your face before applying your retinol product.Avoid retinol products if you have a sunburn, broken skin or other skin irritations.Use SPF 30 and wear sun protective clothing and hats to reduce your exposure to the sun.Ask your healthcare provider about the best time to apply moisturizer as part of your skincare routine.Can retinol damage your skin?If you use retinol, you’ll sunburn more easily, which can damage your skin. Using high doses of retinol may also be associated with the development of skin cancer. Be sure to wear sunscreen and avoid direct sunlight (with clothing and hat) while you use retinol products.When to Call the DoctorWhen should I see my healthcare provider?Contact your healthcare provider if:You develop a severe reaction to a retinol product.You don’t see results after using an over-the-counter retinol product for a few months and want to consider next steps.Additional DetailsWhat’s the difference?With so many different retinol products on the market, it can be hard to keep them straight.Retinol vs. vitamin AVitamin A is a fat-soluble vitamin found in many foods and supplements that plays several important roles in your body. It helps with your organs and is involved in your immune system, vision and reproduction. Retinol is a form of Vitamin A that can be put on the skin to improve its tone and texture.Retinoid vs. retinolRetinol and retinoid are vitamin A derivatives used to improve the texture and appearance of skin. The main difference is how strong they are. Retinol is widely available over-the-counter in serums, creams and is even used as an ingredient in some cosmetics. Retinoids are made at higher concentrations, and are available by prescription only with one notable exception. You can buy adapalene (Differen®) at your local drug store. It’s a retinoid used to treat acne.Prescription retinoid vs. over the counter retinolPrescription retinoids contain higher concentration of active ingredients. So, if you see your provider and get a prescription-strength retinoid, you may see more significant changes to your skin, faster. Over-the-counter retinol is usually combined with other ingredients. It can be harder to tell how much of the active ingredient is in there. But the other ingredients in the over-the-counter retinol products may also hydrate and brighten your skin.Tretinoin vs. retinolTretinoin is a retinoid available by prescription only. It’s been used for decades to treat acne and signs of premature aging from sun exposure (photoaging). It’s stronger than the retinol you can buy over-the-counter, so it may work faster.Can you use retinol while pregnant or breastfeeding?If you’re pregnant or breastfeeding, consult your healthcare provider before using new products, supplements or medications.Topical retinol during pregnancyWhen taken by mouth, retinoids can cause birth defects. Some studies suggest that when applied to the skin, less of the medication is absorbed and enters your blood stream. But there are reports that of babies born with birth defects after topical retinoid use by their birth parent. Since there are other ways to treat skin conditions, healthcare providers discourage the use of retinoids if you’re pregnant. Tell your doctor if you plan to become pregnant, and consider birth control methods if you use retinol products.Topical retinol use and breastfeedingBecause topical retinoid is applied on the skin, little is absorbed into your bloodstream. Healthcare providers believe the risk to breastfeeding infants is low. You should always discuss medications and supplements, even topical ones, with your healthcare provider while you’re nursing. If you do use topical retinoids, don’t apply it on your breasts, and take care to keep the product from rubbing onto your baby’s skin.Can you combine retinol with other topical skin treatments?Yes, you can combine or alternate retinol with other topical skin treatments. But since many treatments can irritate your skin, you’ll want to do so carefully.Retinol and glycolic acidGlycolic acid is a form of alpha-hydroxy acid that works as a chemical exfoliant. Alternating glycolic acid and retinol might work well to reduce the appearance of dark spots and scars from acne. But they can both irritate your skin. If you want to try both products, consider alternating days or using glycolic acid in the morning and retinol at night.Retinol and hyaluronic acidHyaluronic acid is a great moisturizer that works by slowing the evaporation of water from your skin. It soothes and plumps your skin, which can help counteract some of the irritating effects of retinol use.Retinol and niacinamideNiacinamide is a vitamin B3 derivative that can help clear acne and reduce the signs of aging. It also helps protect your skin, and may help counteract the irritating side effects of retinol.Retinol and salicylic acidBoth retinol and salicylic acid are used to treat acne. But they both can dry and irritate the skin. Overdrying your skin can stimulate more oil production, making your acne even worse. If you want to try using both retinol and salicylic acid, consider alternating them: use salicylic acid in the morning and retinol at night.Retinol and vitamin CVitamin C can help lighten dark spots and reduce fine lines and wrinkles. Retinol slows the breakdown of collagen and increases elasticity, giving you skin that looks firmer and plumper. The combination can help even out the texture and tone of your skin. Both products can cause skin irritation, so you’ll want to add one at a time over a period of a couple of weeks. It’s best to use a product with Vitamin C in the morning and keep the retinol for nighttime.A note from Cleveland ClinicAs we age, it’s normal to see changes in our skin. Almost everyone gets pimples and wrinkles at some point in their life. But there are lots of different treatments to help if you don’t like the way your skin looks or feels. Retinol is just one ingredient that can help clear and plump your skin. It can take several weeks before you’ll start to see results from retinol, and your skin may look worse before it gets better, so try not to get discouraged. Start slowly and increase your use of retinol gradually.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 06/17/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Dermatology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"