"Retrograde Pyelogram: Procedure, Risks & Advantages800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Retrograde PyelogramAdvertisementAdvertisementAdvertisementRetrograde PyelogramYour provider might order a retrograde pyelogram to see what’s going on if you have symptoms of stones or blockages in your urinary system. The procedure generally requires anesthesia.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a retrograde pyelogram?A retrograde pyelogram is an image created by combining X-rays with a dye injected into the ureters to get clear pictures of the parts of your urinary system. The dye is a contrast agent that makes the pictures easier to understand. The procedure can be used on one or both ureters.The “retrograde” means that the flow is going back into your system, rather than outward as liquid (urine) normally flows. The “pyelogram” refers to the images of a specific part of your kidney, the renal pelvis, an area near where the ureter is attached. Another name for this procedure is retrograde pyeloureterogram.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is the difference between a retrograde pyelogram and an intravenous pyelogram?Another test, an intravenous pyelogram, is similar, but the dye is put into your vein instead of into your ureter. They involve using contrast dyes and both are used to show images of the upper urinary tract. A retrograde pyelogram is done when you’re allergic to contrast media and it can’t be injected into your vein.Intravenous pyelograms aren’t used as often as they were. Providers now prefer to do computed tomography (CT) urograms to find bleeding, blockages or tumors.Why is a retrograde pyelogram done?Your provider might order a retrograde pyelogram if:You may have damaged your ureter.You may have a blockage or narrow spot in your ureter.You may have stones or tumors in your kidneys and ureters or bladder.Your provider needs to have a good image to place a stent or do a ureteroscopy.AdvertisementHow common are retrograde pyelograms?Retrograde pyelography was used in the past more often than it is now. It’s been replaced in many cases by other imaging technologies. However, it still is used with cystoscopy in many cases, such as stenting to keep passageways open.Procedure DetailsWhat happens before a retrograde pyelogram?Before you have the procedure, you’ll talk with your doctor about your symptoms, your medical condition and the medicines and over-the-counter products you’re taking. It’s especially important that your doctor knows about pregnancy, blood-thinner medications and allergies.This procedure typically is an outpatient procedure done in a hospital or walk-in surgery setting. It’s likely that you’ll get some type of anesthesia, usually general, so you’ll need a driver.Your healthcare provider will tell you if and when you’ll have to stop eating and drinking the night before the procedure and if you’re able to take your usual medications.On the day of your procedure, leave your jewelry and valuables at home. Don’t bother with lotions or makeup. Wear loose and comfortable clothing.AdvertisementWhat happens during a retrograde pyelogram?You’ll be given a hospital gown to wear for the procedure.One of the healthcare team members will put an intravenous (IV) line into your arm and you’ll get a sedative to start. Most people who have retrograde pyelograms get general anesthesia, but your provider may also choose to administer regional anesthesia.You’ll be taken to an operating room and transferred to an operating table. You may be asked to put your feet in stirrups or the operating table might be one that can be rearranged to make the procedure easier to do.When the anesthesia takes effect, your provider will begin with a cystoscopy that will allow them to place the tube used to inject the dye into the upper part of your urinary tract. The cystoscope and instruments will pass through your bladder from your urethra and then be positioned in one of your ureters.Taking care to avoid air bubbles, your provider will push the dye into your ureter. When the dye is completely in place, a team member will take a series of X-rays.If the retrograde pyelogram is part of another procedure, such as placing a stent or removing a stone, the procedure will continue. If not, the scope will be withdrawn and the anesthesia lessened.What happens after a retrograde pyelogram?You’ll be taken to a recovery unit for monitoring until you’ve come out of the anesthesia and your blood pressure and breathing are all fine.In recovery, healthcare providers will check your urine (pee) for signs of blood. They’ll also keep track of how much you’re peeing. You may be asked to keep track of your urine output and quality while you go home.Your healthcare provider will give information on any medications you should take or avoid, what you can and can’t eat, and when you should call the office.You’ll be able to leave with your designated driver.Care at Cleveland ClinicUrology CareMake an AppointmentRisks / BenefitsWhat are the advantages of a retrograde pyelogram?Here are some advantages to having a retrograde pyelogram:Because the dye doesn’t get into your system, you can have a retrograde pyelogram even if you’re allergic to the dye.With the cystoscope and instruments, your provider can treat some of the urinary conditions that the test might find. For instance, they might be able to remove stones or take care of a blood clot.The level of radiation is low for this procedure. However, it’s a good idea to keep track of your procedures so you and your providers are aware of which procedures you’ve had and what type of radiation exposure you’ve had.What are the risks or complications of this procedure?No procedure is without risk, but retrograde pyelograms are very safe. Risks include:Issues with anesthesia.Urinary tract infections.Possible damage to parts of the urinary tract reached by the cystoscope, including the bladder and ureters.Recovery and OutlookWhat is the recovery time?Your recovery may depend on whether or not your provider performed other procedures, but you should be able to go back to work or school in a few days.You can return to normal eating, and you should stay hydrated.When to Call the DoctorWhen should I see my healthcare provider?Call your healthcare provider after a retrograde pyelogram if you:Develop a fever.Have chills or begin shaking.Find it difficult to pee.Have extreme pain when you pee.Experience increased bleeding.A note from Cleveland ClinicIf your healthcare provider thinks that you may have a blockage in the upper part of your urinary tract, like in the ureter, they may suggest that you have a retrograde pyelogram. This procedure can be combined with cystoscopy to diagnose and treat your urinary condition.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/11/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicUrology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointment Center 24/7 216.445.7050Appointments & LocationsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"