"Rezūm Water Vapor Therapy: Procedure & Results800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Rezūm ProcedureAdvertisementAdvertisementAdvertisementRezūm ProcedureThe Rezūm procedure treats benign prostatic hyperplasia (BPH), a condition that causes your prostate to grow, which may block your urethra and cause symptoms that affect your ability to pee or ejaculate. The procedure uses steam to reduce prostate tissue and relieve symptoms of BPH. Long-term results are good, and you can repeat the procedure if you develop BPH symptoms again in the future.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is Rezūm therapy?Rezūm™ (pronounced “ruh-ZOOM”) therapy is a minimally invasive nonsurgical treatment for benign prostatic hyperplasia (BPH) that has good long-term results. It involves a special instrument that uses water vapor (steam) to shrink the enlarged areas of your prostate. The instrument goes through your urethra, so you won’t have incisions or need stitches. A healthcare provider will numb the area before the procedure to reduce discomfort.Another name for Rezūm is water vapor therapy.What conditions are treated with the Rezūm procedure?The Rezūm procedure treats BPH. BPH is a condition that causes your prostate (the gland near your bladder, in front of your rectum) to grow, which may block your urethra and cause symptoms that affect your ability to pee or ejaculate. BPH commonly affects people over 50. But it may also begin when you’re younger.Who is not a good candidate for Rezūm?Healthcare providers may not recommend Rezūm if you have:Kidney function complications.A urethral implant.A very large prostate (over 80 grams).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens during the Rezūm procedure?Rezūm therapy takes place in a provider’s office. Before Rezūm therapy, a healthcare provider will instruct you to use the restroom. They’ll then use a local anesthetic to numb your urethra and prostate to make you more comfortable during the procedure.A urologist will then insert a handheld device with a long, thin tube at the end into your urethra. A tiny needle releases from the end of the tube and delivers steam into the enlarged areas of your prostate. The steam destroys the prostate cells, causing the enlarged areas to shrink.You’ll use a urinary catheter for several days until the swelling goes down.How long does Rezūm therapy take?Rezūm therapy usually takes about 30 minutes. Each individual treatment takes about 10 seconds. Up to 15 treatments can be given during one procedure. Risks / BenefitsWhat are the potential benefits of Rezūm therapy?Rezūm therapy is a safe, effective treatment for BPH with good long-term results. Other potential Rezūm procedure benefits include:You no longer need to take BPH medications.Many people see improvement in their BPH symptoms within a few weeks.It preserves sexual function.It’s an outpatient procedure (you can go home the same day as the procedure).You don’t need general anesthesia.Quick recovery period.You can repeat the procedure if your BPH symptoms return.How successful is the Rezūm procedure? The Rezūm procedure’s success rate is good. Studies show that less than 5% of people need additional procedures or surgeries within five years after the procedure. About 10% of people need to take prostate medications within those first five years.How many years does Rezūm last?Rezūm therapy is a relatively new procedure. The U.S. Food and Drug Administration (FDA) approved Rezūm therapy in 2015. Medical outcome studies indicate that Rezūm therapy effectively treats BPH symptoms for at least five years.AdvertisementWhat is the downside of Rezūm?Though the Rezūm procedure is relatively safe, there are some risks, including:Pain or discomfort while peeing or ejaculating.Peeing more than usual or having more urgent urination.Blood in your pee (hematuria) or semen (hematospermia).Urinary tract infection (UTI).Your penis doesn’t release semen when you reach sexual climax (dry ejaculation).Narrowing of your urethra (urethral strictures).Bladder stones.Recovery and OutlookHow long will it take for me to feel better after Rezūm therapy?During the first few weeks, your BPH symptoms may get worse before they get better. Many people notice an improvement in their symptoms after several weeks. However, it may take up to three months to see a difference.AdvertisementIs there anything I can do to make the Rezūm procedure easier on me?The following instructions can help make your Rezūm procedure recovery easier for you.Rest. Your body needs time to heal after Rezūm therapy, and rest is essential for your recovery. Spending at least a day at home resting after your Rezūm procedure is a good idea. It’s OK to drive yourself home after the procedure and walk short distances. But avoid running, heavy lifting, bike riding and other strenuous activities for a few weeks.Avoid sexual activity. Avoid sexual intercourse and masturbation for a few days to help allow the area to heal.Drink plenty of fluids, especially water. Drinking lots of fluids helps flush blood out of your pee.Avoid fluids that may irritate your bladder. These may include drinks that contain caffeine (tea, coffee, energy drinks), carbonated beverages (seltzer water, soda pop) and citrus fruit juices (orange juice, grapefruit juice).When to Call the DoctorWhen should I call my healthcare provider?Schedule a follow-up appointment with your healthcare provider two to three weeks after Rezūm therapy. They’ll want to see how you’re healing.Call your healthcare provider if you experience any of the following during your recovery:Inability to pee.Severe pain.A fever higher than 101 degrees Fahrenheit (38 degrees Celsius).Chills.Diarrhea.Additional Common QuestionsWhat is the difference between Aquablation and Rezūm therapy?Aquablation® is another treatment for BPH. Like Rezūm therapy, it uses water to remove prostate tissue. But it uses a high-pressure, heat-free water jet instead of steam.Rezūm therapy is a minimally invasive procedure that a healthcare provider can perform in an office setting. Providers must perform Aquablation in an operating room.With Aquablation, the healthcare team removes the enlarged prostate tissue immediately. With Rezūm, steam damages and shrinks the tissue over several weeks to months. Aquablation typically has faster and more dramatic improvements in your ability to pee.What is the difference between Rezūm therapy and TURP?Transurethral resection of the prostate (TURP) is a type of surgery that uses an electric current or laser to remove part of your prostate. Similar to Aquablation, the improvements are usually better than an office-based treatment like Rezūm therapy. However, surgery generally has more risks. What is the cost of Rezūm?Insurance coverage for Rezūm therapy is excellent. The price varies among healthcare providers, medical facilities and healthcare coverage. Talk to a provider to get a better idea of its cost.A note from Cleveland ClinicBenign prostatic hyperplasia (BPH) is a common condition that can cause problems when you pee, and Rezūm therapy is a relatively new treatment for BPH symptoms. It’s a safe and effective procedure with good long-term results and allows for shrinking the prostate without needing to have surgery in an operating room. Talk to a healthcare provider if BPH is affecting your quality of life. The Rezūm procedure may be a good option if medications or other front-line treatments don’t work for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/08/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"