"Rhizotomy: What It Is, Procedure, Side Effects & Risks800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/RhizotomyAdvertisementAdvertisementAdvertisementRhizotomyA rhizotomy is a procedure that involves damaging certain nerves through surgical cutting, chemical ablation or radiofrequency ablation to treat chronic pain or spasticity. There are several different types of rhizotomies.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorOverviewA rhizotomy is a procedure that involves damaging certain nerve fibers to help treat chronic pain or spasticity. Radiofrequency ablation is one method for damaging nerves.What is a rhizotomy?A rhizotomy is a procedure that involves damaging certain nerve fibers to help treat chronic pain or spasticity. Healthcare providers can destroy the nerves with any of the following methods:Cutting them with a surgical instrument. Surgeons may do this using open surgery (as in the case of selective dorsal rhizotomy) or with an endoscopic approach, which involves a tiny incision and a small camera tool to locate the nerves and cut them.Damaging them with a chemical, like glycerin or glycerol.Burning them with focalized high-intensity radio waves (radiofrequency ablation).Nerves are like cables that carry electrical signals between your brain and the rest of your body and vice versa. These signals help you feel sensations (like touch and pain) and move your muscles. They also maintain certain functions like breathing, sweating or digesting food.In a rhizotomy, damaging problematic nerves prevents them from sending pain signals to your brain. This typically results in pain relief.What’s the difference between a rhizotomy and an ablation?A nerve ablation and a rhizotomy have the same purpose: To damage nerve fibers that are causing pain or other issues. Rhizotomy is an umbrella term. Radiofrequency ablation (RFA) is a specific way of damaging the nerves using heat. Chemical ablation damages nerves using a substance that’s toxic to the nerves.Neurotomy is another word healthcare providers may use in place of rhizotomy or nerve ablation.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat does a rhizotomy treat?In general, rhizotomies treat certain causes of chronic pain or spasticity. Many types of rhizotomies target different nerves to treat specific causes of pain.Rhizotomies aren’t the first-choice treatment for chronic pain. Healthcare providers typically try more conservative treatments first, like physical therapy, NSAIDs or nerve blocks.Trigeminal ganglion rhizotomyThis rhizotomy targets nerves in your trigeminal ganglia, which are clusters of nerves on both sides of your face. It can help treat the following:Trigeminal neuralgia.Chronic treatment-resistant cluster headaches.Atypical face pain (persistent idiopathic facial pain).Postherpetic neuralgia that affects your face.Cancer-related pain that affects your face.Providers may also call this a percutaneous rhizotomy. “Percutaneous” means “done through the skin.”Facet rhizotomyThis rhizotomy targets the nerve roots that travel through the facet joints in your spine. It can help treat chronic pain (usually in your neck or lower back) due to conditions that affect your spine, such as arthritis and facet joint syndrome.If the procedure is for nerves in your neck, providers may call it a cervical rhizotomy. If the procedure is for nerves in your lower back, they may call it a lumbar rhizotomy.Selective dorsal rhizotomyHealthcare providers sometimes use selective dorsal rhizotomy to treat spasticity in children with cerebral palsy. Spasticity is a disruption in muscle movement patterns that causes certain muscles to contract all at once when you try to move or even when you’re at rest.This rhizotomy targets certain sensory nerve fibers in your lower spinal cord. Not every child with cerebral palsy is a candidate for this procedure.Procedure DetailsHow do I prepare for a rhizotomy?Each type of rhizotomy has a different preparation process. Your healthcare team will let you know what you need to do. Don’t hesitate to ask questions.In general, your healthcare team will likely recommend various tests to make sure the rhizotomy will be beneficial for you. These tests may include:Imaging tests, such as an MRI scan or X-rays.Nerve block to locate the problematic nerves.Blood tests.Urinalysis.If you’ll have general anesthesia for the procedure, you’ll have an appointment with an anesthesiologist to ensure it’s safe for you. This may involve tests to check your heart’s health.You may also need to stop taking certain medications, such as blood thinners (anticoagulants). Again, your provider will let you know if this applies to you. Never stop taking your medications unless your provider tells you to.AdvertisementWhat happens during a rhizotomy?The process of a rhizotomy varies based on which nerves your healthcare provider is targeting and what kind of rhizotomy it is — surgical cutting, radiofrequency ablation or chemical ablation.In general, a rhizotomy may involve the following aspects:General anesthesia or sedation: Most rhizotomies require general anesthesia — medication that numbs your brain so you fall asleep and don’t feel pain during the procedure. Other types of rhizotomies may involve sedation (medication to make you feel relaxed) or local anesthetic.Imaging guidance: Most rhizotomies involve imaging guidance — usually fluoroscopy — to locate the problematic nerves and make sure the provider is placing the needle in the correct spot. This may require a contrast dye, which is a safe substance that makes your nerves show up more clearly on imaging. A provider will inject the dye through an IV.Testing the affected nerves: During a rhizotomy, the provider usually tests the problematic nerve with electrical stimulation to make sure it’s the correct nerve to target. Depending on the type of rhizotomy, this may involve inserting a microelectrode through a hollow needle to stimulate the nerve or using electromyography (EMG).Destroying the nerves: Depending on the type of rhizotomy, the provider will use chemical ablation, radiofrequency ablation or surgical cutting to destroy the problematic nerve. Providers typically use needles to deliver chemical and radiofrequency ablations. Cutting the nerves involves either open surgery (a large incision) or endoscopic surgery (a tiny incision).Care at Cleveland ClinicSpasticity TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat is the success rate of a rhizotomy?The majority of people who have a rhizotomy experience long-lasting pain relief or significant improvement in spasticity. However, some people experience little to no pain relief.Your healthcare team can provide more information about the likelihood of success for your specific procedure.AdvertisementWhat are the risks or complications of a rhizotomy?Risks and complications for a rhizotomy vary depending on the kind of procedure as well as which nerves your healthcare provider treats. Providers expect certain sided effects and don’t call them complications. For example, you can lose facial sensation after a trigeminal rhizotomy. Your provider will go over all of the possible risks and complications before your procedure.In general, you may experience soreness, bruising or minor bleeding at the site of the rhizotomy injection or incision. This is usually mild and goes away within a few days. In rare cases, an infection can develop at the site of the rhizotomy.When to Call the DoctorWhen should I call my healthcare provider?If you notice any signs of post-procedure complications, such as infection at the incision site or nerve issues like weakness or burning pain, call your healthcare provider right away.A note from Cleveland ClinicA rhizotomy may help treat several causes of chronic pain. Healthcare providers usually reserve rhizotomies as a last option for pain treatment if other methods, such as pain medication and physical therapy, haven’t been successful. A rhizotomy is helpful for many people who decide to have the procedure — but not everyone. Talk with your provider to see if a rhizotomy is right for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/14/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSpasticity TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7243Questions 216.444.9134Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"