"Robotically Assisted Mitral Valve Repair800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Robotically Assisted Mitral Valve RepairAdvertisementAdvertisementAdvertisementRobotically Assisted Mitral Valve RepairContentsArrow DownOverviewProcedure DetailsRisks / BenefitsAdditional DetailsResourcesContentsArrow DownOverviewProcedure DetailsRisks / BenefitsAdditional DetailsResourcesOverviewFind out what to expect in robotically assisted heart surgery.What is Robotically Assisted Heart Surgery?Mitral Valve Surgery:New Approaches to Minimally Invasive Heart SurgeryRobotically assisted mitral valve surgery is a type of minimally invasive heart surgery performed by a cardiac surgeon, on the mitral valve with an endoscopic, closed chest approach.Your mitral valveThere are four valves within your heart. They are the mitral, tricuspid, aortic and pulmonic valves. The mitral valve lies between the left atrium (upper heart chamber) and the left ventricle (lower heart chamber). Learn more about the heart valves.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is valve disease?Valve disease occurs when your heart's valves do not work correctly. This can be caused by valve stenosis (stiff, fused, inflexible leaflets, limiting flow of blood) or valve regurgitation (leaky heart valve, occurs when the leaflets do not close completely). Learn more about valve disease.Mitral valve surgeryWhen the mitral valve does not function properly, the mitral valve must be repaired or replaced. At Cleveland Clinic, mitral valve repair is the procedure of choice for most patients with mitral valve disease. If you require mitral valve surgery, either repair or replacement, you may be a candidate for robotically assisted mitral valve surgeryRobotically-Assisted Valve Surgery: smaller incisionTraditional, open-chest surgeries, such as mitral and tricuspid valve surgery, and bypass surgery involve: placing the patient on the heart-lung bypass machine to circulate oxygenated blood during surgery; creating a 6- to 8-inch incision through the sternum; spreading the ribs to view the heart and stopping the heart in order to stabilize the blood vessels.Conventional minimally invasive surgery decreases the size of the incision to about 3 to 4 inches.Traditional open heart surgery incisionRobotically assisted surgery incisionThe minimally-invasive robotically-assisted technique uses even smaller incisions – often less than 2 inches. The surgeon’s hands control the movement and placement of the endoscopic instruments to open the pericardium (thin sac that surrounds the heart) and to perform the procedure. In most cases, the sternum or breastbone does not need to be opened and the ribs do not need to be spread to perform the procedure.Procedure DetailsHow does robotically assisted heart surgery work?During mitral valve surgery, the surgeon is able to get an undistorted 3-D view of the mitral valve, leaflets and subvalvular structures with use of a high powered camera. and a lateral thoracic approach. The robotic surgical system is used to control instruments, which are attached to thin, robotic arms. The surgeon's hands control the movement and placement of the instruments. The robotic “arm and wrist” movements mimic those of the surgeon's hand to enable the surgeon to follow the same steps as a traditional mitral valve surgery - including a variety of repair techniques and mitral valve replacement.Learn more about how robotically assisted heart surgery works.Care at Cleveland ClinicHeart Valve CareFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the benefits of robotically-assisted surgery?Compared with traditional surgery, the benefits of robotically-assisted surgery include:Smaller incisions with minimal scarringLess trauma to the patient, including less painShorter hospital stay (usually 3 to 4 days)Decreased use of pain medicationsLess bleedingDecreased risk of infectionShorter recovery and quicker return to daily and professional activities: The patient can resume normal activities and work as soon as he or she feels up to it; there are no specific activity restrictions after robotically-assisted surgery.Additional DetailsInformation about Robotic surgery:Learn more how robotically assisted heart surgery worksMinimally Invasive Heart SurgeryHeart SurgerydaVinci® Cardiothoracic Surgery*Information about mitral valve disease treatments:Mitral valve repairMinimally Invasive Mitral Valve RepairOther robotically assisted heart surgeriesMitral valve repair surgeryTricuspid valve repair surgery (when combined with mitral valve surgery)Ablation of atrial fibrillation (if other robotic surgery is required)Atrial septal defect (ASD) repairPatent foramen ovale (PFO) repairRemoval of cardiac tumors (Myxoma, Fibroelastoma of the mitral or tricuspid valve)*The inclusion of links to other web sites does not imply any endorsement of the material on the web sites or any association with their operators. Link opens in new window.*ResourcesHow do I find a heart surgeon?Cleveland Clinic has the nation's largest valve treatment program. Doctors vary in quality due to differences in training and experience; hospitals differ in the number of services available. The more complex your medical problem, the greater these differences in quality become and the more they matter.Clearly, the doctor and hospital that you choose for complex, specialized medical care will have a direct impact on how well you do. To help you make this choice, please review our Miller Family Heart, Vascular & Thoracic Institute Outcomes.Cleveland Clinic Heart, Vascular & Thoracic Institute SurgeonsRobot assisted surgery is performed by specially trained cardiovascular surgeons. Some of these surgeons perform only specific types of robotically assisted heart surgery. We would be happy to help you find the right surgeon to treat your medical condition.The Mitral and Tricuspid Valve Center surgeons offers expertise and experience to provide the best outcomes possible.The Miller Family Heart, Vascular & Thoracic Institute offers specialty centers and clinics for patients whose treatment requires the expertise of a group of doctors and surgeons who focus on valve disease:Valve CenterEndocarditis CenterMitral and Tricuspid Valve CenterIf you would like to find out whether you are a candidate for robot assisted mitral valve surgery or learn more about minimally invasive heart surgery, contact us or call the Miller Family Heart, Vascular & Thoracic Institute Resource & Information Nurse at 216.445.9288 or toll-free at 866.289.6911. We would be happy to help you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/17/2019.Learn more about our editorial process.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicHeart Valve CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"