"Robotically Assisted Patent Foramen Ovale Repair800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Robotically Assisted Patent Foramen Ovale RepairAdvertisementAdvertisementAdvertisementRobotically Assisted Patent Foramen Ovale RepairContentsArrow DownOverviewProcedure DetailsRisks / BenefitsResourcesContentsArrow DownOverviewProcedure DetailsRisks / BenefitsResourcesOverviewPatent Foramen Ovale (PFO)Robotically Assisted Heart Surgery: Patent Foramen Ovale (PFO):New Approaches to Minimally Invasive Heart SurgeryRobotically assisted patent foramen ovale (PFO) surgery is a type of minimally invasive heart surgery performed on patent foramen ovale with an endoscopic, closed chest approach.Your septumThe septum is the muscular wall separating the heart into the left and right sides.The atrial septum is the wall separating the atria (the two upper chambers).The ventricular septum is the wall separating the ventricles (the two lower chambers).What is Patent Foramen Ovale (PFO)?The foramen ovale is a small hole located in atrial septum that is used during fetal circulation to speed up the flow of blood through the heart. During fetal development, the fetus doesn't use its own lungs for oxygen-rich blood. Instead, it relies on the birthing parent to provide oxygen-rich blood from the placenta through the umbilical cord. Therefore, blood can travel from the veins to the right side of the baby's heart and cross to the left side of the heart through the foramen ovale and skip the trip to the baby's lungs.Normally the foramen ovale closes at birth when increased blood pressure on the left side of the heart forces the opening to close.If the atrial septum does not close properly, it is called a patent foramen ovale. This type of defect generally works like a flap valve, only opening during certain conditions when there is more pressure inside the chest. This increased pressure occurs when people strain while having a bowel movement, cough, or sneeze.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyRobotically assisted heart surgeriesMitral valve repairTricuspid valve repair (with mitral valve repair)Ablation of atrial fibrillation (if other robotic surgery is required)Atrial septal defect (ASD) repairPatent foramen ovale (PFO) repairRemoval of cardiac tumors (Myxoma, Fibroelastoma of the mitral or tricuspid valve)Department of Thoracic and Cardiovascular SurgeryImages used with permission by © Intuitive Surgical, Inc.Procedure DetailsTreatment of PFOIn some cases, PFO may not require any treatment at all. If a PFO does require treatment, particularly if associated with a stroke, it may be closed interventionally through a PFO closure device or through heart surgery.Robotically Assisted PFO Surgery: smaller incisionRobotically assisted atrial septal defect (ASD) and patent foramen ovale (PFO) repair surgeries are performed through small incisions made in the right sight of the chest. The surgeon’s hands control the movement and placement of the endoscopic instruments, which are used to retrieve a small patch of pericardial tissue.The pericardium is the thin sac that surrounds the heart. The tissue patch is used to repair the defect between the right and left atrium for ASD or PFO defects.AdvertisementRisks / BenefitsWhat are the benefits of robotically assisted surgery?Compared with traditional surgery, the benefits of robotically assisted surgery include:Smaller incisions with minimal scarringLess trauma to the patient, including less painShorter hospital stay (usually 3 to 4 days)Decreased use of pain medicationsLess bleedingDecreased risk of infectionShorter recovery and quicker return to daily and professional activities: The patient can resume normal activities and work as soon as he or she feels up to it; there are no specific activity restrictions after robotically assisted surgeryResourcesWhich Cleveland Clinic physicians perform robotically-assisted heart surgery?Robotically-assisted surgery is performed by our specially trained cardiovascular surgeons. Some of these surgeons perform only specific types of robotically assisted heart surgery. We would be happy to help you find the right surgeon to treat your medical condition. Learn more about how to make an appointment with a cardiovascular surgeon in Cleveland Clinic's Heart, Vascular & Thoracic Institute. If you have questions, you can also talk to one of our Heart Nurses at 216.445.9288 or toll-free at 866.289.6911.AdvertisementWhere can I find more information about patent foramen ovale (PFO)?Patent foramen ovale: symptoms and causes, diagnosis and tests, management and treatmentCardiac implant closure deviceMinimally Invasive Heart SurgeryHeart SurgeryMedically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/03/2019.Learn more about our editorial process.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"