"Root Canal: Procedure, What It Treats & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Root CanalAdvertisementAdvertisementAdvertisementRoot CanalA root canal is treatment for infections in tooth pulp, the innermost layer of your teeth. Endodontists and dentists do about 15 million root canals in the United States every year. Typically, root canals are painless treatments. You can avoid needing a root canal by brushing your teeth after meals, flossing daily and having regular dental checkups.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookAdditional Common QuestionsOverviewRoot canals involve several steps, starting with removing infected tooth pulp, placing filling in the pulp area and then placing a dental crown on the affected tooth.What is a root canal?A root canal (endodontic therapy) is a dental treatment for infections in tooth pulp, the innermost layer of your teeth. Endodontists and dentists do about 15 million root canals in the United States every year. Often, you can avoid needing a root canal by taking care of your teeth.Why would I need a root canal?You may need a root canal if bacteria inside your mouth invade the pulp inside your tooth and cause inflammation (pulpitis). Your tooth pulp may come under bacterial attack if:You have a deep cavity that needs treatment.You have a cracked or damaged tooth, and bacteria from plaque infects your tooth pulp.What are signs I may need a root canal?If you have an infected tooth, you may need root canal treatment to clear out the infection. You can have infected teeth without symptoms. When you have symptoms, they may include:Tooth pain that doesn’t go away. Lots of things make your teeth hurt. But pain that’s deep in a tooth or that spreads to your jaw, face or other teeth may mean you have an infection.Pressure hurts. If your tooth hurts when you eat or touch it, it may mean something damaged the nerves around your tooth pulp.Swollen gums. If you have an infected tooth, your gums may swell or feel tender.Pimple on your gums. Infected teeth can create pimples or boils on your gums that ooze smelly pus.Swollen jaw. Your jaw may swell from pus that doesn’t drain away from your infected tooth.Discolored tooth. Tooth pulp infection keeps blood from getting to your tooth. That makes your tooth turn dark.Loose tooth. Pus from infected tooth pulp can soften the bones supporting your tooth, making your tooth feel loose.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsWhat happens during root canals?Before beginning treatment, your dentist or endodontist will take dental X-rays of the affected tooth. They may do other tests to determine if your tooth pulp is dead, infected or inflamed and confirm that you’ll need a root canal. They may:Gently tap on your tooth or touch it with a cold or hot substance to check for sensitivity or discomfort.Do an electric pulp test (EPT) by using a device that sends a gradually increasing electric current through your tooth to see if your tooth pulp reacts.Check for signs of swelling in the gums and bone around your tooth.Ask if it hurts when you bite down on your tooth.During root canal treatment, your dentist or endodontist removes the inflamed pulp. Then they clean and disinfect the inside of your tooth and place a filling on your tooth to seal the space.Root canal treatment steps are:Your provider injects anesthesia to numb your infected tooth and nearby gum. If you have dental anxiety, your provider may give you medications to help you relax. The medication may make you feel drowsy, which means you won’t be able to drive right after your treatment.Next, your provider places a thin, flexible piece of rubber over your infected tooth and nearby gums. This is a dental dam that keeps your tooth dry during treatment.They drill a tiny hole in your tooth’s crown so they can get to your tooth pulp.Then, they use tiny dental instruments to remove nerves, blood vessels and tissues inside your tooth pulp.After clearing out pulp, your provider cleans and disinfects your pulp chamber and root canals.Next, they fill the empty pulp chamber and root canals with a flexible, rubbery dental material called gutta-percha.Your provider then seals your tooth with a temporary dental filling. The seal keeps bacteria from getting into your tooth.In the last step, your provider places a dental crown on your treated tooth. Dental crowns protect your teeth and restore your bite — the way your teeth fit together when you bite down. Dental crowns are typically made to order, so it may be two or three weeks before this last step happens.What happens after a root canal?Your provider may suggest you rest for a few minutes before leaving the dental clinic or provider’s office. It can take an hour or more for anesthesia to wear off, meaning your mouth and gums aren’t numb anymore. Some people decide to rest at home while that happens while others choose to go on with their usual daily routine.Typically, you’ll have two more appointments so a provider can prepare your tooth for a dental crown and then place the crown on your tooth.Care at Cleveland ClinicGet Dental CareFind a Doctor and SpecialistsMake an AppointmentAdvertisementRisks / BenefitsWhat are the potential benefits of root canals?Root canals eliminate tooth infections that, left untreated, could cause serious issues like:Infection that spreads to other teeth.Jawbone damage.What are the risks or complications of root canals?Sometimes root canals fail because they weren’t the right solution for your tooth infection. For example, if your tooth is very damaged, a root canal may not solve your issues. If your root canal fails, your healthcare provider will discuss other options:Re-treating your infected tooth by doing another root canal.Removing (extracting) your infected tooth and replacing it with a dental implant or dental bridge.AdvertisementRecovery and OutlookHow long does it take to recover from a root canal?Typically, it takes less than a week to recover from a root canal. Call your healthcare provider if your treated tooth hurts for more than a week.How do I take care of myself after a root canal?Your tooth and gums go through a lot during a root canal. You can help them heal by:Eating soft foods for the first few days after treatment. (Think well-cooked pasta, mashed potatoes, cottage cheese, smoothies and yogurt).Avoid chewing on your treated tooth if you’re waiting on your permanent crown.If you smoke, try to take a break after your root canal because smoking makes it harder for your tooth to heal.Brushing your teeth after every meal and flossing once a day.Using an antibacterial mouthwash to keep germs at bay.Additional Common QuestionsHow can I avoid a root canal?Practicing good oral hygiene and having regular dental checkups are the best ways to avoid root canal treatment. Brushing and flossing your teeth gets rid of dental plaque — a sticky film of bacteria that can cause cavities. Regular dental checkups mean your dentist can spot cavities and other issues early on before they affect your tooth pulp.What happens if I delay root canal treatment?Putting off root canal treatment increases the chance that:You’ll lose your infected tooth.The infection in your tooth pulp will spread to other teeth.The infection will spread to your jawbone.Do root canals hurt?Root canal treatment can be uncomfortable, mostly when your provider injects anesthesia into your gums and other parts of your mouth. Your provider wants you to be relaxed during treatment, so never hesitate to let them know if something hurts.If you’re like most people, you’ll have less pain after treatment because it eliminated the infection that made your tooth hurt. Your tooth may feel sensitive for the first few days after treatment. That said, contact your provider right away if you have throbbing pain. Throbbing pain may mean there’s still infected pulp in your tooth.A note from Cleveland ClinicNotice a twinge in one of your teeth when you drink hot or cold liquids? Have a toothache that won’t go away? These may be signs you have an infected tooth and may need root canal treatment. These infections don’t heal on their own, so it’s important to talk to a dentist if you have ongoing tooth pain. If you need a root canal, your dentist or endodontist will explain the process so you know what to expect. You can avoid needing a root canal by brushing your teeth after meals, flossing daily and having regular dental checkups.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 11/20/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Dental CareFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.8500Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"