"Ross Procedure for Aortic Valve Repair800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Ross ProcedureAdvertisementAdvertisementAdvertisementRoss ProcedureThe Ross procedure for aortic valve repair can help you live an excellent quality of life. It replaces a nonfunctioning aortic valve with the pulmonary valve. A healthy donor valve replaces the original pulmonary valve. After recovering, many people live a healthy, active lifestyle for decades.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is the Ross procedure?This complex heart surgery is for adults and children with aortic valve disease. It is also known as a pulmonary autograft procedure and is a type of aortic valve replacement.It involves:Replacing a nonfunctioning aortic valve with your pulmonary valve.Implanting a healthy donor valve where your pulmonary valve used to be.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhy is this procedure necessary?The aortic valve plays a critical role in your health. It opens to release oxygen-rich blood from your heart out to your body and prevents blood from going back into your heart between beats. Aortic valve disease, including stenosis (narrowing) and regurgitation (leaking), can affect valve function, making you feel sick. These issues raise your risk of severe complications, like heart failure and infections.How can a Ross procedure help me?With severe heart valve disease, it’s necessary to replace the non-functioning valve. Using your own tissue maximizes long-term valve function.People who undergo a successful Ross procedure maintain a quality of life similar to people without heart disease. There are no restrictions on physical activity. You are also far less likely to experience heart failure.AdvertisementWhy replace the aortic valve with the pulmonary valve?The Ross procedure involves using a healthy pulmonary valve to repair the aortic valve. This approach is uncommon but ideal because:The aortic valve is under high pressure. A durable replacement ensures long-term valve health. Prosthetic valves are more sensitive to early degeneration and blood clots. Replacements using your natural tissue help you avoid these risks.The pulmonary valve is not under high pressure. It's similar in size and shape to the aortic valve. The pulmonary valve position can better tolerate degeneration of a donor valve.Who’s eligible for a Ross procedure?You may benefit from a Ross procedure if you are younger than 60 years old and have:Congenital aortic stenosis, a narrow aortic valve at birth.Other types of aortic valve disease.Aortic valve endocarditis.AdvertisementWho’s not eligible for a Ross procedure?People with certain conditions are not good candidates for this procedure. These conditions include:Autoimmune diseases such as lupus and rheumatoid arthritis.Connective tissue disorders such as Marfan syndrome.Coronary artery disease in three or more arteries.Pulmonary valve disease.Procedure DetailsWhat happens during a Ross procedure?The Ross procedure takes many hours to complete. Here’s what happens:You go under general anesthesia, which puts you to sleep and temporarily blocks sensation. You will also have no memory of the procedure.Doctors place you on a heart-lung (cardiopulmonary) bypass machine. This makes it possible to safely stop your heart. Cardiopulmonary bypass takes over the work of your heart and lungs during the procedure.Surgeons make an incision down your chest and separate your breastbone (sternotomy) to access your pulmonary and aortic valves.They inspect the pulmonary valve to ensure it is healthy enough to replace the aortic valve.Surgeons remove the damaged aortic valve and replace it with the pulmonary valve. Next, they implant a healthy donor pulmonary valve.With the new valves in place, surgeons restart your heart and slowly take you off the heart-lung bypass machine.They test the aortic and pulmonary valves to ensure they are working properly.To complete the procedure, surgeons put your breastbone back in place and secure it with wires.They close incisions with stitches and protect the area with a surgical dressing.The Ross procedure begins with the measurement of the aortic and pulmonic valves.The next step in the Ross procedure is to open your aorta and pulmonary artery. Your surgeon carefully inspects the valves to determine if the Ross procedure is appropriate.In the Ross procedure, your surgeon removes your diseased aortic valve. Then, they remove the pulmonary valve and move it over to the aortic position.Next in the Ross procedure, your surgeon sutures the pulmonary valve in its new place and reattaches your coronary arteries.Your surgeon attaches a pulmonary homograft (donor tissue) to the outflow tract of your right ventricle as part of the Ross procedure.Finally, the surgeon performing your Ross procedure attaches your aorta to the autograft (formerly your pulmonary valve) and the pulmonary artery to the homograft (donor tissue) and your procedure is complete.Care at Cleveland ClinicAortic Valve Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of a Ross procedure?This procedure offers many benefits, such as:The ability to live an active lifestyle, including regular exercise and driving.The ability for women and people designated female at birth (DFAB) who wish to become pregnant to do so safely.Excellent blood flow throughout your body (hemodynamics).No need for lifelong blood thinners that are typically necessary with other treatments.Quick symptom relief. Many people start feeling better shortly after surgery.What are the risks of the Ross procedure?This complex surgery has many risks. Receiving care from an experienced heart surgeon who performs a high volume of Ross procedures lowers the likelihood of complications.Ross procedure complications may include:Abnormal widening of the aorta near the new valve (aortic autograft dilation).Arrhythmia.Heart attack.Hemorrhage.Infection.Leaky heart valve.Narrowing of the new aortic valve (pulmonary allograft stenosis).Recovery and OutlookWhat is recovery from a Ross procedure like?After surgery, you wake up in the cardiac intensive care unit (ICU). You may need a ventilator to help you breathe. A heart monitor provides real-time assessments of heart function. You can expect to stay in the ICU for up to five days.Your recovery continues at home and can last several months. During this time, it’s common to experience:Constipation.Depression.Insomnia.Loss of appetite.Numbness and swelling near the incision.Will I need more treatments later in life?After a Ross procedure, you’ll need lifelong monitoring to test valve function.A replacement pulmonary valve isn’t meant to last a lifetime and typically needs replacing within 15 to 20 years. Regular monitoring ensures you receive a timely replacement. Healthcare providers often use minimally invasive techniques for this procedure so that you can expect a quick recovery.When to Call the DoctorWhen should I contact my healthcare provider after undergoing a Ross Procedure?Contact your healthcare provider if you experience signs of complications, such as:Bright red stool.Chest pain.Coughing up blood.Dizziness or lightheadedness.Fever or chills.Tingling sensation in your hands or feet.Unusual bruising or bleeding.Vomiting.A note from Cleveland ClinicThe Ross procedure offers a lifeline to people with severe aortic valve disease. It replaces the aortic valve with your pulmonary valve. A healthy donor valve replaces the pulmonary valve. After a successful procedure, many people enjoy a renewed sense of health and hardly any activity restrictions. For the best results, it’s important to receive care from an experienced heart surgeon who has performed a high volume of Ross procedures.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/18/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicAortic Valve Disease TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 800.659.7822Appointments & LocationsTalk to a Heart NurseRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"