"Rotationplasty: What It Is, How It's Done, Outlook800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/RotationplastyAdvertisementAdvertisementAdvertisementRotationplastyRotationplasty is a surgery for bone cancer near the knee. A surgeon removes the middle part of your leg, including the tumor. Your lower leg is reattached at your thigh, but rotated 180 degrees. Your ankle joint functions as your new knee joint. You wear a prosthesis, or artificial limb. Rotationplasty is a more functional alternative to an above-the-knee full leg amputation.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookOverviewWhat is rotationplasty?Rotationplasty is a surgery to amputate (remove) the middle part of your leg when there is a tumor near your knee. Your surgeon rotates the lower section of your leg (shin bone, ankle and foot) 180 degrees. So, your foot points backwards. They reattach it to your remaining thigh bone. The ankle serves as a replacement knee joint. You wear a prosthesis (artificial limb) on your foot. Generally speaking, a rotationplasty leaves you with greater function than you would have with a standard amputation.Van Nes rotationplasty is another name for this procedure.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWho needs to have rotationplasty?People with knee tumors from osteosarcoma or Ewing sarcoma (types of bone cancer) may need rotationplasty. The procedure is more common in children and teenagers since osteosarcoma mostly affects this age group.Children and teenagers are also better candidates for rotationplasty because their bones are still growing. Their reattached leg continues to grow as they grow, so they can adapt to more activities.In some cases, children and adults with the following conditions may need rotationplasty:Congenital (present at birth) leg deformities.Knee infections due to prostheses.Traumatic leg injuries.Who shouldn’t have rotationplasty?People with the following conditions shouldn’t have rotationplasty:Blood vessel problems.Nerve dysfunction.Poor ankle or hip joint function.AdvertisementHow common is rotationplasty?Rotationplasty isn’t a common procedure. Not many healthcare providers have experience performing rotationplasty. In addition, parents and children may be hesitant to choose rotationplasty because of the uncommon appearance of the foot and ankle.Procedure DetailsHow do I prepare for rotationplasty?A rotationplasty requires careful preparation and planning:Patient education: It’s important to have realistic expectations about the appearance of your leg after rotationplasty. Your healthcare provider may show you pictures or videos of other patients who have had the procedure. They’ll also explain what you can expect during rehabilitation.Physical exam: Your healthcare provider makes sure your hip and ankle joints have full range of motion. They’ll also check your nerve function. The sciatic and femoral nerves (the main nerves in the leg) need to be fully functional for the surgery to be successful.Imaging exams: You may have an X-ray, MRI or CT angiography before rotationplasty. These tests help your healthcare provider check the size and location the tumor. They can also see how blood flows through your leg. This information helps your healthcare provider plan your surgery.Prosthesis preparation: Your healthcare provider may make a mold of your foot before surgery. This helps them make a temporary leg prosthesis that you can wear soon after the procedure.AdvertisementWhat happens during rotationplasty?Rotationplasty includes the following steps:Anesthesia: You receive general anesthesia. This is medication that puts you to sleep so you don’t feel pain during your surgery.Amputation: Your surgeon removes the middle part of your leg. Most people will have the lower part of the thigh, the knee and the upper part of the shin bone removed. If you have rotationplasty for bone cancer, your surgeon makes sure to remove all of the tumor.Reattachment: Your surgeon attaches the rest of your shin, ankle and foot to your remaining thigh bone. They rotate the lower part of your leg so your heel faces front and your toes face backward.Stabilization: A plate and screws hold the two sections of your leg in place. This hardware helps connect the thigh bone and shin bone together as your leg heals. The two bones eventually grow together to form a single bone.What happens after rotationplasty?After your surgery, you stay in an intensive care unit (ICU) for at least a few days. You might stay in the hospital for up to a week. A team of healthcare providers monitors your leg, foot and toes carefully.It may take three to six months for the bones in your leg to heal. If you receive chemotherapy for bone cancer after surgery, healing may take longer. You wear a cast on your leg and may need a wheelchair or crutches to move around.Physical therapy is an important part of recovering from rotationplasty. A physical therapist helps you regain strength and flexibility in your hip and ankle joints. A therapist also shows you how to use your new “knee joint” to perform activities.Once your leg heals, you start using a prosthesis. It’s important to have a prosthesis that’s specially made for someone recovering from rotationplasty. A poorly fitted prosthesis can lead to complications and mobility problems. As you grow, you will need new prostheses.Functional results with a well-ﬁtted prosthesis often exceed patient expectations. After three to six months, you'll be able to walk without aid. Most people can return to sports activities, work or attend school within six to 12 months after the procedure.Care at Cleveland ClinicPediatric Osteosarcoma TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the risks of rotationplasty?The biggest risks immediately after surgery include:Arterial occlusion (reduced blood flow).Deep vein thrombosis (DVT) (blood clot in your leg).Edema (swelling due to fluid buildup in the body).Postoperative bleeding.Venous insufficiency (pooled blood in the leg veins).Complications that can occur during the healing process or long after surgery may include:Infections or problems with wound healing.Leg bone fractures.Problems from the prosthesis, such as sores or nerve damage.Slipped capital femoral epiphysis (hip joint misalignment).Thigh and shin bones don’t fuse together.What are the benefits of rotationplasty?Rotationplasty offers several advantages over other procedures, including:Less risk of phantom limb pain (pain where a limb used to be).More leg mobility since the ankle functions as a knee joint.Better leg stability because the foot and toes naturally bear weight and provide balance.Continued bone growth. In children, the reattached bones continue to grow as they grow. A healthcare provider adjusts the prosthesis as they mature.Recovery and OutlookWhat is the outlook after rotationplasty?Most children do well after rotationplasty. Since their bones are still growing, it’s easier for them to adapt to the prosthesis. They’re usually able to return to many activities such as running or playing soccer. Adults may have a longer adjustment period with the prosthesis.As children grow, they’ll need new prostheses. How often will depend on their rate of growth. They might need to work with a physical therapist each time they get a new prosthesis.Will I need a second surgery?Most people who have rotationplasty don’t need a second surgery unless there are complications. In rare cases, issues like fractures or blood vessel problems may need a full-leg amputation.A note from Cleveland ClinicRotationplasty is a surgery for bone cancer near the knee. A surgeon removes the middle part of your leg, including the knee. They reattach the lower shin, ankle and foot to the remaining thigh bone. They also rotate the lower leg 180 degrees so the ankle joint functions as a knee joint. A prosthesis, or artificial limb, attaches to your foot. People who have rotationplasty usually have much better mobility than people who have a full leg amputation.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/10/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicPediatric Osteosarcoma TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2606Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"