"Nasal Cannula: Oxygen, Flow Rate, Benefits & How To Use800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Nasal CannulaAdvertisementAdvertisementAdvertisementNasal CannulaA nasal cannula is a device that delivers extra oxygen through a tube and into your nose. They help people who are having difficulty breathing due to a medical condition or another reason.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional Common QuestionsOverviewWhat is a nasal cannula?A nasal cannula is a device that gives you additional oxygen (supplemental oxygen or oxygen therapy) through your nose. It’s a thin, flexible tube that goes around your head and into your nose. There are two prongs that go inside your nostrils that deliver the oxygen. The tube is attached to an oxygen source like a tank or container.There are high-flow nasal cannulas (HFNC) and low-flow nasal cannulas (LFNC). The difference between them is in the amount and type of oxygen they deliver per minute. You may need to use a nasal cannula in the hospital or in another healthcare setting temporarily, or you may use a nasal cannula at home or for long-term use. It depends on your condition and why you need oxygen therapy.What is a nasal cannula used for?A nasal cannula is beneficial for people who have trouble breathing and aren’t getting enough oxygen. Oxygen is a gas that’s in the air we breathe. We need it for our organs to function properly. If you have certain health conditions or can’t get enough oxygen for another reason, a nasal cannula is one way to get the oxygen your body needs.Your healthcare provider tells you how much oxygen you should have, just as they tell you how many pills to take when they write a prescription. You shouldn’t decrease or increase your oxygen rate without talking to your healthcare provider.When do you use a nasal cannula?Certain health conditions (especially respiratory conditions) make it hard for your body to get enough oxygen. In these cases, getting extra oxygen through a cannula or another oxygen device may be necessary.If you have any of the following conditions, your healthcare provider may recommend a nasal cannula:Asthma, bronchitis or emphysema.Chronic obstructive pulmonary disease (COPD).COVID-19.Cystic fibrosis.Heart failure.Lung cancer or other cancers.Pneumonia.Pulmonary fibrosis.Sleep apnea.A nasal cannula can help anyone at any stage of life. For example, newborns may need to use a nasal cannula if their lungs are underdeveloped or if they’re having breathing difficulties at birth. It’s also beneficial if you’re traveling to an area with higher altitudes where oxygen levels are lower.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyProcedure DetailsHow does a nasal cannula work?A nasal cannula is a thin, flexible tube that wraps around your head, typically hooking around your ears. On one end, it has two prongs that sit in your nose and deliver oxygen. The other end of the tube connects to an oxygen supply. There are several different types of oxygen supply delivery systems. The type of oxygen delivery system you use depends on your condition and what your healthcare provider recommends. Your healthcare provider also determines how much oxygen you need.How long do you need a nasal cannula for oxygen?It depends on your condition and the reason you need supplemental oxygen. Some people need it for the rest of their lives, while others need it while recovering from an illness or during a specific situation. For example, if your oxygen levels drop during childbirth, your provider may give you a nasal cannula for oxygen for just a few minutes. Others may depend on oxygen 24 hours a day or only when they sleep.How much oxygen does a nasal cannula give you?A nasal cannula can be high-flow or low-flow. A flow rate is a measurement of how much oxygen you’re getting through the cannula. It’s usually measured in liters. There’s a device on your oxygen supply that controls the flow of oxygen.High-flow nasal cannulas deliver warm oxygen. It can deliver up to about 60 liters of oxygen per minute. It delivers warm oxygen because oxygen at this flow rate could dry up your nasal passages quickly and lead to nosebleeds.Low-flow nasal cannulas don’t deliver warm oxygen. Because of this, they tend to dry out your nasal passages quicker. The flow rate for a low-flow cannula is up to about 6 liters of oxygen per minute.Remember, your healthcare provider recommends how much oxygen you need. It may seem like getting a high-flow cannula would be more efficient and give you more than enough oxygen. But getting too much oxygen has risks.AdvertisementCan you use a nasal cannula at home?Yes, a nasal cannula is a good option for at-home oxygen therapy.Using a nasal cannula at homeIf you’re using oxygen therapy at home, you must also take care of your equipment. This includes:Checking the tubing for blockages or kinks.Changing the long tube that connects to the oxygen supply (usually monthly).Changing your nasal cannula (the two prongs in your nose) at least once a week. You can also use a cotton pad or wipe containing alcohol to disinfect the cannula between uses.Performing general maintenance on the oxygen supply equipment. Your healthcare provider can talk you through this.Keep in mind that certain types of oxygen run on electricity. You may want to consider a backup electrical method (like a generator) if you use an oxygen system that could fail during a power outage.Since oxygen is highly flammable, you should keep your oxygen system away from any open flames in your home, including stoves, candles and cigarettes.Risks / BenefitsWhat are the benefits of using a nasal cannula?One of the biggest benefits of a nasal cannula is being able to talk and eat while using it because it doesn’t cover your mouth (like a face mask).Some other benefits of a nasal cannula (and oxygen therapy in general) include:Not feeling short of breath and breathing easier. This can greatly improve your quality of life.Feeling less tired. Working so hard to breathe can leave you feeling tired.Sleeping better. Many people with chronic lung conditions don’t sleep well.Having more energy. Having the oxygen your body needs can give you the energy you need to exercise, socialize, travel and more.AdvertisementWhat are the disadvantages of using a nasal cannula?Oxygen therapy has some risks. These risks include:Nasal dryness or irritation from the cannula. Using a water-based ointment or saline spray inside your nostrils can help with this. Using a high-flow nasal cannula (HFNC) with a humidifier unit can also help because it adds moisture to the oxygen you breathe in.Highly flammable materials. Don’t use oxygen around open flames, cigarettes, candles, stoves or aerosol sprays. Oxygen devices are highly flammable and could start a fire.Lung damage or pulmonary oxygen toxicity. This is damage to your lungs and airways from too much oxygen.When to Call the DoctorWhen should I call my healthcare provider?If your provider has prescribed oxygen therapy with a nasal cannula, contact them right away if you have difficulty breathing or have any of the following symptoms:Pale or blue lips.Fever.Changes in breathing like breathing rapidly or laboring to breathe.Nasal flaring (your nostrils get wide when you breathe in).Wheezing, grunting or other noisy breathing.Additional Common QuestionsWhere do you get a nasal cannula?Nasal cannulation, and supplemental oxygen, is usually something health insurance will cover partially or fully because it’s medically necessary. Your healthcare provider will need to provide documentation that you have a health condition that causes low oxygen levels. Speak to your health insurance provider about what they cover and don’t cover when it comes to supplemental oxygen.In most cases, healthcare supply companies or your regular pharmacy can coordinate getting you the supplies you need for oxygen therapy at home.Which is better: nasal cannula or oxygen mask?There are pros and cons to each type of oxygen therapy. Masks typically deliver more oxygen than a nasal cannula, but that doesn’t mean it’s better. It really depends on your needs, lifestyle and what your provider recommends based on your condition.A note from Cleveland ClinicMany people need to use a nasal cannula or other device for extra oxygen. Certain respiratory conditions make breathing hard and exhausting. A nasal cannula is one way to improve your quality of life, give you energy and help you feel better. Some people need to use a cannula for just a short time, while others need it longer. Talk to your healthcare provider about a nasal cannula for oxygen therapy and if it’ll work for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/04/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6503Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"