"Needle Aponeurotomy for Dupuytren’s Contracture800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Needle Aponeurotomy for Dupuytren's ContractureAdvertisementAdvertisementAdvertisementNeedle Aponeurotomy for Dupuytren's ContractureDupuytren's contracture is a tightening and thickening of the fibrous tissue layer underneath the skin of your palm and fingers, which can cause your fingers to curl. Needle aponeurotomy is an in-office procedure that uses a needle to perforate and weaken the contracted cords of fascia so that your fingers can straighten.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a needle aponeurotomy?A needle aponeurotomy (ay-po-ner-AH-tuh-mee) is a procedure to straighten fingers that have become bent due to a condition called Dupuytren’s (doo-pooy-trans) contracture. This procedure is sometimes called a percutaneous needle fasciotomy (PNF).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is Dupuytren's contracture?Dupuytren’s contracture is a disease of a structure in the palm. Specifically, the fascia, a fibrous tissue layer underneath the skin of your palm and fingers, thickens and tightens. This causes your fingers to contract or curl. Your contracted fingers affect your ability to perform such daily tasks as reaching into your pockets, putting gloves on, clapping your hands or holding large objects.Treatment options for Dupuytren’s contracture include surgery (removal of the diseased fascia), injection of collagenase (a drug to dissolve the fascia) and needle aponeurotomy. Unfortunately, there is little benefit from therapy, stretching exercises or cortisone injections (except for the occasional painful palmar nodule). Treatment choice depends on the degree of contracture, joints involved, and number of fingers affected.How does a needle aponeurotomy work?During a needle aponeurotomy, a small needle is used to perforate (make holes in) and weaken the contracted cords of fascia so they can be stretched to allow the fingers to straighten.AdvertisementProcedure DetailsWhat should I expect before a needle aponeurotomy?Your healthcare provider will review pre-treatment steps with you. Before any medical procedure, you should:Provide a list of medications and supplements you currently take.Ask if you need to stop taking medications that interfere with blood clotting such as aspirin, warfarin (Coumadin®), clopidogrel (Plavix®) or other blood thinners.How is a needle aponeurotomy performed?A needle aponeurotomy takes place at your healthcare provider’s office. It’s an outpatient procedure — you go home the same day. The procedure should take less than one hour.During the procedure, your provider:Numbs the hand with a local anesthetic.Uses a thin needle to separate and perforate the thickened fascial cord.Straightens the flexed finger.Covers the open wound with a bandage (you won’t need stitches).You are seen in occupational therapy for fabrication of a custom splint to help keep your fingers straight.Before and after surgery for Dupuytren’s constrictureAdvertisementWhat should I expect after a needle aponeurotomy?After a needle aponeurotomy, you can expect to:Experience some swelling, which you can reduce with ice packs, by elevating your hand as high off the ground as possible, and by keeping your fingers moving.Feel numbness or tingling in the treated hand for a day or two.Have some mild to moderate soreness, which you can treat with over-the-counter pain medication.Wear a splint intermittently during the day for a couple of weeks, and at night for a couple of months.Perform gentle finger bending and straightening exercises at home.Return to work or activities within 48 hours or whenever your healthcare provider gives the OK.Care at Cleveland ClinicWrist and Elbow Pain TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are potential risks or complications of a needle aponeurotomy?A needle aponeurotomy is a relatively safe nonsurgical procedure to release palm and finger contractures. It’s less invasive than removal of the diseased palmar fascia, and has a much quicker recovery.Potential risks of a needle aponeurotomy include:Recurrence of the contractureLoss of hand or finger function or sensation.Nerve or blood vessel damage.Infection.Recovery and OutlookHow effective is a needle aponeurotomy?A needle aponeurotomy is an effective treatment for people with mild to moderate contractures. You might need a more involved hand surgery if the contractures are severe. After the procedure, your fingers might not straighten completely. Contractures return within a couple of years in up to half of those who get needle aponeurotomies. The procedure can be repeated.When to Call the DoctorWhen should I call the doctor?You should call your healthcare provider if you experience:Fever or other signs of infection at the treatment site (redness, tenderness or yellowish discharge).Hand or finger numbness or tingling that lasts more than 48 hours after the procedure.Inability to move or straighten fingers.Severe pain.A note from Cleveland ClinicWhen your fingers stay bent from Dupuytren’s contracture, it can be hard to work and do everyday tasks like washing dishes, driving and getting dressed. A needle aponeurotomy is a nonsurgical treatment that helps patients regain the ability to straighten their fingers, improving motion and function. Talk to your healthcare provider to see if this treatment can help you and to learn about other treatments for Dupuytren’s.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 09/21/2020.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicWrist and Elbow Pain TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2606Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"