"Nephroureterectomy: Purpose, Procedure, Risks & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/NephroureterectomyAdvertisementAdvertisementAdvertisementNephroureterectomyA nephroureterectomy is a surgical procedure that treats transitional cell cancer. During the procedure, your healthcare provider will remove your renal pelvis, kidney, ureter and bladder cuff. Risks include healing problems, blood clots and a poor response to anesthesia. Most people fully recover from a nephroureterectomy after six weeks.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a nephroureterectomy?A nephroureterectomy (neff-roh-yer-it-ter-eck-toh-mee) is a surgery that removes your renal pelvis, kidney, entire ureter and bladder cuff. Your renal pelvis is a funnel-shaped structure in the center of each kidney. It collects urine (pee) and passes it down your ureters.Your ureters are two tubes of muscle that carry pee from your kidneys to your bladder. Your bladder stores your pee. Your bladder cuff is a small piece of tissue where the ureter connects to your bladder.Your healthcare provider may recommend a nephroureterectomy if you have transitional cell cancer (also known as urothelial cancer). A nephroureterectomy is radical surgery. During radical surgery, your healthcare provider removes a tumor and any other organs into which cancer may have spread. For example, if cancer invades your colon, part of it may need to be removed along with your kidney and ureter.During a traditional open nephroureterectomy, your healthcare provider will make one to two large cuts (incisions) in your abdomen. They may also remove a rib. The first incision may be between 8 and 12 inches long. Some tumors are very large and invasive and may require such an open surgical approach.However, most procedures are now robotic-assisted laparoscopic nephroureterectomies. Technology allows your healthcare provider to make precise movements in hard-to-reach areas of your body.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is a robotic-assisted laparoscopic nephroureterectomy?Robot-assisted surgery allows your healthcare provider to use specialized technology to perform minimally invasive surgery. Minimally invasive surgery reduces the size of the incisions and allows for a more rapid recovery.Laparoscopic surgery uses a laparoscope (a thin rod with a camera attached to it) to look at the affected areas.During a robotic-assisted laparoscopic nephroureterectomy, your healthcare provider will make three to five incisions in your lower abdomen. The incisions are only about half an inch long. They use a laparoscope to look inside your incisions. The laparoscope provides magnified views of your renal pelvis, kidney, ureter and bladder cuff on a computer screen. They’ll then use a robot with tiny surgical arms to help perform the procedure.What are the advantages of a robotic-assisted laparoscopic radical nephroureterectomy?A robotic-assisted laparoscopic radical nephroureterectomy has several advantages over an open nephroureterectomy. These include:Faster healing.Shorter hospital stay.Less pain after surgery.Less need for pain medications.Shorter recovery time.Quicker return to normal activities and work.Smaller incisions.Less scarring.AdvertisementWho is the best candidate for a nephroureterectomy?The best candidate for a nephroureterectomy is someone who has transitional cell cancer of the ureter or renal pelvis.Why is a nephroureterectomy done and what does it treat?A nephroureterectomy is the standard treatment for people with transitional cell cancer of the ureter or renal pelvis, particularly if it's on the aggressive end of the spectrum.Knowing your options is the first step in cancer treatment.Laparoscopic radical nephroureterectomy treats people who have transitional cell cancer in their upper urinary system or transitional epithelium.Your body drains pee through your urinary system. Your urinary system includes your kidneys, ureters, bladder and urethra. Transitional epithelium is a tissue that lines your kidneys, ureters and bladder.How common are nephroureterectomies?There are about 12,000 nephroureterectomies performed each year in the U.S.AdvertisementHow painful is a nephroureterectomy?A nephroureterectomy is moderately painful.An open nephroureterectomy is more painful than a robotic-assisted laparoscopic nephroureterectomy.Your healthcare provider may prescribe pain relievers. You may also manage your pain with over-the-counter (OTC) pain relievers.Procedure DetailsWhat happens before a nephroureterectomy?Before a nephroureterectomy, you’ll meet with your healthcare provider. They’ll check your general health. They’ll also take your vitals (temperature, pulse and blood pressure).Tell your healthcare provider about any prescription or OTC medications you’re taking. This includes herbal supplements. Aspirin, anti-inflammatory drugs and certain herbal supplements can increase your risk of bleeding. Be sure to check with your healthcare provider before discontinuing any medications.Tell your healthcare provider about any allergies you have as well. Include all known allergies. These include medications, skin cleaners like iodine or isopropyl alcohol, latex and foods.Your healthcare provider will also give you specific directions on eating and drinking. Follow a clear liquid diet for 24 hours before surgery. You shouldn’t eat anything after midnight the night before your surgery. If you must take medications, you should take them with a small sip of water.How is a nephroureterectomy performed?A special team of healthcare providers will perform a nephroureterectomy. The team typically includes:Urologist.Anesthesiologist.Nurses.Your anesthesiologist will sedate you (put you under) with general anesthesia. You won’t be awake, won’t move and won’t feel any pain during the procedure.Once you’re asleep, your urologist will use a sharp, sterile knife (scalpel) to carefully make several small incisions in your abdomen. They’ll then insert a powerful laparoscope through the incisions to examine your affected areas.Your urologist will use tiny, specialized surgical instruments to remove (extract) your affected organs from one of your incisions.Finally, your urologist will use stitches to close your incisions. They may place small silicone tubes (drainage tubes) in your incision sites. The drainage tubes drain blood or fluid. They’ll stitch the tubes in place.How long does a laparoscopic nephroureterectomy take?A laparoscopic nephroureterectomy takes two to four hours on average.What can I expect after a nephroureterectomy?After a nephroureterectomy, your healthcare provider will cover your stitches with bandages.Your anesthesiologist will stop putting anesthesia into your body to keep you asleep, and at that point, you will become conscious again.You’ll move to a recovery room, where providers will wait for you to more fully wake up and track your overall health. Once you wake up, healthcare providers will treat your pain.Anesthesia sometimes causes nausea. If you have nausea, healthcare providers will give you medication to treat it.You’ll maintain a liquid diet for one to two days after surgery. A liquid diet helps give your body time to recover. After this time, your healthcare providers will help you get back to eating solid foods.The day after surgery, healthcare providers will help you get out of bed and walk. Walking helps your recovery process. It limits the risk of developing blood clots in your legs and prevents pneumonia.Once your healthcare providers determine you’re healthy enough and no longer require monitoring, they’ll let you go home (discharge you). A family member or friend must drive you home. It’s also a good idea to have a family member or friend help take care of you for at least a few days after the procedure.Care at Cleveland ClinicUrology CareMake an AppointmentRisks / BenefitsWhat are the advantages of a nephroureterectomy?The main purpose of a nephroureterectomy is to remove cancer, which can be deadly without treatment. The risks of living with transitional cell cancer without treatment far outweigh any risks associated with a nephroureterectomy in most people.What are the risks of a nephroureterectomy?All surgical procedures have risks. Some risks of a nephroureterectomy include:Anesthesia risks.Healing problems.Possible need for blood transfusion.Infection.Mass of clotted blood (hematoma).Blood clots.Fluid buildup at surgical sites (seroma).Recovery and OutlookWhat is the recovery time after a nephroureterectomy?You must rest and relax for about six weeks after a nephroureterectomy. You shouldn’t drive for at least two weeks after the procedure.You should also avoid strenuous physical activity. This includes running and lifting heavy objects (over 20 pounds). Strenuous physical activity could strain your stitches or cause an injury or hernia. However, walking as exercise is OK and even encouraged after surgery.Your body is unique, so recovery times may vary. It’s a good idea to be aware of your body and its limitations as you recover. Follow your healthcare provider’s general guidelines on managing your pain and discomfort.When can I go back to work?You should be able to return to work about four weeks after your nephroureterectomy.If you have a less physically demanding job, you may be able to return to work sooner.If you have a more physically demanding job, it might be a good idea to schedule more time off.When to Call the DoctorWhen should I see my healthcare provider?Schedule follow-up appointments with your healthcare provider. They’ll want to check your incisions and stitches. If you don’t have dissolvable stitches, they may remove your stitches after one to two weeks. If you have drainage tubes, they’ll remove those as well.They’ll also conduct tests to make sure your transitional cell cancer is gone. If your transitional cell cancer spreads, they’ll help you coordinate the next steps in your treatment plan.Contact your healthcare provider immediately if you experience any abnormal symptoms. Symptoms may include:Heavy bleeding at your incision sites.Discolored drainage from your incisions.A fever of 100 degrees F (38 degrees C) or higher.Infection.Bad odor.Skin separation at your stitches.Increased pain.A note from Cleveland ClinicA nephroureterectomy is the most common and effective treatment for transitional cell cancer. A robotic-assisted laparoscopic nephroureterectomy is more common than an open nephroureterectomy. The process may sound complicated and confusing. However, your healthcare provider is available to answer any of your questions.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/18/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicUrology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"