"Nephrectomy: Surgery Types, What to Expect, Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/NephrectomyAdvertisementAdvertisementAdvertisementNephrectomyA nephrectomy is surgery to remove a kidney. Your surgeon may perform a partial nephrectomy to remove only a portion of your kidney. Or you may have a radical nephrectomy, where your surgeon removes your entire kidney. If you have kidney disease or cancer, a nephrectomy can be a life-saving procedure.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewWhat is a nephrectomy?A nephrectomy is the surgical removal of one kidney. Bilateral nephrectomy is the surgical removal of both kidneys.There are two types of nephrectomy procedures:Partial nephrectomy, where a surgeon removes only the diseased portion of the kidney. You may have an open partial nephrectomy or a laparoscopic/robotic partial nephrectomy.Radical nephrectomy, where a surgeon removes the entire kidney. Surgeons may also remove a section of the ureter (tube leading to the bladder), in a procedure called nephroureterectomy. They may also remove the adrenal glands (hormone glands that sit above the kidneys). This may also be performed as an open or laparoscopic/robotic procedure.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is the difference between a laparoscopic and open surgery?Surgeons use two different techniques for nephrectomies. A laparoscopic nephrectomy uses a small tool with a camera (laparoscope) and a few tiny incisions. In a robotic-assisted laparoscopic case, a surgical robot is controlled by the surgeon to manipulate these small tools. An open nephrectomy uses one large incision. Surgeons view directly inside the body and do not use a camera.Laparoscopic nephrectomy may lead to shorter hospital stays and quicker recovery times. However, surgeons may use open surgery if laparoscopic surgery is not an option. For example, laparoscopic surgery often requires longer periods under anesthesia. Some people may not respond well to being under anesthesia for long periods. Also, others may have a large kidney tumor for which these minimally-invasive techniques may not be the best choice. In these cases, an open approach could be safer.Why is kidney removal done?The most common reason to have a nephrectomy is to remove a tumor from the kidney. A kidney tumor may be cancerous or benign (noncancerous).Some people need a nephrectomy if their kidney is the source of repeat infections or is no longer working. Surgeons also use nephrectomies to remove a healthy kidney for a kidney donation.AdvertisementDo I need both kidneys?Most people are born with two kidneys, but you usually can function with only one.If you have both kidneys removed, you'll need a kidney transplant or dialysis (a treatment to take over your kidney functions) to remain alive.Procedure DetailsWhat happens before a nephrectomy?Before kidney surgery, your healthcare provider will give you instructions about how to prepare. You'll need to stop taking certain medications, such as blood thinners, in the days before the operation. Your surgeon will also likely instruct you to fast (not eat) and stop drinking liquids the night before the procedure.A few days before surgery, your healthcare provider will draw blood. This test determines your blood type in case you need a blood transfusion, and will also determine baseline kidney function and blood countsAdvertisementWhat happens during a nephrectomy?Your surgeon may use laparoscopic or open surgery. Before either kidney removal procedure, you will receive general anesthesia (medication to help you remain asleep) to ensure you don’t feel anything.During a laparoscopic nephrectomy, your surgeon:Makes one or a few small incisions in your abdomen or side.Inserts a long wand with a camera (laparoscope) through the incision.Views the camera image from the laparoscope on a large screen.Uses the camera image and small surgical tools to remove the diseased portion of your kidney or your entire kidney.Closes all incisions with small stitches that will dissolve on their own.During an open nephrectomy, your surgeon:Makes one incision in your abdomen.Removes the diseased portion of your kidney or your whole kidney.Closes the incision with stitches.What happens after a nephrectomy?You will need to stay in the hospital for one to five days after surgery. How long you stay in the hospital depends on what type of nephrectomy you had.Your healthcare team will monitor your blood pressure, electrolytes and fluid levels. Typically, you will have to use a urinary catheter (hollow tube to drain urine) for the first few days after surgery.At first, the incision will be sore, and you may notice some numbness, too. Your healthcare team can help you with pain management, as needed.Because your incision will be near your diaphragm (muscle under your lungs), it may be uncomfortable to breathe deeply. However, performing diaphragmatic breathing exercises is important for preventing pneumonia (lung infection).Care at Cleveland ClinicUrology CareMake an AppointmentRisks / BenefitsWhat are the advantages of a nephrectomy?In cases of kidney cancer, a nephrectomy can be a life-saving procedure. If you have a nephrectomy to remove a kidney for donation, your donor kidney can save someone else’s life. Most people function well with only one kidney.What are the potential risks of a nephrectomy?All surgeries carry some risk of infection. If you have disease or damage in your remaining kidney, there is a small risk of kidney failure.Recovery and OutlookWhat is the recovery time after a nephrectomy?After you return home, you may be able to return to light activity within a week or two. You will need to avoid heavy lifting or strenuous activity for at least six weeks.After six weeks, you will need blood tests to monitor the function of your remaining kidney. Your healthcare provider will give you instructions on how often you need these tests.When to Call the DoctorWhen should I see a healthcare provider?You should call 911 or seek immediate care if you experience any symptoms of kidney failure. Call your healthcare provider if you notice:Changes in urination, including frequent urination or changes in urine color.Edema (swelling) in the legs, lower back or face.Increasingly high blood pressure.Nausea or vomiting.Brain fog.Additional DetailsHow might my life change after my kidney is removed?People who have only one kidney after a nephrectomy need ongoing care to monitor kidney function. You will need urinalysis (urine-screening test) and blood tests at least once a year.You will also have to stay away from activities that increase your risk of kidney injury. For example, you should avoid high-contact sports such as hockey, football or wrestling.A note from Cleveland ClinicDuring a nephrectomy, surgeons remove all or part of your kidney. Healthcare providers may use nephrectomy to remove a tumor or remove a kidney for donation. While most people are born with two kidneys, you can usually function well with only one. You should be able to return to normal activities about six weeks after surgery. After nephrectomy, you'll need follow-up care to keep an eye on the function of your remaining kidney.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 05/02/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicUrology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementUrology 216.444.5600Kidney Medicine 216.444.6771Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"