"Nerve Block: What It Is, Procedure, Side Effects & Types800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Nerve BlockAdvertisementAdvertisementAdvertisementNerve BlockA nerve block is an injection that may provide temporary pain relief. It can also help diagnose sources of nerve pain. There are several different types of nerve blocks based on which nerve it’s targeting, such as a genicular nerve block or an occipital nerve block.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a nerve block?A nerve block is an injection of medication close to a targeted nerve or group of nerves to provide temporary pain relief. Some injections provide prolonged pain relief. An injection of anti-inflammatory medication in addition to local anesthetic may allow the damaged nerves to heal by relieving the inflammation.Nerves are like cables that carry electrical signals between your brain and the rest of your body and vice versa. These signals help you feel sensations (like touch and pain) and move your muscles. They also maintain certain functions like breathing, sweating or digesting food. Nerve blocks mainly address issues with pain signaling, but they can affect other nerve functions as well.The effects of the injection are usually quick, but nerve blocks are often just a temporary fix. Some people may benefit from one injection, while others need multiple. Some people don’t experience any effects from the block and may require different treatment methods to manage their symptoms.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is the purpose of a nerve block?Nerve blocks have three general purposes:Therapeutic nerve blocks: The goal of these nerve blocks is to achieve temporary pain relief for acute (sudden and short) or chronic (long-term) pain. The nerve block may reduce inflammation and allow your nerves to heal and, thus, relieve pain.Diagnostic nerve blocks: If you’re experiencing pain but your healthcare provider doesn’t know the exact source of it, they may perform a nerve block. If you experience pain relief from the injection, it generally means that the targeted nerves are the source of the pain. If you don’t experience relief, the pain is likely coming from a different source. Diagnostic nerve blocks can help your provider plan future treatment.Anesthetic nerve blocks: Anesthesiologists or surgeons often administer nerve blocks before surgeries to help manage pain after the procedure. They use this in addition to general anesthesia for complex surgeries. For some smaller surgeries, you can choose a nerve block instead of anesthesia, such as carpal tunnel surgery or trigger finger release surgery.What are the types of nerve blocks?Your body has hundreds of major nerves that could be potentially targeted for a nerve block. Because of this, there are several types of nerve blocks. A few examples include:Celiac plexus nerve block: Your celiac plexus is a bundle of nerves in your upper abdomen that sits behind your pancreas close to your aorta. This block can help relieve pain due to pancreatic cancer or chronic pancreatitis.Epidural nerve block: This is an extremely common nerve block that’s best known for blocking pain during labor and childbirth, but providers use it for surgeries as well. The goal of an epidural block is to provide pain relief (analgesia) or a complete lack of feeling (anesthesia) for one region of your body, such as your legs or belly.Genicular nerve block: Your genicular nerves run around your knee joints. This block can help with chronic knee pain or for surgeries that result in moderate to severe postoperative (after surgery) knee pain.Intercostal nerve block: Your intercostal nerves are under each of your ribs. This block can provide temporary pain relief from rib fractures and can help diagnose and treat neuralgia (nerve pain).Lumbar sympathetic nerve block: Your sympathetic nerves are on both sides of your spine in your lower back. This block can help relieve lower back and leg pain, such as from sciatica or complex regional pain syndrome (CRPS).Occipital nerve block: Your occipital nerves are a group of nerves in the back of your head. They arise from the C2 and C3 (C is for “cervical” and refers to vertebrae in your neck) spinal nerves. This block can help diagnose and treat occipital neuralgia (occipital headache). It can also help manage chronic intractable migraine, which often requires multiple blocks.Pudendal nerve block: Your pudendal nerve is a major nerve in your pelvic region. It sends movement (motor) and sensation information from your genital area. Healthcare providers sometimes recommend pudendal nerve blocks to provide pain relief during labor and delivery if you can’t have or don’t want an epidural. This block can also help relieve genital, tailbone (coccyx) and rectal pain (pudendal neuralgia).Stellate ganglion block: Your stellate ganglion is a collection of nerves in your neck, on both sides of your voice box. This block can help relieve pain in your head, neck, upper arm and upper chest. It also can help increase circulation and blood flow to your arm.Trigeminal nerve block: Your trigeminal nerves are on both sides of your face. This block can help treat different causes of pain in your face (trigeminal neuralgia).AdvertisementProcedure DetailsHow does a nerve block work?To understand how nerve blocks work, it helps to understand how your body processes pain:Your nerves have nociceptors, which are a specific type of nerve receptor that constantly monitors for signs of damage or injury to your body.If they detect signs of damage or injury, nociceptors fire off high-priority signals to your brain, telling it what they detect. These signals aren’t pain itself. They’re more like a code describing the problem.Your brain receives and processes those signals and translates the code. Once your brain decodes the signal, it processes them into the feeling of pain you experience.Anesthetics in nerve blocks work by preventing nerve cells from sending or relaying those coded electrical signals.Sometimes, your body can respond to an injury with an inflammatory response that lasts too long. Extended inflammation can cause extended pain. In this case, the medication can also reduce inflammation in the affected nerve to allow it time to heal. This may lead to a decrease in pain.How do I prepare for a nerve block?You usually don’t have to do anything special to prepare for a nerve block.In some cases, your healthcare provider may recommend sedation for the procedure. If you’re receiving sedation, you’ll need to fast for six to eight hours before it. You’ll also need someone else to drive you home after the procedure.In any case, your healthcare provider will let you know what to do if anything. Be sure to follow their instructions. Don’t hesitate to ask questions.AdvertisementWhat happens during a nerve block injection?Doctors typically perform nerve blocks for pain management in an outpatient setting. This means you’re not admitted to a hospital for the procedure and can go home shortly after it.There are hundreds of types and varieties of nerve blocks, each with slightly different processes. But in general, you can expect the following when you receive a nerve block:A provider will position you on an exam table in a certain way so they can easily access the injection point.You may receive a mild sedative through an IV line in your arm to help you relax.The provider will clean your skin with an antiseptic solution. They’ll give you an injection of a local anesthetic to numb the area where you’ll receive the nerve block. You may still feel a pinch or some discomfort as the needle enters your skin.The provider may use imaging guidance, such as ultrasound or X-ray, to locate the exact spot where the injection needs to go. They’ll then inject the medication as close to the affected nerve as possible.After the procedure, you’ll rest until the medication takes effect.What happens after a nerve block injection?After the injection, you’ll rest for 15 to 30 minutes to let the medication take effect. A healthcare provider will also observe you during this time to make sure you don’t have any unexpected side effects. You’ll then be able to go home.Care at Cleveland ClinicTrigeminal Neuralgia TreatmentFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the benefits of a nerve block?Potential benefits of a nerve block include:Temporary or permanent pain relief, which may help you function better day to day.Temporary or permanent reduction of inflammation in the affected nerves, which may help them heal.Providing a diagnosis. A nerve block can help your provider identify a more specific cause of pain.It’s important to note that not everyone experiences pain relief from nerve blocks. You may need to try other treatment options if this is the case. In addition, some nerve blocks may only be effective if you do a course of physical therapy afterward.What are the risks or complications of a nerve block?Complications of nerve blocks are rare. And each type of nerve block has different risks and side effects. For example, a stellate ganglion block may cause difficulty swallowing, drooping eyes and hoarseness. A celiac plexus block may lead to delayed emptying of stomach contents (gastroparesis).But in general, risks and complications of nerve blocks include:Infection at the injection site.Bleeding at the injection site.Accidental delivery of the medication into your bloodstream.Unexpected spread of the medication to other nerves or your spinal canal (depending on the type of block).Be sure to talk to your provider about the risks and benefits of the specific type of nerve block you’re getting.Recovery and OutlookHow long does a nerve block last?Pain relief from a nerve block can vary significantly. It may last a few days, several weeks, months or even years. Each person responds differently. Some people may get relief from a single injection, while others may need multiple nerve block treatments. Some people don’t experience any pain relief.When to Call the DoctorWhen should I call my healthcare provider?Contact your healthcare provider immediately if you experience any new symptoms or complications from the nerve block, such as an infection or nerve issues like burning pain, weakness or tingling.A note from Cleveland ClinicNerve blocks can help treat a variety of pain-related conditions. But the results can vary considerably from person to person. If you’re feeling anxious about receiving a nerve block injection, don’t hesitate to ask your healthcare provider about it and the procedure. They can answer any questions you may have.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 03/07/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicTrigeminal Neuralgia TreatmentFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7243Questions 216.444.9134Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"