"Nipple Shields for Breastfeeding: When & How To Use Them800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Nipple ShieldAdvertisementAdvertisementAdvertisementNipple ShieldA nipple shield is a thin piece of silicone that is placed on your areola and nipple. It's used as a short-term solution when your baby is having trouble learning to breastfeed. You should only use a nipple shield after weighing the pros and cons with your healthcare provider or lactation consultant.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorAdditional DetailsOverviewA nipple shield is a thin silicone device that covers your real nipple during breastfeeding. It helps babies who are having issues latching onto the breast.What is a nipple shield?A nipple shield is a silicone device worn over your nipple to help your baby if they struggle with breastfeeding (chestfeeding or nursing). Nipple shields have a base that wraps around your areola (skin around your nipple) with a cone-shaped area for your nipple. Some nipple shields have an area cut out to allow more skin-to-skin contact between you and your baby. The nipple part of the shield has tiny holes at the tip that allow milk to flow into your baby’s mouth. Most nipple shields are thin, flexible and transparent.You use a nipple shield when your newborn isn’t nursing or nursing ineffectively due to poor latch or other issues. You stop using a nipple shield when your baby gets better at nursing and the breastfeeding issues resolve. Nipple shields are used as a last resort when other methods to establish breastfeeding don’t work. They should be used temporarily and under the guidance of your healthcare provider or a lactation consultant.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhen do people use nipple shields?People use nipple shields when their baby is learning how to breastfeed, usually in the first several weeks after birth. Some babies struggle early on with latching (or attaching) to the breast for various reasons. This can cause your baby not to get enough milk and lead to poor weight gain. Using a nipple shield can give your baby extra time to learn to nurse or improve their ability to suck.For parents who wish to breastfeed, using a nipple shield can let them continue breastfeeding and avoid pumping into bottles or switching to formula.Speak to a lactation consultant before using a nipple shield. They’ll want to try other methods to improve breastfeeding before recommending a nipple shield. Once your baby gets the hang of nursing and things are going more smoothly, your lactation consultant can help you stop using, or wean from, a nipple shield.What does a nipple shield help with?A nipple shield helps with your baby’s latch. Your baby’s latch refers to how their mouth attaches to your nipple and areola during breastfeeding. A good latch helps your baby empty the breast and get enough milk during feedings. An improper latch is a common cause of breastfeeding pain. This is because your baby is sucking just the tip of your nipple instead of taking the entire areola into their mouth.A nipple shield may be helpful when:Your baby is premature. Premature babies may not be strong enough to suck or latch on to a human nipple.Your baby has a tongue-tie, tongue thrust or retracted tongue. These can be fixed or may improve over time.You have inverted, short or flat nipples. A nipple shield helps by making your nipple longer and harder.You have very soft breasts. A shield helps by making your breasts feel more firm.Your baby needs more stimuli to begin sucking. A more extended nipple can help stimulate the roof of your baby’s mouth, where the suck reflex is.Your nipples are sore, cracked or bleeding from a poor latch. Wearing a shield could help your nipples heal.You have an overactive let down. A let down refers to the initial flow of milk from your nipple.You’re transitioning your baby from a bottle to breastfeeding.Speak with your lactation consultant before using a nipple shield. They’ll want to observe your baby’s latch and nursing position to ensure a nipple shield is truly necessary. Sometimes, minor adjustments can prevent you from needing a nipple shield.AdvertisementProcedure DetailsHow do you put a nipple shield on?It’s important that your nipple shield is the right size and is applied correctly. Using a nipple shield incorrectly will lead to more problems with breastfeeding or prevent milk from flowing from your breast to your baby.Steps for putting on a nipple shield:Turning your nipple shield inside out before applying helps draw your nipple into the cone-shaped area of the shield better.Place your thumbs on the base of the nipple, then flip it halfway inside out. That'll leave a small dimple at the end. Your nipple should be drawn into the nipple area of the shield as deeply as possible once it’s applied.Put your nipple into that dimple. Then, stretch the silicone base of the nipple shield over your breast.It should feel snug around your areola, and your nipple should be deep into the nipple area of the shield. Your nipple should fit comfortably without scraping the sides.Applying nipple cream or water around the edge of the nipple shield can sometimes help it stick.Your nipple shield will come with instructions you can follow. If you’re working with a lactation consultant, ask them to show you how to put on the nipple shield.How should a nipple shield fit?Nipple shields come in sizes. The sizes are measured in millimeters and depend on the size of your infant’s mouth. When your baby is latched correctly to a nipple shield, their mouth should be over the whole nipple with their lips extended around the areola. Your baby should not be sucking on just the tip of the nipple. Your nipple should fit inside the conical shape of the nipple shield without touching the side.If you’re unsure what size you need, talk to your lactation consultant. They’ll guide you on selecting the correct size and even demonstrate how to put on a nipple shield.How does a nipple shield work?A nipple shield is almost like a second nipple. It goes over your breast and nipple and has tiny holes at the end where milk can transfer from your nipple to your baby’s mouth. It helps infants with trouble latching onto the breast by acting like a longer, firmer nipple. This makes it easier for your baby to learn how to latch and suck. You should stop using a nipple shield once your baby is strong enough to nurse from your nipple directly.AdvertisementRisks / BenefitsWhat are the advantages of using a nipple shield?Using a nipple shield is usually a last resort for lactation professionals because the drawbacks may outweigh the benefits. A nipple shield is recommended when:There’s an issue with your baby’s mouth or tongue that’s affecting their latch. This can be due to prematurity or a condition like tongue-tie.Your nipple is short or inverted and doesn’t reach the roof of your baby’s mouth (where the sucking reflex is).All other methods to improve your baby’s latch have been exhausted.Your nipple is damaged and needs a chance to heal while you work on improving your baby’s latch.What are the risks of using a nipple shield?A lot of lactation professionals will avoid using a nipple shield unless it’s necessary. Some of the disadvantages of using a nipple shield are:It acts as a barrier between you and your baby. This can affect milk supply because there is less stimulation between your baby and your breast. The more skin-to-skin contact you can offer your baby, the better.It’s difficult to wean a baby from a nipple shield. They may become too dependent on it.There is slightly less milk transfer. You could develop mastitis more easily because your baby isn’t fully emptying your breast each feeding. This could also lead to a low milk supply.It’s hard to apply and use correctly, which could lead to your baby getting less milk.How do you wean a baby from a nipple shield?A nipple shield is meant to be a learning tool to help your baby learn to latch and nurse. This means it’s a short-term solution. Once your baby’s latch has improved, your lactation consultant will advise you to wean your baby from the nipple shield. Some tips to help you stop using a nipple shield are:Try weaning at times when your baby feeds the best.Pump until your milk “lets down,” then breastfeed.Go to a quiet, comfortable area without distractions.Offer lots of skin-to-skin contact without the nipple shield (to see if the baby latches).Gradually remove the shield partway through nursing or when you switch breasts.Breastfeed frequently and before your baby is too hungry. Hungry babies tend to be fussier.Try to remove the nipple shield when your baby is sleepy or almost asleep.Consider using your lactation consultant for support during this time. They may be able to offer personalized attention to you and your baby to help ease the transition.Recovery and OutlookHow long can I use a nipple shield?Most lactation consultants prefer to use a nipple shield for a few weeks or less. The longer a nipple shield is used, the harder it usually is to stop using one. It can also disrupt your milk supply. Your lactation professional can help you with the weaning process to make this easier for both you and your baby.How do I know the nipple shield is working?The best way to know your nipple shield is working is if your baby seems full or satisfied after a feeding and you hear your baby swallowing while nursing. You can also monitor how much milk they get by weighing them on a healthcare provider’s scale or counting how many wet diapers they have each day. Your baby should have at least six wet diapers per day.When to Call the DoctorWhen should I contact my healthcare provider?Contact your healthcare provider or your lactation consultant if any of the following apply to you:Your baby isn’t gaining enough weight.Your baby seems overly fussy at the breast.Your nipples are cracked, sore or bleeding from nursing.Your baby hasn’t had a wet diaper in six hours.In certain circumstances, they may recommend a nipple shield to help you and your baby with breastfeeding. If a nipple shield is not recommended, they’ll help you find a solution so you can continue with breastfeeding.Additional DetailsDoes a nipple shield help with pain?Yes, a nipple shield can help with cracked, sore or bleeding nipples. A bad latch causes painful nipples. If your baby continues to latch poorly to a nipple shield, you may still feel pain even while wearing one. Getting your baby to latch correctly is the first step in relieving nipple pain. Once this happens, you should be able to breastfeed without pain.Are nipple shields recommended?Nipple shields are recommended for some people, but not recommended for everyone. They should be used under the guidance of a lactation professional and only after weighing the pros and cons.Where can I get a nipple shield?You can get a nipple shield at retail stores, pharmacies or through your healthcare provider or lactation professional. They are often available at the hospital after you deliver your baby.How do I clean my nipple shield?Sterilize your nipple shield before its first use (if possible) by placing it in boiling water for 15 minutes. You should wash your nipple shield with hot water and soap after each use. It can also be put on the top rack of a dishwasher on a hot cycle. Make sure it’s completely dry before using it again.A note from Cleveland ClinicA nipple shield can be a great tool for frustrated parents and babies. If your baby is struggling with breastfeeding and nothing else has worked, your lactation consultant may recommend a nipple shield. When used correctly, it helps with nipple pain and allows your baby to maintain a good latch. It’s important to follow the guidance of your lactation professional and stop using a nipple shield once your baby has the hang of nursing. Know that you’re not alone, and many families require breastfeeding support.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 12/05/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6601Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"