"Nissen Fundoplication: What Is It, Procedure Details & Recovery800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Nissen FundoplicationAdvertisementAdvertisementAdvertisementNissen FundoplicationA Nissen fundoplication is a surgery to treat gastroesophageal reflux disease (GERD). During the procedure, a surgeon creates a sphincter (tightening muscle) at the bottom of the esophagus to prevent acid reflux. Most people notice a significant decrease in acid reflux symptoms after the surgery.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewWhat is a Nissen fundoplication?A Nissen fundoplication is a surgery to correct gastroesophageal reflux disease (GERD). The surgery tightens the junction between the esophagus and the stomach to prevent acid reflux.The esophagus is the tube between your mouth and stomach. It is part of your gastrointestinal (GI) system.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat is GERD?GERD (chronic acid reflux) is a digestive system disorder that affects the esophagus. If you have GERD, your stomach acid and contents persistently flow back up through your esophagus.What are the types of Nissen fundoplication?Surgeons perform two types of Nissen fundoplication surgery:Laparoscopic procedures use tiny incisions (cuts) and cameras to view inside the body.Open procedures use larger incisions so the surgeon can access inside the body with larger instruments and more range of motion.AdvertisementWho needs to have a Nissen fundoplication?Sometimes, you can find relief from acid reflux symptoms with medication or lifestyle changes. If symptoms continue after trying noninvasive treatments, your healthcare provider may recommend Nissen fundoplication surgery. Both children and adults can be candidates for Nissen fundoplication.Procedure DetailsWhat happens before a Nissen fundoplication?Before Nissen fundoplication surgery, your surgeon may order tests to examine your stomach and esophagus.GI X-rays (barium swallow X-rays) take images of your esophagus, stomach and small intestine.Esophageal manometry measures the pressure in your esophagus when you swallow.Upper endoscopy examines the upper part of your stomach.A pH probe to look for evidence of acid in the esophagus.Healthcare providers use these tests to assess any narrowing in your esophagus. They may also order these tests to look for a hiatal hernia. In this condition, the top of the stomach bulges into the esophagus. Hiatal hernias can worsen GERD symptoms.AdvertisementHow do I prepare for a Nissen fundoplication?Your healthcare provider will instruct you or your child not to eat or drink anything after midnight the evening before surgery.What happens during a Nissen fundoplication?What happens during your surgery varies slightly depending on whether your surgeon uses an open or a laparoscopic approach. In both procedures, an anesthesiologist first gives you intravenous (IV) medication so you fall asleep.During open acid reflux surgery, the surgeon:Makes one large incision in your abdomen.Wraps the upper part of the stomach (fundus) around the lower part of the esophagus.Closes the incision with staples.During laparoscopic Nissen fundoplication, the surgeon:Makes four to five small incisions in your abdomen.Inserts a laparoscope (small tool with a camera) into your abdomen.Uses the camera images and tiny operating tools to wrap the upper stomach around the lower esophagus.Closes the incision with stitches.What happens after a Nissen fundoplication?Immediately after surgery, your throat might be sore for a day or two. If you or your child had open fundoplication surgery, you will need a temporary nasogastric (NG) tube. The tube clears the stomach of digestive juices while you heal.You or your child may also need an IV (intravenous) line to deliver fluids until you can eat again. You’ll be able to resume eating once you have passed gas or had a bowel movement. Those actions are signs that your body is getting back to its usual function.Adults or children may spend one or more days in the hospital after surgery. Recovery depends on whether the surgeon used a laparoscopic or open approach, as well as if other medical problems exist. Many patients who have laparoscopic surgery can go home the next day.Care at Cleveland ClinicSchedule General SurgeryFind a Doctor and SpecialistsMake an AppointmentRisks / BenefitsWhat are the advantages of a Nissen fundoplication?Most people notice an improvement in acid reflux symptoms after a Nissen fundoplication. Relieving GERD keeps you more comfortable and reduces the chance of developing Barrett’s esophagus. Barrett’s esophagus raises the risk of esophageal cancer.People who have laparoscopic Nissen fundoplication also benefit from:Faster recovery.Less pain.Shorter hospital stay.What are the risks or complications of a Nissen fundoplication?The primary risk of Nissen fundoplication surgery is that symptom relief does not always last. Some patients need another surgery after two to three years. Like all surgeries, Nissen fundoplication also carries a risk of infection at the incision site.Recovery and OutlookWhat is the recovery time after a Nissen fundoplication?For the first seven to 10 days after surgery, many surgeons will recommend a soft foods diet. Usually, you can return to usual activities and light exercise within a few days of surgery.Children can usually go back to school within a few days after going home from the hospital. They should avoid strenuous activity for at least three weeks. Restrictions on activity can vary between laparoscopic and open procedures.When to Call the DoctorWhen should I see my healthcare provider?If acid reflux symptoms return after surgery, speak with your healthcare provider.After surgery, you may also notice some swelling around your incision. Call your healthcare provider if you experience:Bleeding.Excessive swelling.Fever.Flushed or hot skin around the incision.Vomiting.A note from Cleveland ClinicNissen fundoplication is a surgery to treat GERD. If you have acid reflux that has not responded to medication or other noninvasive treatment, your healthcare provider may recommend surgery. Often, surgeons use a laparoscopic approach to Nissen fundoplication. Laparoscopic surgery uses smaller incisions and results in a quicker recovery. Most people who get a Nissen fundoplication experience a decrease in GERD symptoms.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 04/26/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicSchedule General SurgeryFind a Doctor and SpecialistsMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.7000Appointments & LocationsRequest an AppointmentContact UsFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"