"Non-Rebreather Mask: Uses, What It Is & How It Works800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Non-Rebreather MaskAdvertisementAdvertisementAdvertisementNon-Rebreather MaskA non-rebreather mask is an oxygen mask that delivers high concentrations of oxygen. It’s for when a person needs oxygen quickly in emergencies like injury, smoke inhalation or carbon monoxide poisoning.  It’s not available to use at home.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional DetailsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional DetailsOverviewWhat is a non-rebreather mask?A non-rebreather mask (NRM) is a device that gives you oxygen, usually in an emergency. It’s a face mask that fits over your mouth and nose. An elastic band stretches around your head to keep the mask on. The mask connects to a small bag filled with oxygen (reservoir bag), and the bag is attached to an oxygen tank. It provides a high concentration of oxygen quickly, typically in a hospital or emergency room, or in an ambulance during transportation to a hospital.The main feature of a non-rebreather mask is that it has several one-way valves. Simply put, a one-way valve ensures air only comes in or out one way. The valves prevent you from “rebreathing” any exhaled air or room air. You’re only inhaling oxygen directly from the reservoir bag and oxygen tank, with no outside air diluting the oxygen. While this gets you more oxygen faster, it’s also a risk. When the oxygen tank empties, there’s no other source of air, meaning you could suffocate in the mask. .Most studies report that a non-rebreather mask allows a person to get 60% to 90% FIO2, which stands for fraction of inspired oxygen (oxygen in the air). This is a high and concentrated amount of oxygen. For reference, the FIO2 of a standard face mask (also called a rebreather mask) is about 40% to 60%, and the FIO2 in the air around you is about 21%.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhen do you use a non-rebreather mask?Non-rebreather masks are usually for emergency use when a person has low blood oxygen levels, but can breathe on their own. Some examples of emergency situations would include:Smoke inhalation.Carbon monoxide poisoning.Trauma or other serious injury to your lungs.Cluster headaches.Severe, chronic airway disorders such as COPD or cystic fibrosis.What is the difference between a partial rebreather and a non-rebreather mask?The main difference between the two masks is in how much recycled air you rebreathe. A partial rebreather mask has two-way valves instead of one-way valves. This means you rebreathe a small amount of outside air. With a non-rebreather mask, the one-way valve doesn’t allow you to breathe in any outside air. Because of this, a partial rebreather mask doesn’t have the same risk of suffocation as a non-rebreather mask. The FIO2 of a partial rebreather mask is slightly less than a non-rebreather mask.Procedure DetailsHow does a non-rebreather mask work?A non-rebreather mask consists of:A face mask.A small, clear bag called a reservoir bag.Three or four one-way valves.Tubes to connect the bag to an oxygen tank.Oxygen tank.Oxygen flows from the oxygen tank to the reservoir bag through tubing. A one-way valve connects the bag to the face mask. The face mask covers your nose and mouth and forms a tight seal against your skin. When you breathe, you breathe just the air from the bag and oxygen tank.The one-way valves on a non-rebreather mask prevent you from breathing in any other air. They also remove exhaled air out of the mask so it doesn’t go into the reservoir bag and dilute the oxygen.How long can you be on a non-rebreather mask?A non-rebreather mask is meant for temporary use when you need a lot of oxygen fast. It’s not an oxygen therapy that you would use long term or at home. There are other types of oxygen delivery devices that work better in those situations and don’t carry the risk of suffocation. Because a non-rebreather mask relies solely on an oxygen supply, once the supply runs out, a person could suffocate. How long this takes depends on the size of the oxygen tank. A healthcare provider will monitor you while using a non-rebreather mask.AdvertisementHow many liters of oxygen do you need for a non-rebreather mask?A non-rebreather mask typically has a flow rate of about 12 to 15 liters of oxygen per minute.Can I use a non-rebreather mask at home?No, you don’t use a non-rebreather mask at home. Healthcare providers in a hospital or emergency department use non-rebreather masks. There are better options for home oxygen therapy that your healthcare provider can discuss with you.AdvertisementRisks / BenefitsWhat are the benefits of a non-rebreather mask?The main benefit of a non-rebreather mask is that it delivers a high concentration of oxygen quickly. This is especially helpful in situations where a person needs extra oxygen due to dangerously low blood oxygen levels.What are the disadvantages of a non-rebreather mask?The biggest risk of a non-rebreather mask is that it can cause suffocation. This is because it doesn’t allow you to inhale any outside air. You can only inhale the air inside the oxygen tank. So, when the oxygen tank empties, the person wearing the non-rebreather doesn’t get air. A healthcare provider should watch you closely when you’re using a non-rebreather mask to make sure the oxygen tank doesn’t empty.When to Call the DoctorWhen should I call my healthcare provider?If you have difficulty breathing and have any of the following symptoms, contact your provider right away:Pale or blue lips.Breathing rapidly or laboring to breathe.Nasal flaring (your nostrils get wide when you breathe in).Wheezing, grunting or other noisy breathing.A non-rebreather mask isn’t available to use at home or in situations where you need a little extra help breathing. But there are oxygen therapies for use in these cases. A non-rebreather mask is only for emergency situations where a person needs a lot of oxygen quickly.Discuss any breathing difficulties you’re having with your healthcare provider so they can recommend an oxygen treatment to help you.Additional DetailsWhen do you use a nasal cannula vs non-rebreather mask?A nasal cannula is often the best choice for at-home oxygen therapy. As the name suggests, it delivers oxygen through two small prongs that sit in your nostrils. People with respiratory conditions that cause difficulty breathing use a nasal cannula. A non-breather mask isn’t for home use. Its main use is for emergency situations when a person needs oxygen quickly. It delivers much more oxygen than a nasal cannula.A note from Cleveland ClinicA non-rebreather mask is a type of oxygen mask that gives a person a lot of oxygen, typically in an emergency. There’s a risk of suffocation since it doesn’t allow you to breathe in any outside or room air. For this reason, non-rebreather masks are typically for hospital or emergency department use only. If you have difficulty breathing on a day-to-day basis, talk to your healthcare provider about other forms of oxygen therapy.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/04/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyAdAdvertisementAdvertisementAdvertisementAppointments 216.444.6503Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"