"Nonsurgical Facelift: What It Is, Options & Benefits800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/Nonsurgical FaceliftAdvertisementAdvertisementAdvertisementNonsurgical FaceliftA nonsurgical facelift uses noninvasive or minimally invasive techniques to improve the appearance of your facial skin. Treatments such as dermal fillers and fat injections add volume for a smoother, younger look.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and OutlookWhen to Call the DoctorOverviewBefore and after: A nonsurgical facelift improves the appearance of your facial skin.What is a nonsurgical facelift?A nonsurgical facelift is a procedure to temporarily refresh, firm or plump the skin on your face. It doesn’t require large incisions (cuts), general anesthesia or an overnight hospital stay. Nonsurgical facelifts typically use a combination of minimally invasive and nonsurgical techniques.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat’s the difference between a nonsurgical and a surgical facelift?A surgical facelift (rhytidectomy) uses cuts in the face to tighten the skin on your face and neck. A surgical facelift may also transfer fat to your face or adjust facial muscles. For this type of procedure, you’ll need general anesthesia and overnight hospitalization.Cosmetic surgery is a more dramatic, permanent treatment for aging facial skin. Nonsurgical treatments tend to deliver short-term results.Who gets nonsurgical facelifts?People who worry about aging skin or any of the following common facial skin concerns may consider a nonsurgical facelift:Sagging skin and loose jowls (around your face and jawline).Shadows around your eyes.Sunken cheeks.Thin lips.Wrinkles, including frown lines (on your forehead), crow’s feet (at the corners of your eyes) and marionette lines (on the sides of your mouth).AdvertisementWho shouldn’t get a nonsurgical facelift?Some people with pre-existing skin conditions might not be good candidates for a nonsurgical facelift. Talk to your healthcare provider before treatment if you have:Active acne.Cold sore outbreaks.Eczema.Moles, freckles, skin tags or other skin growths.Psoriasis.Skin burns, such as those from radiation therapy.Skin rashes (contact dermatitis).It’s also important to note that nonsurgical facelifts might not be effective for cosmetic concerns such as:Deep wrinkles.Extremely loose or sagging skin.Severe scars.What are the different types of nonsurgical facelifts?Nonsurgical facelifts can take many forms and address multiple skin concerns. Your healthcare provider can advise you about which procedures are right for you.AdvertisementHow common are nonsurgical facelifts?Nonsurgical facelifts are extremely common. In 2020, providers performed more than 13 million minimally invasive cosmetic procedures in the U.S. Most of those procedures — such as botulinum toxin, dermal fillers and laser skin resurfacing — were for the face.Procedure DetailsA nonsurgical facelift can reduce wrinkles or lines on your face. Photo by Cleveland Clinic Cosmetic and Plastic Surgery.How is a nonsurgical facelift performed?Procedures vary depending on the type of nonsurgical facelift you receive. Most procedures take place right in the office. Some are relatively painless, while others may cause discomfort. Your provider can tell you more about what to expect for the following treatments:Botulinum toxin injections: These injections, such as Botox® and Dysport®, relax tense muscles that can lead to wrinkles. Most people get botulinum toxin injections between their eyebrows, in their forehead or at the corners of their eyes. Results can last up to three months.Chemical peels: Chemicals remove the top layers of your skin. Chemical peels can help reduce large pores, minimize wrinkles and reveal newer, firmer skin. Most people need multiple chemical peels to achieve the results they want.Dermal fillers: Also called soft tissue fillers, injections of substances such as hyaluronic acid or gel add volume back to sunken areas of the face. Dermal fillers add fullness back to your cheeks and lips. They can also fill in deep wrinkles. These fillers last anywhere from six months to several years.Fat injections: Also called fat grafting, fat injections use fat from elsewhere in your body to fill in sagging areas of your face. Fat injections are more invasive than dermal fillers, as liposuction is necessary to take fat from your body, but they tend to last longer.Laser skin resurfacing: Beams of intense light target certain areas of your face. The treatment removes the older, outer layers of your skin. Heat from the light also stimulates collagen growth. Laser skin resurfacing can help your skin appear smoother and firmer.Microdermabrasion: This minimally invasive procedure gently sands away layers of your skin with a rough pad. Exfoliation with microdermabrasion can help reduce the appearance of fine lines, mild scars and other skin concerns. You may need multiple treatments, usually a few weeks apart. Results last several months.Microneedling: Thin, tiny needles make small wounds in your face. Microneedling stimulates the growth of collagen and elastin in your skin. It can improve the look of loose skin, wrinkles, large pores and sun damage. You may need multiple treatments, usually about three to eight weeks apart. Full results take about three to six months to appear.Care at Cleveland ClinicGet Dermatology CareMake an AppointmentRisks / BenefitsWhat are the risks of a nonsurgical facelift?The potential risks of a nonsurgical facelift procedure depend on the type you receive. Most nonsurgical facelift treatments are generally safe and have minimal side effects, but risks may include:Bleeding.Blisters.Bruises.Dry skin.Infection.Itchy skin (pruritis).Lumps or asymmetry in your face.Peeling skin.Scars.Skin burns.Skin redness.Swelling.In rare cases, botulinum toxin injections and dermal fillers can lead to:Fever.Headache.Nausea and vomiting.Skin rash.What are the benefits of a nonsurgical facelift?A nonsurgical facelift can help you achieve firmer, smoother and younger looking skin without surgery. You don’t need general anesthesia or overnight hospitalization. Recovery is faster and less painful than recovery after a surgical procedure. Nonsurgical facelifts also tend to be much less expensive than surgical cosmetic procedures.Recovery and OutlookWhat can I expect during recovery?Some people experience mild pain, soreness or discomfort after their treatment. You might notice your skin is red and a little swollen. After a few days, you may have bruising, flaking skin or scabs, depending on the procedure you choose. Most people can return to normal activities right away or shortly after their procedure.As you recover, your provider may recommend:Cold packs for any swelling.Ointments to soothe your skin.Pain relievers.How long do the results of a nonsurgical facelift last?The results of treatment vary. You may need to repeat some procedures, such as chemical peels or botulinum toxin injections, every few months. The results of other treatments may last longer.How can I maintain the results of a nonsurgical facelift?Talk to your healthcare provider about the best way to maintain the results of your procedure. Regular treatments can help you achieve longer-lasting skin benefits. You can also maintain a healthy skin care routine by:Cleansing and moisturizing your face each day.Not smoking.Staying out of the sun.Using face products that contain antioxidants.When to Call the DoctorWhen should I see my healthcare provider?Contact your healthcare provider if you experience these symptoms after your procedure:Flu-like symptoms.Infection.Numbness or loss of movement in any part of your face.Pain that doesn’t go away or gets worse.Severe swelling in your face.A note from Cleveland ClinicA nonsurgical facelift is a noninvasive or minimally invasive treatment to improve the look of your facial skin. Procedures add volume to your face and reduce the look of wrinkles and sagging skin. These treatments produce temporary results, so talk to your healthcare provider about the number and frequency of treatments necessary to achieve your goals.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 08/18/2022.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Dermatology CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.5725Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"