"NSAIDs (Nonsteroidal Anti-Inflammatory Drugs): Uses800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Treatments & Procedures/NSAIDs (Nonsteroidal Anti-Inflammatory Drugs)AdvertisementAdvertisementAdvertisementNSAIDs (Nonsteroidal Anti-Inflammatory Drugs)NSAIDs (nonsteroidal anti-inflammatory drugs) can reduce pain, fever and other types of inflammation. Common over-the-counter NSAIDs include aspirin, ibuprofen and naproxen sodium. Healthcare providers can also prescribe stronger NSAIDs when appropriate.ContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional Common QuestionsContentsArrow DownOverviewProcedure DetailsRisks / BenefitsWhen to Call the DoctorAdditional Common QuestionsOverviewWhat are NSAIDs?NSAIDs (nonsteroidal anti-inflammatory drugs) are medications that reduce inflammation, pain and fever. There are many different types of NSAIDs, including nonprescription and prescription strength. Healthcare providers use them to treat a wide range of symptoms, from headaches and dental pain to arthritis and muscle stiffness.You can buy NSAIDs in several forms, including:Tablets or capsules.Liquid.Gels and creams.Suppositories.Which drugs are NSAIDs?Common nonprescription strength NSAIDs include:Aspirin (Bayer®, St. Joseph®).Ibuprofen (Motrin®, Advil®).Naproxen sodium (Aleve®).Some of the most common prescription-strength NSAIDs include:Celecoxib (Celebrex®).Diclofenac (Voltaren®).Fenoprofen (Nalfon®).Indomethacin (Indocin®).Ketorolac (Toradol®).AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhat do you use NSAIDs for?Healthcare providers use NSAIDs to treat:Muscle aches.Arthritis.Tendonitis.Back pain.Bursitis.Toothaches.Menstrual cramps.How do NSAIDs work?NSAIDs stop your body from producing certain chemicals that cause inflammation. NSAIDs work like corticosteroids without steroid side effects.Steroids are synthetic drugs similar to cortisone, a naturally occurring hormone. Like cortisone, NSAIDs reduce pain and inflammation.AdvertisementProcedure DetailsHow long should I use an over-the-counter NSAID?Don’t use an over-the-counter NSAID continuously for more than three days for fever and 10 days for pain unless your provider says it’s OK. Over-the-counter NSAIDs work well for relieving pain, but you should only use them short term.If your provider clears you to take NSAIDs for a long period of time, you should keep an eye out for harmful side effects like stomach pain or heartburn. If you develop side effects, your provider can recommend an alternative treatment.Care at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentRisks / BenefitsWhat are the benefits of NSAIDs?NSAIDs are very effective for:Reducing inflammation.Easing pain.Decreasing stiffness.Reducing fever.AdvertisementWhat are the risks of NSAIDs?Some people develop stomach ulcers from taking NSAIDs. To reduce your risk of ulcers, always take NSAIDs with food (preferably, a full meal).While NSAIDs are effective for relieving symptoms, they don’t help your body heal. In fact, research suggests that these medications can actually slow your body’s natural healing process. A healthcare provider can help you weigh the risks and benefits of using NSAIDs and find a treatment that’s right for you.Who should avoid NSAIDs?In general, you should avoid taking NSAIDs if you have:Stomach ulcers or gastrointestinal bleeding.Kidney disease.Liver disease.GERD (chronic acid reflux).Crohn’s disease.Ulcerative colitis.Unmanaged diabetes.High blood pressure that’s difficult to manage.Bleeding disorders.Heart failure.A history of stroke or heart attack.You also shouldn’t take NSAIDs if you’re pregnant or plan on getting pregnant.Additionally, if any of the following apply to you, check with your provider before taking NSAIDs:Children and teenagers with viral infections (with or without fever) shouldn’t take aspirin or aspirin-containing products due to the risk of Reye's syndrome (a rare but deadly illness that can affect their brain and liver).Those who have an upcoming surgical procedure, including oral surgery.People who have beverages containing alcohol every day.Asthma that gets worse when taking aspirin.If you’re 65 or older.What are some common NSAID side effects?You may develop side effects if you take large doses of NSAIDs, or if you take them for a long time. Some side effects are mild and go away, while others are more serious and need medical attention.Unless your healthcare provider tells you to do so, don't take:Over-the-counter NSAIDs with prescription NSAIDs.Multiple over-the-counter NSAIDs.More than the recommended dose of NSAIDs.Doing so could increase your risk of side effects.The most frequently reported side effects of NSAIDs are gastrointestinal (stomach and gut) symptoms, such as:Gas.Feeling bloated.Heartburn.Stomach pain.Nausea and vomiting.Diarrhea.Constipation.Taking NSAIDs with food, milk or antacids may reduce your risk for these gastrointestinal symptoms. But if these symptoms continue for more than a few days, let a healthcare provider know.Additional side effects of NSAIDs include:Dizziness.Feeling lightheaded.Balance issues.Difficulty concentrating.Mild headaches.If these symptoms go on for more than a few days, stop taking the NSAID and call a provider.When to Call the DoctorWhen should I call my healthcare provider?If you have any of these side effects, call your healthcare provider right away:Gastrointestinal/urinaryBlack stools (poop) — bloody or black, tarry stools.Cloudy urine (pee).Blood in your pee.Severe stomach pain.Blood or material that looks like coffee grounds in vomit (bleeding may occur without warning symptoms like pain).Inability to pee, or a change in how much you pee.Unusual weight gain.Jaundice.Head (vision, hearing, etc.)Blurred vision.Ringing in your ears (tinnitus).Photosensitivity (greater sensitivity to light).Very bad headache.Difficulty speaking or thinking.Balance issues.Possible allergic reactions and other issuesFluid retention (edema).Severe rash or hives or red, peeling skin.Itchy skin (pruritis).Unexplained bruising and bleeding.Wheezing, trouble breathing or unusual cough.Chest pain, rapid heartbeat, palpitations.Fatigue.Flu-like symptoms.Severe back pain.Additional Common QuestionsIs Tylenol (acetaminophen) an NSAID?No, acetaminophen isn’t an NSAID. It relieves pain and reduces fever. But unlike NSAIDs, acetaminophen (like Tylenol®) doesn’t reduce inflammation.Acetaminophen doesn’t cause as many gastrointestinal issues as NSAIDs, though. So, if you’re prone to stomach issues, acetaminophen might be a better option for you. Check with your provider if you have questions about what kind to take.Can NSAIDs cause allergic reactions?It’s rare, but NSAIDs can cause a generalized allergic reaction known as anaphylactic shock. If this happens, it’s usually soon after you start taking the NSAID. The symptoms of this reaction include:Swollen eyes, lips or tongue.Difficulty swallowing.Shortness of breath (dyspnea).Rapid heart rate.Chest pain or tightness.If any of these symptoms occur, call 911 (or your local emergency services number) or have someone drive you to the emergency room immediately.A note from Cleveland ClinicWhen your back aches, your head hurts, arthritis acts up or you’re feeling feverish, an NSAID can give you the quick relief you need. They’re safe when used correctly. But it’s not a good idea to take them if you have certain health conditions. Ask your healthcare provider if NSAIDs are right for you.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 07/24/2023.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicFind a Primary Care ProviderSchedule an AppointmentAdAdvertisementAdvertisementAdvertisementQuestions 216.444.2538Appointments & LocationsRequest an AppointmentFind a Primary Care ProviderFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2023 Cleveland Clinic. All Rights Reserved.\n"